{
  "section_id": "25-1-article-17",
  "content": "### ARTICLE 17. - INTERLOCAL DEVELOPMENT AGREEMENTS.\n\nIn this article:\n\n(1)\n\nDIRECTOR means the Director of the Planning and Development Review Department.\n\n(2)\n\nINTERLOCAL DEVELOPMENT AGREEMENT means an agreement between the City and any governmental\nentity, municipal corporation or political subdivision that establishes or modifies\nregulations for the use, development, or construction of property containing one or\nmore existing or proposed structures. The term includes new agreements and amendments\nto existing agreements, but does not include agreements or amendments related to roads\nor road facilities or the provision of utility services.\n\nSource: Ord. 20091105-068.\n\n(A)\n\nPrior to council consideration of a proposed interlocal agreement, the director shall\nschedule a public hearing before the Land Use Commission.\n\n(B)\n\nThe director shall give notice of a public hearing required under Subsection (A) consistent\nwith the following requirements:\n\n(1)\n\nIf a proposed interlocal development agreement establishes or modifies use, development,\nor construction regulations applicable to a particular site or structure, the director\nshall mail notice not later than the 11th day before the date of the hearing as provided\nunder Subsection 25-1-904(A) (Notice Requirements for Proposed Interlocal Development Agreements).\n\n(2)\n\nIf a proposed interlocal development agreement establishes or modifies general use,\ndevelopment, or construction regulations contained in a master plan or agreement applicable\nto a governmental entity, municipal corporation, or political subdivision, rather\nthan regulations applicable to a particular site or structure, the director shall\nprovide notice as required under Subsection 25-1-132(C) (Notice of Public Hearing).\n\n(C)\n\nThe Land Use Commission shall make a recommendation to the council on a proposed interlocal\ndevelopment agreement not later than the 14th day after the public hearing on the\nproposed agreement is closed.\n\n(D)\n\nThe Land Use Commission may recommend that the council:\n\n(1)\n\napprove the interlocal development agreement as proposed;\n\n(2)\n\napprove a more restrictive interlocal development agreement; or\n\n(3)\n\nreject the proposed interlocal development agreement.\n\nSource: Ord. 20091105-068.\n\n(A)\n\nThe council shall hold a public hearing on a proposed interlocal development agreement\nnot later than the 40th day after the date of the Land Use Commission recommendation.\n\n(B)\n\nThe director shall give notice of a public hearing required under Subsection (A) consistent\nwith the following requirements:\n\n(1)\n\nIf a proposed interlocal development agreement establishes or modifies use, development,\nor construction regulations applicable to a particular site or structure, the director\nshall provide notice by:\n\n(a)\n\npublishing notice not later than the 16th day before the date of the public hearing\nas provided under Subsection 25-1-132(B)(1) (Notice of Public Hearing); and\n\n(b)\n\nmailing notice not later than the 16th day before the date of the hearing as provided\nunder Subsection 25-1-904(A) (Notice Requirements for Proposed Interlocal Development Agreements).\n\n(2)\n\nIf a proposed interlocal development agreement establishes or modifies general use,\nconstruction, or development regulations contained in a master plan or agreement applicable\nto a governmental entity, municipal corporation, or political subdivision, rather\nthan a particular site or structure, the director shall provide notice as required\nunder Subsection 25-1-132(C) (Notice of Public Hearing).\n\n(C)\n\nAfter a public hearing on a proposed interlocal development agreement, the council\nmay authorize the city manager to:\n\n(1)\n\nexecute the agreement as proposed;\n\n(2)\n\nexecute a modified agreement, which may include different use, development, or construction\nregulations or other conditions not contained in the proposed agreement;\n\n(3)\n\nnegotiate a new agreement, which shall be subject to review by the Land Use Commission\nunder Section 25-1-903 (Review and Recommendation of the Land Use Commission); or\n\n(4)\n\nreject the proposed agreement and discontinue negotiations.\n\nSource: Ord. 20091105-068.\n\n(A)\n\nMailed notice required under this article shall comply with the requirements of Subsection\n25-1-134(B) (Procedures and Requirements for Notice) and shall be sent to:\n\n(1)\n\ngovernmental entity, municipal corporation, or political subdivision that is to be\na party to the agreement;\n\n(2)\n\nnotice owner of property located within 500 feet of the subject property;\n\n(3)\n\nregistered environmental or neighborhood organization whose declared boundaries are\nwithin 500 feet of the site of the subject property; and\n\n(4)\n\nutility account addresses located within 500 feet of the site of the subject property,\nas shown in the City utility records on the date of the filing of the application.\n\n(B)\n\nMailed and published notice required under this article must:\n\n(1)\n\ndescribe the general nature of the proposed interlocal development agreement;\n\n(2)\n\nidentify the governmental entity, municipal corporation, or political subdivision\nthat is to be a party to the agreement;\n\n(3)\n\ngenerally describe the proposed agreement;\n\n(4)\n\nidentify the entities that may approve the proposed agreement;\n\n(5)\n\nstate the earliest date that action on the proposed agreement may occur; and\n\n(6)\n\ninclude the address and telephone number of the accountable official or staff from\nwhom additional information may be obtained.\n\nSource: Ord. 20091105-068.\n\nIn this article:\n\n(A)\n\nDIRECTOR means the director of the Planning Department.\n\n(B)\n\nAREA PLAN means a long-range policy plan adopted by ordinance as an element of the\ncomprehensive plan that establishes land use policy for a specific geographic area.\nArea plan may include a neighborhood plan, district plan, station area plan, small\narea plan, land use-focused corridor plan, framework plan, and plans incorporating\nfuture land use maps.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\n(A)\n\nAn area plan shall be prepared by the director.\n\n(B)\n\nThe director may conduct a general review of an area plan at any time and may recommend\namendments of an area plan to the Land Use Commission and council.\n\n(C)\n\nThe director may establish a list of community stakeholders to seek input in the review\nprocess.\n\n(D)\n\nThe director may establish a list of community resources available to assist the director\nwith technical aspects of area planning.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\nAn amendment to an area plan shall follow the process outlined by this Article, except\nfor:\n\n(1)\n\nAn amendment to the Lamar Blvd./Justin Station Area Plan, Plaza Saltillo Station Area\nPlan, or East MLK TOD Station Area Plan, shall follow the process in 25-2-766.23.\n\n(2)\n\nAn amendment to a neighborhood plan adopted by ordinance shall follow the process\nin Chapter 25-1, Article 16 (Neighborhood Plan Amendments).\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\nAn area plan amendment may be initiated by:\n\n(1)\n\nfor an individual property amendment:\n\n(a)\n\nthe owner of the subject property;\n\n(b)\n\nthe council;\n\n(c)\n\nthe Land Use Commission; or\n\n(d)\n\nthe director.\n\n(2)\n\nfor an area-wide or subdistrict-wide amendment:\n\n(a)\n\nthe council;\n\n(b)\n\nthe Land Use Commission; or\n\n(c)\n\nthe director.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\n(A)\n\nPre-Application Meeting. The applicant and the director's staff must meet before an\napplicant can submit an application to amend an area plan. At the meeting:\n\n(1)\n\nthe staff shall describe the application process to the applicant;\n\n(2)\n\nthe applicant shall describe the proposed area plan amendment to the staff;\n\n(3)\n\nif the applicant is proposing a change to the future land use map, the applicant shall\nprovide the staff with information regarding the proposed change, including the address,\nboundaries, acreage, current and proposed future land use map categories, and current\nand proposed uses; and\n\n(4)\n\nif the applicant is proposing a text change, the applicant shall provide the proposed\nlanguage and an explanation of the change.\n\n(B)\n\nApplication for an individual property.\n\n(1)\n\nThe director may accept an application to amend an area plan not earlier than one\nyear after the adoption of the plan.\n\n(2)\n\nAn applicant may not file an application for an amendment that is substantially the\nsame as an application denied by council until one year after the council action denying\nthe prior application.\n\n(C)\n\nApplication for area-wide or subdistrict-wide amendment.\n\n(1)\n\nThe director may accept an application to amend an area plan two or more years after\ncouncil adopted the plan.\n\n(2)\n\nThe director may accept an application to amend an area plan two or more years after\nthe most recent council action on the plan occurred.\n\n(3)\n\nAn application initiated by council may be filed at any time.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\n(A)\n\nThe director shall give notice of the filing of an application for a proposed area\nplan amendment under Section 25-1-133\n(Notice of Applications and Administrative Decisions).\n\n(B)\n\nThe director shall conduct a community meeting on a proposed area plan amendment prior\nto the date on which the Land Use Commission is scheduled to consider the amendment.\nThe director shall give notice of the meeting under Section 25-1-132(A) (Notice of Public Hearing).\n\n(C)\n\nThe Land Use Commission and the council shall each hold a public hearing on a proposed\narea plan amendment.\n\n(D)\n\nThis subsection prescribes notice for a public hearing on a proposed area plan amendment\nregarding an individual property.\n\n(1)\n\nFor a hearing before the Land Use Commission, the director shall give notice under\nSection 25-1-132(A) (Notice of Public Hearing).\n\n(2)\n\nFor a hearing before council, the director shall give notice under Section 25-1-132(B)(2) (Notice of Public Hearing).\n\n(3)\n\nThe applicant is responsible for the cost of notice.\n\n(E)\n\nThis subsection prescribes notice for a public hearing on a proposed area-wide or\nsubdistrict-wide amendment.\n\n(1)\n\nThe director shall give notice of a public hearing before the Land Use Commission\nor council to:\n\n(a)\n\neach notice owner of property located within the proposed amendment boundaries;\n\n(b)\n\neach City of Austin utility account address within the proposed amendment boundaries;\nand\n\n(c)\n\neach registered neighborhood organization within the proposed amendment boundaries\nand within 500 feet of the proposed amendment boundaries.\n\n(2)\n\nThe City is responsible for the cost of notice.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\n(A)\n\nAn area plan amendment application expires if the director does not schedule the application\nfor a public hearing:\n\n(1)\n\nby the Land Use Commission before the 181st day after the date of filing; or\n\n(2)\n\nby the Land Use Commission or council before the 181st day after the date on which\nthe Land Use Commission or council grants an indefinite postponement of a scheduled\npublic hearing.\n\n(B)\n\nExcept as provided in Subsection (D), an area plan amendment application expires if\nthe council does not adopt an ordinance before the 361st day after council closes\nthe public hearing on the application.\n\n(C)\n\nExcept as provided in Subsection (D), an area plan amendment application initially\nsubmitted before the effective date of this section expires 180 days after the effective\ndate of this section.\n\n(D)\n\nAn applicant may file one request with the director and one request with council to\nextend an application that will expire under Subsection (B) or Subsection (C). The\nrequest must be in writing, be filed before the application expires, state good cause\nfor the extension, and be for not more than 180 days.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\n(A)\n\nThe Land Use Commission shall hold a public hearing on an area plan amendment application\nnot later than the 90th day after the date the application is filed.\n\n(B)\n\nThe Land Use Commission shall make a recommendation to the council on an area plan\namendment application not later than the 14th day after the Land Use Commission closes\nthe public hearing on the application.\n\n(C)\n\nIf the Land Use Commission does not adopt a recommendation on an application, the\ndirector shall forward the application to council without a Land Use Commission recommendation.\n\n(D)\n\nIf the Land Use Commission does not hold a public hearing in accordance with Subsection\n(A), the applicant may file a written request for a hearing as prescribed in Section 25-2-282(E).\n\n(E)\n\nThe director shall report the Land Use Commission's recommendation on each area plan\namendment application to the council.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\n(A)\n\nThe council shall hold a public hearing on an area plan amendment application not\nlater than the 40th day after the date of the Land Use Commission recommendation.\n\n(B)\n\nSection 25-2-283(C) shall apply to requests for postponement of the public hearing on a neighborhood\nplan amendment application.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\n(A)\n\nThe director may not recommend approval of an area plan amendment unless the requirements\nof Subsections (B) and (C) are satisfied.\n\n(B)\n\nThe applicant must demonstrate that:\n\n(1)\n\nthe proposed amendment is appropriate because of a mapping or textual error or omission\nmade when the original plan was adopted or during subsequent amendments;\n\n(2)\n\nthe denial of the proposed amendment would jeopardize public health, safety, or welfare;\n\n(3)\n\nthe proposed amendment is appropriate because of a material change in circumstances\nsince the adoption of the plan;\n\n(4)\n\nthe proposed project:\n\n(a)\n\nprovides environmental protection that is superior to the protection that would otherwise\nbe achieved under existing zoning and development regulations; or\n\n(b)\n\npromotes the recruitment or retention of an employment center with 100 or more employees;\n\n(5)\n\nthe proposed amendment is consistent with the goals and objectives of the area plan;\nor\n\n(6)\n\nthe proposed amendment promotes additional S.M.A.R.T. Housing opportunities.\n\n(C)\n\nThe applicant must demonstrate that:\n\n(1)\n\nthe proposed amendment complies with applicable regulations and standards established\nby Title 25\n(Land Development), the objectives of Chapter 25-2\n(Zoning), and the purposes of the zoning district proposed for the subject property; and\n\n(2)\n\nthe proposed amendment is consistent with the policies of the Comprehensive Plan and\nsound planning principles.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n",
  "entities": [
    {
      "text": "ARTICLE 17",
      "label": "SECTION_REF",
      "start": 4,
      "end": 14,
      "normalized": {
        "type": "article",
        "number": 17,
        "full_reference": "Article 17"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 885,
      "end": 893,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 1693,
      "end": 1701,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 2489,
      "end": 2497,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 3465,
      "end": 3473,
      "normalized": "required"
    },
    {
      "text": "Section 25-1-903",
      "label": "SECTION_REF",
      "start": 3966,
      "end": 3982,
      "normalized": {
        "section": "25-1-903",
        "subsection": null,
        "full_reference": "25-1-903"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 4156,
      "end": 4164,
      "normalized": "required"
    },
    {
      "text": "500 feet",
      "label": "MEASUREMENT",
      "start": 4469,
      "end": 4477,
      "normalized": {
        "value": 500,
        "unit": "ft",
        "original": "500 feet"
      }
    },
    {
      "text": "500 feet",
      "label": "MEASUREMENT",
      "start": 4600,
      "end": 4608,
      "normalized": {
        "value": 500,
        "unit": "ft",
        "original": "500 feet"
      }
    },
    {
      "text": "500 feet",
      "label": "MEASUREMENT",
      "start": 4697,
      "end": 4705,
      "normalized": {
        "value": 500,
        "unit": "ft",
        "original": "500 feet"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 4860,
      "end": 4868,
      "normalized": "required"
    },
    {
      "text": "Chapter 25-1",
      "label": "SECTION_REF",
      "start": 6817,
      "end": 6829,
      "normalized": {
        "type": "chapter",
        "number": "25-1",
        "full_reference": "Chapter 25-1"
      }
    },
    {
      "text": "Article 16",
      "label": "SECTION_REF",
      "start": 6831,
      "end": 6841,
      "normalized": {
        "type": "article",
        "number": 16,
        "full_reference": "Article 16"
      }
    },
    {
      "text": "Section 25-1-133",
      "label": "SECTION_REF",
      "start": 8966,
      "end": 8982,
      "normalized": {
        "section": "25-1-133",
        "subsection": null,
        "full_reference": "25-1-133"
      }
    },
    {
      "text": "500 feet",
      "label": "MEASUREMENT",
      "start": 10380,
      "end": 10388,
      "normalized": {
        "value": 500,
        "unit": "ft",
        "original": "500 feet"
      }
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 11621,
      "end": 11634,
      "normalized": "lte"
    },
    {
      "text": "Chapter 25-2",
      "label": "SECTION_REF",
      "start": 14189,
      "end": 14201,
      "normalized": {
        "type": "chapter",
        "number": "25-2",
        "full_reference": "Chapter 25-2"
      }
    }
  ]
}