{
  "section_id": "25-1-392",
  "content": "\n(A)\n\nA permit holder must, as a condition of the permit, to allow city or county inspectors\nto enter and inspect the land or premises that is the subject of the permit.\n\n(B)\n\nAn applicant for an approval under this title shall agree in writing to allow city\nand county inspectors to enter and inspect the land or premises that is the subject\nof the application during approval and development.\n\n(C)\n\nEntry and inspection under this section must be at a reasonable time for the purpose\nof investigating or enforcing the requirements of this title.\n\n(D)\n\nIf the premises are occupied, the city or county inspector shall present the inspector's\ncredentials and request entry. If the premises are unoccupied, the inspector shall\nattempt to contact a responsible person and request entry.\n\nSource: City Code Section 25-1-392; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may suspend an approved subdivision construction plan if the single\noffice determines that:\n\n(1)\n\nthe subdivision construction plan was approved in error; or\n\n(2)\n\nthe development does not comply with this title.\n\n(B)\n\nA suspension is effective until the single office determines that the applicant has\ncomplied with the requirements of this title.\n\nSource: City Code Section 25-1-412; Ord. 031211-11; Ord. 031211-42.",
  "entities": [
    {
      "text": "Section 25-1-392",
      "label": "SECTION_REF",
      "start": 804,
      "end": 820,
      "normalized": {
        "section": "25-1-392",
        "subsection": null,
        "full_reference": "25-1-392"
      }
    },
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 871,
      "end": 877,
      "normalized": "office"
    },
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 946,
      "end": 952,
      "normalized": "office"
    },
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 1140,
      "end": 1146,
      "normalized": "office"
    },
    {
      "text": "Section 25-1-412",
      "label": "SECTION_REF",
      "start": 1246,
      "end": 1262,
      "normalized": {
        "section": "25-1-412",
        "subsection": null,
        "full_reference": "25-1-412"
      }
    }
  ]
}