{
  "section_id": "25-1-article-16",
  "content": "### ARTICLE 16. - NEIGHBORHOOD PLAN AMENDMENTS.\n\nIn this article:\n\n(1)\n\nDIRECTOR means the director of the Planning and Development Review Department.\n\n(2)\n\nNEIGHBORHOOD PLAN CONTACT TEAM means the individuals designated to implement an adopted\nneighborhood plan. The neighborhood plan contact team is a neighborhood organization\nthat qualifies as an interested party for purposes of notice, appeal, and other processes\nif all other qualifications for interested party status are satisfied. The neighborhood\nplan contact team is a separate body apart from any other existing or future neighborhood\norganization.\n\nSource: Ord. 20080306-073; Ord. 20091105-069; 20091217-053.\n\nThe director shall conduct a general review of a neighborhood plan not earlier than\nfive years after the adoption of the plan and may recommend amendments of a plan to\nthe Planning Commission and council. The director shall include neighborhood stakeholder\ninput in the review process.\n\nSource: Ord. 20080306-073.\n\nA neighborhood plan amendment may be initiated by:\n\n(1)\n\nfor an amendment regarding an individual property:\n\n(a)\n\nthe owner of the subject property;\n\n(b)\n\nthe council;\n\n(c)\n\nthe Planning Commission;\n\n(d)\n\nthe director;\n\n(e)\n\nthe neighborhood plan contact team for the planning area in which the property is\nlocated; or\n\n(2)\n\nfor an amendment regarding an area-wide or subdistrict-wide recommendation:\n\n(a)\n\nthe council;\n\n(b)\n\nthe Planning Commission;\n\n(c)\n\nthe director; or\n\n(d)\n\nthe neighborhood plan contact team for the affected neighborhood plan area.\n\nSource: Ord. 20080306-073; 20091217-053.\n\n(A)\n\nPre-Application Meeting. The applicant and the director's staff must meet before an\napplicant can submit an application to amend a neighborhood plan. At the meeting:\n\n(1)\n\nthe staff shall describe the application process to the applicant;\n\n(2)\n\nthe applicant shall describe the proposed neighborhood plan amendment to the staff;\n\n(3)\n\nif the applicant is proposing a change to the future land use map, the applicant shall\nprovide the staff with information regarding the proposed change, including the address,\nboundaries, acreage, current and proposed future land use map categories, and current\nand proposed uses; and\n\n(4)\n\nif the applicant is proposing a text change, the applicant shall provide the proposed\nlanguage and an explanation of the change.\n\n(B)\n\nApplications for an Individual Property.\n\n(1)\n\nThe director may accept an application to amend a neighborhood plan not earlier than\none year after the adoption of the plan.\n\n(2)\n\nAn applicant may not file an application for an amendment that is substantially the\nsame as an application denied by council until one year after the council action denying\nthe prior application.\n\n(C)\n\nApplications for Area-wide or Subdistrict-wide Amendments.\n\n(1)\n\nThe director may accept an application to amend a neighborhood plan two or more years\nafter council adopted the plan.\n\n(2)\n\nThe director may accept an application to amend a neighborhood plan two or more years\nafter the most recent council action on the plan occurred.\n\n(3)\n\nAn application initiated by council may be filed at any time.\n\n(D)\n\nThe director may waive all or a portion of the fees, as set by the City's annual fee\nordinance, for an amendment application initiated by a neighborhood plan contact team.\n\nSource: Ord. 20080306-073; 20091217-053; Ord. No. 20170608-057, Pt. 1, 6-8-17; Ord. No. 20200220-056, Pt. 2, 3-2-20; Ord. No. 20230831-104, Pt. 1, 9-11-23.\n\n(A)\n\nThe director shall initiate the formation of a neighborhood plan contact team.\n\n(B)\n\nThe neighborhood plan contact team shall to the greatest extent practicable include\nat least one representative from each of the following groups within a neighborhood\nplan area:\n\n(1)\n\nproperty owners;\n\n(2)\n\nresidential renters;\n\n(3)\n\nbusiness owners; and\n\n(4)\n\nneighborhood organization members owning or renting property within the neighborhood\nplan area.\n\n(C)\n\nRepresentatives shall to the greatest extent possible be drawn from the group of persons\ninvolved in the development of the neighborhood plan.\n\n(D)\n\nThe neighborhood plan contact team shall annually submit a list of its officers and\nmembers, including individual contact information and applicable membership category\nunder Subsection (B), to the director.\n\n(E)\n\nThe neighborhood plan contact team shall submit new bylaws or changes in existing\nbylaws to the director. The bylaws shall address roles and responsibilities, boundaries,\nmembership, decision-making, meetings and meeting notification, officers and duties,\namendments to the bylaws, finances, and conflicts of interest. The bylaws shall be\nconsistent with the standardized bylaws template and instructions provided by the\ndirector.\n\n(F)\n\nBefore the date on which the Planning Commission is scheduled to consider a proposed\nneighborhood plan amendment, the neighborhood plan contact team may submit a letter\nto the director stating its recommendation on the proposed amendment. The neighborhood\nplan contact team shall also identify any conflict of interest as defined in the bylaws\nof the neighborhood plan contact team.\n\n(G)\n\nNeighborhood plan contact teams shall have dispute resolution as follows:\n\n(1)\n\nFiling complaints. A person who meets the membership requirements described under\nSubsection (B) and believes that the neighborhood plan contact team has violated the\nprovisions of this section may file with the director a request to have the director\ninvestigate and mediate the complaint. Such complaints shall be in writing and shall\nidentify the neighborhood plan contact team alleged to be violating the provisions\nof this section. All complaints must be filed within 45 days following the occurrence\nof an alleged violation.\n\n(2)\n\nInvestigation. The director shall review with the charging party the allegations contained\nwithin the complaint and, if warranted based on the requirements of this chapter,\nshall conduct a prompt and full investigation of the matter stated in the complaint\nthrough interviews with the charging party, contact team officers, and through review\nof all available documentation. The director shall determine in writing whether dispute\nresolution is warranted within 14 days of receiving a complaint and shall render a\nwritten report identifying issues to be addressed through dispute resolution within\n28 days of receiving the complaint.\n\n(3)\n\nInformal Dispute Resolution. If after investigation it is determined that there is\nreasonable cause to believe that dispute resolution is warranted, the director shall\nendeavor to eliminate any such alleged violations by informal methods of conference,\nconciliation, and persuasion. All informal dispute resolution and determinations of\nthe director must be completed within 30 days after the director provides the written\nreport.\n\n(4)\n\nFormal Dispute Resolution. If, after determining that there is reasonable cause to\nbelieve that dispute resolution is warranted, and the director is unable to secure\nfrom the respondent an acceptable conciliation agreement, the director shall present\na report to the Planning Commission within 30 days of completing the informal dispute\nresolution. If after review of the report the Planning Commission agrees with the\nreport of the director, the Planning Commission may recommend a more formal mediation\nor dispute resolution process. The Planning Commission shall set a deadline for the\ncompletion of formal mediation based on the complexity and circumstances of a specific\ncase and shall identify a neutral third party to conduct the dispute resolution process.\n\n(5)\n\nRemedy.\n\n(a)\n\nIn cases where the informal and formal dispute resolution processes initiated by the\nCity are unable to secure from the respondent an acceptable conciliation agreement,\nthe Planning Commission may recommend that the director and the City discontinue recognition\nof the neighborhood plan contact team under the provisions of this chapter until a\nconciliation agreement acceptable to the Planning Commission is reached.\n\n(b)\n\nIn the event the City discontinues recognition of a neighborhood plan contact team,\nspecial designation of the organization as a neighborhood plan contact team will be\nremoved from the City of Austin Community Registry, the neighborhood plan contact\nteam will no longer be granted the authority to initiate Neighborhood Plan amendments,\nand the neighborhood plan contact team will no longer have access to any special resources\nor authority through the City based on its status as a neighborhood plan contact team.\n\n(c)\n\nIf recognition of a neighborhood plan contact team is discontinued for more than six\nmonths, the director may take action to initiate a new neighborhood plan contact team\nfor the planning area under the provisions of City Code Section 25-1-805(A)—(C). In the event that the director takes action to initiate a new neighborhood\nplan contact team, the initial officers of the new neighborhood plan contact team\nmay not have served as officers of the previous neighborhood plan contact team at\nthe time when recognition was discontinued.\n\n(6)\n\nAppeal. Charging parties and respondents may appeal the determination of the director\nand of the Planning Commission under this subsection to the City Council. Actions\nthat are appealable include the director's determination that dispute resolution is\nwarranted; findings/determinations that come out of the informal dispute resolution\nprocess; and discontinuation of recognition of a neighborhood plan contact team.\n\nSource: Ord. 20080306-073; 20091217-053; Ord. No. 20160128-084, Pts. 1, 2, 2-8-16.\n\n(A)\n\nThe director shall give notice of the filing of an application for a proposed neighborhood\nplan amendment under Section 25-1-133 (Notice of Applications and Administrative Decisions).\n\n(B)\n\nThe director shall conduct a community meeting on a proposed neighborhood plan amendment\nprior to the date on which the Planning Commission is scheduled to consider the amendment.\nThe director shall give notice of the meeting under Section 25-1-132(A) (Notice of Public Hearing).\n\n(C)\n\nThe Planning Commission and the council shall each hold a public hearing on a proposed\nneighborhood plan amendment.\n\n(D)\n\nThis subsection prescribes notice for a public hearing on a proposed neighborhood\nplan amendment regarding an individual property.\n\n(1)\n\nFor a hearing before the Planning Commission, the director shall give notice under\nSection 25-1-132(A) (Notice of Public Hearing).\n\n(2)\n\nFor a hearing before council, the director shall give notice under Section 25-1-132(B)(2) (Notice of Public Hearing).\n\n(3)\n\nThe applicant is responsible for the cost of notice, unless the applicant is a neighborhood\nplan contact team. In that event, the City is responsible for the cost of notice.\n\n(E)\n\nThis subsection prescribes notice for a public hearing on a proposed neighborhood\nplan amendment regarding an area-wide or subdistrict-wide recommendation.\n\n(1)\n\nThe director shall give notice of a public hearing before the Planning Commission\nor council to:\n\n(a)\n\neach notice owner of property located within the proposed amendment boundaries;\n\n(b)\n\neach City of Austin utility account address within the proposed amendment boundaries;\nand\n\n(c)\n\neach neighborhood plan contact team and registered neighborhood organization within\nthe proposed amendment boundaries and within 500 feet of the proposed amendment boundaries.\n\n(2)\n\nThe City is responsible for the cost of notice.\n\nSource: Ord. 20080306-073; 20091217-053.\n\n(A)\n\nA neighborhood plan amendment application expires if the director does not schedule\nthe application for a public hearing:\n\n(1)\n\nby the Planning Commission before the 181st day after the date of filing; or\n\n(2)\n\nby the Planning Commission or council before the 181st day after the date on which\nthe Planning Commission or council grants an indefinite postponement of a scheduled\npublic hearing.\n\n(B)\n\nExcept as provided in Subsection (D), a neighborhood plan amendment application expires\nif the council does not adopt an ordinance before the 361st day after council closes\nthe public hearing on the application.\n\n(C)\n\nExcept as provided in Subsection (D), a neighborhood plan amendment application initially\nsubmitted before the effective date of this section expires 180 days after the effective\ndate of this section.\n\n(D)\n\nAn applicant may file one request with the director and one request with council to\nextend an application that will expire under Subsection (B) or Subsection (C). The\nrequest must be in writing, be filed before the application expires, state good cause\nfor the extension, and be for not more than 180 days.\n\nSource: 20091217-053.\n\n(A)\n\nThe Land Use Commission shall hold a public hearing on a neighborhood plan amendment\napplication not later than the 90th day after the date the application is filed.\n\n(B)\n\nThe Land Use Commission shall make a recommendation to the council on a neighborhood\nplan amendment application not later than the 14th day after the Land Use Commission\ncloses the public hearing on the application.\n\n(C)\n\nIf the Land Use Commission does not adopt a recommendation on an application, the\nDirector shall forward the application to council without a Land Use Commission recommendation.\n\n(D)\n\nIf the Land Use Commission does not hold a public hearing in accordance with Subsection\n(A), the applicant may file a written request for a hearing as prescribed in Section 25-2-282(E).\n\n(E)\n\nThe Director shall report the Land Use Commission's recommendation on each neighborhood\nplan amendment application to the council.\n\nSource: 20091217-053.\n\n(A)\n\nThe council shall hold a public hearing on a neighborhood plan amendment application\nnot later than the 40th day after the date of the Land Use Commission recommendation.\n\n(B)\n\nSection 25-2-283(C) shall apply to requests for postponement of the public hearing on a neighborhood\nplan amendment application.\n\nSource: 20091217-053.\n\n(A)\n\nThe director may not recommend approval of a neighborhood plan amendment unless the\nrequirements of Subsections (B) and (C) are satisfied.\n\n(B)\n\nThe applicant must demonstrate that:\n\n(1)\n\nthe proposed amendment is appropriate because of a mapping or textual error or omission\nmade when the original plan was adopted or during subsequent amendments;\n\n(2)\n\nthe denial of the proposed amendment would jeopardize public health, safety, or welfare;\n\n(3)\n\nthe proposed amendment is appropriate:\n\n(a)\n\nbecause of a material change in circumstances since the adoption of the plan; and\n\n(b)\n\ndenial would result in a hardship to the applicant;\n\n(4)\n\nthe proposed project:\n\n(a)\n\nprovides environmental protection that is superior to the protection that would otherwise\nbe achieved under existing zoning and development regulations; or\n\n(b)\n\npromotes the recruitment or retention of an employment center with 100 or more employees;\n\n(5)\n\nthe proposed amendment is consistent with the goals and objectives of the neighborhood\nplan; or\n\n(6)\n\nthe proposed amendment promotes additional S.M.A.R.T. Housing opportunities.\n\n(C)\n\nThe applicant must demonstrate that:\n\n(1)\n\nthe proposed amendment complies with applicable regulations and standards established\nby Title 25 (Land Development), the objectives of Chapter 25-2 (Zoning), and the purposes of the zoning district proposed for the subject property; and\n\n(2)\n\nthe proposed amendment is consistent with sound planning principles.\n\nSource: Ord. 20080306-073; 20091217-053.\n\n**Editor's note—**\nOrd. No. 20230831-104, Pt. 2, effective September 11, 2023, repealed § 25-1-811, which pertained to map;\nfiling dates and derived from Ord. No. 20080306-073; Ord. No. 20091217-053.\n",
  "entities": [
    {
      "text": "ARTICLE 16",
      "label": "SECTION_REF",
      "start": 4,
      "end": 14,
      "normalized": {
        "type": "article",
        "number": 16,
        "full_reference": "Article 16"
      }
    },
    {
      "text": "at least",
      "label": "OPERATOR",
      "start": 3647,
      "end": 3655,
      "normalized": "gte"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 3771,
      "end": 3782,
      "normalized": "residential"
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 8611,
      "end": 8620,
      "normalized": "gt"
    },
    {
      "text": "Section 25-1-133",
      "label": "SECTION_REF",
      "start": 9700,
      "end": 9716,
      "normalized": {
        "section": "25-1-133",
        "subsection": null,
        "full_reference": "25-1-133"
      }
    },
    {
      "text": "500 feet",
      "label": "MEASUREMENT",
      "start": 11340,
      "end": 11348,
      "normalized": {
        "value": 500,
        "unit": "ft",
        "original": "500 feet"
      }
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 12597,
      "end": 12610,
      "normalized": "lte"
    },
    {
      "text": "Chapter 25-2",
      "label": "SECTION_REF",
      "start": 15206,
      "end": 15218,
      "normalized": {
        "type": "chapter",
        "number": "25-2",
        "full_reference": "Chapter 25-2"
      }
    },
    {
      "text": "§ 25-1-811",
      "label": "SECTION_REF",
      "start": 15514,
      "end": 15524,
      "normalized": {
        "section": "25-1-811",
        "subsection": null,
        "full_reference": "25-1-811"
      }
    }
  ]
}