{
  "section_id": "25-1-article-3",
  "content": "### ARTICLE 3. - ACCOUNTABLE ENTITIES.\n\nThe Neighborhood Planning and Zoning Department provides the citizens of Austin with\nassistance in neighborhood planning, makes recommendations on land use issues, coordinates\nthe delivery of neighborhood services, and ensures compliance with zoning and housing\nregulations. The department has the duties and powers prescribed by ordinance or delegated\nby the city manager. The city manager shall appoint a director to manage the department.\n\nSource: Ord. 010329-18; Ord. 031211-11.\n\nThe Watershed Protection and Development Review Department ensures that development\nin the City's planning jurisdiction efficiently and effectively complies with the\nComprehensive Plan and City ordinances and serves the citizens of Austin by using\nenvironmentally responsible, cost-effective water resource management to protect lives,\nproperty, and quality of life. The department has the duties and powers prescribed\nby ordinance or delegated by the city manager. The city manager shall appoint a director\nto manage the department.\n\nSource: Section 13-1-130; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nThe city manager shall appoint an environmental officer to advise and direct the city\nstaff and ensure that environmental protection is the highest priority in public and\nprivate development.\n\n(B)\n\nThe environmental officer may receive complaints from citizens, investigate the complaints,\nand report the findings to the city manager.\n\n(C)\n\nThe environmental officer shall deliver a report on Austin's environment to the city\nmanager and Council each April.\n\nSource: Section 13-1-134(d); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe Planning Commission or the Zoning and Platting Commission may act as the Land\nUse Commission, as prescribed by this section.\n\n(B)\n\nThe Planning Commission or the Zoning and Platting Commission may act as the Land\nUse Commission to consider an appeal for a disapproval of an application for preliminary\nplan or plat. The determination of which commission shall act as the Land Use Commission\nfor a particular preliminary plan or plat application shall be made by the director\nbased on agenda management considerations. Regardless of the initial determination,\neither Commission may act as the land use commission for subsequent consideration\nof the application.\n\n(C)\n\nThe Zoning and Platting Commission shall act as the Land Use Commission for all applications,\nexcept as provided in Subsection (D).\n\n(D)\n\nThe Planning Commission shall act as the land use commission for property that is\nwholly or partly within:\n\n(1)\n\nthe boundaries of a neighborhood plan that the council has adopted as a component\nof the comprehensive plan;\n\n(2)\n\nthe former Robert Mueller Municipal Airport site;\n\n(3)\n\na transit oriented development (TOD) district;\n\n(4)\n\nthe old Enfield neighborhood planning area; or\n\n(5)\n\nthe boundaries of a proposed neighborhood plan that the Planning Commission is considering\nas an amendment to the comprehensive plan. In this subsection, Planning Commission\nconsideration of a proposed neighborhood plan:\n\n(a)\n\nbegins on the effective date of a council resolution or ordinance directing the Planning\nCommission to consider a neighborhood plan for an identified area; and\n\n(b)\n\nends on the date that the council adopts or rejects the proposed neighborhood plan\nor withdraws its directive to the Planning Commission to consider a neighborhood plan\nfor the area.\n\n(E)\n\nA liaison committee of the Planning Commission and the Zoning and Platting Commission\nis established. The chair of each commission shall appoint two commission members\nto serve on the committee. The committee shall meet regularly to exchange information\nrelating to the commissions and make recommendations to the commissions on common\npolicies, objectives, issues, and activities.\n\nSource: Ord. 010607-8; Ord. 011129-79; Ord. 031211-11; Ord. 20060309-057; Ord. 20060622-128;\n20090806-068; Ord. 20120524-083; Ord. 20121018-104; Ord. No. 20140626-113, Pt. 2, 7-7-14; Ord. No. 20190822-117, Pt. 1, 9-1-19; Ord. No. 20230831-141, Pt. 2, 9-11-23.\n",
  "entities": [
    {
      "text": "ARTICLE 3",
      "label": "SECTION_REF",
      "start": 4,
      "end": 13,
      "normalized": {
        "type": "article",
        "number": 3,
        "full_reference": "Article 3"
      }
    },
    {
      "text": "Section 13-1-130",
      "label": "SECTION_REF",
      "start": 1067,
      "end": 1083,
      "normalized": {
        "section": "13-1-130",
        "subsection": null,
        "full_reference": "13-1-130"
      }
    }
  ]
}