{
  "section_id": "25-1-151",
  "content": "\n(A)\n\nA person shall register to speak at a public hearing with the presiding officer of\nthe body conducting the hearing in the manner provided by the presiding officer.\n\n(B)\n\nA person who registers before the hearing may speak at the time provided in Subsection\n(E). A person who registers after the beginning of a hearing may speak before the\nclose of the hearing with the permission of the presiding officer.\n\n(C)\n\nThe speaker registration shall identify the name and mailing address of the speaker\nand the matter to be addressed.\n\n(D)\n\nA speaker shall state the speaker's name at the beginning of the speaker's presentation\nwhen addressing the body conducting the hearing.\n\n(E)\n\nExcept as provided in Article 9 (Appeals, Variances, and Special City Procedures), a public hearing shall proceed as follows:\n\n(1)\n\npresentation of a report by staff;\n\n(2)\n\npresentation by the applicant, for a hearing on an application;\n\n(3)\n\npresentation by interested parties supporting the application or proposal;\n\n(4)\n\npresentation by interested parties opposing the application or proposal;\n\n(5)\n\nrebuttal by the applicant, for a hearing on an application.\n\n(F)\n\nA member of the body conducting the public hearing may ask questions of a person at\nany time during the hearing. With the approval of the presiding officer, a person\nmay ask a question of another person.\n\n(G)\n\nThe body conducting a public hearing may limit a speaker's time to address the body.\nThe presiding officer may request that a speaker eliminate repetitious or irrelevant\ntestimony.\n\nSource: City Code Section 25-1-151; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe body conducting a public hearing may:\n\n(1)\n\npostpone a public hearing by announcing the postponement on the date and at the time\nand location stated in the notice for the scheduled hearing; and\n\n(2)\n\ncontinue a public hearing to a later date by announcing the continuance after the\nhearing begins.\n\n(B)\n\nIf the body conducting a public hearing postpones or continues a hearing to a specific\ndate and time not later than 60 days after the date on which the postponement or continuance\nis announced, the announcement is adequate notice of the next hearing and additional\nnotice is not required.\n\n(C)\n\nWhen a body conducting a public hearing postpones or continues a hearing, the next\nhearing shall be held at the same location as the original hearing unless a change\nin location is announced at the time of the postponement or continuance.\n\n(D)\n\nIf a body does not specify a hearing date and time at the time that a postponement\nor continuance is announced, notice of the next hearing shall be provided in the manner\nrequired for the original hearing.\n\nSource: City Code Section 25-1-152; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, Pt. 44, 9-1-19; Ord. No. 20230831-142, Pt. 10, 9-1-23.",
  "entities": [
    {
      "text": "Article 9",
      "label": "SECTION_REF",
      "start": 705,
      "end": 714,
      "normalized": {
        "type": "article",
        "number": 9,
        "full_reference": "Article 9"
      }
    },
    {
      "text": "Section 25-1-151",
      "label": "SECTION_REF",
      "start": 1562,
      "end": 1578,
      "normalized": {
        "section": "25-1-151",
        "subsection": null,
        "full_reference": "25-1-151"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 2205,
      "end": 2213,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 2637,
      "end": 2645,
      "normalized": "required"
    },
    {
      "text": "Section 25-1-152",
      "label": "SECTION_REF",
      "start": 2691,
      "end": 2707,
      "normalized": {
        "section": "25-1-152",
        "subsection": null,
        "full_reference": "25-1-152"
      }
    }
  ]
}