{
  "section_id": "25-1-22",
  "content": "is determined in accordance with Section 25-1-22 (Measurements).\n\n(93)\n\nREAR YARD means a yard extending the full width of a lot between the rear lot line\nand the rear setback line, excluding any area located within the street side yard\nof a corner lot.\n\n(94)\n\nRECORD OWNER means the owner of real property as shown by the deed records of the\ncounty in which the property is located.\n\n(95)\n\nRECREATIONAL VEHICLE means a vehicle or trailer designed for temporary dwelling or\nrecreational purposes, and includes travel trailers, pick-up campers, camping trailers,\nmotor coach homes, converted trucks and buses, boats, and boat trailers.\n\n(96)\n\nRELEASE means:\n\n(a)\n\nthe written certification of the director that a site plan has been approved, that\nthe site plan complies with this title, and that the conditions of approval for the\nsite plan have been satisfied; or\n\n(b)\n\nthe written certification of the director and the presiding officer of the Land Use\nCommission, that a plat has been approved, that the plat complies with this title,\nand that the conditions of approval for the plat have been satisfied.\n\n(97)\n\nRESIDENTIAL INFILL PROJECT means development of a site not exceeding 1.00 acre that\nconsists of:\n\n(a)\n\nfive to sixteen dwelling units; or\n\n(b)\n\na re-subdivision of property that:\n\n(i)\n\nis zoned SF-1, SF-2, or SF-3;\n\n(ii)\n\nincludes only land that was originally platted as a residential subdivision; and\n\n(iii)\n\ndoes not require a plat vacation.\n\n(98)\n\nRESPONSIBLE DIRECTOR means:\n\n(a)\n\nthe director of the Watershed Protection and Development Review Department or the\ndirector's designee; or\n\n(b)\n\nthe director of the Planning and Development Review Department or the director's designee\nfor responsibilities arising under:\n\n(i)\n\nChapter 25-2, Subchapter A, B, or D; or\n\n(ii)\n\nChapter 25-3, except Article 3.\n\n(99)\n\nREVISION means a change in an approved or released plan that is initiated by an applicant.\n\n(100)\n\nRIGHT-OF-WAY means land dedicated or reserved for streets, utilities, or other public\nfacilities.\n\n(101)\n\nROADWAY means the portion of a street right-of-way used for vehicular travel.\n\n(102)\n\nSCREENED means hidden from the view of a person standing at ground level on an abutting\nsite by an architectural or landscape feature that is, or will grow to, at least six\nfeet in height.\n\n(103)\n\nSECURE means either in a dedicated locked room, an area enclosed by a fence with a\nlocked gate, and/or within 100 feet of a permanent security guard station. For residential\nuse enclosed private garage space is considered to be secure.\n\n(104)\n\nSETBACK LINE means a line within a lot parallel to and measured from a corresponding\nlot line, forming the boundary of a yard and governing the placement of structures\nand uses on the lot.\n\n(105)\n\nSIDE LOT LINE means a lot line intersecting the front lot line and extending a minimum\ndistance of 25 feet.\n\n(106)\n\nSIDEWALK means the paved portion of a pedestrian way.\n\n(107)\n\nSIDE YARD means a yard extending the depth of a lot from the front yard to the rear\nlot line between the side lot line and the side setback line. For a corner lot, a\nstreet side yard is a yard that extends from the front yard to the rear lot line.\n\n(108)\n\nSITE means a contiguous area intended for development, or the area on which a building\nhas been proposed to be built or has been built. A site may not cross a public street\nor right-of-way.\n\n(109)\n\nSITE PLAN means a plan for a development, other than a subdivision construction plan,\nsubmitted by an applicant to demonstrate that the development complies with the requirements\nof this title.\n\n(110)\n\nSMALL LOT means a lot with an area of less than 5,750 square feet.\n\n(111)\n\nSPECIAL EXCEPTION means the waiver of a requirement because of vested rights established\nin accordance with the procedures prescribed by Article 7, Division 3 (Special Exceptions).\n\n(112)\n\nSTAFF means a City employee.\n\n(113)\n\nSTANDARD LOT means a lot of at least 5,750 square feet and less than 10,000 square\nfeet.\n\n(114)\n\nSTREET LINE means a lot line abutting a street.\n\n(115)\n\nSTREET YARD means a yard adjacent to a street and determined on the basis of a street\nlot line.\n\n(116)\n\nSTRUCTURAL ALTERATION means a change in the supporting members of a building including\nload bearing walls, columns, girders, and beams over eight feet long.\n\n(117)\n\nSTRUCTURE means a building of any kind, or a piece of work artificially built-up or\ncomposed of parts joined together in a definite manner.\n\n(118)\n\nSUBDIVIDE means:\n\n(a)\n\nto divide land into two or more lots or sites for the purpose of sale or development;\n\n(b)\n\nto resubdivide an existing lot; or\n\n(c)\n\nto combine of two or more lots into the same number or fewer lots with different boundaries.\n\n(119)\n\nSUBORDINATE SIDE YARD, when used in reference to a small lot, means the side yard\nhaving the smaller width.\n\n(120)\n\nSUBSTANDARD LOT means a lot or tract recorded by deed or plat that does not comply\nwith current area, width, or depth requirements, but that complied with the requirements\nin effect when it was placed on record.\n\n(121)\n\nTECHNICAL CODE means the International Building Code, the National Electrical Code,\nthe Uniform Mechanical Code, the Uniform Plumbing Code, the International Fire Code,\nthe Uniform Solar Energy Code, the Uniform Housing Code, or the International Property\nMaintenance Code, as adopted by the city council.\n\n(122)\n\nTHROUGH LOT means a lot, other than a corner lot, abutting more than one street.\n\n(123)\n\nTINY HOME means a dwelling unit that is 400 square feet or less in floor area excluding\nloft space.\n\n(124)\n\nTOWNHOUSE means a dwelling unit having a common wall with or abutting one or more\nadjoining dwelling units in a townhouse group.\n\n(125)\n\nTOWNHOUSE GROUP means two or more contiguous townhouses.\n\n(126)\n\nTOWNHOUSE LOT means the portion of a townhouse development that is intended for separate\nownership as the location of a single townhouse and associated private yard area.\n\n(127)\n\nTRANSPORTATION PLAN means the Austin Metropolitan Area Transportation Plan or an equivalent\nplan adopted by the city council as part of the Comprehensive Plan.\n\n(128)\n\nUPDATE means additional information, a plan, or a plat submitted by an applicant in\nresponse to comments by a review entity.\n\n(129)\n\nUSE means the conduct of an activity, or the performance of a function, on a site\nor in a structure.\n\n(130)\n\nUSE EASEMENT, when used in reference to a small lot, means an easement granted by\nthe owner of a small lot with the subordinate side yard to the owner of a small lot\nwith a dominant side yard along the common lot line, and which allows the occupant\nof the dwelling unit on the lot having the dominant side yard the use, enjoyment,\nand privacy of the dominant side yard.\n\n(131)\n\nVALUE or VALUATION, when used in reference to a structure, means the estimated cost\nto replace the structure in kind, based on current replacement costs.\n\n(132)\n\nVARIANCE means a waiver of a provision of this title under Article 7, Division 2 (Variances).\n\n(133)\n\nWATER CONTROL AND IMPROVEMENT DISTRICT means a district created under Chapters 50\nand 51 of the Water Code.\n\n(134)\n\nWATER DISTRICT means a district created under Title 4 of the Water Code.\n\n(135)\n\nWILDLAND-URBAN INTERFACE AREA means an area designated by the city council as one\nwhere conditions affecting the combustibility of both wildland and built fuels allow\nfor the ignition and spread of fire through the combined fuel complex.\n\n(136)\n\nWORKING DAY is synonymous with BUSINESS DAY and excludes a Saturday, Sunday, an official\nCity holiday, or any other day on which City offices are closed for regular business\nat any time during normal business hours.\n\n(137)\n\nYARD means an open space on a lot adjoining a lot line.\n\n(138)\n\nZERO LOT LINE means a common lot line on which a wall of a structure may be constructed.\n\n(139)\n\nZONING MAP means the zoning district map of the City as adopted by ordinance.\n\nSource: Sections 13-1-22, 13-2-1, 13-2-401, 13-2-435, and 13-5-61; Ord. 990225-70;\nOrd. 990805-46; Ord. 000309-39; Ord. 000406-85; Ord. 010329-18; Ord. 010607-8; Ord.\n031211-11; Ord. 041202-16; Ord. 20111215-096; Ord. 20120524-139; Ord. 20130228-074;\nOrd. 20130523-104; Ord. 20130926-145; Ord. No. 20160303-036, Pt. 1, 3-14-16; Ord. No. 20160421-039, Pt. 1, 5-2-16; Ord. No. 20170615-102, Pt. 1, 6-15-17; Ord. No. 20220519-094, Pt. 1, 5-30-22; Ord. No. 20230413-057, Pt. 1, 4-24-23; Ord. No. 20230831-141, Pt. 1, 9-11-23; Ord. No. 20231207-001, Pt. 1, 12-18-23; Ord. No. 20231102-028, Pt. 1, 11-13-23; Ord. No. 20240516-006, Pt. 1, 5-27-24; Ord. No. 20250306-037, Pt. 1, 5-23-25.\n\n(A)\n\nLot area is the net horizontal area within the lot lines, excluding the portion of\nthe lot:\n\n(1)\n\nthat provides street access, if the lot is a flag lot; or\n\n(2)\n\nthat is located below 492.8 feet of elevation above sea level, if the lot is adjacent\nto Lake Austin.\n\n(B)\n\nLot depth is the horizontal distance between the mid-point of the front lot line and\nthe midpoint of the rear lot line.\n\n(C)\n\nExcept as otherwise provided in this title, lot width is measured at the front setback\nline and at a distance of 20 feet to the rear of the front setback line.\n\n(D)\n\nIn determining required yards and setbacks for an irregularly shaped lot or a lot\nbounded by only three lot lines, the rear lot line is:\n\n(1)\n\na line ten feet long;\n\n(2)\n\nparallel to the front lot line; and\n\n(3)\n\nat the most distant location from the front lot line.\n\n(E)\n\nA distance from a structure to a line or location is measured from the exterior face\nof the nearest wall or vertical support of the structure to the line or location.\nFor a structure that does not have a wall or vertical support, the building official\nshall determine the point of measurement.\n\nSource: Sections 13-2-1, 13-2-602 and 13-2-603; Ord. 990225-70; Ord. 031211-11; Ord. No. 20240516-006, Pt. 2, 5-27-24.\n\n(A)\n\nExcept as otherwise provided in this section, impervious cover means the total area\nof any surface that prevents the infiltration of water into the ground, such as roads,\nparking areas, concrete, and buildings.\n\n(B)\n\nImpervious cover shall be calculated in accordance with the Environmental Criteria\nManual and Section 25-8-63 (Impervious Cover Calculations).\n\nSource: Ord. 000406-85; Ord. 031211-11; Ord. 20080306-072; Ord. 20131017-046.\n\n### ARTICLE 3. - ACCOUNTABLE ENTITIES.\n\nThe Neighborhood Planning and Zoning Department provides the citizens of Austin with\nassistance in neighborhood planning, makes recommendations on land use issues, coordinates\nthe delivery of neighborhood services, and ensures compliance with zoning and housing\nregulations. The department has the duties and powers prescribed by ordinance or delegated\nby the city manager. The city manager shall appoint a director to manage the department.\n\nSource: Ord. 010329-18; Ord. 031211-11.\n\nThe Watershed Protection and Development Review Department ensures that development\nin the City's planning jurisdiction efficiently and effectively complies with the\nComprehensive Plan and City ordinances and serves the citizens of Austin by using\nenvironmentally responsible, cost-effective water resource management to protect lives,\nproperty, and quality of life. The department has the duties and powers prescribed\nby ordinance or delegated by the city manager. The city manager shall appoint a director\nto manage the department.\n\nSource: Section 13-1-130; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nThe city manager shall appoint an environmental officer to advise and direct the city\nstaff and ensure that environmental protection is the highest priority in public and\nprivate development.\n\n(B)\n\nThe environmental officer may receive complaints from citizens, investigate the complaints,\nand report the findings to the city manager.\n\n(C)\n\nThe environmental officer shall deliver a report on Austin's environment to the city\nmanager and Council each April.\n\nSource: Section 13-1-134(d); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe Planning Commission or the Zoning and Platting Commission may act as the Land\nUse Commission, as prescribed by this section.\n\n(B)\n\nThe Planning Commission or the Zoning and Platting Commission may act as the Land\nUse Commission to consider an appeal for a disapproval of an application for preliminary\nplan or plat. The determination of which commission shall act as the Land Use Commission\nfor a particular preliminary plan or plat application shall be made by the director\nbased on agenda management considerations. Regardless of the initial determination,\neither Commission may act as the land use commission for subsequent consideration\nof the application.\n\n(C)\n\nThe Zoning and Platting Commission shall act as the Land Use Commission for all applications,\nexcept as provided in Subsection (D).\n\n(D)\n\nThe Planning Commission shall act as the land use commission for property that is\nwholly or partly within:\n\n(1)\n\nthe boundaries of a neighborhood plan that the council has adopted as a component\nof the comprehensive plan;\n\n(2)\n\nthe former Robert Mueller Municipal Airport site;\n\n(3)\n\na transit oriented development (TOD) district;\n\n(4)\n\nthe old Enfield neighborhood planning area; or\n\n(5)\n\nthe boundaries of a proposed neighborhood plan that the Planning Commission is considering\nas an amendment to the comprehensive plan. In this subsection, Planning Commission\nconsideration of a proposed neighborhood plan:\n\n(a)\n\nbegins on the effective date of a council resolution or ordinance directing the Planning\nCommission to consider a neighborhood plan for an identified area; and\n\n(b)\n\nends on the date that the council adopts or rejects the proposed neighborhood plan\nor withdraws its directive to the Planning Commission to consider a neighborhood plan\nfor the area.\n\n(E)\n\nA liaison committee of the Planning Commission and the Zoning and Platting Commission\nis established. The chair of each commission shall appoint two commission members\nto serve on the committee. The committee shall meet regularly to exchange information\nrelating to the commissions and make recommendations to the commissions on common\npolicies, objectives, issues, and activities.\n\nSource: Ord. 010607-8; Ord. 011129-79; Ord. 031211-11; Ord. 20060309-057; Ord. 20060622-128;\n20090806-068; Ord. 20120524-083; Ord. 20121018-104; Ord. No. 20140626-113, Pt. 2, 7-7-14; Ord. No. 20190822-117, Pt. 1, 9-1-19; Ord. No. 20230831-141, Pt. 2, 9-11-23.\n\n### ARTICLE 4. - APPLICATION AND APPROVAL.\n\n(A)\n\nAn applicant must obtain approvals in the following order:\n\n(1)\n\nzoning;\n\n(2)\n\nsubdivision;\n\n(3)\n\nsite plan; and\n\n(4)\n\nbuilding permit.\n\n(B)\n\nAn applicant must obtain approvals for subdivision development in the following order:\n\n(1)\n\npreliminary plan, if required;\n\n(2)\n\nplat; and\n\n(3)\n\nsubdivision construction plan.\n\n(C)\n\nAn applicant may concurrently file zoning and site plan applications if no subdivision\nis required.\n\n(D)\n\nAn applicant may concurrently file subdivision, site plan, and building permit applications,\nif:\n\n(1)\n\nno zoning or rezoning is required or requested; and\n\n(2)\n",
  "entities": [
    {
      "text": "Section 25-1-22",
      "label": "SECTION_REF",
      "start": 33,
      "end": 48,
      "normalized": {
        "section": "25-1-22",
        "subsection": null,
        "full_reference": "25-1-22"
      }
    },
    {
      "text": "REAR YARD",
      "label": "METRIC",
      "start": 72,
      "end": 81,
      "normalized": "rear_yard_setback_min"
    },
    {
      "text": "rear setback",
      "label": "METRIC",
      "start": 163,
      "end": 175,
      "normalized": "rear_setback_min"
    },
    {
      "text": "street side yard",
      "label": "METRIC",
      "start": 220,
      "end": 236,
      "normalized": "street_side_yard_min"
    },
    {
      "text": "not exceeding",
      "label": "OPERATOR",
      "start": 1169,
      "end": 1182,
      "normalized": "lte"
    },
    {
      "text": "1.00 acre",
      "label": "MEASUREMENT",
      "start": 1183,
      "end": 1192,
      "normalized": {
        "value": 1,
        "unit": "acre",
        "original": "1.00 acre"
      }
    },
    {
      "text": "dwelling units",
      "label": "USE_TYPE",
      "start": 1233,
      "end": 1247,
      "normalized": "dwelling_unit"
    },
    {
      "text": "SF-1",
      "label": "ZONE",
      "start": 1308,
      "end": 1312,
      "normalized": {
        "code": "SF-1",
        "original": "SF-1"
      }
    },
    {
      "text": "SF-2",
      "label": "ZONE",
      "start": 1314,
      "end": 1318,
      "normalized": {
        "code": "SF-2",
        "original": "SF-2"
      }
    },
    {
      "text": "SF-3",
      "label": "ZONE",
      "start": 1323,
      "end": 1327,
      "normalized": {
        "code": "SF-3",
        "original": "SF-3"
      }
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 1388,
      "end": 1399,
      "normalized": "residential"
    },
    {
      "text": "Chapter 25-2",
      "label": "SECTION_REF",
      "start": 1744,
      "end": 1756,
      "normalized": {
        "type": "chapter",
        "number": "25-2",
        "full_reference": "Chapter 25-2"
      }
    },
    {
      "text": "Subchapter A",
      "label": "SECTION_REF",
      "start": 1758,
      "end": 1770,
      "normalized": {
        "type": "subchapter",
        "letter": "A",
        "full_reference": "Subchapter A"
      }
    },
    {
      "text": "Chapter 25-3",
      "label": "SECTION_REF",
      "start": 1791,
      "end": 1803,
      "normalized": {
        "type": "chapter",
        "number": "25-3",
        "full_reference": "Chapter 25-3"
      }
    },
    {
      "text": "Article 3",
      "label": "SECTION_REF",
      "start": 1812,
      "end": 1821,
      "normalized": {
        "type": "article",
        "number": 3,
        "full_reference": "Article 3"
      }
    },
    {
      "text": "at least",
      "label": "OPERATOR",
      "start": 2281,
      "end": 2289,
      "normalized": "gte"
    },
    {
      "text": "height",
      "label": "METRIC",
      "start": 2302,
      "end": 2308,
      "normalized": "height_max"
    },
    {
      "text": "100 feet",
      "label": "MEASUREMENT",
      "start": 2428,
      "end": 2436,
      "normalized": {
        "value": 100,
        "unit": "ft",
        "original": "100 feet"
      }
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 2480,
      "end": 2491,
      "normalized": "residential"
    },
    {
      "text": "SETBACK",
      "label": "METRIC",
      "start": 2562,
      "end": 2569,
      "normalized": "setback_min"
    },
    {
      "text": "LOT",
      "label": "ZONE",
      "start": 2764,
      "end": 2767,
      "normalized": {
        "code": "LOT",
        "original": "LOT"
      }
    },
    {
      "text": "minimum",
      "label": "OPERATOR",
      "start": 2838,
      "end": 2845,
      "normalized": "min"
    },
    {
      "text": "25 feet",
      "label": "MEASUREMENT",
      "start": 2858,
      "end": 2865,
      "normalized": {
        "value": 25,
        "unit": "ft",
        "original": "25 feet"
      }
    },
    {
      "text": "SIDE YARD",
      "label": "METRIC",
      "start": 2937,
      "end": 2946,
      "normalized": "side_yard_setback_min"
    },
    {
      "text": "front yard",
      "label": "METRIC",
      "start": 2998,
      "end": 3008,
      "normalized": "front_yard_setback_min"
    },
    {
      "text": "side setback",
      "label": "METRIC",
      "start": 3064,
      "end": 3076,
      "normalized": "side_setback_min"
    },
    {
      "text": "street side yard",
      "label": "METRIC",
      "start": 3103,
      "end": 3119,
      "normalized": "street_side_yard_min"
    },
    {
      "text": "front yard",
      "label": "METRIC",
      "start": 3152,
      "end": 3162,
      "normalized": "front_yard_setback_min"
    },
    {
      "text": "LOT",
      "label": "ZONE",
      "start": 3599,
      "end": 3602,
      "normalized": {
        "code": "LOT",
        "original": "LOT"
      }
    },
    {
      "text": "less than",
      "label": "OPERATOR",
      "start": 3631,
      "end": 3640,
      "normalized": "lt"
    },
    {
      "text": "5,750 square feet",
      "label": "MEASUREMENT",
      "start": 3641,
      "end": 3658,
      "normalized": {
        "value": 5750,
        "unit": "sqft",
        "original": "5,750 square feet"
      }
    },
    {
      "text": "Article 7",
      "label": "SECTION_REF",
      "start": 3805,
      "end": 3814,
      "normalized": {
        "type": "article",
        "number": 7,
        "full_reference": "Article 7"
      }
    },
    {
      "text": "Division 3",
      "label": "SECTION_REF",
      "start": 3816,
      "end": 3826,
      "normalized": {
        "type": "division",
        "number": 3,
        "full_reference": "Division 3"
      }
    },
    {
      "text": "LOT",
      "label": "ZONE",
      "start": 3903,
      "end": 3906,
      "normalized": {
        "code": "LOT",
        "original": "LOT"
      }
    },
    {
      "text": "at least",
      "label": "OPERATOR",
      "start": 3922,
      "end": 3930,
      "normalized": "gte"
    },
    {
      "text": "5,750 square feet",
      "label": "MEASUREMENT",
      "start": 3931,
      "end": 3948,
      "normalized": {
        "value": 5750,
        "unit": "sqft",
        "original": "5,750 square feet"
      }
    },
    {
      "text": "less than",
      "label": "OPERATOR",
      "start": 3953,
      "end": 3962,
      "normalized": "lt"
    },
    {
      "text": "eight feet",
      "label": "MEASUREMENT",
      "start": 4291,
      "end": 4301,
      "normalized": {
        "value": "eight feet",
        "unit": null,
        "original": "eight feet"
      }
    },
    {
      "text": "SIDE YARD",
      "label": "METRIC",
      "start": 4733,
      "end": 4742,
      "normalized": "side_yard_setback_min"
    },
    {
      "text": "side yard",
      "label": "METRIC",
      "start": 4793,
      "end": 4802,
      "normalized": "side_yard_setback_min"
    },
    {
      "text": "LOT",
      "label": "ZONE",
      "start": 4849,
      "end": 4852,
      "normalized": {
        "code": "LOT",
        "original": "LOT"
      }
    },
    {
      "text": "LOT",
      "label": "ZONE",
      "start": 5379,
      "end": 5382,
      "normalized": {
        "code": "LOT",
        "original": "LOT"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 5430,
      "end": 5439,
      "normalized": "gt"
    },
    {
      "text": "dwelling unit",
      "label": "USE_TYPE",
      "start": 5478,
      "end": 5491,
      "normalized": "dwelling_unit"
    },
    {
      "text": "400 square feet",
      "label": "MEASUREMENT",
      "start": 5500,
      "end": 5515,
      "normalized": {
        "value": 400,
        "unit": "sqft",
        "original": "400 square feet"
      }
    },
    {
      "text": "dwelling unit",
      "label": "USE_TYPE",
      "start": 5586,
      "end": 5599,
      "normalized": "dwelling_unit"
    },
    {
      "text": "dwelling units",
      "label": "USE_TYPE",
      "start": 5660,
      "end": 5674,
      "normalized": "dwelling_unit"
    },
    {
      "text": "townhouse",
      "label": "USE_TYPE",
      "start": 5680,
      "end": 5689,
      "normalized": "townhouse"
    },
    {
      "text": "townhouses",
      "label": "USE_TYPE",
      "start": 5750,
      "end": 5760,
      "normalized": "townhouse"
    },
    {
      "text": "LOT",
      "label": "ZONE",
      "start": 5780,
      "end": 5783,
      "normalized": {
        "code": "LOT",
        "original": "LOT"
      }
    },
    {
      "text": "townhouse",
      "label": "USE_TYPE",
      "start": 5807,
      "end": 5816,
      "normalized": "townhouse"
    },
    {
      "text": "townhouse",
      "label": "USE_TYPE",
      "start": 5897,
      "end": 5906,
      "normalized": "townhouse"
    },
    {
      "text": "side yard",
      "label": "METRIC",
      "start": 6487,
      "end": 6496,
      "normalized": "side_yard_setback_min"
    },
    {
      "text": "side yard",
      "label": "METRIC",
      "start": 6541,
      "end": 6550,
      "normalized": "side_yard_setback_min"
    },
    {
      "text": "dwelling unit",
      "label": "USE_TYPE",
      "start": 6615,
      "end": 6628,
      "normalized": "dwelling_unit"
    },
    {
      "text": "side yard",
      "label": "METRIC",
      "start": 6660,
      "end": 6669,
      "normalized": "side_yard_setback_min"
    },
    {
      "text": "side yard",
      "label": "METRIC",
      "start": 6718,
      "end": 6727,
      "normalized": "side_yard_setback_min"
    },
    {
      "text": "Article 7",
      "label": "SECTION_REF",
      "start": 6958,
      "end": 6967,
      "normalized": {
        "type": "article",
        "number": 7,
        "full_reference": "Article 7"
      }
    },
    {
      "text": "Division 2",
      "label": "SECTION_REF",
      "start": 6969,
      "end": 6979,
      "normalized": {
        "type": "division",
        "number": 2,
        "full_reference": "Division 2"
      }
    },
    {
      "text": "open space",
      "label": "METRIC",
      "start": 7682,
      "end": 7692,
      "normalized": "open_space_min"
    },
    {
      "text": "LOT",
      "label": "ZONE",
      "start": 7737,
      "end": 7740,
      "normalized": {
        "code": "LOT",
        "original": "LOT"
      }
    },
    {
      "text": "Lot area",
      "label": "METRIC",
      "start": 8594,
      "end": 8602,
      "normalized": "lot_area_min"
    },
    {
      "text": "492.8 feet",
      "label": "MEASUREMENT",
      "start": 8778,
      "end": 8788,
      "normalized": {
        "value": 492.8,
        "unit": "ft",
        "original": "492.8 feet"
      }
    },
    {
      "text": "Lake Austin",
      "label": "ZONE",
      "start": 8845,
      "end": 8856,
      "normalized": {
        "code": "LA",
        "name": "lake austin",
        "original": "Lake Austin"
      }
    },
    {
      "text": "Lot depth",
      "label": "METRIC",
      "start": 8864,
      "end": 8873,
      "normalized": "lot_depth_min"
    },
    {
      "text": "lot width",
      "label": "METRIC",
      "start": 9034,
      "end": 9043,
      "normalized": "lot_width_min"
    },
    {
      "text": "front setback",
      "label": "METRIC",
      "start": 9063,
      "end": 9076,
      "normalized": "front_setback_min"
    },
    {
      "text": "20 feet",
      "label": "MEASUREMENT",
      "start": 9103,
      "end": 9110,
      "normalized": {
        "value": 20,
        "unit": "ft",
        "original": "20 feet"
      }
    },
    {
      "text": "front setback",
      "label": "METRIC",
      "start": 9130,
      "end": 9143,
      "normalized": "front_setback_min"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 9171,
      "end": 9179,
      "normalized": "required"
    },
    {
      "text": "setbacks",
      "label": "METRIC",
      "start": 9190,
      "end": 9198,
      "normalized": "setback_min"
    },
    {
      "text": "ten feet",
      "label": "MEASUREMENT",
      "start": 9306,
      "end": 9314,
      "normalized": {
        "value": "ten feet",
        "unit": null,
        "original": "ten feet"
      }
    },
    {
      "text": "impervious cover",
      "label": "METRIC",
      "start": 9895,
      "end": 9911,
      "normalized": "impervious_cover_max"
    },
    {
      "text": "Impervious cover",
      "label": "METRIC",
      "start": 10066,
      "end": 10082,
      "normalized": "impervious_cover_max"
    },
    {
      "text": "Section 25-8-63",
      "label": "SECTION_REF",
      "start": 10160,
      "end": 10175,
      "normalized": {
        "section": "25-8-63",
        "subsection": null,
        "full_reference": "25-8-63"
      }
    },
    {
      "text": "Impervious Cover",
      "label": "METRIC",
      "start": 10177,
      "end": 10193,
      "normalized": "impervious_cover_max"
    },
    {
      "text": "ARTICLE 3",
      "label": "SECTION_REF",
      "start": 10293,
      "end": 10302,
      "normalized": {
        "type": "article",
        "number": 3,
        "full_reference": "Article 3"
      }
    },
    {
      "text": "Section 13-1-130",
      "label": "SECTION_REF",
      "start": 11356,
      "end": 11372,
      "normalized": {
        "section": "13-1-130",
        "subsection": null,
        "full_reference": "13-1-130"
      }
    },
    {
      "text": "ARTICLE 4",
      "label": "SECTION_REF",
      "start": 14383,
      "end": 14392,
      "normalized": {
        "type": "article",
        "number": 4,
        "full_reference": "Article 4"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 14684,
      "end": 14692,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 14843,
      "end": 14851,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 14987,
      "end": 14995,
      "normalized": "required"
    }
  ]
}