{
  "section_id": "25-1-288",
  "content": "\n(A)\n\nThe owner shall request an inspection of erosion and sedimentation controls and tree\nprotection measures after the owner installs the controls and measures.\n\n(B)\n\nThe single office shall schedule the inspection. The owner, consulting engineer, and\ncontractor shall attend the inspection.\n\n(C)\n\nDuring the inspection, the owner shall:\n\n(1)\n\ndemonstrate that the erosion and sedimentation controls and tree protection measures\ncomply with the Environmental Criteria Manual; and\n\n(2)\n\npresent a plan to the inspector that includes future erosion and sedimentation controls,\ndrainage, and utility and street layout.\n\n(D)\n\nAfter two days notice to the owner, the inspector may modify the approved erosion\ncontrol and construction sequencing if:\n\n(1)\n\nthe inspector determines that the plans are inadequate;\n\n(2)\n\nthe inspector confirms the determination with the single office; and\n\n(3)\n\nthe single office provides written approval of the modification.\n\n(E)\n\nThe inspector may make minor changes to the erosion control and construction sequencing\nplans without written approval from single office if the modification upgrades erosion\ncontrols or reflects construction progress.\n\n(F)\n\nExcept as provided in Subsection (G), the owner may not begin construction until the\nsingle office determines that the erosion and sedimentation controls and tree protection\nmeasures comply with applicable requirements.\n\n(G)\n\nIf the single office does not conduct an inspection on or before the fifth day after\nreceiving a request, the owner may proceed with construction.\n\nSource: City Code Section 25-1-288; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as provided in Subsection (B), the single office may charge a reinspection\nfee if at the time that an inspector attempts to conduct an inspection, the permittee:\n\n(1)\n\nhas not finished the work to be inspected;\n\n(2)\n\nhas not finished corrections previously required by an inspector;\n\n(3)\n\nhas not posted the record inspection card;\n\n(4)\n\ndoes not make approved plans readily available to the inspector; or\n\n(5)\n\ndoes not provide access to the work on the scheduled inspection date.\n\n(B)\n\nWork that was rejected at the first inspection for failure to comply with a technical\ncode may be reinspected without payment of a reinspection fee.\n\n(C)\n\nIf a reinspection fee is due, additional inspections may not be performed until the\nreinspection fee is paid.\n\nSource: City Code Section 25-1-289; Ord. 031211-11; Ord. 031211-42.",
  "entities": [
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 180,
      "end": 186,
      "normalized": "office"
    },
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 871,
      "end": 877,
      "normalized": "office"
    },
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 900,
      "end": 906,
      "normalized": "office"
    },
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 1091,
      "end": 1097,
      "normalized": "office"
    },
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 1277,
      "end": 1283,
      "normalized": "office"
    },
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 1425,
      "end": 1431,
      "normalized": "office"
    },
    {
      "text": "Section 25-1-288",
      "label": "SECTION_REF",
      "start": 1577,
      "end": 1593,
      "normalized": {
        "section": "25-1-288",
        "subsection": null,
        "full_reference": "25-1-288"
      }
    },
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 1682,
      "end": 1688,
      "normalized": "office"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 1897,
      "end": 1905,
      "normalized": "required"
    },
    {
      "text": "Section 25-1-289",
      "label": "SECTION_REF",
      "start": 2412,
      "end": 2428,
      "normalized": {
        "section": "25-1-289",
        "subsection": null,
        "full_reference": "25-1-289"
      }
    }
  ]
}