{
  "section_id": "25-2-article-11",
  "content": "### ARTICLE 11. - HILL COUNTRY ROADWAY REQUIREMENTS.\n\nIn this article:\n\nSCENIC VISTA means a generally recognizable, noteworthy view of:\n\n(1)\n\nBarton Creek;\n\n(2)\n\nBull Creek;\n\n(3)\n\nWest Bull Creek;\n\n(4)\n\nLake Austin;\n\n(5)\n\nLake Travis;\n\n(6)\n\na valley of the Colorado River; or\n\n(7)\n\nthe downtown area of Austin.\n\nSource: Section 13-2-783(b)(1); Ord. 990225-70; Ord. 031211-11.\n\nExcept as provided in Section 25-2-1104 (Exceptions), this article applies to development on a site in a hill country roadway corridor.\n\nSource: Section 13-2-782 ; Ord. 990225-70; Ord. 031211-11.\n\nA hill country roadway corridor is the land within the City's zoning jurisdiction\nlocated 1,000 feet or less from each side of the right-of-way of the following roadways:\n\n(1)\n\nLoop 360, from US 290 West to US 183;\n\n(2)\n\nRM 620, from SH 71 to Anderson Mill Road;\n\n(3)\n\nRM 2222, from Highland Hills Drive to RM 620;\n\n(4)\n\nRM 2244, from Loop 360 to SH 71; and\n\n(5)\n\nSouthwest Parkway.\n\nSource: Section 13-2-1; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis article does not apply to development that occurs 1,000 feet or less from the\ndedicated right-of-way of:\n\n(1)\n\nUS 183; or\n\n(2)\n\nUS 290 West.\n\n(B)\n\nThis article does not apply to development that complies with a site plan approved\nby council before January 27, 1986 or to a modification of the approved site plan\nif a zoning change was approved to allow the modification.\n\n(C)\n\nThis article does not apply to development that complies with a site plan for which\na development permit was issued by the City before January 27, 1986.\n\n(D)\n\nThis article does not apply to development that complies with a site plan that was\nsubmitted for approval before May 23, 1985, or that was recommended for approval by\nthe Planning Commission before November 6, 1985. The development must comply with\nCity requirements in effect on the date the site plan was submitted for approval.\n\n(E)\n\nThis article does not apply to development that complies with a planned development\narea agreement approved by the council before January 26, 1986.\n\nSource: Section 13-2-781(a), (b), (c), (e) and (f); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nSubject to Subsection (B), the Land Use Commission may approve the waiver of a provision\nin this article if the person applying for the waiver demonstrates that:\n\n(1)\n\nthe provision imposes an undue hardship on a development because of the location,\ntopography, or peculiar configuration of the tract; or\n\n(2)\n\na proposed development incorporates the use of highly innovative architectural, site\nplanning, or land use technique; and\n\n(3)\n\nif the waiver is approved, a proposed development will equal or exceed a development\nthat is in compliance with this article in terms of:\n\n(a)\n\nenvironmental protection;\n\n(b)\n\naesthetic enhancement;\n\n(c)\n\nland use compatibility; and\n\n(d)\n\ntraffic considerations.\n\n(B)\n\nThe Land Use Commission may waive a provision only to the extent necessary to allow\nthe development to occur.\n\n(C)\n\nThe approval or disapproval of a waiver by the Land Use Commission under this section\nmay be appealed to the council.\n\nSource: Section 13-2-785; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThis section applies to development that is:\n\n(1)\n\non a site in a hill county roadway corridor; and\n\n(2)\n\nexcepted from the application of this article.\n\n(B)\n\nThe owner of a site may file a request with the director to apply this article to\nthe development.\n\n(C)\n\nIf an owner requests that this article apply to a development, the council may approve\na waiver or a provision of this article.\n\n(D)\n\nThe director shall recommend to the Land Use Commission and council each provision\nof this article that should be:\n\n(1)\n\napplied to the development; or\n\n(2)\n\nwaived by the council.\n\n(E)\n\nThe Land Use Commission shall review a request filed under Subsection (B) and shall\nprepare a recommendation on the request.\n\n(F)\n\nIn making a recommendation under Subsection (D), the director shall take into consideration\neach existing land use approved for the site.\n\n(G)\n\nThe council may approve a waiver of a provision of this article to the minimum extent\nnecessary to allow development to occur, based on the recommendations of the director\nand the Land Use Commission.\n\nSource: Section 13-2-781(g); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nThe Watershed Protection and Development Review Department shall maintain a file on\nthe hill country roadway corridors. The file must contain:\n\n(1)\n\na contour map of each corridor that shows each proposed or approved land use in a\ncorridor;\n\n(2)\n\na copy of each site plan submitted in connection with development in each corridor,\nwhether the site plan was subsequently approved, disapproved, or withdrawn;\n\n(3)\n\na map that shows each scenic vista or overlook in each corridor that the Watershed\nProtection and Development Review Department has identified; and\n\n(4)\n\na map that shows each segment of a hill country roadway along which scenic vistas\nare prevalent.\n\nSource: Sections 13-2-783(b)(1) and 13-2-784; Ord. 990225-70; Ord. 010329-18; Ord.\n031211-11.\n\n(A)\n\nProperty is in a high intensity zone, if the property:\n\n(1)\n\nis along Loop 360 and within 3,500 feet of the intersection of Loop 360 with US 290;\nor\n\n(2)\n\nis within 1,000 feet of the right-of-way of two intersecting highways that are maintained\nby the state; and\n\n(a)\n\nhas frontage on:\n\n(i)\n\nboth highways; or\n\n(ii)\n\none highway and an intersecting arterial or collector street.\n\n(B)\n\nProperty is in a moderate intensity zone, if the property:\n\n(1)\n\nis not in a high intensity zone; and\n\n(2)\n\nhas frontage on:\n\n(a)\n\nLoop 360, north of RM 2222 and south of RM 2244;\n\n(b)\n\nthe segment of Loop 360 that is 1,200 feet or less from Westlake Drive;\n\n(c)\n\nthe segment of RM 2222 that extends east from RM 620 for 2.1 miles;\n\n(d)\n\nthe segment of RM 620 that extends from Comanche Trail to Anderson Mill Road;\n\n(e)\n\nthe segment of RM 620 that extends from Lohman's Crossing to Steward Road; or\n\n(f)\n\na segment of a roadway that would otherwise place the property in a low intensity\nzone, if access to the property is solely from an arterial or collector street that\nis not a hill country roadway.\n\n(C)\n\nProperty is in a moderate intensity zone, if the property is not in a high intensity\nzone, has frontage on a hill country roadway and on an intersecting arterial or collector\nstreet, and is located 500 feet or less from the right-of-way boundary of the arterial\nor collector street. This subsection does not apply to an intersection on RM 2222\neast of Loop 360.\n\n(D)\n\nProperty is in a low intensity zone if the property is not in a high intensity zone\nor a moderate intensity zone.\n\nSource: Section 13-2-782(1); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), the floor-to-area ratio of a nonresidential\nbuilding may not exceed:\n\n(1)\n\nin a low intensity zone:\n\n(a)\n\n0.20 for a building on property with a slope gradient of 15 percent or less;\n\n(b)\n\n0.08 for a building on property with a slope gradient of more than 15 percent, but\nnot more than 25 percent; or\n\n(c)\n\n0.04 for a building on property with a slope gradient of more than 25 percent, but\nnot more than 35 percent;\n\n(2)\n\nin a moderate intensity zone:\n\n(a)\n\n0.25 for a building on property with a slope gradient of 15 percent or less;\n\n(b)\n\n0.10 for a building on property with a slope gradient of more than 15 percent, but\nnot more than 25 percent; or\n\n(c)\n\n0.05 for a building on property with a slope gradient of more than 25 percent, but\nnot more than 35 percent; or\n\n(3)\n\nin a high intensity zone:\n\n(a)\n\n0.30 for a building on property with a slope gradient of 15 percent or less;\n\n(b)\n\n0.12 for a building on property with a slope gradient of more than 15 percent, but\nnot more than 25 percent; or\n\n(c)\n\n0.06 for a building on property with a slope gradient of more than 25 percent, but\nnot more than 35 percent.\n\n(B)\n\nIf the Land Use Commission grants a development bonus under Section 25-2-1128 (Development Bonuses), the floor-to-area ratio of a building on a slope that has a gradient of not more\nthan 15 percent may not exceed:\n\n(1)\n\n0.25 if the property is a low intensity zone;\n\n(2)\n\n0.30 if the property is in a moderate intensity zone; or\n\n(3)\n\n0.35 if the property is in a high intensity zone.\n\n(C)\n\nIf a portion of developed property or property covered by an approved site plan is\ncondemned for right-of-way and if the development complies with other applicable requirements,\nthe gross square footage permitted before the condemnation is the gross square footage\npermitted for the portion of the property remaining after the condemnation.\n\n(D)\n\nTo calculate allowable floor area under this section, gross site area includes all\nland dedicated for right-of-way under Section 25-6-55 (Dedication Of Right-Of-Way) that is more than 60 feet from the centerline of a hill country roadway.\n\n(E)\n\nThis section does not apply to property in the Southwest Parkway hill country roadway\ncorridor.\n\nSource: Section 13-2-782(2); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nDevelopment of property in a hill country roadway corridor must comply with Chapter 25-8, Subchapter A, Article 7, Division 3 (Construction On Slopes) and this section. If a conflict exists between this section and another section\nof this title, the more restrictive provision applies.\n\n(B)\n\nA person who constructs a structure uphill of a slope with a gradient of 15 percent\nor more:\n\n(1)\n\nmust use a pier and beam technique to construct the structure; and\n\n(2)\n\nmay not extend a vertical wall below the lowest finished floor elevation of the structure,\nexcept as necessary to screen mechanical equipment.\n\n(C)\n\nA person who constructs a structure downhill of a slope with a gradient of 15 percent\nor more may not exceed a depth of eight feet for structural excavation.\n\n(D)\n\nTo restore a cut or fill for a roadway, driveway, or structure, a person may construct\na terraced wall and fill with a finished gradient of 100 percent. The wall may not\nexceed a height of four feet. More than one level of terracing may be constructed.\n\n(E)\n\nIf a person does not use terracing to restore a cut or fill, the person must revegetate\nand restore the cut or fill to a slope have a finished gradient of 33 percent.\n\n(F)\n\nA cut or fill restored under Subsection (E) may not exceed eight feet in length. If\nadditional restoration is required, a terrace that complies with Subsection (D) must\nbe constructed between each eight-foot slope segment.\n\n(G)\n\nA person must place fill to blend with the natural contour of the slope.\n\nSource: Section 13-2-782; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (C) or Section 25-2-1128 (Development Bonuses), a person may not construct a building that is more than 28 feet in height, if the\nbuilding is:\n\n(1)\n\n200 feet or less from the nearest right-of-way boundary of a hill country roadway;\nor\n\n(2)\n\nin a low intensity zone.\n\n(B)\n\nIf a building is more than 200 feet from the nearest right-of-way boundary of a hill\ncountry roadway, a person may construct a building that is not more than:\n\n(1)\n\n40 feet in height in a moderate intensity zone; or\n\n(2)\n\n53 feet in a high intensity zone.\n\n(C)\n\nThe height of a building in the Southwest Parkway roadway corridor may not exceed\nthe lesser of:\n\n(1)\n\nthe height permitted by the zoning or the site plan approved for the property; or\n\n(2)\n\n60 feet.\n\nSource: Section 13-2-782(4); Ord. 990225-70; Ord. 031211-11.\n\nEach on-site utility must be located underground, unless otherwise required by the\nutility provider.\n\nSource: Section 13-2-782(5); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nEach building shall be designed to use, to the greatest extent feasible, building\nmaterials that are compatible with the environment of the hill country, including\nrock, stone, brick, and wood.\n\n(B)\n\nA person may not construct a building that has mirrored glass with a reflectance of\nmore than 20 percent.\n\nSource: Section 13-2-782(6); Ord. 990225-70; Ord. 031211-11.\n\nTo calculate impervious cover under this article, gross site area includes all land\ndedicated for right-of-way under Section 25-6-55 (Dedication Of Right-Of-Way) that is more than 60 feet from the centerline of a hill country roadway.\n\nSource: Section 13-2-782(2); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe Land Use Commission shall grant a development bonus to a proposed development\nif the Land Use Commission determines that:\n\n(1)\n\nan unusual circumstance exists, as defined in Subsection (C); and\n\n(2)\n\nthe proposed development as constructed will comply with at least 50 percent of the\ncriteria identified in Section 25-2-1129 (Criteria For Approval Of A Development Bonus).\n\n(B)\n\nA development bonus approved by the Land Use Commission for a proposed development\nmay:\n\n(1)\n\nfor property on a slope with a gradient of 15 percent or less, increase the floor-to-area\nratio up to .05 to 1;\n\n(2)\n\nincrease building height up to:\n\n(a)\n\n40 feet in a low intensity zone;\n\n(b)\n\n53 feet in a moderate intensity zone; or\n\n(c)\n\n63 feet in a high intensity zone; or\n\n(3)\n\nreduce a required setback by 25 feet or less.\n\n(C)\n\nIn Subsection (A), an unusual circumstance must involve:\n\n(1)\n\nan undue hardship caused by this article, or by the cumulative effects of this title,\nbecause of the configuration, topography, or location of the tract;\n\n(2)\n\nthe demonstration of an innovative architectural, site planning, or land use design\nthat:\n\n(a)\n\nhas not been used in the Austin area before; and\n\n(b)\n\nwill serve as an excellent example for a subsequent development; or\n\n(3)\n\na condemnation for right-of-way, if a bonus allows the property owner to recapture\nsquare footage potential that was lost because of that condemnation.\n\n(D)\n\nNotwithstanding Subsection (A)(2), if an unusual circumstance exists, the Land Use\nCommission may approve a development bonus if the proposed development does not comply\nwith at least 50 percent of the criteria in Section 25-2-1129 (Criteria For Approval Of A Development Bonus).\n\nSource: Sections 13-2-783(a) and (c); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nIn determining whether to approve a development bonus for a proposed development,\nthe Land Use Commission may consider criteria that reasonably relate to the development\nbonus, including if the proposed development:\n\n(1)\n\npreserves a scenic vista and provides a place where the public can view the scenic\nvista;\n\n(2)\n\nlimits access to a roadway that is not a hill country roadway if use of the roadway\ndoes not increase traffic in a residential area;\n\n(3)\n\nreduces by at least 15 percent the amount of impervious cover otherwise required for\nthe development;\n\n(4)\n\nincreases landscaping or a setback by more than 50 percent above the amount required\nfor the development or increases a natural area;\n\n(5)\n\nis a mixed-use development, particularly a mixed-use development that includes a residential\nuse and community facility;\n\n(6)\n\nreduces building mass by breaking up buildings;\n\n(7)\n\nuses pervious pavers although the development is not entitled to receive an impervious\ncover credit;\n\n(8)\n\nconsolidates small lots to create a parcel that has at least 300 feet of frontage\non a hill country roadway;\n\n(9)\n\nuses pitched roof design features;\n\n(10)\n\nincludes the construction or dedication of a public facility that is not required\nby a City ordinance, including a park, roadway and right-of-way, Police Department\nsite, Fire Department site, emergency medical services facility site, or a regional\ndrainage facility;\n\n(11)\n\nlimits the construction of a building or parking area to an area with a slope that\nhas a gradient of not more than 15 percent; or\n\n(12)\n\nuses an energy-conserving or a water-conserving device that reduces energy or water\nconsumption below City requirements.\n\nSource: Section 13-2-783(b); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n",
  "entities": [
    {
      "text": "ARTICLE 11",
      "label": "SECTION_REF",
      "start": 4,
      "end": 14,
      "normalized": {
        "type": "article",
        "number": 11,
        "full_reference": "Article 11"
      }
    },
    {
      "text": "Lake Austin",
      "label": "ZONE",
      "start": 204,
      "end": 215,
      "normalized": {
        "code": "LA",
        "name": "lake austin",
        "original": "Lake Austin"
      }
    },
    {
      "text": "Section 25-2-1104",
      "label": "SECTION_REF",
      "start": 400,
      "end": 417,
      "normalized": {
        "section": "25-2-1104",
        "subsection": null,
        "full_reference": "25-2-1104"
      }
    },
    {
      "text": "Section 13-2-782",
      "label": "SECTION_REF",
      "start": 523,
      "end": 539,
      "normalized": {
        "section": "13-2-782",
        "subsection": null,
        "full_reference": "13-2-782"
      }
    },
    {
      "text": "1,000 feet",
      "label": "MEASUREMENT",
      "start": 665,
      "end": 675,
      "normalized": {
        "value": 1000,
        "unit": "ft",
        "original": "1,000 feet"
      }
    },
    {
      "text": "Section 13-2-1",
      "label": "SECTION_REF",
      "start": 967,
      "end": 981,
      "normalized": {
        "section": "13-2-1",
        "subsection": null,
        "full_reference": "13-2-1"
      }
    },
    {
      "text": "1,000 feet",
      "label": "MEASUREMENT",
      "start": 1076,
      "end": 1086,
      "normalized": {
        "value": 1000,
        "unit": "ft",
        "original": "1,000 feet"
      }
    },
    {
      "text": "Section 13-2-785",
      "label": "SECTION_REF",
      "start": 3089,
      "end": 3105,
      "normalized": {
        "section": "13-2-785",
        "subsection": null,
        "full_reference": "13-2-785"
      }
    },
    {
      "text": "minimum",
      "label": "OPERATOR",
      "start": 4091,
      "end": 4098,
      "normalized": "min"
    },
    {
      "text": "3,500 feet",
      "label": "MEASUREMENT",
      "start": 5154,
      "end": 5164,
      "normalized": {
        "value": 3500,
        "unit": "ft",
        "original": "3,500 feet"
      }
    },
    {
      "text": "1,000 feet",
      "label": "MEASUREMENT",
      "start": 5229,
      "end": 5239,
      "normalized": {
        "value": 1000,
        "unit": "ft",
        "original": "1,000 feet"
      }
    },
    {
      "text": "1,200 feet",
      "label": "MEASUREMENT",
      "start": 5667,
      "end": 5677,
      "normalized": {
        "value": 1200,
        "unit": "ft",
        "original": "1,200 feet"
      }
    },
    {
      "text": "500 feet",
      "label": "MEASUREMENT",
      "start": 6356,
      "end": 6364,
      "normalized": {
        "value": 500,
        "unit": "ft",
        "original": "500 feet"
      }
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 6803,
      "end": 6813,
      "normalized": "lte"
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 6909,
      "end": 6919,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 6992,
      "end": 7001,
      "normalized": "gt"
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 7002,
      "end": 7012,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 7018,
      "end": 7031,
      "normalized": "lte"
    },
    {
      "text": "25 percent",
      "label": "MEASUREMENT",
      "start": 7032,
      "end": 7042,
      "normalized": {
        "value": 25.0,
        "unit": "%",
        "original": "25 percent"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 7110,
      "end": 7119,
      "normalized": "gt"
    },
    {
      "text": "25 percent",
      "label": "MEASUREMENT",
      "start": 7120,
      "end": 7130,
      "normalized": {
        "value": 25.0,
        "unit": "%",
        "original": "25 percent"
      }
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 7136,
      "end": 7149,
      "normalized": "lte"
    },
    {
      "text": "35 percent",
      "label": "MEASUREMENT",
      "start": 7150,
      "end": 7160,
      "normalized": {
        "value": 35.0,
        "unit": "%",
        "original": "35 percent"
      }
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 7261,
      "end": 7271,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 7344,
      "end": 7353,
      "normalized": "gt"
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 7354,
      "end": 7364,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 7370,
      "end": 7383,
      "normalized": "lte"
    },
    {
      "text": "25 percent",
      "label": "MEASUREMENT",
      "start": 7384,
      "end": 7394,
      "normalized": {
        "value": 25.0,
        "unit": "%",
        "original": "25 percent"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 7462,
      "end": 7471,
      "normalized": "gt"
    },
    {
      "text": "25 percent",
      "label": "MEASUREMENT",
      "start": 7472,
      "end": 7482,
      "normalized": {
        "value": 25.0,
        "unit": "%",
        "original": "25 percent"
      }
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 7488,
      "end": 7501,
      "normalized": "lte"
    },
    {
      "text": "35 percent",
      "label": "MEASUREMENT",
      "start": 7502,
      "end": 7512,
      "normalized": {
        "value": 35.0,
        "unit": "%",
        "original": "35 percent"
      }
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 7612,
      "end": 7622,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 7695,
      "end": 7704,
      "normalized": "gt"
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 7705,
      "end": 7715,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 7721,
      "end": 7734,
      "normalized": "lte"
    },
    {
      "text": "25 percent",
      "label": "MEASUREMENT",
      "start": 7735,
      "end": 7745,
      "normalized": {
        "value": 25.0,
        "unit": "%",
        "original": "25 percent"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 7813,
      "end": 7822,
      "normalized": "gt"
    },
    {
      "text": "25 percent",
      "label": "MEASUREMENT",
      "start": 7823,
      "end": 7833,
      "normalized": {
        "value": 25.0,
        "unit": "%",
        "original": "25 percent"
      }
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 7839,
      "end": 7852,
      "normalized": "lte"
    },
    {
      "text": "35 percent",
      "label": "MEASUREMENT",
      "start": 7853,
      "end": 7863,
      "normalized": {
        "value": 35.0,
        "unit": "%",
        "original": "35 percent"
      }
    },
    {
      "text": "Section 25-2-1128",
      "label": "SECTION_REF",
      "start": 7931,
      "end": 7948,
      "normalized": {
        "section": "25-2-1128",
        "subsection": null,
        "full_reference": "25-2-1128"
      }
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 8058,
      "end": 8068,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 8073,
      "end": 8083,
      "normalized": "lte"
    },
    {
      "text": "permitted",
      "label": "OPERATOR",
      "start": 8465,
      "end": 8474,
      "normalized": "permitted"
    },
    {
      "text": "permitted",
      "label": "OPERATOR",
      "start": 8527,
      "end": 8536,
      "normalized": "permitted"
    },
    {
      "text": "site area",
      "label": "METRIC",
      "start": 8669,
      "end": 8678,
      "normalized": "site_area_min"
    },
    {
      "text": "Section 25-6-55",
      "label": "SECTION_REF",
      "start": 8730,
      "end": 8745,
      "normalized": {
        "section": "25-6-55",
        "subsection": null,
        "full_reference": "25-6-55"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 8783,
      "end": 8792,
      "normalized": "gt"
    },
    {
      "text": "60 feet",
      "label": "MEASUREMENT",
      "start": 8793,
      "end": 8800,
      "normalized": {
        "value": 60,
        "unit": "ft",
        "original": "60 feet"
      }
    },
    {
      "text": "Chapter 25-8",
      "label": "SECTION_REF",
      "start": 9109,
      "end": 9121,
      "normalized": {
        "type": "chapter",
        "number": "25-8",
        "full_reference": "Chapter 25-8"
      }
    },
    {
      "text": "Subchapter A",
      "label": "SECTION_REF",
      "start": 9123,
      "end": 9135,
      "normalized": {
        "type": "subchapter",
        "letter": "A",
        "full_reference": "Subchapter A"
      }
    },
    {
      "text": "Article 7",
      "label": "SECTION_REF",
      "start": 9137,
      "end": 9146,
      "normalized": {
        "type": "article",
        "number": 7,
        "full_reference": "Article 7"
      }
    },
    {
      "text": "Division 3",
      "label": "SECTION_REF",
      "start": 9148,
      "end": 9158,
      "normalized": {
        "type": "division",
        "number": 3,
        "full_reference": "Division 3"
      }
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 9398,
      "end": 9408,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 9721,
      "end": 9731,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 9744,
      "end": 9754,
      "normalized": "lte"
    },
    {
      "text": "eight feet",
      "label": "MEASUREMENT",
      "start": 9766,
      "end": 9776,
      "normalized": {
        "value": "eight feet",
        "unit": null,
        "original": "eight feet"
      }
    },
    {
      "text": "100 percent",
      "label": "MEASUREMENT",
      "start": 9950,
      "end": 9961,
      "normalized": {
        "value": 100.0,
        "unit": "%",
        "original": "100 percent"
      }
    },
    {
      "text": "height",
      "label": "METRIC",
      "start": 9989,
      "end": 9995,
      "normalized": "height_max"
    },
    {
      "text": "four feet",
      "label": "MEASUREMENT",
      "start": 9999,
      "end": 10008,
      "normalized": {
        "value": "four feet",
        "unit": null,
        "original": "four feet"
      }
    },
    {
      "text": "More than",
      "label": "OPERATOR",
      "start": 10010,
      "end": 10019,
      "normalized": "gt"
    },
    {
      "text": "33 percent",
      "label": "MEASUREMENT",
      "start": 10224,
      "end": 10234,
      "normalized": {
        "value": 33.0,
        "unit": "%",
        "original": "33 percent"
      }
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 10290,
      "end": 10300,
      "normalized": "lte"
    },
    {
      "text": "eight feet",
      "label": "MEASUREMENT",
      "start": 10301,
      "end": 10311,
      "normalized": {
        "value": "eight feet",
        "unit": null,
        "original": "eight feet"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 10352,
      "end": 10360,
      "normalized": "required"
    },
    {
      "text": "Section 13-2-782",
      "label": "SECTION_REF",
      "start": 10553,
      "end": 10569,
      "normalized": {
        "section": "13-2-782",
        "subsection": null,
        "full_reference": "13-2-782"
      }
    },
    {
      "text": "Section 25-2-1128",
      "label": "SECTION_REF",
      "start": 10649,
      "end": 10666,
      "normalized": {
        "section": "25-2-1128",
        "subsection": null,
        "full_reference": "25-2-1128"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 10736,
      "end": 10745,
      "normalized": "gt"
    },
    {
      "text": "28 feet",
      "label": "MEASUREMENT",
      "start": 10746,
      "end": 10753,
      "normalized": {
        "value": 28,
        "unit": "ft",
        "original": "28 feet"
      }
    },
    {
      "text": "height",
      "label": "METRIC",
      "start": 10757,
      "end": 10763,
      "normalized": "height_max"
    },
    {
      "text": "200 feet",
      "label": "MEASUREMENT",
      "start": 10791,
      "end": 10799,
      "normalized": {
        "value": 200,
        "unit": "ft",
        "original": "200 feet"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 10931,
      "end": 10940,
      "normalized": "gt"
    },
    {
      "text": "200 feet",
      "label": "MEASUREMENT",
      "start": 10941,
      "end": 10949,
      "normalized": {
        "value": 200,
        "unit": "ft",
        "original": "200 feet"
      }
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 11058,
      "end": 11071,
      "normalized": "lte"
    },
    {
      "text": "40 feet",
      "label": "MEASUREMENT",
      "start": 11079,
      "end": 11086,
      "normalized": {
        "value": 40,
        "unit": "ft",
        "original": "40 feet"
      }
    },
    {
      "text": "height",
      "label": "METRIC",
      "start": 11090,
      "end": 11096,
      "normalized": "height_max"
    },
    {
      "text": "53 feet",
      "label": "MEASUREMENT",
      "start": 11136,
      "end": 11143,
      "normalized": {
        "value": 53,
        "unit": "ft",
        "original": "53 feet"
      }
    },
    {
      "text": "height",
      "label": "METRIC",
      "start": 11180,
      "end": 11186,
      "normalized": "height_max"
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 11247,
      "end": 11257,
      "normalized": "lte"
    },
    {
      "text": "height",
      "label": "METRIC",
      "start": 11283,
      "end": 11289,
      "normalized": "height_max"
    },
    {
      "text": "permitted",
      "label": "OPERATOR",
      "start": 11290,
      "end": 11299,
      "normalized": "permitted"
    },
    {
      "text": "60 feet",
      "label": "MEASUREMENT",
      "start": 11367,
      "end": 11374,
      "normalized": {
        "value": 60,
        "unit": "ft",
        "original": "60 feet"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 11506,
      "end": 11514,
      "normalized": "required"
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 11892,
      "end": 11901,
      "normalized": "gt"
    },
    {
      "text": "20 percent",
      "label": "MEASUREMENT",
      "start": 11902,
      "end": 11912,
      "normalized": {
        "value": 20.0,
        "unit": "%",
        "original": "20 percent"
      }
    },
    {
      "text": "impervious cover",
      "label": "METRIC",
      "start": 11990,
      "end": 12006,
      "normalized": "impervious_cover_max"
    },
    {
      "text": "site area",
      "label": "METRIC",
      "start": 12033,
      "end": 12042,
      "normalized": "site_area_min"
    },
    {
      "text": "Section 25-6-55",
      "label": "SECTION_REF",
      "start": 12094,
      "end": 12109,
      "normalized": {
        "section": "25-6-55",
        "subsection": null,
        "full_reference": "25-6-55"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 12147,
      "end": 12156,
      "normalized": "gt"
    },
    {
      "text": "60 feet",
      "label": "MEASUREMENT",
      "start": 12157,
      "end": 12164,
      "normalized": {
        "value": 60,
        "unit": "ft",
        "original": "60 feet"
      }
    },
    {
      "text": "at least",
      "label": "OPERATOR",
      "start": 12541,
      "end": 12549,
      "normalized": "gte"
    },
    {
      "text": "50 percent",
      "label": "MEASUREMENT",
      "start": 12550,
      "end": 12560,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50 percent"
      }
    },
    {
      "text": "Section 25-2-1129",
      "label": "SECTION_REF",
      "start": 12591,
      "end": 12608,
      "normalized": {
        "section": "25-2-1129",
        "subsection": null,
        "full_reference": "25-2-1129"
      }
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 12800,
      "end": 12810,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "up to",
      "label": "OPERATOR",
      "start": 12853,
      "end": 12858,
      "normalized": "lte"
    },
    {
      "text": "building height",
      "label": "METRIC",
      "start": 12884,
      "end": 12899,
      "normalized": "height_max"
    },
    {
      "text": "up to",
      "label": "OPERATOR",
      "start": 12900,
      "end": 12905,
      "normalized": "lte"
    },
    {
      "text": "40 feet",
      "label": "MEASUREMENT",
      "start": 12913,
      "end": 12920,
      "normalized": {
        "value": 40,
        "unit": "ft",
        "original": "40 feet"
      }
    },
    {
      "text": "53 feet",
      "label": "MEASUREMENT",
      "start": 12952,
      "end": 12959,
      "normalized": {
        "value": 53,
        "unit": "ft",
        "original": "53 feet"
      }
    },
    {
      "text": "63 feet",
      "label": "MEASUREMENT",
      "start": 12999,
      "end": 13006,
      "normalized": {
        "value": 63,
        "unit": "ft",
        "original": "63 feet"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 13051,
      "end": 13059,
      "normalized": "required"
    },
    {
      "text": "setback",
      "label": "METRIC",
      "start": 13060,
      "end": 13067,
      "normalized": "setback_min"
    },
    {
      "text": "25 feet",
      "label": "MEASUREMENT",
      "start": 13071,
      "end": 13078,
      "normalized": {
        "value": 25,
        "unit": "ft",
        "original": "25 feet"
      }
    },
    {
      "text": "at least",
      "label": "OPERATOR",
      "start": 13875,
      "end": 13883,
      "normalized": "gte"
    },
    {
      "text": "50 percent",
      "label": "MEASUREMENT",
      "start": 13884,
      "end": 13894,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50 percent"
      }
    },
    {
      "text": "Section 25-2-1129",
      "label": "SECTION_REF",
      "start": 13914,
      "end": 13931,
      "normalized": {
        "section": "25-2-1129",
        "subsection": null,
        "full_reference": "25-2-1129"
      }
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 14500,
      "end": 14511,
      "normalized": "residential"
    },
    {
      "text": "at least",
      "label": "OPERATOR",
      "start": 14535,
      "end": 14543,
      "normalized": "gte"
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 14544,
      "end": 14554,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    },
    {
      "text": "impervious cover",
      "label": "METRIC",
      "start": 14569,
      "end": 14585,
      "normalized": "impervious_cover_max"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 14596,
      "end": 14604,
      "normalized": "required"
    },
    {
      "text": "landscaping",
      "label": "METRIC",
      "start": 14642,
      "end": 14653,
      "normalized": "landscaping_min"
    },
    {
      "text": "setback",
      "label": "METRIC",
      "start": 14659,
      "end": 14666,
      "normalized": "setback_min"
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 14670,
      "end": 14679,
      "normalized": "gt"
    },
    {
      "text": "50 percent",
      "label": "MEASUREMENT",
      "start": 14680,
      "end": 14690,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50 percent"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 14708,
      "end": 14716,
      "normalized": "required"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 14853,
      "end": 14864,
      "normalized": "residential"
    },
    {
      "text": "at least",
      "label": "OPERATOR",
      "start": 15112,
      "end": 15120,
      "normalized": "gte"
    },
    {
      "text": "300 feet",
      "label": "MEASUREMENT",
      "start": 15121,
      "end": 15129,
      "normalized": {
        "value": 300,
        "unit": "ft",
        "original": "300 feet"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 15290,
      "end": 15298,
      "normalized": "required"
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 15593,
      "end": 15606,
      "normalized": "lte"
    },
    {
      "text": "15 percent",
      "label": "MEASUREMENT",
      "start": 15607,
      "end": 15617,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15 percent"
      }
    }
  ]
}