{
  "section_id": "chapter-25-9",
  "content": "## CHAPTER 25-9. - WATER AND WASTEWATER.\n\nThis article applies in the planning jurisdiction of the City unless stated otherwise\nin this article.\n\nSource: Section 13-3-1; Ord. 990225-70; Ord. 031211-11.\n\nThe service area of the Austin Water Utility is coterminous with the water and wastewater\nimpact fee service area established by the council under Chapter 25-9, Article 3 (Water And Wastewater Capital Recovery Fees), including each amendment\nor revision of the area.\n\nSource: Section 13-3-5; Ord. 990225-70; Ord. 031211-11; Ord. 20090820-061.\n\nThe City may not provide water or wastewater service outside the service area of the\nAustin Water Utility unless the council by ordinance waives the prohibition.\n\nSource: Section 13-3-5(b); Ord. 990225-70; Ord. 000309-39; Ord. 031211-11; Ord. 20090820-061.\n\nIn accordance with Sections 26.173 and 26.177 of the Texas Water Code, the Health\nAuthority:\n\n(1)\n\nmay inventory, monitor, and periodically inspect and test the discharge from a wastewater\ntreatment plant; and\n\n(2)\n\nshall impose on the owner of a plant an annual fee for inspecting and sampling the\ndischarge.\n\nSource: Section 13-3-2(b) and (c); Ord. 990225-70; Ord. 031211-11.\n\nThis subpart does not apply to a service extension that is constructed as part of\na project serving a property for which the Director determines that the water or wastewater\nsystem that will serve the property can provide suitable and sufficient service in\naccordance with the Utilities Criteria Manual, and:\n\n(1)\n\nthe nearest point on the property's boundary is 100 feet or less from an accessible\nwater or wastewater system; or\n\n(2)\n\nthe Director determines that a suitable service connection can be made in compliance\nwith the Utilities Criteria Manual to a water or wastewater main on the opposite side\nof an undivided city or county roadway.\n\nSource: Section 13-3-9(a); Ord. 990225-70; Ord. 031211-11; Ord. 20090820-061; Ord.\n20130321-065.\n\nIn this division:\n\n(1)\n\nCONSTRUCTION, with reference to a facility, means only the actual physical construction\nof the facility. The term does not include the engineering and project management\nfor a facility.\n\n(2)\n\nCOST PARTICIPATION means a calculated percentage, as set forth in Section 25-9-62 (Amount of Cost Participation), of hard costs, plus up to 15% of the calculated percentage\nof hard costs to reimburse soft costs. The City would pay the sum of these amounts\nto the entity executing the agreement identified in Section 25-9-67 (Agreement).\n\n(3)\n\nDECENTRALIZED WASTEWATER SYSTEM means a wastewater system other than one that is connected\nto a City wastewater treatment plant, and includes an on-site wastewater disposal\nsystem, a cluster wastewater system, or a small wastewater treatment plant.\n\n(4)\n\nDIRECTOR means the director, or his designee, of the City's Austin Water department\nor successor department.\n\n(5)\n\nFACILITY means an apparatus or improvement that is used in conjunction with a water\nor wastewater main that provides water or wastewater service to a property, regardless\nof where the facility is located. The term includes a lift station, force main, wastewater\ntreatment plant, pump station, reservoir, Pressure Reducing Valve station, a decentralized\nwastewater system component, alternative wastewater system, or an addition to an existing\nfacility that increases the capability of the existing facility to provide water or\nwastewater service.\n\n(6)\n\nHARD COSTS means the actual cost of construction and materials determined after completion\nand final acceptance of a project.\n\n(7)\n\nOVERSIZE, with reference to a water or wastewater main or facility, means an increase\nin the size or capacity of the main or facility above the minimum size or capacity\nrequired by the Utilities Criteria Manual, including fire flow requirements, that\nis necessary to provide utility service to meet the projected demands of the property\nto be served.\n\n(8)\n\nSERVICE EXTENSION means a water or wastewater main or facility that provides new or\nadditional water or wastewater service to a property.\n\n(9)\n\nSOFT COSTS means the cost of preliminary engineering reports, surveying, geotechnical\nstudies, design, and project management of the construction and installation of a\nmain or facility. This term does not include costs such as financing, interest, fiscal\nsecurity, permitting, accounting, insurance, governmental fees (including inspection\nfees), legal services, easements, and all other soft costs associated with the construction\nof a main or facility.\n\n(10)\n\nSUITABLE AND SUFFICIENT SERVICE means the ability of the existing water and wastewater\nsystem at the property to appropriately serve the property and meet the size and capacity\ncriteria as defined in the Utilities Criteria Manual.\n\n(11)\n\nWATER means potable water or reclaimed water as defined by Section 210.3(24) of Title\n30 of the Texas Administrative Code.\n\n(12)\n\nWATER OR WASTEWATER MAIN means an appurtenance to a water distribution or wastewater\ncollection system. The term includes all components and equipment necessary to make\nthe water distribution or wastewater collection system operable in compliance with\nthe design criteria and standards in the Utilities Criteria Manual, or the equivalent\ndesign criteria and standards as determined by the Director.\n\n(13)\n\nWATER OR WASTEWATER SERVICE LINE means the branch of pipe extending from the water\nor wastewater main to the approximate location of the property or easement boundary\nintended to provide direct retail service to a property.\n\n(14)\n\nWASTEWATER INTERCEPTOR means a wastewater main generally considered to be 18-inches\nin diameter or larger and to which direct connections for retail service to a property\nare not allowed, unless an exception is approved by the Director.\n\n(15)\n\nWATER TRANSMISSION MAIN means a potable water main generally considered to be 24-inches\nin diameter or larger and to which direct connections for retail service to a property\nare not allowed, unless an exception is approved by the Director.\n\nSource: Section 13-3-9(b); Ord. 990225-70; Ord. 000406-87; Ord. 031211-11; Ord. 20090820-061;\nOrd. 20130321-065; Ord. No. 20240307-037, Pt. 6, 3-18-24.\n\n(A)\n\nA service extension request application is required to:\n\n(1)\n\nconnect a property to a City utility system if an accessible water or wastewater main\nis more than 100 feet from the property's boundary;\n\n(2)\n\nconnect a property to a water transmission or wastewater interceptor within 100 feet\nof the property's boundary, unless an exception is approved by the Director;\n\n(3)\n\nprovide utility service to a property if an existing main or facility is unsuitable\nor insufficient to provide service to the property;\n\n(4)\n\nprovide service from a decentralized wastewater system to a property where the Director\nrecommends the City operate and maintain that decentralized wastewater system.\n\n(B)\n\nA person must submit an application for a service extension to the Director. The Director\nmay not accept an application if the application is not complete and the applicant\nhas not paid the required non-refundable fee.\n\n(C)\n\nAn application for approval of a service extension must:\n\n(1)\n\ninclude a general description of the location, size, and capacity of the service extension;\n\n(2)\n\nbe accompanied by a request for annexation of the property by the City if the land\nis not covered by the City's certificate of convenience and necessity; and\n\n(3)\n\ninclude other information as required by the Director.\n\n(D)\n\nIf either water or wastewater service is to be provided by an entity other than the\nCity, the applicant may be required to submit evidence of a commitment from the other\nentity to provide the appropriate level of service required for the proposed land\nuse. The evidence must be in the form of:\n\n(1)\n\na contract with the entity;\n\n(2)\n\na letter from the entity; or\n\n(3)\n\nthe minutes of the relevant meeting of the governing body of the entity.\n\n(E)\n\nExcept as provided by Section 25-9-3 (Service Outside Service Area Prohibited), the Director may not accept an application for a service extension if the property\nto be served by the service extension is not in the service area of Austin Water.\n\nSource: Sections 13-3-9(b), 13-3-10(a), (b), and (d), and 13-3-11(a), (d), and (e);\nOrd. 990225-70; Ord. 000406-87; Ord. 031211-11; Ord. 20050929-077; Ord. 20090820-061;\nOrd. 20130321-065.\n\n(A)\n\nAdministrative Review. An administrative review will be conducted to determine the\ncompleteness of a service extension applications. Within a time period established\nby state law, notification will be sent to an applicant indicating whether an application\nis administratively complete or if additional information is required.\n\n(B)\n\nTechnical Review. After an application is determined to be administratively complete,\na technical review will be conducted. Technical review may include, but is not limited\nto, a determination of the service requirements for the subject property, the system\ncapacity, cost participation, and type of improvements necessary to provide service\nto the property. Additional information may be required from the applicant for completion\nof technical review.\n\nDuring technical review a professional engineer employed by Austin Water shall determine\nthe size of a water or wastewater main or the capacity of a facility that is roughly\nproportionate to the size or capacity that is required to serve the proposed development\nin accordance with Section 212.904 of the Texas Local Government Code (Apportionment of Municipal Infrastructure Costs).\n\n(C)\n\nNotification of Approval. Upon completion of the technical review, and subject to\nthe approval requirements of Section 25-9-35 (Approval of Service Extension Request), notification of approval of the service extension request will be sent to the applicant.\n\n(D)\n\nDeficient or Inactive Applications. Unless approved by the Director, a service extension\napplication is deemed rejected on the first anniversary of the date the Director provides\ninitial written notice to the applicant stating that:\n\n(1)\n\nthe application is administratively incomplete or is technically deficient; or\n\n(2)\n\ndue to the applicant's inactivity, the Director has placed the application on inactive\nstatus.\n\nSource: 20090820-061; Ord. 20130321-065.\n\n(A)\n\nExcept as provided in Subsection (B), city council approval of a service extension\nrequest or amendment of an unexpired, approved service extension request is required.\n\n(B)\n\nThe Director may approve an application for a service extension request or amendment\nof an unexpired service extension request if:\n\n(1)\n\nthe Director determines that sufficient capacity exists or will be available to meet\nthe projected demands of the property to be served; and\n\n(2)\n\nthe property is located:\n\n(a)\n\nin the desired development zone; or\n\n(b)\n\nin the drinking water protection zone and within the full purpose corporate limits.\n\nSource: Section 13-3-10(c) and (d); Ord. 990225-70; Ord. 000406-87; Ord. 031211-11;\nOrd. 20090820-061; Ord. 20130321-065.\n\n(A)\n\nAn applicant for a service extension request shall perform an environment assessment\nif required by the Director.\n\n(B)\n\nAn applicant is responsible for the cost of the environmental assessment.\n\nSource: Section 13-3-11(c); Ord. 990225-70; Ord. 000406-87; Ord. 031211-11; Ord. 20090820-061;\nOrd. 20130321-065.\n\n(A)\n\nAfter a request for a service extension has been approved, an applicant must submit\nthe construction plans for needed improvements and a copy of the approved service\nextension request to the Director for review and approval of the size, capacity, routing,\nand location of the improvements.\n\n(B)\n\nThe Director may approve the size, capacity, routing, and location of an improvement\nonly if it complies with the Utilities Criteria Manual, or equivalent standards as\ndetermined by the Director, and with each applicable City requirement.\n\nSource: Section 13-3-11(b); Ord. 990225-70; Ord. 000406-87; Ord. 031211-11; Ord. 20090820-061;\nOrd. 20130321-065.\n\nAn applicant for a service extension request shall provide information determined\nby the Director to be necessary to demonstrate that construction of the service extension\ncomplies with the requirements of the City.\n\nSource: Section 13-3-11(c); Ord. 990225-70; Ord. 031211-11; Ord. 20090820-061; Ord.\n20130321-065.\n\n(A)\n\nThis subsection applies to a service extension request approved before April 17, 2000.\n\n(1)\n\nUnless extended under this subsection or Subsection (D), the approval of a service\nextension request remains in effect until the latest of:\n\n(a)\n\nthe date on which the preliminary plan expires for the property to be served by the\nservice extension;\n\n(b)\n\nthe second anniversary of the date on which the service extension request was approved\nif, on or before that date:\n\n(i)\n\na preliminary plan for the property to be served has not been approved; and\n\n(ii)\n\nconstruction of the service extension has not begun; or\n\n(c)\n\nthe third anniversary of the date on which the service extension request was approved,\nif:\n\n(i)\n\non or before that date a preliminary plan for the property to be served has not been\napproved; and\n\n(ii)\n\nconstruction of the service extension began before the second anniversary of the date\non which the service extension request was approved but, on or before the third anniversary\nof that date, construction of the service extension has not been completed and accepted\nfor operation and maintenance by the City.\n\n(2)\n\nIf construction of a service extension begins while the approval is in effect under\nParagraph (1), the Director may extend the approval of a service extension request\nfor the period of time estimated to be necessary to complete construction of the service\nextension.\n\n(B)\n\nThis subsection applies to a service extension request approved after April 17, 2000,\nand on or before March 31, 2013.\n\n(1)\n\nExcept as set forth in Paragraph(2) of this subsection, an approved service extension\nrequest expires on the latest of:\n\n(a)\n\n120 days after the date of its approval;\n\n(b)\n\nfor a project with a pending development application, the date the application expires;\nor\n\n(c)\n\nfor a project with an approved development application, the date the approval expires.\n\n(2)\n\nFor a project with a recorded plat, the service extension request does not expire.\n\n(3)\n\nIf a project's intensity, proposed land uses, or anticipated water or wastewater demands\nchange, any such change must be reported to the Director and there must be an application\nfor the amended service extension request unless the Director determines the change\nis not so substantial as to require an amendment.\n\n(C)\n\nThis subsection applies to a service extension request approved on or after April\n1, 2013.\n\n(1)\n\nExcept as set forth in Paragraph (2) of this subsection, an approved service extension\nrequest expires on the latest of:\n\n(a)\n\n180 days after the date of its approval;\n\n(b)\n\nfor a project with a pending development application, the date the application expires;\nor\n\n(c)\n\nfor a project with an approved development application, the date the approval expires.\n\n(2)\n\nFor a project with a recorded plat, the service extension request does not expire\nfor the portion of the property that was platted.\n\n(3)\n\nIf a project's intensity, proposed land uses, lot configuration, or anticipated water\nor wastewater demands change, any such change must be reported to the Director and\nthere must be an application for the amended service extension request unless the\nDirector determines the change is not so substantial as to require an amendment.\n\n(D)\n\nUnder this section, if the approval of a service extension request requires cost participation\nfrom the City under a cost participation contract approved by the council:\n\n(1)\n\nconstruction of the service extension begins on the date that fiscal security is posted\nor money is deposited in compliance with the contract; and\n\n(2)\n\nthe service extension request approval is extended until construction of the service\nextension is complete and the City accepts the mains and facilities constructed under\nthe contract.\n\nSource: Section 13-3-12(b), (d), and (e); Ord. 990225-70; Ord. 000406-87; Ord. 031211-11;\nOrd. 20090820-061; Ord. 20130321-065.\n\nA service commitment may not be transferred from one property to another.\n\nSource: Ord. 000406-87; Ord. 031211-11; Ord. 20130321-065.\n\nDevelopment of a project for which a service extension request is approved must comply\nwith the terms of the approved service extension request and all City requirements\npertaining to water conservation.\n\nSource: Ord. 000406-87; Ord. 031211-11; Ord. 20090820-061.\n\n(A)\n\nAn entity that agrees to construct a water or wastewater main or a facility that on\nacceptance will become part of the City water and wastewater system may apply to the\nCity for cost participation in a water or wastewater main or a facility if the main\nor facility is oversized at the request of the City to serve additional property.\nCost participation is not permitted for a wastewater main or facility that provides\nservice within the drinking water protection zone.\n\n(B)\n\nUnder this Section cost participation will apply:\n\n(1)\n\nif the improvement is a water main and has a diameter of more than 8 inches;\n\n(2)\n\nif the improvement is a wastewater main and has a diameter of more than 8 inches;\nor\n\n(3)\n\nif the improvement is a pump station, reservoir, lift station, force main or wastewater\ntreatment plant.\n\nSource: Section 13-3-15(b), (c), and Table 2; Ord. 990225-70; Ord. 000309-39; Ord.\n000406-87; Ord. 031211-11; Ord. 20090820-061; Ord. 20130321-065.\n\nTables 1 and 2 below set forth the percentage of cost participation in the hard costs\nof an oversized water or wastewater main. The percentage of cost participation is\nbased on the increased percentage in pipe diameter due to oversizing established under\nSection 25-9-64 (Request for Cost Participation). Cost participation is determined by multiplying\nthe percentage set forth in Table 1 and Table 2 by the hard costs of an oversized\nline.\n\n(A)\n\nThe following table sets forth the amount of cost participation for the hard costs\nassociated with an oversized water main:\n\nTable 1: Amount of Cost Participation (Water)\n\n| Minimum Required Pipe Diameter for the Property (inches) | Percentage of Cost Participation Based on Oversized Pipe Diameter | | | | | | | |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| 8 | 12 | 16 | 24 | 30 | 36 | 42 | 48 |\n| 8 | 0% | 33% | 50% | 66% | 73% | 78% | 81% | 83% |\n| 12 | --- | 0% | 25% | 50% | 60% | 66% | 71% | 75% |\n| 16 | --- | - | 0% | 33% | 47% | 56% | 62% | 66% |\n| 24 | --- | - | --- | 0% | 20% | 33% | 43% | 50% |\n| 30 | --- | - | --- | - | 0% | 17% | 29% | 37% |\n| 36 | --- | - | --- | - | --- | 0% | 14% | 25% |\n| 42 | --- | - | --- | - | --- | - | 0% | 12% |\n| 48 | --- | - | --- | - | --- | - | --- | 0% |\n\n(B)\n\nThe following table sets forth the amount of cost participation for the hard costs\nassociated with an oversized wastewater main:\n\nTable 2: Amount of Cost Participation (Wastewater)\n\n| Minimum Required Pipe Diameter for the Property (inches) | Percentage of Cost Participation Based on Oversized Pipe Diameter | | | | | | | | | |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| 8 | 12 | 15 | 18 | 21 | 24 | 30 | 36 | 42 | 48 |\n| 8 | 0% | 33% | 47% | 56% | 62% | 66% | 73% | 78% | 81% | 83% |\n| 12 | --- | 0% | 20% | 33% | 43% | 50% | 60% | 66% | 71% | 75% |\n| 15 | --- | - | 0% | 17% | 29% | 37% | 50% | 58% | 64% | 69% |\n| 18 | --- | - | --- | 0% | 14% | 25% | 40% | 50% | 57% | 62% |\n| 21 | --- | - | --- | - | 0% | 12% | 30% | 42% | 50% | 56% |\n| 24 | --- | - | --- | - | --- | 0% | 20% | 33% | 43% | 50% |\n| 30 | --- | - | --- | - | --- | - | 0% | 17% | 29% | 37% |\n| 36 | --- | - | --- | - | --- | - | --- | 0% | 14% | 25% |\n| 42 | --- | - | --- | - | --- | - | --- | - | 0% | 12% |\n| 48 | --- | - | --- | - | --- | - | --- | - | --- | 0% |\n\n(C)\n\nThe amount of cost participation for hard costs for pump stations, reservoirs, wastewater\ntreatment plants, lift stations, force mains and other facilities will be calculated\non the percentage of oversizing of the treatment capacity or pumping capacity.\n\n(D)\n\nThe amount of cost participation for soft costs may not exceed 15% of the hard costs\ncalculated under subsections (A), (B) and (C) of this section.\n\n(E)\n\nNotwithstanding the above, under no circumstance shall cost participation under this\nsection exceed the amount authorized by council, unless council provides authorization\nfor additional cost participation.\n\nSource: Section 13-3-15(d); Ord. 990225-70; Ord. 031211-11; Ord. 20090820-061; Ord.\n20130321-065.\n\nDuring the technical review of the application, a determination by the City will be\nmade on whether oversizing of water or wastewater mains or facilities serving additional\nproperty in the area will be necessary. If oversizing of any water or wastewater mains\nor facilities is necessary, the applicant will be required to submit a written request\nfor City cost participation to the Director prior to approval of a service extension\nrequest.\n\nSource: Section 13-3-17(a); Ord. 990225-70; Ord. 031211-11; Ord. 20090820-061; Ord.\n20130321-065.\n\n(A)\n\nThe Director shall review each request for cost participation.\n\n(B)\n\nThe Director may recommend approval of a request for cost participation only if the\nDirector determines that:\n\n(1)\n\nthe property to be served is in the service area of Austin Water;\n\n(2)\n\nthe size of each proposed main or facility complies with the planning criteria of\nAustin Water and final design and routing will comply with the Utilities Criteria\nManual;\n\n(3)\n\nfunds for cost participation are available from an identified source or that funds\nwill be available to meet the proposed payment schedule; and\n\n(4)\n\nthe proposed main or facility is an appropriate extension or addition to the water\nand wastewater utility system.\n\n(C)\n\nDuring the technical review the Director, in consideration of a construction cost\nestimate provided by the applicant's engineer, will establish the terms of the cost\nparticipation. The Director will provide a recommended not-to-exceed amount for cost\nparticipation, which amount will be an estimate based on the percentages for cost\nparticipation in Section 25-9-62 (Amount of Cost Participation).\n\n(D)\n\nThe Water and Wastewater Commission shall make a recommendation on the request for\ncost participation.\n\n(E)\n\nThe Director shall forward the request and the Water and Wastewater Commission recommendation\nto the council for final action.\n\nSource: Section 13-3-17; Ord. 990225-70; Ord. 000406-87; Ord. 031211-11; Ord. 20090820-061;\nOrd. 20130321-065.\n\n(A)\n\nAn entity constructing a water or wastewater main or a facility that is eligible for\ncost participation may not receive a cost participation payment for the main or facility\nunless the entity complies with each requirement or regulation of the City, including\nbut not limited to requirements relating to:\n\n(1)\n\nthe public advertising of the main or facility;\n\n(2)\n\nthe bidding on the main or facility;\n\n(3)\n\na performance or payment bond for the main or facility;\n\n(4)\n\nposting of fiscal security as set forth in the developer agreement required by Section 25-9-67 (Agreement);\n\n(5)\n\ncompletion and acceptance; and\n\n(6)\n\na warranty on the main or facility.\n\n(B)\n\nThe entity constructing the main or facility is not entitled to receive a cost participation\npayment until the entity submits documentation showing the entity's compliance with\neach requirement described by Subsection (A).\n\nSource: Section 13-3-15(e); Ord. 990225-70; Ord. 031211-11; Ord. 20090820-061; Ord.\n20130321-065.\n\n(A)\n\nDesired Development Zone. For cost participation relating to an improvement associated\nwith a service extension request in the desired development zone, the City shall pay\nits portion of the cost 90 days after the date the City accepts the improvement.\n\n(B)\n\nDrinking Water Protection Zone. For cost participation relating to a water improvement\nassociated with a water service extension request to a tract in the drinking water\nprotection zone, the City shall pay its portion of the cost in four equal annual installments,\nwithout interest, with the first payment to be made on March 1 of the second year\nafter the year in which the City accepts the improvement.\n\nSource: Ord. 000406-87; Ord. 031211-11; Ord. 20090820-061; Ord. 20130321-065.\n\n(A)\n\nAn applicant for cost participation must enter into an agreement with the City before\nthe City may make a cost participation payment.\n\n(B)\n\nThe Director shall determine the terms of the agreement.\n\nSource: Ord. 000406-87; Ord. 031211-11; Ord. 20090820-061; Ord. 20130321-065.\n\nA person may not connect a property to the City's water or wastewater utility system\nunless the person holds a tap permit issued by the director of the Water and Wastewater\nUtility approving the connection.\n\nSource: Section 13-3-6(A); Ord. 990225-70; Ord. 031211-11.\n\nThe director of the Water and Wastewater Utility may not issue a tap permit for property\nthat is located outside the City's water and wastewater utility service area unless\nthe council by ordinance waives the prohibition.\n\nSource: Section 13-3-6(E); Ord. 990225-70; Ord. 000309-39; Ord. 031211-11.\n\n(A)\n\nAn applicant for a tap permit must apply to the Water and Wastewater Utility on a\nform approved by the director of the Water and Wastewater Utility.\n\n(B)\n\nAn application for a tap permit must include:\n\n(1)\n\nthe name, title, address and telephone number of the applicant;\n\n(2)\n\na description of the property for which the tap permit is to be issued;\n\n(3)\n\ndocumentation demonstrating that the property that is the subject of the tap permit\napplication is:\n\n(a)\n\na legal lot under state law and local subdivision requirements; and\n\n(b)\n\nlocated in:\n\n(i)\n\nthe City's water and wastewater impact fee service area; or\n\n(ii)\n\nan area covered by an agreement for the wholesale sale of water between the City and\nanother utility service provider that authorizes the City to issue tap permits under\nthe agreement;\n\n(4)\n\nif applicable, documentation that the applicant's service extension has been approved;\nand\n\n(5)\n\nother information that the director of the Water and Wastewater Utility determines\nis necessary to process the application.\n\n(C)\n\nAn application for a tap permit must be accompanied by the payment of:\n\n(1)\n\nthe tap permit fee, connection fee, and capital recovery fee set by the council under\nseparate ordinance; and\n\n(2)\n\nother fees required to be paid at the time the director of the Water and Wastewater\nUtility issues the permit.\n\n(D)\n\nThe director of the Water and Wastewater Utility may not approve an application for\na tap permit if existing facilities do not have actual capacity to serve the new connection.\n\nSource: Sections 13-3-6(B), (C), and (D), and 13-3A-8(i); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nOn approval of an application for a tap permit, the director of the Water and Wastewater\nUtility shall issue a written tap permit to the applicant.\n\n(B)\n\nIf the director of the Water and Wastewater Utility denies a tap permit, the director\nof the Water and Wastewater Utility must be notify the applicant of the denial in\nwriting, stating the grounds for the denial.\n\nSource: Section 13-3-6(F); Ord. 990225-70; Ord. 031211-11.\n\nA water or wastewater tap permit issued under this division is issued for a specific\nproperty or service address. The permit may not be transferred to another property\nor service address.\n\nSource: Section 13-3-6(G); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe director of the Water and Wastewater Utility may delay an applicant's connection\nof an exchange or septic tank cutover if the system does not have sufficient capacity\nfor the connection.\n\n(B)\n\nIf a connection is delayed under Subsection (A), the director of the Water and Wastewater\nUtility shall extend the time for connection until there is sufficient capacity.\n\nSource: Section 13-3A-10(k); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Section 25-9-96 (Connection Delay) and Subsection (B), a tap permit expires on the second anniversary\nof the date on which the permit is issued unless:\n\n(1)\n\nthe connection authorized by the permit is made before the second anniversary date;\nor\n\n(2)\n\non the second anniversary date the permit holder has a plumbing permit for the property\nor service address for which the tap permit is issued.\n\n(B)\n\nThe director of the Water and Wastewater Utility may extend a tap permit if, before\nthe second anniversary of the date the permit was issued, the permit holder submits\na written application for the extension that demonstrates that good cause exists for\nthe extension.\n\n(C)\n\nThe director of the Water and Wastewater Utility may not extend a tap permit for more\nthan 90 days beyond the second anniversary of the date the permit is issued.\n\n(D)\n\nUnder Subsection (B), \"good cause\" means circumstances of financial hardship or a\ndanger to human health or safety.\n\nSource: Section 13-3-6(I); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe director of the Water and Wastewater Utility may refund a tap permit fee.\n\n(B)\n\nTo obtain a refund of a tap permit fee, a permit holder, before the expiration date\nof the permit, must:\n\n(1)\n\nsubmit an application for the refund to the director of the Water and Wastewater Utility\nstating the grounds for the refund;\n\n(2)\n\ntender the tap permit at the time the refund application is submitted;\n\n(3)\n\nsubmit documentation of the amount of the tap permit fee and the payment of the fee;\n\n(4)\n\nsubmit other information the director of Water and Wastewater Utility considers necessary\nto process the application; and\n\n(5)\n\ntender a canceled building permit if a building permit was issued.\n\nSource: Section 13-3-6(J); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this section, city-supported community garden and garden permit have the meanings\nassigned by Section 14-7-1 (Definitions).\n\n(B)\n\nA tap permit issued for a city-supported community garden is a temporary permit. A\ntap permit issued for a city-supported community garden remains valid only while the\ngarden permit is valid.\n\n(C)\n\nIf the garden permit terminates and the parcel of land is no longer exempt under Section 25-4-3 (Temporary Exemption From Platting Requirements), the Water and Wastewater Utility\nshall remove the tap from the city-supported community garden.\n\n(D)\n\nIf the garden permit terminates and the parcel of land is a legal lot, the Water and\nWastewater Utility shall remove the tap from the city-supported community garden unless:\n\n(1)\n\nthe owner or the user of the legal lot submits an application for a tap; and\n\n(2)\n\nthe director of the Water and Wastewater Utility approves a tap permit.\n\n(E)\n\nAn applicant under Subsection (D) must pay the fees for each tap for which an application\nis submitted, including any impact fee.\n\nSource: Section 13-3-6(L); Ord. 990225-70; Ord. 031211-11; Ord. 20110210-018.\n\nThis article applies to:\n\n(1)\n\nthe creation of a water district in the planning jurisdiction of the City;\n\n(2)\n\nthe request by an existing water district to annex or include territory in a water\ndistrict;\n\n(3)\n\nan amendment to a water district consent document or an agreement with a water district;\nand\n\n(4)\n\na water district bond issuance.\n\nSource: Sections 13-1-320, 13-4-1 and 13-4-7; Ord. 990225-70; Ord. 031211-11.\n\nIn this article:\n\n(1)\n\nLAND USE PLAN means a map showing proposed and existing land uses in a water district.\n\n(2)\n\nMUNICIPAL UTILITY DISTRICT means a water district created and operating under the\nauthority of:\n\n(a)\n\nSection 59, Article XVI, Texas Constitution; and\n\n(b)\n\nChapters 49, 50 and 54, Texas Water Code.\n\n(3)\n\nPETITION means the written request to the city for consent to the creation of or annexation\nto a water district required by the Texas Water Code and any document required by\nCity rules.\n\n(4)\n\nWATER DISTRICT means a district or authority, including a municipal utility district\nand a water control and improvement district, that is created under:\n\n(a)\n\nSection 52, Article III, Texas Constitution, or Section 59, Article XVI, Texas Constitution;\nand\n\n(b)\n\nTitle 4, Texas Water Code.\n\nSource: Sections 13-1-321 and 13-4-2; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA water district may not contain less than 100 acres of territory.\n\n(B)\n\nA water district must contain an amount of territory sufficient to assure the economic\nviability of the water district.\n\n(C)\n\nAn applicant seeking consent to the creation of a water district or to include territory\nin an existing water district must submit information to demonstrate the economic\nviability of the proposed or existing water district.\n\nSource: Section 13-4-3(a) and (c); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA water district may be created inside the municipal limits of the City only if:\n\n(1)\n\nthe written consent of the City is obtained;\n\n(2)\n\ncreation of the water district complies with this article.\n\n(B)\n\nTerritory located inside the full purpose municipal boundary of the City may be included\nin a proposed water district only if:\n\n(1)\n\nthe territory is 1,000 feet or less from a major thoroughfare; and\n\n(2)\n\nthe area of the territory does not exceed five percent of the total amount of territory\nin the proposed water district.\n\nSource: Sections 13-4-3(b) and 13-4-10; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe City shall review a petition filed with the City for the City's consent to:\n\n(1)\n\nthe creation of a water district; or\n\n(2)\n\nthe annexation of territory to a water district.\n\n(B)\n\nThe review by the City of the petition must comply with this division.\n\nSource: Sections 13-1-325 and 13-1-331; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA person who intends to file a petition for the creation of a water district may discuss\nthe proposed water district in a preapplication review with City employees before\nthe petition is filed.\n\n(B)\n\nTo request a preapplication review, a person must notify the city manager of the person's\nintent to file a petition in writing at least 30 days before the date the person files\nthe petition with the City.\n\nSource: Section 13-1-326; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord. 031211-11;\nOrd. 20060504-039.\n\n(A)\n\nA petition for the creation of a water district must be filed with the city manager.\n\n(B)\n\nThe city manager shall give notice under Section 25-1-133(A) (Notice Of Applications And Administrative Decisions) of a petition filed under\nthis section.\n\nSource: Section 13-1-327; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord. 031211-11;\nOrd. 20060504-039.\n\nOn the filing of a request for the consent of the City to the creation of a municipal\nutility district, the city manager shall designate the proposed district as a city\nservice district or a non-city service district.\n\nSource: Section 13-4-4; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nEmployees of the appropriate City departments shall:\n\n(1)\n\nreview the petition; and\n\n(2)\n\nprepare a report on the petition.\n\n(B)\n\nA report prepared under Subsection (A) may include appropriate recommendations.\n\n(C)\n\nThe city manager shall send a copy of each report prepared under Subsection (A) to:\n\n(1)\n\nthe city clerk;\n\n(2)\n\nthe person who filed the petition;\n\n(3)\n\neach department that participated in the review; and\n\n(4)\n\neach member of the:\n\n(a)\n\nWater and Wastewater Commission;\n\n(b)\n\nPlanning Commission;\n\n(c)\n\nEnvironmental Board;\n\n(d)\n\nParks and Recreation Board; and\n\n(e)\n\nUrban Transportation Commission.\n\nSource: Section 13-1-327; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord. 031211-11;\nOrd. 20060504-039.\n\nEach board and commission identified in Section 25-9-155(C)(5) (Review Of Petition By City Employees) shall review the petition and prepare\na recommendation on the petition.\n\nSource: Section 13-1-328; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe city manager shall:\n\n(1)\n\ncompile the City department reports and board and commission recommendations into\none volume; and\n\n(2)\n\nsend a copy of the compilation to:\n\n(a)\n\neach member of the council;\n\n(b)\n\nthe city clerk;\n\n(c)\n\nthe city attorney;\n\n(d)\n\neach department that reviewed the petition; and\n\n(e)\n\nthe person who filed the petition.\n\n(B)\n\nThe copy of the compilation sent to the city clerk is available for public inspection.\n\nSource: Section 13-1-328; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord. 031211-11;\nOrd. 20060504-039.\n\n(A)\n\nThe council shall set and hold a public hearing on the petition before the expiration\nof the period established by state law.\n\n(B)\n\nA public hearing required by Subsection (A) must be held during a regularly scheduled\ncouncil meeting.\n\nSource: Section 13-1-329(a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAfter the conclusion of the public hearing required by Section 25-9-158 (Public Hearing Before City Council) and before the expiration of the period state\nlaw establishes for review of the petition, the council by resolution may:\n\n(1)\n\ndeny consent to the creation of the water district; or\n\n(2)\n\ngrant initial consent to creation of the water district, specifying each condition\nnecessary for final consent.\n\n(B)\n\nIf the council grants initial consent to the creation of a water district, the council\nshall instruct the city attorney to prepare the documents required for final consent\nby the council, including a consent ordinance and required agreements.\n\n(C)\n\nThe city attorney shall:\n\n(1)\n\ndraft the required documents; and\n\n(2)\n\nbefore the time the council is scheduled to grant final consent, send a copy of the\ndocuments to the:\n\n(a)\n\nCouncil;\n\n(b)\n\ncity clerk; and\n\n(c)\n\nperson who filed the petition.\n\nSource: Section 13-1-329(b) and (c); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nBefore the 15th day after the date the council grants final consent to the creation\nof a water district, the person who filed the petition for creation shall provide\nto the city manager 26 copies of the land use plan approved by the council.\n\n(B)\n\nEach copy of the approved land use plan must state on its face the date that the council\napproved the land use plan. One copy of the approved land use plan must be on mylar\nand capable of being reproduced.\n\nSource: Section 13-1-330; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord. 031211-11;\nOrd. 20060504-039.\n\nThe council shall act on a petition for consent to the annexation of territory by\na water district before the 91st day after the date the petition is filed, except\nas may be otherwise required by state law.\n\nSource: Section 13-1-331; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf the council does not grant consent to the creation of or annexation of territory\nto a water district, the person who filed the creation or annexation petition may\nrequest the City to provide the water or wastewater service that the water district\nproposed to provide.\n\n(B)\n\nA request under Subsection (A) must be filed with the city manager.\n\n(C)\n\nThe City and the person filing the request shall enter into a negotiation to agree\nto terms of a contract under which the City shall provide the requested water or wastewater\nservice.\n\n(D)\n\nA contract negotiated under Subsection (C) must be reviewed by the Water and Wastewater\nCommission and the Planning Commission. Each commission shall make a recommendation\non the proposed contract to the council.\n\n(E)\n\nThe council shall act on the proposed contract before the 121st day after the date\nthe request for City service is filed.\n\nSource: Section 13-1-332; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord. 031211-11;\nOrd. 20060504-039.\n\nThe Land Use Commission may not approve a preliminary plan or final plat of subdivision\nin a water district that does not comply with a resolution or ordinance adopted in\nconnection with the consent by the City to the creation of the water district or an\nagreement entered into in connection with the consent of the City to the creation\nof the water district.\n\nSource: Section 13-4-5(c)(4); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nTo the extent of conflict between this division and another regulation of the Code,\nthe other Code regulation prevails.\n\n(B)\n\nThis article does not exempt any development located in the territory of a water district\nor undertaken on behalf of a water district from any applicable provision of this\nCode.\n\nSource: Section 13-4-11; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe council may impose a condition or restriction on a water district in connection\nwith the consent of the City to the creation of a water district in accordance with\nthis division and applicable state law.\n\n(B)\n\nA condition or restriction imposed in connection with the consent of the City to the\ncreation of a water district must be included in a resolution, agreement, or ordinance\nthat pertains to the water district.\n\nSource: Section 13-4-5(a) and (b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to each water district.\n\n(B)\n\nThe plans and specifications for a facility to be financed or constructed by or on\nbehalf of a water district must be approved by the City before construction begins.\nFees may be charged for the review and approval of the plans and specifications. The\nfacility must be constructed in accordance with the approved plans and specifications.\n\n(C)\n\nThe City may inspect the construction of a facility financed or constructed by or\non behalf of a water district as determined necessary by the City to ensure compliance\nwith the approved plans and specifications and any applicable requirement. The City\nmay charge a fee for an inspection.\n\n(D)\n\nA water district shall prepare and file with the city manager:\n\n(1)\n\na certified copy of each annual audit of the water district; and\n\n(2)\n\nan annual report describing the status of construction by or on behalf of the water\ndistrict.\n\n(E)\n\nA water district may not provide any service outside the boundary of the water district\nwithout the approval of the City.\n\n(F)\n\nA water district may not annex territory to or exclude territory from the water district\nwithout the approval of council.\n\n(G)\n\nAll territory and each easement for a water district facility must be dedicated to\nthe public, the water district, and each successor of the water district.\n\nSource: Section 13-4-5(c)(1) to (3) and (5) to (7); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to a city service water district.\n\n(B)\n\nIf a water district receives or will receive water or wastewater service from the\nCity, the water district shall adopt and enforce as a water district rule Chapter\n6-4 (Water Conservation Regulations), Chapter 15-10 (Wastewater Regulations), and\nChapter 25-12, Article 6 (Plumbing Code).\n\n(C)\n\nA city service district may not support or encourage:\n\n(1)\n\nan attempt to incorporate a municipality in the district; or\n\n(2)\n\nan attempt by a municipality other than the City to annex territory in the district.\n\n(D)\n\nA wastewater treatment plant constructed by or on behalf of a city service water district\nmust irrigate plant effluent, if the plant would otherwise discharge:\n\n(1)\n\nover the Edwards Aquifer recharge zone; or\n\n(2)\n\nin the Barton Creek watershed.\n\n(E)\n\nA city service water district shall concurrently submit to the city manager a certified\ncopy of each document the water district submits to the Texas Natural Resource Conservation\nCommission or another agency of the state.\n\nSource: Section 13-4-5(d); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe following provisions must be included in a water district consent agreement.\n\n(1)\n\nA water district must pledge the revenue and ad valorem taxes of the water district\nto the payment of the principal of and interest on all bonds issued by the district.\n\n(2)\n\nA bond may be issued by a water district only for a purpose authorized by state law.\n\n(3)\n\nA bond issued by a water district for one purpose may not be used for another purpose.\n\n(4)\n\nThe City, to insure the economic vitality of a water district and to the extent authorized\nby the laws of this state, may limit the amount of bonds the water district may issue.\n\n(5)\n\nTo insure compliance by a water district with each applicable condition or restriction\nimposed in connection with the consent of the City to the creation of the water district,\nthe council is entitled to approve the issuance or sale of a water district bond before\nthe water district issues a bid invitation for the bond. If the water district is\nnot in compliance with each applicable condition:\n\n(a)\n\nthe council may not approve the issuance or sale of the bond; and\n\n(b)\n\nthe water district may not issue or sell the bond.\n\n(6)\n\nEach bond issued by a water district must include a call provision that permits the\nwater district to redeem the bond at par.\n\n(7)\n\nA water district may not spend the proceeds of a bond or incur any indebtedness for\nthe purpose of providing service to territory outside the boundary of the water district\nwithout the approval of the Council.\n\n(8)\n\nThe net effective interest rate of a bond issued by a water district may not exceed\n102 percent of the highest average interest rate reported by the Daily Bond Buyer\nin its weekly \"20 Bond Index\" during the one month period preceding the date that\nnotice of sale is given.\n\n(B)\n\nIn consenting to the creation of a water district, the City may impose an additional\ncondition or restriction on the terms, provisions, or sale of a bond or note of the\nwater district. A condition or restriction imposed under this subsection may not cause\nthe bond or note to be unmarketable.\n\nSource: Section 13-4-6; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe consent of the City to the creation of a municipal utility district shall be conditioned\non a contract between the City and the municipal utility district. The contract must:\n\n(1)\n\ninclude adequate detail as required by the laws of this state; and\n\n(2)\n\nprovide that at the time the City annexes the territory of the municipal utility district,\nwater and wastewater rates established for property in the municipal utility district\nshall be sufficient to fully compensate the City for assuming the indebtedness of\nthe municipal utility district after the municipal utility district is dissolved.\n\n(B)\n\nA water or wastewater rate established under a contract required by Subsection (A)\nshall be based on the water or wastewater rate established for other customers in\nthe boundary of the City and shall include a component based on the monthly debt retirement\npayment assumed by the City. A water or wastewater rate may be recalculated as provided\nin the contract.\n\n(C)\n\nA water or wastewater rate established under a contract required by Subsection (A)\nmust remain in effect until:\n\n(1)\n\nthe bonded indebtedness of the water district is fully retired; and\n\n(2)\n\nthe City is fully compensated, regardless of whether a bond of the water district\nis called.\n\n(D)\n\nThe written consent of the City to the creation of a municipal utility district shall\nspecify the date by which at least 90 percent of the water, wastewater, drainage,\nand road improvements for which bonds of the municipal utility district are issued\nmust be installed or completed.\n\nSource: Section 13-4-8; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe consent of the City to the creation of a water district may include a provision\nrelating to the timing and conditions of annexation by the City, for full or limited\npurposes, of the territory in the water district.\n\n(B)\n\nThe consent of the City to the creation of a municipal utility district may provide\nthat the City and the municipal utility district shall enter into an allocation agreement\nrelating to annexation by the City of the territory in the municipal utility district.\nAn allocation agreement entered into under this subsection:\n\n(1)\n\nmust be in compliance with the applicable law of this state; and\n\n(2)\n\nmay include a term or condition that is determined by the City to be necessary.\n\n(C)\n\nOn annexation of the territory in a water district, the City may:\n\n(1)\n\npermit the water district to continue to exist in accordance with the laws of the\nstate;\n\n(2)\n\ndissolve the water district in accordance with the laws of the state; or\n\n(3)\n\npermit the water district to continue to exist in accordance with an allocation agreement\nentered into in compliance with the laws of the state.\n\nSource: Section 13-4-9; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis division does not apply to an application requesting that a water district provide\nwater or wastewater utility service to a site outside of the boundaries of the water\ndistrict if the site proposed to be served by the water district:\n\n(1)\n\nis located in the service area of the Water and Wastewater Utility;\n\n(2)\n\nis separated geographically from City water or wastewater facilities by the water\ndistrict; and\n\n(3)\n\ncan be served by a facility:\n\n(a)\n\nfinanced by contract bonds; and\n\n(b)\n\nlocated in or immediately adjacent to the water district.\n\n(B)\n\nA person requesting service described in Subsection (A) must apply under Article 1,\nDivision 2 (Extension of Service).\n\nSource: Section 13-1-360(b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAn application requesting that a water district provide water or wastewater utility\nservice to a site outside of the boundary of the water district must be filed with\nthe city manager by the person receiving the service.\n\n(B)\n\nAn application filed under this division includes each document required by City rules.\n\nSource: Sections 13-1-360(a) and 13-1-362; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50;\nOrd. 031211-11; Ord. 20060504-039.\n\nOn receipt of an application filed under this division, the city manager shall notify\nthe:\n\n(1)\n\nCouncil;\n\n(2)\n\nCity clerk; and\n\n(3)\n\npresiding officer of the Planning Commission.\n\nSource: Section 13-1-362; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord. 031211-11;\nOrd. 20060504-039.\n\n(A)\n\nThis section does not apply to an application filed under this division that meets\nthe criteria established in Section 25-9-225(A) (Administrative Approval Of Out-Of-District Service Application).\n\n(B)\n\nThe city manager shall submit an application filed under this division to each of\nthe following boards and commissions determined by the city manager to have an interest\nin the application:\n\n(1)\n\nParks and Recreation Board;\n\n(2)\n\nUrban Transportation Commission;\n\n(3)\n\nWater and Wastewater Commission; or\n\n(4)\n\nEnvironmental Board.\n\n(C)\n\nThe city manager shall submit an application filed under this division to the Planning\nCommission.\n\n(D)\n\nEach department, board, or commission that reviews an application filed under this\ndivision shall send its recommendation on the application to the council not later\nthan the 60th day after the date the application is filed with the city manager.\n\n(E)\n\nThe council shall act on an application filed under this division not later than the\ndate of the second regular Thursday meeting of the council that is to be held after\nthe date that the council receives the final recommendations required by Subsection\n(D).\n\nSource: Section 13-1-362; Ord. 990225-70; Ord. 000309-39; Ord. 010329-18; Ord. 010607-50;\nOrd. 031211-11; Ord. 20060504-039.\n\n(A)\n\nThe director of the Transportation, Planning, and Sustainability Department may approve\nan application filed under this division if:\n\n(1)\n\nthe site that is to receive the proposed water or wastewater service is not:\n\n(a)\n\nin or proposed to be brought into the service area of the Water and Wastewater Utility;\n\n(b)\n\nin an area:\n\n(i)\n\nthat could be served by a facility for which the issuance of a water or wastewater\nbond by the City or water district has been authorized; or\n\n(ii)\n\nin which the City or a water district has called an election on the issuance of a\nwater or wastewater bond; or\n\n(c)\n\nin a water district or the certificated service area of a private utility approved\nby the Texas Natural Resources Conservation Commission unless the water district or\nprivate utility has released the site; and\n\n(2)\n\nthe water district proposing to provide the water or wastewater service is not connected\nor proposed to be connected to:\n\n(a)\n\nthe water or wastewater system of the City; or\n\n(b)\n\na water or wastewater facility to which the City has made a capital contribution.\n\n(B)\n\nAn applicant requesting administrative approval of an application filed under this\ndivision must submit:\n\n(1)\n\ndocumentation demonstrating that the proposed water or wastewater service complies\nwith Subsection (A); and\n\n(2)\n\n10 copies of each document required by City rules to accompany the application.\n\n(C)\n\nThe director of the Transportation, Planning, and Sustainability Department must approve\nor deny an application filed under this division before the 15th day after the date\nthe application is filed.\n\nSource: Section 13-1-364; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord. 031211-11;\nOrd. 20060504-039.\n\n(A)\n\nTo prevent or alleviate a danger to the public health and safety, the city manager\nmay approve a request that a water district provide water or wastewater utility service\nto a site outside of the boundary of the water district.\n\n(B)\n\nThe council shall review a request made under Subsection (A) during the first regular\nThursday meeting of the council that is held after the city manager approves the request.\n\nSource: Section 13-1-365; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAn application to amend a consent document or an agreement between a water district\nand the City must be filed with the city manager by a party to the document or agreement\nor a successor in interest to that party.\n\n(B)\n\nAn application filed under this section includes each document required by City rules.\n\nSource: Sections 13-1-360(a) and 13-1-362; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50;\nOrd. 031211-11; Ord. 20060504-039.\n\n(A)\n\nOn receipt of an application filed under this division, the city manager shall notify\nthe:\n\n(1)\n\nCouncil;\n\n(2)\n\ncity clerk; and\n\n(3)\n\npresiding officer of the Planning Commission.\n\n(B)\n\nIf the application filed under this division requests a revision of a land use plan,\nthe city manager shall give notice of the application under Section 25-1-133(A) (Notice Of Applications And Administrative Decisions).\n\nSource: Sections 13-1-361 and 13-1-362; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50;\nOrd. 031211-11; Ord. 20060504-039.\n\n(A)\n\nThis section does not apply to an application for a revision to a land use plan that\nmeets the criteria established in Section 25-9-254(A) (Administrative Approval Of A Revision To A Land Use Plan).\n\n(B)\n\nThe city manager shall submit an application filed under this division to the Planning\nCommission.\n\n(C)\n\nThe city manager shall submit an application filed under this division to each of\nthe following boards and commissions determined by the city manager to have an interest\nin the application:\n\n(1)\n\nParks and Recreation Board;\n\n(2)\n\nUrban Transportation Commission;\n\n(3)\n\nWater and Wastewater Commission; or\n\n(4)\n\nEnvironmental Board.\n\n(D)\n\nEach department, board, or commission that reviews an application filed under this\ndivision shall send its recommendation on the application to the council not later\nthan the 60th day after the date the application is filed with the city manager.\n\n(E)\n\nThe council shall act on an application filed under this division not later than the\ndate of the second regular Thursday meeting of the council that is to be held after\nthe date that the council receives the final recommendations required by Subsection\n(D).\n\nSource: Section 13-1-362; Ord. 990225-70; Ord. 000309-39; Ord. 010329-18; Ord. 010607-50;\nOrd. 031211-11; Ord. 20060504-039.\n\n(A)\n\nThe city manager shall approve a revision to an approved land use plan if the proposed\nrevision:\n\n(1)\n\nincludes only land uses shown on the approved land use plan, unless the city manager\ndetermines that a proposed use would be a permitted use in the most restrictive zoning\ndistrict of the City that would permit the use on the site covered by the revision;\nand\n\n(2)\n\nwill not:\n\n(a)\n\nincrease residential density above the maximum residential density established by\nthe approved land use plan;\n\n(b)\n\nincrease the area of nonresidential land use above the maximum established by the\napproved land use plan;\n\n(c)\n\nincrease development intensity in a water quality zone above the intensity shown on\nthe approved land use plan;\n\n(d)\n\nincrease the City's commitment for water and wastewater service above the level required\nto serve the uses identified on the approved land use plan or the level established\nin an agreement with the City;\n\n(e)\n\nrequire an amendment to the Transportation Plan or result in the misalignment of a\nroad connecting to land adjacent to land in an approved preliminary plan or final\nplat; or\n\n(f)\n\nin the opinion of the city manager:\n\n(i)\n\nincrease traffic above the capacity of existing or funded roadways in the territory\nof the water district;\n\n(ii)\n\nbe incompatible with land uses in or adjacent to the water district; or\n\n(iii)\n\nnegatively affect a publicly dedicated parkland or a greenbelt area.\n\n(B)\n\nUnder Subsection (A)(2)(b), land that is dedicated or used for a public purpose or\na civic use is considered to be a residential land use.\n\nSource: Section 13-1-363(a); Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord.\n031211-11; Ord. 20060504-039.\n\nAn applicant requesting administrative approval of a revision of a land use plan must\nsubmit:\n\n(1)\n\ndocumentation demonstrating that the proposed revision complies with Section 25-9-254(A) (Administrative Approval of a Revision to a Land Use Plan);\n\n(2)\n\na tabular comparison of the approved and proposed land use plan comparing:\n\n(a)\n\neach utility requirement as described in the relevant consent agreement;\n\n(b)\n\nland uses by acreage;\n\n(c)\n\nthe number of dwelling units by residential category; and\n\n(d)\n\nresidential density in each residential category; and\n\n(3)\n\n15 folded copies of the proposed land use plan.\n\nSource: Section 13-1-363(b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe city manager must approve or deny a revision to an approved land use plan before\nthe 15th day after the date the application was filed.\n\n(B)\n\nOn approval of a revision to an approved land use plan, the person who applied for\napproval of the revision shall submit a copy of the revised land use plan to the city\nmanager. The copy must be on mylar and capable of being reproduced.\n\n(C)\n\nThe effective date of a revised land use plan approved under this section is the date\nthat the plan is signed by the city manager.\n\nSource: Section 13-1-363 (c); Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord.\n031211-11; Ord. 20060504-039.\n\nThis division applies to a water district created with the consent of the City after\nMarch 20, 1980, that issued bonds after December 19, 1985.\n\nSource: Section 13-1-372; Ord. 990225-70; Ord. 031211-11.\n\nA water district may not issue a bond unless the council approves the issuance of\nthe bond.\n\nSource: Section 13-1-370; Ord. 990225-70; Ord. 031211-11.\n\nA water district that proposes to issue bonds must file an application for approval\nof the issuance with the city manager. An application filed under this section includes\nall documents required by City rules.\n\nSource: Section 13-1-370; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord. 031211-11;\nOrd. 20060504-039.\n\nOn receipt of an application filed under Section 25-9-283 (Application For Approval of a District Bond) the city manager shall:\n\n(1)\n\nnotify the council and the presiding officer of the Water and Wastewater Commission\nof the application; and\n\n(2)\n\nsend one copy of the application to the presiding officer of the Water and Wastewater\nCommission.\n\nSource: Section 13-1-371; Ord. 990225-70; Ord. 010329-18; Ord. 010607-50; Ord. 031211-11;\nOrd. 20060504-039.\n\n(A)\n\nThe city manager shall designate departments of the City to review the application.\n\n(B)\n\nEach designated department shall complete its review of the application not later\nthan the 45th day after the date the application is filed.\n\nSource: Section 13-1-371; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAn independent certified public auditor shall review the preliminary and final official\nstatements of the water district that include the City's financial statements and\naudited opinion.\n\n(B)\n\nUntil the independent certified public auditor completes the required review, an official\nstatement described in Subsection (A) may not be disclosed to a person, other than:\n\n(1)\n\nan employee of the City; or\n\n(2)\n\na consultant who is assisting the water district to structure the issuance of a water\ndistrict bond.\n\nSource: Section 13-1-371; Ord. 990225-70; Ord. 031211-11; Ord. No. 20240215-034, Pt. 11, 2-26-24.\n\nThe council shall act on an application filed under this division not later than the\ndate of the second regular Thursday meeting of the council held after the date the\ncouncil receives the recommendations of the Water and Wastewater Commission and each\ndesignated department of the City.\n\nSource: Section 13-1-371; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided by this section, this article applies to new development in the\nwater and wastewater impact fee service area.\n\n(B)\n\nThe impact fee applicable to new development outside the water and wastewater impact\nfee service area shall be set by agreement. The agreement may provide the amount of\nthe fee, the method of collection of the fee, and other terms and conditions.\n\n(C)\n\nA contract for water or wastewater service to a wholesale customer or other political\nsubdivision of the State of Texas shall provide for collection of impact fees and\ntransmittal of collections to the City in accordance with this article.\n\n(D)\n\nThis article does not supersede a contract with a political subdivision or wholesale\ncustomer that was in effect on June 18, 1990, and which provides for the collection\nof impact fees and the transmittal of collections to the City.\n\nSource: Section 13-3A-1(b) and 13-3A-20; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in this section, words and phrases in this article that are defined\nin Chapter 395 of the Local Government Code have the same meaning in this article\nthat they have in Chapter 395.\n\n(B)\n\nIn this article:\n\n(1)\n\nCITY-SUPPORTED COMMUNITY GARDEN has the meaning assigned by Section 14-7-1 (Definitions).\n\n(2)\n\nNEW DEVELOPMENT means the subdivision of land; the construction, reconstruction, redevelopment,\nconversion, structural alteration, relocation, or enlargement of any structure; or\nany use or extension of the use of land; any of which increases the number of service\nunits for water or wastewater service, and includes the sale of water or wastewater\ntaps resulting from the conversion of an individual well, or of an individual waste\ndisposal system, to the City's water or wastewater utility.\n\n(3)\n\nTAP PERMIT means a permit for a connection to the City's water or wastewater system\nunder Article 1, Division 3 (Tap Permits).\n\n(4)\n\nWASTEWATER IMPACT FEE means an impact fee for wastewater service.\n\n(5)\n\nWATER AND WASTEWATER IMPACT FEE SERVICE AREA means the water and wastewater impact\nfee service area designated by separate ordinance.\n\n(6)\n\nWATER IMPACT FEE means an impact fee for water supply service.\n\n(7)\n\nWHOLESALE CUSTOMER means a customer of the City's water and wastewater utility who\npurchases service for resale to a retail customer.\n\nSource: Section 13-3A-1(f); Ord. 990225-70; Ord. 031211-11; Ord. 20110210-018.\n\n(A)\n\nThe following are adopted and incorporated by reference:\n\n(1)\n\nImpact Fee Land Use Assumptions;\n\n(2)\n\nthe designation of the water and wastewater impact fee service area; and\n\n(3)\n\nImpact Fee Capital Improvements Plan for Water and Wastewater Facilities.\n\n(B)\n\nDocuments adopted by reference shall be kept on file by the city clerk.\n\nSource: Sections 13-3A-2, 13-3A-3, and 13-3A-4; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe director of the Financial and Administrative Services Department shall establish\naccounting controls to ensure compliance with Section 395.024 of the Local Government\nCode.\n\n(B)\n\nThe director of the Financial and Administrative Services Department shall establish\nseparate interest-bearing accounts for impact fees collected for water facilities\nand for impact fees collected for wastewater facilities.\n\n(C)\n\nFunds may be disbursed as reasonably necessary to carry out the purposes of this article;\nprovided that a fee shall be expended within a reasonable period of time, not to exceed\n10 years, from the date the fee is deposited into the account.\n\n(D)\n\nThe director of the Financial and Administrative Services Department shall maintain\nrecords for each account that:\n\n(1)\n\nshow the source and disbursement of fees;\n\n(2)\n\nthe number of service units for which fees are received; and\n\n(3)\n\nensure that refunds from each account are properly made.\n\nSource: Section 13-3A-12; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis article levies a water impact fee and a wastewater impact fee to be assessed\nand collected in accordance with Chapter 395 of the Local Government Code.\n\n(B)\n\nThe director of the Water and Wastewater Utility shall collect the water impact fee\nand the wastewater impact fee on new development in accordance with Chapter 395 of\nthe Local Government Code and this article.\n\nSource: Section 13-3A-7(a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to the assessment of the water impact fee and the wastewater\nimpact fee.\n\n(B)\n\nThis article assesses an impact fee on new development at the time of final plat approval.\n\n(C)\n\nIf an applicant obtains a final approval for replatting, this article assesses an\nimpact fee at the time of the replatting.\n\n(D)\n\nFor a development which received final plat approval before June 18, 1990, and which\nis not replatted, this article assesses an impact fee as of June 20, 1990.\n\n(E)\n\nAn application for an amended plat made under Local Government Code Section 212.016\nor the City's subdivision rules is not subject to a reassessment of the impact fee.\n\nSource: Section 13-3A-7 and 13-3A-1(e); Ord. 990225-70; Ord. 031211-11.\n\nThe amount of the impact fee to be assessed for each service unit and the amount of\nthe impact fee to be collected for each service unit shall be set by ordinance.\n\nSource: Section 13-3A-6(c); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe impact fees to be collected for new development are calculated by:\n\n(1)\n\nadding the number of service units attributable to all meters purchased for the development;\n\n(2)\n\nmultiplying the total number of service units by the fee to be collected for each\nservice unit for water or wastewater service; and\n\n(3)\n\nsubtracting any applicable credits or discounts allowable under this article for water\nor wastewater service from the product derived under Subsection (A)(2).\n\n(B)\n\nIf the property owner increases the number of service units for a development, the\nadditional impact fees to be collected for the new service units shall be determined\nusing the method set out in this section, and the fees and credits or discounts in\neffect at the time the additional meters are purchased. The additional fee shall be\ncollected at the time the additional meters are purchased.\n\n(C)\n\nIf the property owner decreases the number of service units for a development, the\nproperty owner is entitled to a refund of the impact fee for the amounts represented\nby the decrease in service units based on the fee to be collected for each service\nunit and credits or discounts in effect at the time the fee was paid.\n\nSource: Section 13-3A-8(b), (d) and (e); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided by Section 25-9-326 (Installment Payment Of Impact Fee), or by a contract with a wholesale customer or\nwith another political subdivision, the impact fee due for new development shall be\ncollected:\n\n(1)\n\nat the time the City issues a building permit; or\n\n(2)\n\nfor land platted outside the corporate boundaries of the City, at the time an application\nfor a tap permit is filed.\n\n(B)\n\nA tap permit may not be issued unless the applicant has paid the impact fee.\n\nSource: Section 13-3A-8(a) and 13-3A-9(a) - (c); Ord. 990225-70; Ord. 030731-54; Ord.\n031211-11.\n\n(A)\n\nThe director of the Water and Wastewater Utility may allow an applicant to make installment\npayments of an impact fee in accordance with this section.\n\n(B)\n\nThe applicant must make written application for approval to make payment of an impact\nfee on an installment basis on a form promulgated for this purpose by the director\nof the Water and Wastewater Utility.\n\n(C)\n\nThe applicant must be:\n\n(1)\n\nthe owner of a single family residence occupied by the applicant as a homestead; or\n\n(2)\n\na community garden that is not a qualified community garden.\n\n(D)\n\nThe applicant must demonstrate that the payment of the full amount of the impact fee\nat the time the tap permit is approved will cause the applicant undue financial hardship\nin accordance with standards promulgated by the director of the Water and Wastewater\nUtility.\n\n(E)\n\nThe property for which connection is sought:\n\n(1)\n\nmay not be used for a commercial or industrial purpose;\n\n(2)\n\nmust be within the City's impact fee service area; and\n\n(3)\n\nmust be a legal lot in compliance with applicable state law and local subdivision\nrequirements.\n\n(F)\n\nAn applicant who is eligible under this section to pay an impact fee on an installment\nbasis shall:\n\n(1)\n\npay a minimum of 10 percent of the applicable impact fee and all connection fees at\nthe time the tap permit is approved; and\n\n(2)\n\nexecute an installment payment agreement on a form promulgated by the director of\nthe Water and Wastewater Utility and approved by the city attorney which must contain,\nat a minimum, the following provisions:\n\n(a)\n\nthe written promise of the applicant to pay the balance of the impact fee owed in\nequal annual installments over a payment term not to exceed five years at an interest\nrate of seven percent with each installment due and payable on the anniversary date\nof the approval of the tap permit until paid;\n\n(b)\n\nterms and conditions as the city attorney shall deem favorable, necessary, or required\nto enforce the agreement in the event of a default, including the right to accelerate\nthe balance due under the contract and require immediate payment of the full remaining\nbalance, to disconnect service upon default, to file a utility lien against the property\nand enforce the terms of the lien according to law, to file suit to collect the remaining\nbalance together with interest and reasonable attorney's fees; and\n\n(c)\n\nother provisions the city attorney considers necessary to document the transaction,\nprotect the interests of the City, and comply with applicable law.\n\nSource: Section 13-3A-9(d) - (f); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to the determination of service units for both water and wastewater\nservice.\n\n(B)\n\nService units shall be determined by the size and type of the water meter purchased\naccording to the following schedule:\n\n| Meter Size (Inch) | Type | Service Units |\n| --- | --- | --- |\n|  | Simple | 1 |\n|  | Simple | 1.5 |\n| 1 | Simple | 2.5 |\n| 1 | Simple | 5 |\n| 2 | Simple | 8 |\n| 2 | Compound | 8 |\n| 2 | Turbine | 10 |\n| 3 | Compound | 16 |\n| 3 | Turbine | 24 |\n| 4 | Compound | 25 |\n| 4 | Turbine | 42 |\n| 6 | Compound | 50 |\n| 8 | Compound | 80 |\n| 6 | Turbine | 92 |\n| 10 | Compound | 115 |\n| 8 | Turbine | 160 |\n| 10 | Turbine | 250 |\n| 12 | Turbine | 330 |\n\nSource: Section 13-3A-5(a) and (b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf a water meter is not purchased for a connection, service units shall be determined\nby a professional engineer licensed in the State of Texas subject to the approval\nof the director of the Water and Wastewater Utility.\n\n(B)\n\nIf a water meter falls between two meter sizes set forth in Section 25-9-331 (Service Units Where A Meter Is Purchased), the calculation shall be made for the\nnext larger size.\n\nSource: Section 13-3A-5(e) and (f); Ord. 990225-70; Ord. 031211-11.\n\nIf a larger or smaller meter is required solely due to abnormally low or high pressure\nin the City's main, the director of the Water and Wastewater Utility or his designee\nmay adjust the number of service units to reflect more accurately the flow rate and\nsystem pressure conditions.\n\nSource: Section 13-3A-5(c); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nNo service units shall be attributed to a tap that provides only fire protection capacity.\n\n(B)\n\nIf a fire demand meter composed of a combination of independent units in separate\nhousings monitoring both fire and domestic use is purchased, the number of service\nunits shall be determined according to the largest independent unit for the fire demand\nmeter that provides only domestic service to the property. For purposes of this section,\nonly a simple or compound meter shall be used to calculate the number of service units.\n\n(C)\n\nIf the fire protection capacity of the fire demand meter is routinely used for domestic\npurposes, as evidenced by the registration of consumption recorded on the City's meter-reading\nand billing systems, the owner of the property shall pay the current fee for the fire\nprotection capacity that has been converted to domestic capacity by routine use.\n\nSource: Section 13-3A-5(d); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAn impact fee may not be collected for a connection that is used to provide only fire\nprotection capacity.\n\n(B)\n\nAn impact fee may not be collected for a connection for a state owned building or\nproperty that is entirely occupied by a state agency.\n\n(C)\n\nAn impact fee may not be collected for non-residential construction funded, wholly\nor partly, by the City's community development block grant program.\n\n(D)\n\nAn impact fee may not be collected for:\n\n(1)\n\nthe exchange of an existing 5/8-inch meter serving an existing duplex residence for\ntwo -inch meters serving the two dwelling units of the duplex residence, provided\nthere are no additions or modifications to the existing duplex residence other than\nthose necessary to comply with this article; or\n\n(2)\n\nthe exchange of a connection for another connection, if the exchange will result in\nan equivalent or lesser number of service units on the property for which the connection\nwas originally purchased. The number of service units to be exchanged shall be determined\nin accordance with Section 25-9-331 (Service Units Where A Meter Is Purchased.)\n\n(E)\n\nIf one -inch meter is serving more than one single-family detached residence, the\nowner of one of the single-family detached residences being served by the existing\nmeter may obtain a separate 5/8-inch meter without paying an additional impact fee.\n\nSource: Section 13-3A-10(d), (e), (f), (i), and (j); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA water impact fee may not be collected for a development that receives service from\na central water supply system that is:\n\n(1)\n\nowned by a person other than the City; and\n\n(2)\n\nis to be connected to the City's water system.\n\n(B)\n\nA wastewater impact fee may not be collected for a development that receives service\nfrom a wastewater treatment plant that is:\n\n(1)\n\nowned by a person other than the City; and\n\n(2)\n\nis to be connected to the City's wastewater system.\n\nSource: Section 13-3A-10(b); Ord. 990225-70; Ord. 031211-11.\n\nA wastewater impact fee may not be collected for a meter used to monitor water that\nis used exclusively for consumption or that cannot enter the City's wastewater system.\n\nSource: Section 13-3A-10(c); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA water impact fee may not be collected on a water connection for property that is:\n\n(1)\n\nannexed for full purposes by the City;\n\n(2)\n\nserved by an existing on-site water well; and\n\n(3)\n\nwithin 100 feet of a City owned water line at the time of annexation; if\n\n(4)\n\na tap permit authorizing the connection of the property to the City's water system\nis obtained by the property owner on or before the second anniversary of the date\nof annexation.\n\n(B)\n\nA water impact fee may not be collected on a water connection for property that is:\n\n(1)\n\nannexed for full purposes by the City;\n\n(2)\n\nserved by an existing water well; and\n\n(3)\n\nwithin 100 feet of a point to which a City owned water line is extended after the\ndate of annexation; if\n\n(4)\n\na tap permit authorizing the connection of the property to the City's water system\nis obtained by the property owner on or before the later of:\n\n(a)\n\nthe second anniversary of the date of annexation; or\n\n(b)\n\nthe second anniversary of the date that the water line was extended to within 100\nfeet of the property.\n\nSource: Section 13-3A-10(l) and (m); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA wastewater impact fee may not be collected on a wastewater connection for property\nthat is:\n\n(1)\n\nannexed for full purposes by the City;\n\n(2)\n\nserved by an existing septic system; and\n\n(3)\n\nwithin 100 feet of a City-owned centralized sanitary sewer line at the time of annexation;\nif\n\n(4)\n\na tap permit authorizing the connection of the property to the City's water system\nis obtained by the property owner on or before the second anniversary of the date\nof annexation.\n\n(B)\n\nA wastewater impact fee may not be collected on a wastewater connection for property\nthat is:\n\n(1)\n\nannexed for full purposes by the City;\n\n(2)\n\nserved by an existing septic system; and\n\n(3)\n\nwithin 100 feet of a point to which a City owned centralized sanitary sewer line is\nextended after the date of annexation; if\n\n(4)\n\na tap permit authorizing the connection of the property to the City's water system\nis obtained by the property owner on or before the later of:\n\n(a)\n\nthe second anniversary of the date of annexation; or\n\n(b)\n\nthe second anniversary of the date that the sewer line was extended to within 100\nfeet of the property.\n\nSource: Section 13-3A-10(g) and (h); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this section, city-supported community garden and garden permit have the meanings\nassigned by Section 14-7-1 (Definitions) of the City Code.\n\n(B)\n\nAn impact fee may not be assessed on a city-supported community garden.\n\n(C)\n\nThe director of the department designated under Section 14-7-1 (Definitions) shall\ndetermine if the parcel of land is issued a garden permit.\n\n(D)\n\nIf the garden permit on a parcel of land terminates, the director of the department\ndesignated under Section 14-7-1 (Definitions) shall notify the director of the Water\nand Wastewater Utility and the director of the Planning and Development Review Department\nof the change in status.\n\n(E)\n\nAfter a garden permit terminates on a parcel of land and if the tap is not removed\nin accordance with Section 25-9-99 (Temporary Tap Permit for a City-Supported Community Garden):\n\n(1)\n\na user of the parcel of land shall pay any impact fees on the parcel of land within\n30 calendar days; and\n\n(2)\n\nif the impact fee is not paid as required under Paragraph (1), the director of the\nWater and Wastewater Utility must notify the user that:\n\n(a)\n\nif the parcel of land had a temporary exemption from the platting requirements before\nthe garden permit was terminated, the user must plat the parcel of land before the\nWater and Wastewater Utility can continue service;\n\n(b)\n\nthe delinquent impact fee on the parcel of land must be paid within 15 calendar days;\nand\n\n(c)\n\nthe failure to secure legal lot status or to pay the impact fee is grounds for terminating\nwater service; and\n\n(3)\n\nif, following the notice under Paragraph (2), legal lot status is not obtained or\nthe impact fee is not paid as required under Paragraph (2), the water service may\nbe disconnected.\n\nSource: Section 13-3A-10(n); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord.\n20110210-018.\n\n(A)\n\nThe community development officer may exempt not more than 1,500 service units of\naffordable housing constructed each fiscal year from the requirement to pay impact\nfees under this article. Service units of affordable housing within the development\nknown as the Robert Mueller Municipal Airport development that are granted exemptions\nfrom paying impact fees do not count against the annual cap of 1,500.\n\n(B)\n\nThe community development officer shall establish guidelines for the selection of\nthe service units to receive an exemption under this section. The guidelines must\ninclude a requirement for a written application.\n\n(C)\n\nTo be eligible for an exemption under this section, affordable housing must:\n\n(1)\n\nmeet design and construction guidelines established by the community development officer\nfor habitability, affordability, accessibility, water conservation, and energy efficiency;\n\n(2)\n\nbe served by existing City infrastructure and services; and\n\n(3)\n\nbe a newly constructed single family home or multifamily housing unit located within\nthe corporate limits of the City that is:\n\n(a)\n\napproved for assistance under an affordable housing program funded with Community\nDevelopment Block Grant or federal HOME program assistance funds administered by the\nCity;\n\n(b)\n\napproved for assistance under a program for affordable housing construction funding\nor down payment assistance administered by the Austin Housing Finance Corporation;\nor\n\n(c)\n\napproved under guidelines for non-assisted affordable housing units established by\nthe community development officer that meet the requirements of this section.\n\n(D)\n\nTo receive an exemption under this section, an applicant who is approved for an exemption\nmust provide to the community development officer an agreement, a restrictive covenant,\na deed of trust, a promissory note, or other documents determined to be necessary\nby the city attorney to establish an enforceable obligation by the applicant to:\n\n(1)\n\npay to the City an amount equal to the impact fee otherwise applicable to the housing\nunit if the applicant does not comply with this section and applicable guidelines;\n\n(2)\n\nreserve by covenant the applicable affordable dwelling units for the duration of the\naffordability period prescribed by Subsection (E); and\n\n(3)\n\npay liquidated damages that will fairly compensate the City for any breach.\n\n(E)\n\nTo retain an exemption under this section, a unit of affordable housing must comply\nwith the requirements of this subsection.\n\n(1)\n\nExcept as provided in Paragraphs (2) and (3), a unit must be available for occupancy\nby a person whose gross household income does not exceed 80 percent of the median\nhousehold income for the Austin Standard Metropolitan Statistical Area for the following\naffordability period:\n\n(a)\n\nin the university neighborhood overlay district, a period of no less than 15 years;\nor\n\n(b)\n\noutside the university neighborhood overlay district:\n\n(i)\n\nfor rental housing, a period of no less than five years; or\n\n(ii)\n\nfor owner-occupied housing a period of no less than one year, unless the owner is\nreceiving federal housing assistance, in which case, a period of no less than five\nyears.\n\n(2)\n\nA unit within a Vertical Mixed Use building must comply with the affordability requirements\nfor the affordability period under Chapter 25-2, Subchapter E, Section 4.3.3.F (Affordability Requirements).\n\n(3)\n\nIn Downtown Mixed Use (DMU) or Central Business District (CBD) base zoning district:\n\n(a)\n\nan owner-occupied unit must be available for occupancy for a period of not less than\n99 years by an occupant whose gross household income does not exceed 120 percent of\nthe median family income for the Austin Standard Metropolitan Statistical Area; or\n\n(b)\n\na rental unit must be available for occupancy for a period of not less than 40 years\nby an occupant whose gross household income does not exceed 80 percent of the median\nfamily income for the Austin Standard Metropolitan Statistical Area.\n\n(4)\n\nAn affordability period prescribed by this subsection begins on the date that an affordable\nunit is available for occupancy.\n\n(F)\n\nIf an applicant who receives an exemption under this section does not comply with\nSubsection (E), defaults on its obligations under documents executed under Subsection\n(D), or does not perform in accordance with the conditions for receipt of the exemption,\nthe City may initiate legal proceedings to recover the impact fees that would have\napplied to the housing unit and damages. Funds recovered for impact fees shall be\ndeposited in the impact fee account of the Water Utility. Damages collected to compensate\nthe City for loss of affordable housing units shall be deposited into the S.M.A.R.T.\nHousing CIP Fund account of the Neighborhood Housing and Community Development Department.\n\n(G)\n\nBefore the director of the Water Utility may issue a tap permit authorizing connection\nto the City water or wastewater system for a property receiving an exemption under\nthis section, the community development officer must provide a written certification\nto the director of the Water Utility identifying the service address of the affordable\nhousing unit.\n\n(H)\n\nThe community development officer may revoke a certification under Subsection (G)\nif the applicant does not finish construction of the approved affordable housing unit:\n\n(1)\n\nwithin 15 months after certification; or\n\n(2)\n\nfor a multifamily housing unit, 24 months after certification.\n\n(I)\n\nThis section does not require a refund by the Water Utility of impact fees previously\npaid.\n\n(J)\n\nAn exemption under this section may not be assigned or transferred by the applicant\nto another property.\n\nSource: Section 13-3A-10(o); Ord. 990225-70; Ord. 000420-77; Ord. 031211-11; Ord.\n20051103-032; Ord. 20071129-100.\n\n(A)\n\nIf a refund is made under Section 395.025 of the Local Government Code, the tap permit\nshall be cancelled and all connection fees previously collected shall be refunded.\nIf a building permit has been issued for the property, the canceled building permit\nmust be presented before the refund may be made.\n\n(B)\n\nIf a previously purchased but uninstalled water meter for which the impact fee has\nbeen paid is replaced with a smaller meter, the City shall refund a portion of impact\nfee payments based on the difference in service units of the two meter sizes and the\nfee for each service unit at the time of the original fee payment.\n\n(C)\n\nA request for a refund shall be submitted to the director of the Water and Wastewater\nUtility on a form provided by the City. The director of the Water and Wastewater Utility\nmust respond to the requestor in writing with a decision on the request not later\nthan the 31st day after the receipt of the request. The response must include the\nreasons for the decision. If a refund is due to the requestor, the director of the\nWater and Wastewater Utility shall notify the director of Financial and Administrative\nServices that a refund payment is due to the requestor.\n\nSource: Section 13-3A-14(d)(4)and (5), (e), and (f); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAn impact fee may not be refunded if the tap permit for which it is paid expires.\n\n(B)\n\nIf the tap permit or building permit for a property for which an impact fee has been\npaid expires, and a new application is filed for the same property, the applicant\nis entitled to receive a credit in the amount of the fee paid.\n\n(C)\n\nExcept as provided by Subsection (B), an impact fee is not transferable to a property\nor service unit other than the one for which it is paid.\n\nSource: Section 13-3A-8(f), (g), (h); Ord. 990225-70; Ord. 031211-11.\n\nThis article applies in the planning jurisdiction of the City except as otherwise\nprovided in this article.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\nIn this article:\n\n(1)\n\nAPPROVED USE means an application of reclaimed water authorized by a reclaimed water\nagreement.\n\n(2)\n\nAPPROVED USE AREA means a site designated in a reclaimed water agreement to receive\nreclaimed water for an approved use.\n\n(3)\n\nCOMMISSION means the Texas Natural Resources Conservation Commission.\n\n(4)\n\nDRAWINGS mean plans, working drawings, detail drawings, profiles, typical cross sections,\nor reproductions that show locations, character, dimensions, or details of work related\nto a reclaimed water system and its components.\n\n(5)\n\nINDUSTRIAL USE means an approved use of reclaimed water for industrial or commercial\nprocesses as defined by 30 Texas Administrative Code, Chapter 210.\n\n(6)\n\nIRRIGATION USE means an approved use of reclaimed water for landscape, horticultural,\nor agricultural irrigation as defined by 30 Texas Administrative Code, Chapter 210.\n\n(7)\n\nMUNICIPAL WASTEWATER means wastewater collected from dwelling units, commercial buildings,\nand institutions including process wastes of industry, groundwater infiltration, miscellaneous\nwaste liquids, spent water from building water supply, and waste materials from bathrooms,\nkitchens and laundries.\n\n(8)\n\nOFFSITE FACILITIES means reclaimed water distribution, storage, or delivery facilities\nupstream of the point of connection to an approved use area.\n\n(9)\n\nONSITE FACILITIES means reclaimed water distribution facilities downstream of the\npoint of connection to an approved use area.\n\n(10)\n\nPOINT OF CONNECTION means a location where offsite facilities connect to onsite facilities,\nat the downstream end of the Utility's reclaimed water service meter.\n\n(11)\n\nRECLAIMED WATER SERVICE means furnishing reclaimed water to a user through a metered\nconnection to onsite facilities.\n\n(12)\n\nRECLAIMED WATER means reclaimed municipal wastewater that is under the direct control\nof the City treatment plants, satellite facilities, or a treatment plant with which\nthe City contracts, and that has been treated to a quality that meets or exceeds 30\nTexas Administrative Code, Chapter 210 requirements.\n\n(13)\n\nSATELLITE FACILITY means a package wastewater treatment plant.\n\n(14)\n\nSERVICE AREA means the territory within the City and within its extraterritorial jurisdiction.\n\n(15)\n\nSTORAGE FACILITY means an impoundment or structural tank that receives reclaimed water\nfrom a producer.\n\n(16)\n\nUSER means a party to a reclaimed water agreement with the City.\n\n(17)\n\nUTILITY means the Water and Wastewater Utility.\n\n(18)\n\nUTILITY STANDARD means a design criterion of the City, American Water Works Association,\nor the Commission.\n\n(19)\n\nWATER RIGHT means a real property right to divert, use, or consume water flowing to,\nover, or under land.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nThe director of the Water and Wastewater Utility may make reclaimed water available\nto properties within the service area as the Utility extends the reclaimed water distribution\nsystem\n\n(B)\n\nThe director of the Water and Wastewater Utility shall prescribe design requirements\nfor reclaimed water facilities, the manner of construction, the method of operation,\nand conditions of service.\n\n(C)\n\nThe director of the Water and Wastewater Utility may refuse to provide service for\nthe following reasons:\n\n(1)\n\nreclaimed water service would be detrimental to the potable water system;\n\n(2)\n\nCity supply of treated wastewater is inadequate to meet the anticipated needs of the\nproposed use area;\n\n(3)\n\nrequired fees have not been paid;\n\n(4)\n\nreclaimed water service to the area would not benefit the City;\n\n(5)\n\nthe proposed use is inappropriate for reclaimed water; or\n\n(6)\n\nknown safeguards are not in place to protect the public health or the environment.\n\n(D)\n\nIn determining whether to provide reclaimed water service to an applicant, the director\nof the Water and Wastewater Utility may consider the following factors:\n\n(1)\n\nthe existence of a reclaimed water main adjacent to or near the premises of an applicant;\nand\n\n(2)\n\nthe applicant's offer to pay the cost of service extension.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\nAn applicant for a subdivision plat, building permit, site plan, water service extension,\nor water connection within the service area may submit an application to use reclaimed\nwater. The director of the Water and Wastewater Utility shall prescribe an application\nform for reclaimed water service.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nThe director of the Water and Wastewater Utility shall review an application for reclaimed\nwater service and investigate the proposed service. The investigation may include\na site visit with the user to determine the feasibility of reclaimed water service.\n\n(B)\n\nThe director of the Water and Wastewater Utility shall determine whether the application\nmeets the requirements of this article and of the Commission.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nA user must submit design drawings and specifications to the director of the Water\nand Wastewater Utility for approval before the user may construct or retrofit an onsite\nfacility that will use or receive reclaimed water.\n\n(B)\n\nA user must submit to the Utility drawings of the final installed onsite reclaimed\nwater system and the entire approved use area before beginning operation.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\nA user must install a backflow prevention assembly on the reclaimed water service\nline before the director may provide reclaimed water service.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\nA user must design storage facilities used for storing reclaimed water in accordance\nwith 30 Texas Administrative Code, Chapter 210.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nIf the director of the Water and Wastewater Utility approves the application, the\nUtility may enter a reclaimed water service agreement with a user.\n\n(B)\n\nA reclaimed water agreement must incorporate the requirements of this article and\nadditional utility standards, if any, prescribed by the director of the Water and\nWastewater Utility.\n\n(C)\n\nThe user must sign the reclaimed water agreement acknowledging that the user is responsible\nfor onsite activities and must agree to hold the City harmless from claims arising\nout of user's operation and maintenance of reclaimed water service.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nThe City may discontinue reclaimed and potable water service to a user if the user:\n\n(1)\n\nviolates this article;\n\n(2)\n\nfails to pay water bills;\n\n(3)\n\ntampers with the service;\n\n(4)\n\ncross-connects with a potable water source;\n\n(5)\n\nrefuses to permit an authorized city representative to enter its premises to inspect\nthe user's reclaimed water system; or\n\n(6)\n\nperforms an act that may be detrimental to the water or wastewater system.\n\n(B)\n\nA user who seeks to discontinue service must pay for the reclaimed water used until\nthe service is discontinued.\n\n(C)\n\nA user may not reconnect a discontinued service without the director of the Water\nand Wastewater Utility's approval.\n\n(D)\n\nIf a user reconnects a discontinued service without the director of the Water and\nWastewater Utility's approval, the Utility may remove the service and charge an additional\nfee.\n\n(E)\n\nThe Utility may not charge a fee for discontinued reclaimed water service.\n\n(F)\n\nA user may apply for reinstatement of service after paying the fees or charges authorized\nby this article.\n\n(G)\n\nThe director of the Water and Wastewater Utility shall charge a fee for service reinstatement.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nThe Utility and its authorized agents, employees, or contractors are responsible for\nthe operation, management, and control of the offsite facilities and the oversight\nof reclaimed water.\n\n(B)\n\nThe Utility shall:\n\n(1)\n\nobtain necessary Commission permits for the offsite use of reclaimed water under 30\nTexas Administrative Code, Chapter 210;\n\n(2)\n\nconduct reclaimed water quality assessments to comply with the requirements of the\nregulatory agencies; and\n\n(3)\n\ninspect the user's onsite facilities and their operations for conformance with this\narticle.\n\n(C)\n\nBefore the Utility requests council approval to construct new reclaimed water satellite\nfacilities the Utility shall request the recommendations of the Water and Wastewater\nCommission, Environmental Board, and Land Use Commission.\n\nSource: Ord. 001214-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nA user may not make a connection to existing Utility facilities without the approval\nof the director of the Water and Wastewater Utility.\n\n(B)\n\nA user is responsible for constructing an onsite service line to an established point\nof connection.\n\n(C)\n\nA user shall provide supervision of onsite facilities to assure compliance with this\narticle and Chapter 15-1 (Cross-Connection Regulations) of the City Code.\n\n(D)\n\nA user shall provide access at reasonable times for inspections.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nA user may use reclaimed water for the following purposes:\n\n(1)\n\nturf and general landscape irrigation;\n\n(2)\n\nnon-food processing industrial processes;\n\n(3)\n\nnon-residential toilet and urinal flushing;\n\n(4)\n\nconstruction activities;\n\n(5)\n\nvehicle washing;\n\n(6)\n\nair conditioning cooling towers; and\n\n(7)\n\nother uses authorized by the director of the Water and Wastewater Utility.\n\n(B)\n\nA user may use reclaimed water only in areas authorized by the director of the Water\nand Wastewater Utility.\n\n(C)\n\nA user may not give, sell, trade, or transfer reclaimed water to another area without\nthe written approval of the director of the Water and Wastewater Utility.\n\n(D)\n\nA user may not discharge airborne or surface reclaimed water from the user's property,\nother than to a wastewater treatment system or wastewater collection system, without\nobtaining a permit from the Commission authorizing the discharge. The user must notify\nthe Utility of the permit application.\n\n(E)\n\nA user who uses reclaimed water for cooling or processing must discharge the water\nto a sanitary sewer or use another method of discharge approved by the director of\nthe Water and Wastewater Utility.\n\n(F)\n\nA user may not interrupt reclaimed water service in a portion of the Utility system\nwithout the approval of the director of the Water and Wastewater Utility. The director\nof the Water and Wastewater Utility may direct, inspect, and determine the time for\nan interruption of service to an existing system.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nThe Utility may inspect, remove, or secure devices installed by the user to control\nreclaimed water.\n\n(B)\n\nUtility personnel may inspect during normal business hours without notice to the user.\n\n(1)\n\nThe Utility and regulatory agencies may make periodic unannounced inspections of the\nonsite reclaimed water system.\n\n(2)\n\nThe user and its operations personnel shall cooperate with inspectors and assist in\nperforming operational tests.\n\n(C)\n\nAn onsite reclaimed water system must pass an operational test before the Utility\nmay approve the system.\n\n(D)\n\nThe director of the Water and Wastewater Utility may grant user final approval for\nreclaimed water service if:\n\n(1)\n\nthe director of the Water and Wastewater Utility approves the drawings;\n\n(2)\n\nthe system passes an inspection and cross connection control test; and\n\n(3)\n\nthe user makes corrections required by the Utility.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\nA user must identify reclaimed water facilities in accordance with utility standards.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\nA user may not:\n\n(1)\n\nuse reclaimed water for a purpose not approved in the reclaimed water agreement;\n\n(2)\n\nuse or apply reclaimed water for a purpose, including approved uses, directly or by\nwindblown spray, to an area other than that approved in the reclaimed water agreement;\n\n(3)\n\nuse hose bibs on an onsite reclaimed water system unless the director approves the\nuse of hose bibs; or\n\n(4)\n\nallow obstructions to impede access to meter boxes or other facilities.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nThe Utility shall charge the rate provided by separate ordinance for the following:\n\n(1)\n\nreclaimed water fee;\n\n(2)\n\ntap fee;\n\n(3)\n\nmeter set charges;\n\n(4)\n\nengineering or inspection fees;\n\n(5)\n\nreconnection fee; and\n\n(6)\n\nservice reinstatement fee.\n\n(B)\n\nA user of reclaimed water service must pay an additional fee set by separate ordinance\nfor discharge of reclaimed water to the sanitary sewer.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\nIf a reclaimed water meter fails to register or registers inaccurately, the Utility\nmay charge an average daily consumption rate based on a reading of the meter when\nin use and registering accurately during the same season or as close to the same season\nas is reasonably possible.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nThe Utility may bill for reclaimed water monthly.\n\n(B)\n\nAn active account becomes delinquent when full payment is not received in the Utility\ncustomer service office by the due date on the bill.\n\n(C)\n\nThe Utility may discontinue a delinquent account, regardless of location, until the\nbilling is paid.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\nThe delivery of reclaimed water by the Utility and the acceptance and use of the reclaimed\nwater by the user is not a transfer by the Utility or an acquisition by the user of\na water right.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n(A)\n\nA person commits an offense if the person knowingly violates any provision of this\narticle.\n\n(B)\n\nAn offense under this subsection is a Class C misdemeanor punishable by a fine not\nto exceed $2,000.\n\n(C)\n\nEach instance of a violation of this article is a separate offense.\n\nSource: Ord. 001214-70; Ord. 031211-11.\n\n\n\nFootnotes:\n\n--- (**1**) ---\n\n**Editor's note**\nOrd. No. 20210930-117, Pt. 5, effective 12-1-21 added article 5 to read as herein set out.\n\nThis article applies to a site that includes multi-family and non-residential buildings\nand that receives retail water service from Austin Water or a successor department.\n\nSource: Ord. No. 20240307-037, Pt. 2, 3-18-24.\n\nIn this article:\n\n(1)\n\nCOMMERCIAL BUILDING means a building that is developed for industry, commerce, trade,\nrecreation, business, or municipal, institutional, or civic use.\n\n(2)\n\nDIRECTOR means the director of Austin Water.\n\n(3)\n\nLARGE DEVELOPMENT PROJECT means the construction of one or more multi-family, mixed\nuse, or commercial buildings on one or more parcels in accordance with a phased plan\nor approved site plan, with a total gross floor area for the building(s) of 250,000\nsquare feet or more.\n\n(4)\n\nMIXED USE BUILDING means a building developed for any combination of commercial and\nmulti-family building uses.\n\n(5)\n\nMULTI-FAMILY BUILDING means a building that contains five or more residential housing\nunits.\n\n(6)\n\nONSITE WATER REUSE SYSTEM means a system that collects, treats, and uses alternative\nwater sources for non-potable uses at the building to district or neighborhood scale,\ngenerally at a location near the point of generation.\n\n(7)\n\nSMALL DEVELOPMENT PROJECT means the construction of one or more multi-family, mixed\nuse, or commercial buildings on one or more parcels in accordance with a phased plan\nor approved site plan, with a total gross floor area for the building(s) of less than\n250,000 square feet.\n\n(8)\n\nWATER BENCHMARKING APPLICATION means the form approved by the director that provides\ninformation on a proposed development project's anticipated water usage by source,\nand that provides a water balance calculation for the project.\n\nSource: Ord. No. 20210930-117, Pt. 1, 12-1-21; Ord. No. 20240307-037, Pts. 1, 3, 3-18-24.\n\n(A)\n\nA small development project with a property boundary located within 250 feet in horizontal\ndistance of a reclaimed water line, measured based on the closest practicable access\nroute, shall connect to a reclaimed water line and use reclaimed water for irrigation,\ncooling, toilet flushing, and other significant non-potable water uses identified\nin the water balance calculator.\n\n(B)\n\nA large development project with a property boundary located within 500 feet in horizontal\ndistance of a reclaimed water line, measured based on the closest practicable access\nroute, shall connect to a reclaimed water line and use reclaimed water for irrigation,\ncooling, toilet flushing and other significant non-potable water uses identified in\nthe water balance calculator.\n\n(C)\n\nThe director may grant a variance for the requirements of this section for:\n\n(1)\n\nsmall development projects if site conditions are such that compliance would represent\na significant financial hardship to the applicant; or\n\n(2)\n\nuses associated with public health and safety.\n\n(D)\n\nThe director shall grant a variance for the requirements of this section for a large\ndevelopment with a multifamily component that is more than 250 feet from and within\n500 feet of a reclaimed water line until April 1, 2024.\n\n(E)\n\nA development is not required to connect to a reclaimed water line or use reclaimed\nwater when the director of the Housing Department certifies the development is participating\nin a city, state, or federal program that requires:\n\n(1)\n\nA minimum of fifty percent on-site income-restricted dwelling units for 60% or lower\nmedian family income for rental units; or\n\n(2)\n\nA minimum of fifty percent on-site income-restricted dwelling units for 80% or lower\nmedian family income for ownership units.\n\nSource: Ord. No. 20210930-117, Pt. 2, 12-1-21; Ord. No. 20231130-086, Pt. 1, 12-11-23; Ord. No. 20240307-037, Pts. 1, 4, 3-18-24.\n\n(A)\n\nWater Benchmarking Application.\n\n(1)\n\nApplicability. This subsection applies to a small or large development project for\nwhich a site plan application is submitted under Chapter 25-5 (Site Plans).\n\n(2)\n\nDirector's Review and Approval.\n\n(a)\n\nA site plan application must include a completed water benchmarking application.\n\n(b)\n\nApproval of the water benchmarking application by the director is required as a condition\nof site plan approval.\n\n(B)\n\nDirector Consultation Required. In addition to the requirements in Subsection (A),\nan applicant requesting approval of a large development project must meet with the\ndirector prior to site plan release to discuss water efficiency code requirements,\nwater use benchmarking data, and incentives and rebates for alternative water use.\n\nSource: Ord. No. 20210930-117, Pt. 3, 12-1-21; Ord. No. 20240307-037, Pt. 1, 3-18-24.\n\n(A)\n\nExcept as provided in Subsection (B), an onsite water reuse system is required for\na large development project for which a site plan application is submitted under Chapter 25-5 (Site Plans) as specified in Chapter 15-13 (Regulation of Onsite Water Reuse Systems).\n\n(B)\n\nA development is not required to have an onsite water reuse system when:\n\n(1)\n\nthe director approves a fee in lieu of providing an onsite water reuse system under\nSubsection (C); or\n\n(2)\n\nthe director of the Housing Department certifies the development is participating\nin a city, state, or federal program that requires:\n\n(a)\n\na minimum of fifty percent on-site income-restricted dwelling units for 60% or lower\nmedian family income for rental units; or\n\n(b)\n\na minimum of fifty percent on-site income-restricted dwelling units for 80% or lower\nmedian family income for ownership units.\n\n(C)\n\nFee in Lieu of Providing On-site Water Reuse System.\n\n(1)\n\nThe director may approve the payment of a fee in lieu of providing an on-site water\nreuse system if:\n\n(a)\n\nthe applicant submits a written request in a manner prescribed by the director at\nthe time of site plan submittal; and\n\n(b)\n\nthe director determines that the qualifying multi-family building is more than 500\nfeet from the centralized reclaimed system; and\n\n(c)\n\nthe applicant installs separate distribution plumbing to all non-potable fixtures\nwithin the project for a future centralized connection in accordance with the Utilities\nCriteria Manual before issuance of a certificate of occupancy.\n\n(2)\n\nThe amount of the fee in lieu shall be established by separate ordinance.\n\n(3)\n\nFor a site plan application filed on or after April 1, 2024, the fee in lieu shall\nbe calculated using the rate set forth in the fee schedule in effect at the time the\nsite plan application was filed.\n\nSource: Ord. No. 20210930-117, Pt. 4, 12-1-23; Ord. No. 20240307-037, Pts. 1, 5, 3-18-24.\n",
  "entities": [
    {
      "text": "CHAPTER 25-9",
      "label": "SECTION_REF",
      "start": 3,
      "end": 15,
      "normalized": {
        "type": "chapter",
        "number": "25-9",
        "full_reference": "Chapter 25-9"
      }
    },
    {
      "text": "Section 13-3-1",
      "label": "SECTION_REF",
      "start": 154,
      "end": 168,
      "normalized": {
        "section": "13-3-1",
        "subsection": null,
        "full_reference": "13-3-1"
      }
    },
    {
      "text": "Chapter 25-9",
      "label": "SECTION_REF",
      "start": 350,
      "end": 362,
      "normalized": {
        "type": "chapter",
        "number": "25-9",
        "full_reference": "Chapter 25-9"
      }
    },
    {
      "text": "Article 3",
      "label": "SECTION_REF",
      "start": 364,
      "end": 373,
      "normalized": {
        "type": "article",
        "number": 3,
        "full_reference": "Article 3"
      }
    },
    {
      "text": "Section 13-3-5",
      "label": "SECTION_REF",
      "start": 479,
      "end": 493,
      "normalized": {
        "section": "13-3-5",
        "subsection": null,
        "full_reference": "13-3-5"
      }
    },
    {
      "text": "100 feet",
      "label": "MEASUREMENT",
      "start": 1547,
      "end": 1555,
      "normalized": {
        "value": 100,
        "unit": "ft",
        "original": "100 feet"
      }
    },
    {
      "text": "Section 25-9-62",
      "label": "SECTION_REF",
      "start": 2212,
      "end": 2227,
      "normalized": {
        "section": "25-9-62",
        "subsection": null,
        "full_reference": "25-9-62"
      }
    },
    {
      "text": "up to",
      "label": "OPERATOR",
      "start": 2280,
      "end": 2285,
      "normalized": "lte"
    },
    {
      "text": "15%",
      "label": "MEASUREMENT",
      "start": 2286,
      "end": 2289,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15%"
      }
    },
    {
      "text": "Section 25-9-67",
      "label": "SECTION_REF",
      "start": 2454,
      "end": 2469,
      "normalized": {
        "section": "25-9-67",
        "subsection": null,
        "full_reference": "25-9-67"
      }
    },
    {
      "text": "minimum",
      "label": "OPERATOR",
      "start": 3688,
      "end": 3695,
      "normalized": "min"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 3713,
      "end": 3721,
      "normalized": "required"
    },
    {
      "text": "retail",
      "label": "USE_TYPE",
      "start": 5475,
      "end": 5481,
      "normalized": "retail"
    },
    {
      "text": "retail",
      "label": "USE_TYPE",
      "start": 5654,
      "end": 5660,
      "normalized": "retail"
    },
    {
      "text": "allowed",
      "label": "OPERATOR",
      "start": 5691,
      "end": 5698,
      "normalized": "permitted"
    },
    {
      "text": "retail",
      "label": "USE_TYPE",
      "start": 5902,
      "end": 5908,
      "normalized": "retail"
    },
    {
      "text": "allowed",
      "label": "OPERATOR",
      "start": 5939,
      "end": 5946,
      "normalized": "permitted"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 6199,
      "end": 6207,
      "normalized": "required"
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 6307,
      "end": 6316,
      "normalized": "gt"
    },
    {
      "text": "100 feet",
      "label": "MEASUREMENT",
      "start": 6317,
      "end": 6325,
      "normalized": {
        "value": 100,
        "unit": "ft",
        "original": "100 feet"
      }
    },
    {
      "text": "100 feet",
      "label": "MEASUREMENT",
      "start": 6438,
      "end": 6446,
      "normalized": {
        "value": 100,
        "unit": "ft",
        "original": "100 feet"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 7035,
      "end": 7043,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 7424,
      "end": 7432,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 7567,
      "end": 7575,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 7677,
      "end": 7685,
      "normalized": "required"
    },
    {
      "text": "Section 25-9-3",
      "label": "SECTION_REF",
      "start": 7926,
      "end": 7940,
      "normalized": {
        "section": "25-9-3",
        "subsection": null,
        "full_reference": "25-9-3"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 8662,
      "end": 8670,
      "normalized": "required"
    },
    {
      "text": "limited",
      "label": "OPERATOR",
      "start": 8843,
      "end": 8850,
      "normalized": "limited"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 9067,
      "end": 9075,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 9352,
      "end": 9360,
      "normalized": "required"
    },
    {
      "text": "Section 25-9-35",
      "label": "SECTION_REF",
      "start": 9633,
      "end": 9648,
      "normalized": {
        "section": "25-9-35",
        "subsection": null,
        "full_reference": "25-9-35"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 10411,
      "end": 10419,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 11085,
      "end": 11093,
      "normalized": "required"
    },
    {
      "text": "permitted",
      "label": "OPERATOR",
      "start": 16932,
      "end": 16941,
      "normalized": "permitted"
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 17160,
      "end": 17169,
      "normalized": "gt"
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 17248,
      "end": 17257,
      "normalized": "gt"
    },
    {
      "text": "Section 25-9-64",
      "label": "SECTION_REF",
      "start": 17787,
      "end": 17802,
      "normalized": {
        "section": "25-9-64",
        "subsection": null,
        "full_reference": "25-9-64"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 18397,
      "end": 18399,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "33%",
      "label": "MEASUREMENT",
      "start": 18402,
      "end": 18405,
      "normalized": {
        "value": 33.0,
        "unit": "%",
        "original": "33%"
      }
    },
    {
      "text": "50%",
      "label": "MEASUREMENT",
      "start": 18408,
      "end": 18411,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50%"
      }
    },
    {
      "text": "66%",
      "label": "MEASUREMENT",
      "start": 18414,
      "end": 18417,
      "normalized": {
        "value": 66.0,
        "unit": "%",
        "original": "66%"
      }
    },
    {
      "text": "73%",
      "label": "MEASUREMENT",
      "start": 18420,
      "end": 18423,
      "normalized": {
        "value": 73.0,
        "unit": "%",
        "original": "73%"
      }
    },
    {
      "text": "78%",
      "label": "MEASUREMENT",
      "start": 18426,
      "end": 18429,
      "normalized": {
        "value": 78.0,
        "unit": "%",
        "original": "78%"
      }
    },
    {
      "text": "81%",
      "label": "MEASUREMENT",
      "start": 18432,
      "end": 18435,
      "normalized": {
        "value": 81.0,
        "unit": "%",
        "original": "81%"
      }
    },
    {
      "text": "83%",
      "label": "MEASUREMENT",
      "start": 18438,
      "end": 18441,
      "normalized": {
        "value": 83.0,
        "unit": "%",
        "original": "83%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 18457,
      "end": 18459,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "25%",
      "label": "MEASUREMENT",
      "start": 18462,
      "end": 18465,
      "normalized": {
        "value": 25.0,
        "unit": "%",
        "original": "25%"
      }
    },
    {
      "text": "50%",
      "label": "MEASUREMENT",
      "start": 18468,
      "end": 18471,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50%"
      }
    },
    {
      "text": "60%",
      "label": "MEASUREMENT",
      "start": 18474,
      "end": 18477,
      "normalized": {
        "value": 60.0,
        "unit": "%",
        "original": "60%"
      }
    },
    {
      "text": "66%",
      "label": "MEASUREMENT",
      "start": 18480,
      "end": 18483,
      "normalized": {
        "value": 66.0,
        "unit": "%",
        "original": "66%"
      }
    },
    {
      "text": "71%",
      "label": "MEASUREMENT",
      "start": 18486,
      "end": 18489,
      "normalized": {
        "value": 71.0,
        "unit": "%",
        "original": "71%"
      }
    },
    {
      "text": "75%",
      "label": "MEASUREMENT",
      "start": 18492,
      "end": 18495,
      "normalized": {
        "value": 75.0,
        "unit": "%",
        "original": "75%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 18515,
      "end": 18517,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "33%",
      "label": "MEASUREMENT",
      "start": 18520,
      "end": 18523,
      "normalized": {
        "value": 33.0,
        "unit": "%",
        "original": "33%"
      }
    },
    {
      "text": "47%",
      "label": "MEASUREMENT",
      "start": 18526,
      "end": 18529,
      "normalized": {
        "value": 47.0,
        "unit": "%",
        "original": "47%"
      }
    },
    {
      "text": "56%",
      "label": "MEASUREMENT",
      "start": 18532,
      "end": 18535,
      "normalized": {
        "value": 56.0,
        "unit": "%",
        "original": "56%"
      }
    },
    {
      "text": "62%",
      "label": "MEASUREMENT",
      "start": 18538,
      "end": 18541,
      "normalized": {
        "value": 62.0,
        "unit": "%",
        "original": "62%"
      }
    },
    {
      "text": "66%",
      "label": "MEASUREMENT",
      "start": 18544,
      "end": 18547,
      "normalized": {
        "value": 66.0,
        "unit": "%",
        "original": "66%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 18573,
      "end": 18575,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "20%",
      "label": "MEASUREMENT",
      "start": 18578,
      "end": 18581,
      "normalized": {
        "value": 20.0,
        "unit": "%",
        "original": "20%"
      }
    },
    {
      "text": "33%",
      "label": "MEASUREMENT",
      "start": 18584,
      "end": 18587,
      "normalized": {
        "value": 33.0,
        "unit": "%",
        "original": "33%"
      }
    },
    {
      "text": "43%",
      "label": "MEASUREMENT",
      "start": 18590,
      "end": 18593,
      "normalized": {
        "value": 43.0,
        "unit": "%",
        "original": "43%"
      }
    },
    {
      "text": "50%",
      "label": "MEASUREMENT",
      "start": 18596,
      "end": 18599,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 18629,
      "end": 18631,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "17%",
      "label": "MEASUREMENT",
      "start": 18634,
      "end": 18637,
      "normalized": {
        "value": 17.0,
        "unit": "%",
        "original": "17%"
      }
    },
    {
      "text": "29%",
      "label": "MEASUREMENT",
      "start": 18640,
      "end": 18643,
      "normalized": {
        "value": 29.0,
        "unit": "%",
        "original": "29%"
      }
    },
    {
      "text": "37%",
      "label": "MEASUREMENT",
      "start": 18646,
      "end": 18649,
      "normalized": {
        "value": 37.0,
        "unit": "%",
        "original": "37%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 18685,
      "end": 18687,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "14%",
      "label": "MEASUREMENT",
      "start": 18690,
      "end": 18693,
      "normalized": {
        "value": 14.0,
        "unit": "%",
        "original": "14%"
      }
    },
    {
      "text": "25%",
      "label": "MEASUREMENT",
      "start": 18696,
      "end": 18699,
      "normalized": {
        "value": 25.0,
        "unit": "%",
        "original": "25%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 18739,
      "end": 18741,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "12%",
      "label": "MEASUREMENT",
      "start": 18744,
      "end": 18747,
      "normalized": {
        "value": 12.0,
        "unit": "%",
        "original": "12%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 18793,
      "end": 18795,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 19258,
      "end": 19260,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "33%",
      "label": "MEASUREMENT",
      "start": 19263,
      "end": 19266,
      "normalized": {
        "value": 33.0,
        "unit": "%",
        "original": "33%"
      }
    },
    {
      "text": "47%",
      "label": "MEASUREMENT",
      "start": 19269,
      "end": 19272,
      "normalized": {
        "value": 47.0,
        "unit": "%",
        "original": "47%"
      }
    },
    {
      "text": "56%",
      "label": "MEASUREMENT",
      "start": 19275,
      "end": 19278,
      "normalized": {
        "value": 56.0,
        "unit": "%",
        "original": "56%"
      }
    },
    {
      "text": "62%",
      "label": "MEASUREMENT",
      "start": 19281,
      "end": 19284,
      "normalized": {
        "value": 62.0,
        "unit": "%",
        "original": "62%"
      }
    },
    {
      "text": "66%",
      "label": "MEASUREMENT",
      "start": 19287,
      "end": 19290,
      "normalized": {
        "value": 66.0,
        "unit": "%",
        "original": "66%"
      }
    },
    {
      "text": "73%",
      "label": "MEASUREMENT",
      "start": 19293,
      "end": 19296,
      "normalized": {
        "value": 73.0,
        "unit": "%",
        "original": "73%"
      }
    },
    {
      "text": "78%",
      "label": "MEASUREMENT",
      "start": 19299,
      "end": 19302,
      "normalized": {
        "value": 78.0,
        "unit": "%",
        "original": "78%"
      }
    },
    {
      "text": "81%",
      "label": "MEASUREMENT",
      "start": 19305,
      "end": 19308,
      "normalized": {
        "value": 81.0,
        "unit": "%",
        "original": "81%"
      }
    },
    {
      "text": "83%",
      "label": "MEASUREMENT",
      "start": 19311,
      "end": 19314,
      "normalized": {
        "value": 83.0,
        "unit": "%",
        "original": "83%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 19330,
      "end": 19332,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "20%",
      "label": "MEASUREMENT",
      "start": 19335,
      "end": 19338,
      "normalized": {
        "value": 20.0,
        "unit": "%",
        "original": "20%"
      }
    },
    {
      "text": "33%",
      "label": "MEASUREMENT",
      "start": 19341,
      "end": 19344,
      "normalized": {
        "value": 33.0,
        "unit": "%",
        "original": "33%"
      }
    },
    {
      "text": "43%",
      "label": "MEASUREMENT",
      "start": 19347,
      "end": 19350,
      "normalized": {
        "value": 43.0,
        "unit": "%",
        "original": "43%"
      }
    },
    {
      "text": "50%",
      "label": "MEASUREMENT",
      "start": 19353,
      "end": 19356,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50%"
      }
    },
    {
      "text": "60%",
      "label": "MEASUREMENT",
      "start": 19359,
      "end": 19362,
      "normalized": {
        "value": 60.0,
        "unit": "%",
        "original": "60%"
      }
    },
    {
      "text": "66%",
      "label": "MEASUREMENT",
      "start": 19365,
      "end": 19368,
      "normalized": {
        "value": 66.0,
        "unit": "%",
        "original": "66%"
      }
    },
    {
      "text": "71%",
      "label": "MEASUREMENT",
      "start": 19371,
      "end": 19374,
      "normalized": {
        "value": 71.0,
        "unit": "%",
        "original": "71%"
      }
    },
    {
      "text": "75%",
      "label": "MEASUREMENT",
      "start": 19377,
      "end": 19380,
      "normalized": {
        "value": 75.0,
        "unit": "%",
        "original": "75%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 19400,
      "end": 19402,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "17%",
      "label": "MEASUREMENT",
      "start": 19405,
      "end": 19408,
      "normalized": {
        "value": 17.0,
        "unit": "%",
        "original": "17%"
      }
    },
    {
      "text": "29%",
      "label": "MEASUREMENT",
      "start": 19411,
      "end": 19414,
      "normalized": {
        "value": 29.0,
        "unit": "%",
        "original": "29%"
      }
    },
    {
      "text": "37%",
      "label": "MEASUREMENT",
      "start": 19417,
      "end": 19420,
      "normalized": {
        "value": 37.0,
        "unit": "%",
        "original": "37%"
      }
    },
    {
      "text": "50%",
      "label": "MEASUREMENT",
      "start": 19423,
      "end": 19426,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50%"
      }
    },
    {
      "text": "58%",
      "label": "MEASUREMENT",
      "start": 19429,
      "end": 19432,
      "normalized": {
        "value": 58.0,
        "unit": "%",
        "original": "58%"
      }
    },
    {
      "text": "64%",
      "label": "MEASUREMENT",
      "start": 19435,
      "end": 19438,
      "normalized": {
        "value": 64.0,
        "unit": "%",
        "original": "64%"
      }
    },
    {
      "text": "69%",
      "label": "MEASUREMENT",
      "start": 19441,
      "end": 19444,
      "normalized": {
        "value": 69.0,
        "unit": "%",
        "original": "69%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 19470,
      "end": 19472,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "14%",
      "label": "MEASUREMENT",
      "start": 19475,
      "end": 19478,
      "normalized": {
        "value": 14.0,
        "unit": "%",
        "original": "14%"
      }
    },
    {
      "text": "25%",
      "label": "MEASUREMENT",
      "start": 19481,
      "end": 19484,
      "normalized": {
        "value": 25.0,
        "unit": "%",
        "original": "25%"
      }
    },
    {
      "text": "40%",
      "label": "MEASUREMENT",
      "start": 19487,
      "end": 19490,
      "normalized": {
        "value": 40.0,
        "unit": "%",
        "original": "40%"
      }
    },
    {
      "text": "50%",
      "label": "MEASUREMENT",
      "start": 19493,
      "end": 19496,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50%"
      }
    },
    {
      "text": "57%",
      "label": "MEASUREMENT",
      "start": 19499,
      "end": 19502,
      "normalized": {
        "value": 57.0,
        "unit": "%",
        "original": "57%"
      }
    },
    {
      "text": "62%",
      "label": "MEASUREMENT",
      "start": 19505,
      "end": 19508,
      "normalized": {
        "value": 62.0,
        "unit": "%",
        "original": "62%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 19538,
      "end": 19540,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "12%",
      "label": "MEASUREMENT",
      "start": 19543,
      "end": 19546,
      "normalized": {
        "value": 12.0,
        "unit": "%",
        "original": "12%"
      }
    },
    {
      "text": "30%",
      "label": "MEASUREMENT",
      "start": 19549,
      "end": 19552,
      "normalized": {
        "value": 30.0,
        "unit": "%",
        "original": "30%"
      }
    },
    {
      "text": "42%",
      "label": "MEASUREMENT",
      "start": 19555,
      "end": 19558,
      "normalized": {
        "value": 42.0,
        "unit": "%",
        "original": "42%"
      }
    },
    {
      "text": "50%",
      "label": "MEASUREMENT",
      "start": 19561,
      "end": 19564,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50%"
      }
    },
    {
      "text": "56%",
      "label": "MEASUREMENT",
      "start": 19567,
      "end": 19570,
      "normalized": {
        "value": 56.0,
        "unit": "%",
        "original": "56%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 19606,
      "end": 19608,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "20%",
      "label": "MEASUREMENT",
      "start": 19611,
      "end": 19614,
      "normalized": {
        "value": 20.0,
        "unit": "%",
        "original": "20%"
      }
    },
    {
      "text": "33%",
      "label": "MEASUREMENT",
      "start": 19617,
      "end": 19620,
      "normalized": {
        "value": 33.0,
        "unit": "%",
        "original": "33%"
      }
    },
    {
      "text": "43%",
      "label": "MEASUREMENT",
      "start": 19623,
      "end": 19626,
      "normalized": {
        "value": 43.0,
        "unit": "%",
        "original": "43%"
      }
    },
    {
      "text": "50%",
      "label": "MEASUREMENT",
      "start": 19629,
      "end": 19632,
      "normalized": {
        "value": 50.0,
        "unit": "%",
        "original": "50%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 19672,
      "end": 19674,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "17%",
      "label": "MEASUREMENT",
      "start": 19677,
      "end": 19680,
      "normalized": {
        "value": 17.0,
        "unit": "%",
        "original": "17%"
      }
    },
    {
      "text": "29%",
      "label": "MEASUREMENT",
      "start": 19683,
      "end": 19686,
      "normalized": {
        "value": 29.0,
        "unit": "%",
        "original": "29%"
      }
    },
    {
      "text": "37%",
      "label": "MEASUREMENT",
      "start": 19689,
      "end": 19692,
      "normalized": {
        "value": 37.0,
        "unit": "%",
        "original": "37%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 19738,
      "end": 19740,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "14%",
      "label": "MEASUREMENT",
      "start": 19743,
      "end": 19746,
      "normalized": {
        "value": 14.0,
        "unit": "%",
        "original": "14%"
      }
    },
    {
      "text": "25%",
      "label": "MEASUREMENT",
      "start": 19749,
      "end": 19752,
      "normalized": {
        "value": 25.0,
        "unit": "%",
        "original": "25%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 19802,
      "end": 19804,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "12%",
      "label": "MEASUREMENT",
      "start": 19807,
      "end": 19810,
      "normalized": {
        "value": 12.0,
        "unit": "%",
        "original": "12%"
      }
    },
    {
      "text": "0%",
      "label": "MEASUREMENT",
      "start": 19866,
      "end": 19868,
      "normalized": {
        "value": 0.0,
        "unit": "%",
        "original": "0%"
      }
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 20189,
      "end": 20199,
      "normalized": "lte"
    },
    {
      "text": "15%",
      "label": "MEASUREMENT",
      "start": 20200,
      "end": 20203,
      "normalized": {
        "value": 15.0,
        "unit": "%",
        "original": "15%"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 20908,
      "end": 20916,
      "normalized": "required"
    },
    {
      "text": "Section 25-9-62",
      "label": "SECTION_REF",
      "start": 22199,
      "end": 22214,
      "normalized": {
        "section": "25-9-62",
        "subsection": null,
        "full_reference": "25-9-62"
      }
    },
    {
      "text": "Section 13-3-17",
      "label": "SECTION_REF",
      "start": 22498,
      "end": 22513,
      "normalized": {
        "section": "13-3-17",
        "subsection": null,
        "full_reference": "13-3-17"
      }
    },
    {
      "text": "limited",
      "label": "OPERATOR",
      "start": 22875,
      "end": 22882,
      "normalized": "limited"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 23144,
      "end": 23152,
      "normalized": "required"
    },
    {
      "text": "Section 25-9-67",
      "label": "SECTION_REF",
      "start": 23156,
      "end": 23171,
      "normalized": {
        "section": "25-9-67",
        "subsection": null,
        "full_reference": "25-9-67"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 26438,
      "end": 26446,
      "normalized": "required"
    },
    {
      "text": "Section 25-9-96",
      "label": "SECTION_REF",
      "start": 27958,
      "end": 27973,
      "normalized": {
        "section": "25-9-96",
        "subsection": null,
        "full_reference": "25-9-96"
      }
    },
    {
      "text": "Section 14-7-1",
      "label": "SECTION_REF",
      "start": 29835,
      "end": 29849,
      "normalized": {
        "section": "14-7-1",
        "subsection": null,
        "full_reference": "14-7-1"
      }
    },
    {
      "text": "Section 25-4-3",
      "label": "SECTION_REF",
      "start": 30150,
      "end": 30164,
      "normalized": {
        "section": "25-4-3",
        "subsection": null,
        "full_reference": "25-4-3"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 31723,
      "end": 31731,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 31773,
      "end": 31781,
      "normalized": "required"
    },
    {
      "text": "less than",
      "label": "OPERATOR",
      "start": 32203,
      "end": 32212,
      "normalized": "lt"
    },
    {
      "text": "100 acres",
      "label": "MEASUREMENT",
      "start": 32213,
      "end": 32222,
      "normalized": {
        "value": 100,
        "unit": "acre",
        "original": "100 acres"
      }
    },
    {
      "text": "1,000 feet",
      "label": "MEASUREMENT",
      "start": 33021,
      "end": 33031,
      "normalized": {
        "value": 1000,
        "unit": "ft",
        "original": "1,000 feet"
      }
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 33108,
      "end": 33118,
      "normalized": "lte"
    },
    {
      "text": "five percent",
      "label": "MEASUREMENT",
      "start": 33119,
      "end": 33131,
      "normalized": {
        "value": "five percent",
        "unit": null,
        "original": "five percent"
      }
    },
    {
      "text": "at least",
      "label": "OPERATOR",
      "start": 33937,
      "end": 33945,
      "normalized": "gte"
    },
    {
      "text": "Section 13-1-326",
      "label": "SECTION_REF",
      "start": 34024,
      "end": 34040,
      "normalized": {
        "section": "13-1-326",
        "subsection": null,
        "full_reference": "13-1-326"
      }
    },
    {
      "text": "Section 13-1-327",
      "label": "SECTION_REF",
      "start": 34386,
      "end": 34402,
      "normalized": {
        "section": "13-1-327",
        "subsection": null,
        "full_reference": "13-1-327"
      }
    },
    {
      "text": "Section 13-4-4",
      "label": "SECTION_REF",
      "start": 34715,
      "end": 34729,
      "normalized": {
        "section": "13-4-4",
        "subsection": null,
        "full_reference": "13-4-4"
      }
    },
    {
      "text": "Section 13-1-327",
      "label": "SECTION_REF",
      "start": 35396,
      "end": 35412,
      "normalized": {
        "section": "13-1-327",
        "subsection": null,
        "full_reference": "13-1-327"
      }
    },
    {
      "text": "Section 13-1-328",
      "label": "SECTION_REF",
      "start": 35681,
      "end": 35697,
      "normalized": {
        "section": "13-1-328",
        "subsection": null,
        "full_reference": "13-1-328"
      }
    },
    {
      "text": "Section 13-1-328",
      "label": "SECTION_REF",
      "start": 36184,
      "end": 36200,
      "normalized": {
        "section": "13-1-328",
        "subsection": null,
        "full_reference": "13-1-328"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 36440,
      "end": 36448,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 36637,
      "end": 36645,
      "normalized": "required"
    },
    {
      "text": "Section 25-9-158",
      "label": "SECTION_REF",
      "start": 36649,
      "end": 36665,
      "normalized": {
        "section": "25-9-158",
        "subsection": null,
        "full_reference": "25-9-158"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 37154,
      "end": 37162,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 37231,
      "end": 37239,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 37299,
      "end": 37307,
      "normalized": "required"
    },
    {
      "text": "Section 13-1-330",
      "label": "SECTION_REF",
      "start": 38044,
      "end": 38060,
      "normalized": {
        "section": "13-1-330",
        "subsection": null,
        "full_reference": "13-1-330"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 38330,
      "end": 38338,
      "normalized": "required"
    },
    {
      "text": "Section 13-1-331",
      "label": "SECTION_REF",
      "start": 38362,
      "end": 38378,
      "normalized": {
        "section": "13-1-331",
        "subsection": null,
        "full_reference": "13-1-331"
      }
    },
    {
      "text": "Section 13-1-332",
      "label": "SECTION_REF",
      "start": 39309,
      "end": 39325,
      "normalized": {
        "section": "13-1-332",
        "subsection": null,
        "full_reference": "13-1-332"
      }
    },
    {
      "text": "Section 13-4-11",
      "label": "SECTION_REF",
      "start": 40168,
      "end": 40183,
      "normalized": {
        "section": "13-4-11",
        "subsection": null,
        "full_reference": "13-4-11"
      }
    },
    {
      "text": "Chapter 15-10",
      "label": "SECTION_REF",
      "start": 42418,
      "end": 42431,
      "normalized": {
        "type": "chapter",
        "number": "15-10",
        "full_reference": "Chapter 15-10"
      }
    },
    {
      "text": "Chapter 25-12",
      "label": "SECTION_REF",
      "start": 42462,
      "end": 42475,
      "normalized": {
        "type": "chapter",
        "number": "25-12",
        "full_reference": "Chapter 25-12"
      }
    },
    {
      "text": "Article 6",
      "label": "SECTION_REF",
      "start": 42477,
      "end": 42486,
      "normalized": {
        "type": "article",
        "number": 6,
        "full_reference": "Article 6"
      }
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 44852,
      "end": 44862,
      "normalized": "lte"
    },
    {
      "text": "102 percent",
      "label": "MEASUREMENT",
      "start": 44863,
      "end": 44874,
      "normalized": {
        "value": 102.0,
        "unit": "%",
        "original": "102 percent"
      }
    },
    {
      "text": "Section 13-4-6",
      "label": "SECTION_REF",
      "start": 45360,
      "end": 45374,
      "normalized": {
        "section": "13-4-6",
        "subsection": null,
        "full_reference": "13-4-6"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 45626,
      "end": 45634,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 46075,
      "end": 46083,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 46443,
      "end": 46451,
      "normalized": "required"
    },
    {
      "text": "at least",
      "label": "OPERATOR",
      "start": 46790,
      "end": 46798,
      "normalized": "gte"
    },
    {
      "text": "90 percent",
      "label": "MEASUREMENT",
      "start": 46799,
      "end": 46809,
      "normalized": {
        "value": 90.0,
        "unit": "%",
        "original": "90 percent"
      }
    },
    {
      "text": "Section 13-4-8",
      "label": "SECTION_REF",
      "start": 46970,
      "end": 46984,
      "normalized": {
        "section": "13-4-8",
        "subsection": null,
        "full_reference": "13-4-8"
      }
    },
    {
      "text": "limited",
      "label": "OPERATOR",
      "start": 47185,
      "end": 47192,
      "normalized": "limited"
    },
    {
      "text": "Section 13-4-9",
      "label": "SECTION_REF",
      "start": 48133,
      "end": 48147,
      "normalized": {
        "section": "13-4-9",
        "subsection": null,
        "full_reference": "13-4-9"
      }
    },
    {
      "text": "Article 1",
      "label": "SECTION_REF",
      "start": 48818,
      "end": 48827,
      "normalized": {
        "type": "article",
        "number": 1,
        "full_reference": "Article 1"
      }
    },
    {
      "text": "Division 2",
      "label": "SECTION_REF",
      "start": 48829,
      "end": 48839,
      "normalized": {
        "type": "division",
        "number": 2,
        "full_reference": "Division 2"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 49223,
      "end": 49231,
      "normalized": "required"
    },
    {
      "text": "Section 13-1-362",
      "label": "SECTION_REF",
      "start": 49564,
      "end": 49580,
      "normalized": {
        "section": "13-1-362",
        "subsection": null,
        "full_reference": "13-1-362"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 50800,
      "end": 50808,
      "normalized": "required"
    },
    {
      "text": "Section 13-1-362",
      "label": "SECTION_REF",
      "start": 50837,
      "end": 50853,
      "normalized": {
        "section": "13-1-362",
        "subsection": null,
        "full_reference": "13-1-362"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 52296,
      "end": 52304,
      "normalized": "required"
    },
    {
      "text": "Section 13-1-364",
      "label": "SECTION_REF",
      "start": 52563,
      "end": 52579,
      "normalized": {
        "section": "13-1-364",
        "subsection": null,
        "full_reference": "13-1-364"
      }
    },
    {
      "text": "Section 13-1-365",
      "label": "SECTION_REF",
      "start": 53089,
      "end": 53105,
      "normalized": {
        "section": "13-1-365",
        "subsection": null,
        "full_reference": "13-1-365"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 53429,
      "end": 53437,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 55253,
      "end": 55261,
      "normalized": "required"
    },
    {
      "text": "Section 13-1-362",
      "label": "SECTION_REF",
      "start": 55290,
      "end": 55306,
      "normalized": {
        "section": "13-1-362",
        "subsection": null,
        "full_reference": "13-1-362"
      }
    },
    {
      "text": "permitted",
      "label": "OPERATOR",
      "start": 55643,
      "end": 55652,
      "normalized": "permitted"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 55807,
      "end": 55818,
      "normalized": "residential"
    },
    {
      "text": "density",
      "label": "METRIC",
      "start": 55819,
      "end": 55826,
      "normalized": "density_max"
    },
    {
      "text": "maximum",
      "label": "OPERATOR",
      "start": 55837,
      "end": 55844,
      "normalized": "max"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 55845,
      "end": 55856,
      "normalized": "residential"
    },
    {
      "text": "density",
      "label": "METRIC",
      "start": 55857,
      "end": 55864,
      "normalized": "density_max"
    },
    {
      "text": "maximum",
      "label": "OPERATOR",
      "start": 55969,
      "end": 55976,
      "normalized": "max"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 56224,
      "end": 56232,
      "normalized": "required"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 56962,
      "end": 56973,
      "normalized": "residential"
    },
    {
      "text": "dwelling units",
      "label": "USE_TYPE",
      "start": 57555,
      "end": 57569,
      "normalized": "dwelling_unit"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 57573,
      "end": 57584,
      "normalized": "residential"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 57605,
      "end": 57616,
      "normalized": "residential"
    },
    {
      "text": "density",
      "label": "METRIC",
      "start": 57617,
      "end": 57624,
      "normalized": "density_max"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 57633,
      "end": 57644,
      "normalized": "residential"
    },
    {
      "text": "Section 13-1-363",
      "label": "SECTION_REF",
      "start": 58310,
      "end": 58326,
      "normalized": {
        "section": "13-1-363",
        "subsection": null,
        "full_reference": "13-1-363"
      }
    },
    {
      "text": "Section 13-1-372",
      "label": "SECTION_REF",
      "start": 58569,
      "end": 58585,
      "normalized": {
        "section": "13-1-372",
        "subsection": null,
        "full_reference": "13-1-372"
      }
    },
    {
      "text": "Section 13-1-370",
      "label": "SECTION_REF",
      "start": 58721,
      "end": 58737,
      "normalized": {
        "section": "13-1-370",
        "subsection": null,
        "full_reference": "13-1-370"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 58958,
      "end": 58966,
      "normalized": "required"
    },
    {
      "text": "Section 13-1-370",
      "label": "SECTION_REF",
      "start": 58991,
      "end": 59007,
      "normalized": {
        "section": "13-1-370",
        "subsection": null,
        "full_reference": "13-1-370"
      }
    },
    {
      "text": "Section 25-9-283",
      "label": "SECTION_REF",
      "start": 59134,
      "end": 59150,
      "normalized": {
        "section": "25-9-283",
        "subsection": null,
        "full_reference": "25-9-283"
      }
    },
    {
      "text": "Section 13-1-371",
      "label": "SECTION_REF",
      "start": 59448,
      "end": 59464,
      "normalized": {
        "section": "13-1-371",
        "subsection": null,
        "full_reference": "13-1-371"
      }
    },
    {
      "text": "Section 13-1-371",
      "label": "SECTION_REF",
      "start": 59795,
      "end": 59811,
      "normalized": {
        "section": "13-1-371",
        "subsection": null,
        "full_reference": "13-1-371"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 60105,
      "end": 60113,
      "normalized": "required"
    },
    {
      "text": "Section 13-1-371",
      "label": "SECTION_REF",
      "start": 60368,
      "end": 60384,
      "normalized": {
        "section": "13-1-371",
        "subsection": null,
        "full_reference": "13-1-371"
      }
    },
    {
      "text": "Section 13-1-371",
      "label": "SECTION_REF",
      "start": 60756,
      "end": 60772,
      "normalized": {
        "section": "13-1-371",
        "subsection": null,
        "full_reference": "13-1-371"
      }
    },
    {
      "text": "Section 14-7-1",
      "label": "SECTION_REF",
      "start": 62047,
      "end": 62061,
      "normalized": {
        "section": "14-7-1",
        "subsection": null,
        "full_reference": "14-7-1"
      }
    },
    {
      "text": "Article 1",
      "label": "SECTION_REF",
      "start": 62672,
      "end": 62681,
      "normalized": {
        "type": "article",
        "number": 1,
        "full_reference": "Article 1"
      }
    },
    {
      "text": "Division 3",
      "label": "SECTION_REF",
      "start": 62683,
      "end": 62693,
      "normalized": {
        "type": "division",
        "number": 3,
        "full_reference": "Division 3"
      }
    },
    {
      "text": "retail",
      "label": "USE_TYPE",
      "start": 63113,
      "end": 63119,
      "normalized": "retail"
    },
    {
      "text": "Section 25-9-326",
      "label": "SECTION_REF",
      "start": 67363,
      "end": 67379,
      "normalized": {
        "section": "25-9-326",
        "subsection": null,
        "full_reference": "25-9-326"
      }
    },
    {
      "text": "single family residence",
      "label": "ZONE",
      "start": 68337,
      "end": 68360,
      "normalized": {
        "code": "SF-3",
        "name": "single family residence",
        "original": "single family residence"
      }
    },
    {
      "text": "commercial",
      "label": "USE_TYPE",
      "start": 68826,
      "end": 68836,
      "normalized": "commercial"
    },
    {
      "text": "industrial",
      "label": "USE_TYPE",
      "start": 68840,
      "end": 68850,
      "normalized": "industrial"
    },
    {
      "text": "minimum",
      "label": "OPERATOR",
      "start": 69141,
      "end": 69148,
      "normalized": "min"
    },
    {
      "text": "10 percent",
      "label": "MEASUREMENT",
      "start": 69152,
      "end": 69162,
      "normalized": {
        "value": 10.0,
        "unit": "%",
        "original": "10 percent"
      }
    },
    {
      "text": "minimum",
      "label": "OPERATOR",
      "start": 69440,
      "end": 69447,
      "normalized": "min"
    },
    {
      "text": "seven percent",
      "label": "MEASUREMENT",
      "start": 69657,
      "end": 69670,
      "normalized": {
        "value": "seven percent",
        "unit": null,
        "original": "seven percent"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 69863,
      "end": 69871,
      "normalized": "required"
    },
    {
      "text": "Section 25-9-331",
      "label": "SECTION_REF",
      "start": 71559,
      "end": 71575,
      "normalized": {
        "section": "25-9-331",
        "subsection": null,
        "full_reference": "25-9-331"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 71778,
      "end": 71786,
      "normalized": "required"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 73345,
      "end": 73356,
      "normalized": "residential"
    },
    {
      "text": "duplex",
      "label": "USE_TYPE",
      "start": 73568,
      "end": 73574,
      "normalized": "duplex"
    },
    {
      "text": "dwelling units",
      "label": "USE_TYPE",
      "start": 73623,
      "end": 73637,
      "normalized": "dwelling_unit"
    },
    {
      "text": "duplex",
      "label": "USE_TYPE",
      "start": 73645,
      "end": 73651,
      "normalized": "duplex"
    },
    {
      "text": "duplex",
      "label": "USE_TYPE",
      "start": 73728,
      "end": 73734,
      "normalized": "duplex"
    },
    {
      "text": "Section 25-9-331",
      "label": "SECTION_REF",
      "start": 74092,
      "end": 74108,
      "normalized": {
        "section": "25-9-331",
        "subsection": null,
        "full_reference": "25-9-331"
      }
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 74190,
      "end": 74199,
      "normalized": "gt"
    },
    {
      "text": "single-family",
      "label": "USE_TYPE",
      "start": 74204,
      "end": 74217,
      "normalized": "single_family"
    },
    {
      "text": "single-family",
      "label": "USE_TYPE",
      "start": 74262,
      "end": 74275,
      "normalized": "single_family"
    },
    {
      "text": "100 feet",
      "label": "MEASUREMENT",
      "start": 75464,
      "end": 75472,
      "normalized": {
        "value": 100,
        "unit": "ft",
        "original": "100 feet"
      }
    },
    {
      "text": "100 feet",
      "label": "MEASUREMENT",
      "start": 75908,
      "end": 75916,
      "normalized": {
        "value": 100,
        "unit": "ft",
        "original": "100 feet"
      }
    },
    {
      "text": "100 feet",
      "label": "MEASUREMENT",
      "start": 76600,
      "end": 76608,
      "normalized": {
        "value": 100,
        "unit": "ft",
        "original": "100 feet"
      }
    },
    {
      "text": "100 feet",
      "label": "MEASUREMENT",
      "start": 77078,
      "end": 77086,
      "normalized": {
        "value": 100,
        "unit": "ft",
        "original": "100 feet"
      }
    },
    {
      "text": "Section 14-7-1",
      "label": "SECTION_REF",
      "start": 77689,
      "end": 77703,
      "normalized": {
        "section": "14-7-1",
        "subsection": null,
        "full_reference": "14-7-1"
      }
    },
    {
      "text": "Section 14-7-1",
      "label": "SECTION_REF",
      "start": 77868,
      "end": 77882,
      "normalized": {
        "section": "14-7-1",
        "subsection": null,
        "full_reference": "14-7-1"
      }
    },
    {
      "text": "Section 14-7-1",
      "label": "SECTION_REF",
      "start": 78069,
      "end": 78083,
      "normalized": {
        "section": "14-7-1",
        "subsection": null,
        "full_reference": "14-7-1"
      }
    },
    {
      "text": "Section 25-9-99",
      "label": "SECTION_REF",
      "start": 78360,
      "end": 78375,
      "normalized": {
        "section": "25-9-99",
        "subsection": null,
        "full_reference": "25-9-99"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 78589,
      "end": 78597,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 79251,
      "end": 79259,
      "normalized": "required"
    },
    {
      "text": "not more than",
      "label": "OPERATOR",
      "start": 79468,
      "end": 79481,
      "normalized": "lte"
    },
    {
      "text": "affordable housing",
      "label": "USE_TYPE",
      "start": 79505,
      "end": 79523,
      "normalized": "affordable_housing"
    },
    {
      "text": "affordable housing",
      "label": "USE_TYPE",
      "start": 79630,
      "end": 79648,
      "normalized": "affordable_housing"
    },
    {
      "text": "affordable housing",
      "label": "USE_TYPE",
      "start": 80105,
      "end": 80123,
      "normalized": "affordable_housing"
    },
    {
      "text": "single family",
      "label": "USE_TYPE",
      "start": 80411,
      "end": 80424,
      "normalized": "single_family"
    },
    {
      "text": "multifamily",
      "label": "USE_TYPE",
      "start": 80433,
      "end": 80444,
      "normalized": "multifamily"
    },
    {
      "text": "affordable housing",
      "label": "USE_TYPE",
      "start": 80554,
      "end": 80572,
      "normalized": "affordable_housing"
    },
    {
      "text": "affordable housing",
      "label": "USE_TYPE",
      "start": 80744,
      "end": 80762,
      "normalized": "affordable_housing"
    },
    {
      "text": "affordable housing",
      "label": "USE_TYPE",
      "start": 80919,
      "end": 80937,
      "normalized": "affordable_housing"
    },
    {
      "text": "equal to",
      "label": "OPERATOR",
      "start": 81416,
      "end": 81424,
      "normalized": "eq"
    },
    {
      "text": "dwelling units",
      "label": "USE_TYPE",
      "start": 81611,
      "end": 81625,
      "normalized": "dwelling_unit"
    },
    {
      "text": "affordable housing",
      "label": "USE_TYPE",
      "start": 81846,
      "end": 81864,
      "normalized": "affordable_housing"
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 82056,
      "end": 82066,
      "normalized": "lte"
    },
    {
      "text": "80 percent",
      "label": "MEASUREMENT",
      "start": 82067,
      "end": 82077,
      "normalized": {
        "value": 80.0,
        "unit": "%",
        "original": "80 percent"
      }
    },
    {
      "text": "no less than",
      "label": "OPERATOR",
      "start": 82270,
      "end": 82282,
      "normalized": "gte"
    },
    {
      "text": "no less than",
      "label": "OPERATOR",
      "start": 82394,
      "end": 82406,
      "normalized": "gte"
    },
    {
      "text": "no less than",
      "label": "OPERATOR",
      "start": 82468,
      "end": 82480,
      "normalized": "gte"
    },
    {
      "text": "no less than",
      "label": "OPERATOR",
      "start": 82576,
      "end": 82588,
      "normalized": "gte"
    },
    {
      "text": "Mixed Use",
      "label": "USE_TYPE",
      "start": 82632,
      "end": 82641,
      "normalized": "mixed_use"
    },
    {
      "text": "Chapter 25-2",
      "label": "SECTION_REF",
      "start": 82734,
      "end": 82746,
      "normalized": {
        "type": "chapter",
        "number": "25-2",
        "full_reference": "Chapter 25-2"
      }
    },
    {
      "text": "Subchapter E",
      "label": "SECTION_REF",
      "start": 82748,
      "end": 82760,
      "normalized": {
        "type": "subchapter",
        "letter": "E",
        "full_reference": "Subchapter E"
      }
    },
    {
      "text": "Downtown Mixed Use",
      "label": "ZONE",
      "start": 82817,
      "end": 82835,
      "normalized": {
        "code": "DMU",
        "name": "downtown mixed use",
        "original": "Downtown Mixed Use"
      }
    },
    {
      "text": "DMU",
      "label": "ZONE",
      "start": 82837,
      "end": 82840,
      "normalized": {
        "code": "DMU",
        "original": "DMU"
      }
    },
    {
      "text": "Central Business District",
      "label": "ZONE",
      "start": 82845,
      "end": 82870,
      "normalized": {
        "code": "CBD",
        "name": "central business district",
        "original": "Central Business District"
      }
    },
    {
      "text": "CBD",
      "label": "ZONE",
      "start": 82872,
      "end": 82875,
      "normalized": {
        "code": "CBD",
        "original": "CBD"
      }
    },
    {
      "text": "not less than",
      "label": "OPERATOR",
      "start": 82976,
      "end": 82989,
      "normalized": "gte"
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 83048,
      "end": 83058,
      "normalized": "lte"
    },
    {
      "text": "120 percent",
      "label": "MEASUREMENT",
      "start": 83059,
      "end": 83070,
      "normalized": {
        "value": 120.0,
        "unit": "%",
        "original": "120 percent"
      }
    },
    {
      "text": "not less than",
      "label": "OPERATOR",
      "start": 83225,
      "end": 83238,
      "normalized": "gte"
    },
    {
      "text": "not exceed",
      "label": "OPERATOR",
      "start": 83297,
      "end": 83307,
      "normalized": "lte"
    },
    {
      "text": "80 percent",
      "label": "MEASUREMENT",
      "start": 83308,
      "end": 83318,
      "normalized": {
        "value": 80.0,
        "unit": "%",
        "original": "80 percent"
      }
    },
    {
      "text": "affordable housing",
      "label": "USE_TYPE",
      "start": 84072,
      "end": 84090,
      "normalized": "affordable_housing"
    },
    {
      "text": "affordable housing",
      "label": "USE_TYPE",
      "start": 84739,
      "end": 84757,
      "normalized": "affordable_housing"
    },
    {
      "text": "multifamily",
      "label": "USE_TYPE",
      "start": 84823,
      "end": 84834,
      "normalized": "multifamily"
    },
    {
      "text": "industrial",
      "label": "USE_TYPE",
      "start": 87813,
      "end": 87823,
      "normalized": "industrial"
    },
    {
      "text": "commercial",
      "label": "USE_TYPE",
      "start": 87827,
      "end": 87837,
      "normalized": "commercial"
    },
    {
      "text": "dwelling units",
      "label": "USE_TYPE",
      "start": 88140,
      "end": 88154,
      "normalized": "dwelling_unit"
    },
    {
      "text": "commercial",
      "label": "USE_TYPE",
      "start": 88156,
      "end": 88166,
      "normalized": "commercial"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 90664,
      "end": 90672,
      "normalized": "required"
    },
    {
      "text": "Chapter 15-1",
      "label": "SECTION_REF",
      "start": 95937,
      "end": 95949,
      "normalized": {
        "type": "chapter",
        "number": "15-1",
        "full_reference": "Chapter 15-1"
      }
    },
    {
      "text": "industrial",
      "label": "USE_TYPE",
      "start": 96247,
      "end": 96257,
      "normalized": "industrial"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 96279,
      "end": 96290,
      "normalized": "residential"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 98499,
      "end": 98507,
      "normalized": "required"
    },
    {
      "text": "office",
      "label": "USE_TYPE",
      "start": 100137,
      "end": 100143,
      "normalized": "office"
    },
    {
      "text": "article 5",
      "label": "SECTION_REF",
      "start": 100978,
      "end": 100987,
      "normalized": {
        "type": "article",
        "number": 5,
        "full_reference": "Article 5"
      }
    },
    {
      "text": "multi-family",
      "label": "USE_TYPE",
      "start": 101061,
      "end": 101073,
      "normalized": "multifamily"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 101082,
      "end": 101093,
      "normalized": "residential"
    },
    {
      "text": "retail",
      "label": "USE_TYPE",
      "start": 101122,
      "end": 101128,
      "normalized": "retail"
    },
    {
      "text": "multi-family",
      "label": "USE_TYPE",
      "start": 101532,
      "end": 101544,
      "normalized": "multifamily"
    },
    {
      "text": "commercial",
      "label": "USE_TYPE",
      "start": 101560,
      "end": 101570,
      "normalized": "commercial"
    },
    {
      "text": "MIXED USE",
      "label": "USE_TYPE",
      "start": 101748,
      "end": 101757,
      "normalized": "mixed_use"
    },
    {
      "text": "commercial",
      "label": "USE_TYPE",
      "start": 101817,
      "end": 101827,
      "normalized": "commercial"
    },
    {
      "text": "multi-family",
      "label": "USE_TYPE",
      "start": 101832,
      "end": 101844,
      "normalized": "multifamily"
    },
    {
      "text": "MULTI-FAMILY",
      "label": "USE_TYPE",
      "start": 101866,
      "end": 101878,
      "normalized": "multifamily"
    },
    {
      "text": "residential",
      "label": "USE_TYPE",
      "start": 101932,
      "end": 101943,
      "normalized": "residential"
    },
    {
      "text": "multi-family",
      "label": "USE_TYPE",
      "start": 102260,
      "end": 102272,
      "normalized": "multifamily"
    },
    {
      "text": "commercial",
      "label": "USE_TYPE",
      "start": 102288,
      "end": 102298,
      "normalized": "commercial"
    },
    {
      "text": "less than",
      "label": "OPERATOR",
      "start": 102441,
      "end": 102450,
      "normalized": "lt"
    },
    {
      "text": "250,000 square feet",
      "label": "MEASUREMENT",
      "start": 102451,
      "end": 102470,
      "normalized": {
        "value": 250000,
        "unit": "sqft",
        "original": "250,000 square feet"
      }
    },
    {
      "text": "250 feet",
      "label": "MEASUREMENT",
      "start": 102874,
      "end": 102882,
      "normalized": {
        "value": 250,
        "unit": "ft",
        "original": "250 feet"
      }
    },
    {
      "text": "500 feet",
      "label": "MEASUREMENT",
      "start": 103258,
      "end": 103266,
      "normalized": {
        "value": 500,
        "unit": "ft",
        "original": "500 feet"
      }
    },
    {
      "text": "multifamily",
      "label": "USE_TYPE",
      "start": 103959,
      "end": 103970,
      "normalized": "multifamily"
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 103989,
      "end": 103998,
      "normalized": "gt"
    },
    {
      "text": "250 feet",
      "label": "MEASUREMENT",
      "start": 103999,
      "end": 104007,
      "normalized": {
        "value": 250,
        "unit": "ft",
        "original": "250 feet"
      }
    },
    {
      "text": "500 feet",
      "label": "MEASUREMENT",
      "start": 104024,
      "end": 104032,
      "normalized": {
        "value": 500,
        "unit": "ft",
        "original": "500 feet"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 104107,
      "end": 104115,
      "normalized": "required"
    },
    {
      "text": "minimum",
      "label": "OPERATOR",
      "start": 104323,
      "end": 104330,
      "normalized": "min"
    },
    {
      "text": "fifty percent",
      "label": "MEASUREMENT",
      "start": 104334,
      "end": 104347,
      "normalized": {
        "value": "fifty percent",
        "unit": null,
        "original": "fifty percent"
      }
    },
    {
      "text": "restricted",
      "label": "OPERATOR",
      "start": 104363,
      "end": 104373,
      "normalized": "restricted"
    },
    {
      "text": "dwelling units",
      "label": "USE_TYPE",
      "start": 104374,
      "end": 104388,
      "normalized": "dwelling_unit"
    },
    {
      "text": "60%",
      "label": "MEASUREMENT",
      "start": 104393,
      "end": 104396,
      "normalized": {
        "value": 60.0,
        "unit": "%",
        "original": "60%"
      }
    },
    {
      "text": "minimum",
      "label": "OPERATOR",
      "start": 104456,
      "end": 104463,
      "normalized": "min"
    },
    {
      "text": "fifty percent",
      "label": "MEASUREMENT",
      "start": 104467,
      "end": 104480,
      "normalized": {
        "value": "fifty percent",
        "unit": null,
        "original": "fifty percent"
      }
    },
    {
      "text": "restricted",
      "label": "OPERATOR",
      "start": 104496,
      "end": 104506,
      "normalized": "restricted"
    },
    {
      "text": "dwelling units",
      "label": "USE_TYPE",
      "start": 104507,
      "end": 104521,
      "normalized": "dwelling_unit"
    },
    {
      "text": "80%",
      "label": "MEASUREMENT",
      "start": 104526,
      "end": 104529,
      "normalized": {
        "value": 80.0,
        "unit": "%",
        "original": "80%"
      }
    },
    {
      "text": "Chapter 25-5",
      "label": "SECTION_REF",
      "start": 104888,
      "end": 104900,
      "normalized": {
        "type": "chapter",
        "number": "25-5",
        "full_reference": "Chapter 25-5"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 105112,
      "end": 105120,
      "normalized": "required"
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 105660,
      "end": 105668,
      "normalized": "required"
    },
    {
      "text": "Chapter 25-5",
      "label": "SECTION_REF",
      "start": 105754,
      "end": 105766,
      "normalized": {
        "type": "chapter",
        "number": "25-5",
        "full_reference": "Chapter 25-5"
      }
    },
    {
      "text": "Chapter 15-13",
      "label": "SECTION_REF",
      "start": 105796,
      "end": 105809,
      "normalized": {
        "type": "chapter",
        "number": "15-13",
        "full_reference": "Chapter 15-13"
      }
    },
    {
      "text": "required",
      "label": "OPERATOR",
      "start": 105881,
      "end": 105889,
      "normalized": "required"
    },
    {
      "text": "minimum",
      "label": "OPERATOR",
      "start": 106190,
      "end": 106197,
      "normalized": "min"
    },
    {
      "text": "fifty percent",
      "label": "MEASUREMENT",
      "start": 106201,
      "end": 106214,
      "normalized": {
        "value": "fifty percent",
        "unit": null,
        "original": "fifty percent"
      }
    },
    {
      "text": "restricted",
      "label": "OPERATOR",
      "start": 106230,
      "end": 106240,
      "normalized": "restricted"
    },
    {
      "text": "dwelling units",
      "label": "USE_TYPE",
      "start": 106241,
      "end": 106255,
      "normalized": "dwelling_unit"
    },
    {
      "text": "60%",
      "label": "MEASUREMENT",
      "start": 106260,
      "end": 106263,
      "normalized": {
        "value": 60.0,
        "unit": "%",
        "original": "60%"
      }
    },
    {
      "text": "minimum",
      "label": "OPERATOR",
      "start": 106323,
      "end": 106330,
      "normalized": "min"
    },
    {
      "text": "fifty percent",
      "label": "MEASUREMENT",
      "start": 106334,
      "end": 106347,
      "normalized": {
        "value": "fifty percent",
        "unit": null,
        "original": "fifty percent"
      }
    },
    {
      "text": "restricted",
      "label": "OPERATOR",
      "start": 106363,
      "end": 106373,
      "normalized": "restricted"
    },
    {
      "text": "dwelling units",
      "label": "USE_TYPE",
      "start": 106374,
      "end": 106388,
      "normalized": "dwelling_unit"
    },
    {
      "text": "80%",
      "label": "MEASUREMENT",
      "start": 106393,
      "end": 106396,
      "normalized": {
        "value": 80.0,
        "unit": "%",
        "original": "80%"
      }
    },
    {
      "text": "multi-family",
      "label": "USE_TYPE",
      "start": 106789,
      "end": 106801,
      "normalized": "multifamily"
    },
    {
      "text": "more than",
      "label": "OPERATOR",
      "start": 106814,
      "end": 106823,
      "normalized": "gt"
    }
  ]
}