{
  "id": "25-1-723",
  "title": "AFFORDABILITY REQUIREMENTS",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "it meets the requirements set forth in Section 25-1-723 (Affordability Requirements).\n\n(B)\n\nExcept for a proposed development participating in a government-operated affordable\nhousing program with stricter requirements, the applicant for a proposed rental development:\n\n(1)\n\nshall incorporate lease provisions that are consistent with:\n\n(a)\n\nthe U.S. Department of Housing and Urban Development (HUD) Section 8 Tenant-Based\nAssistance Housing Choice Voucher (HCV) Program related to the termination of tenancy\nby owner;\n\n(b)\n\nany lease addendum required as a condition to receive city or Austin Housing Finance\nCorporation (AHFC) funds; and\n\n(c)\n\n24 C.F.R. § 245.100 related to a tenant's right to organize; and\n\n(2)\n\nmay not discriminate on the basis of an individual 's source of income as defined\nin Section 5-1-13 (Definitions).\n\n(C)\n\nA proposed development qualifies as a Type 2 development and is eligible for additional\nbonuses if it meets the standards imposed in Subsections (A) and (B) plus one or more\nof the following:\n\n(1)\n\nat least 50 percent of the affordable dwelling units include two or more bedrooms;\n\n(2)\n\nfor a rental development:\n\n(a)\n\nat least 75 percent of the total units or sleeping units serve households whose incomes\naverage 60 percent MFI or below, rounded up to the nearest unit or sleeping unit;\nor\n\n(b)\n\nat least 10 percent of the affordable units or sleeping units serve households with\nincomes of 30 percent MFI or below, rounded up to the nearest unit or sleeping unit;\nor\n\n(3)\n\nfor an owner-occupied development, at least 75 percent of the owner-occupied dwelling\nunits or sleeping units serve households whose incomes average 80 percent MFI or below;\nor\n\n(4)\n\nis located within ¼ mile of an activity corridor designated in the Imagine Austin\nComprehensive Plan and is served by a bus or transit line.\n\n(D)\n\nA proposed development that will require the applicant to redevelop or rebuild an\nexisting multi-family structure is eligible for this program if:\n\n(1)\n\nthe proposed development meets the standards imposed in Subsections (A) and (B);\n\n(2)\n\nthe existing multi-family structure requires extensive repairs and for which rehabilitation\ncosts will exceed 50 percent of the market value, as determined by the building official;\n\n(3)\n\nthe proposed development will replace all existing units that were affordable to a\nhousehold earning 80 percent MFI or below in the previous year and have at least as\nmany bedrooms;\n\n(4)\n\nthe applicant provides current tenants with:\n\n(a)\n\nnotice and information about the proposed development on a form approved by the director;\nand\n\n(b)\n\nrelocation benefits that are consistent with Federal Uniform Relocation Assistance\nand Real Property Acquisition Policies Act of 1970, 42 U.S.C.A. 4601, et seq.; and\n\n(5)\n\nthe applicant grants current tenants the option to lease a unit of comparable affordability\nand size following completion of redevelopment.\n\nSource: 20190509-027, Pt. 2, 5-20-19.\n\n(A)\n\nAn applicant complies with the requirements in this section if the applicant participates\nin a government-operated affordable housing program that imposes, at a minimum, the\nsame affordability requirements.\n\n(B)\n\nA rental development must comply with at least the following:\n\n(1)\n\nat least 50 percent of the total units or sleeping units serve households whose incomes\naverage 60 percent MFI or below; and\n\n(2)\n\nat least 20 percent of the total units or sleeping units serve households with incomes\nof 50 percent MFI or below.\n\n(C)\n\nExcept for a Type 2 owner-occupied development that complies with the requirements\nin Section 25-1-722(C)(3), at least 50 percent of the owner-occupied dwelling units or sleeping units\nmust serve households whose incomes average 80 percent MFI or below.\n\n(D)\n\nIf the number of units required in this section include less than a whole unit, the\nunit number is rounded up to the nearest whole unit.\n\n(E)\n\nThe minimum affordability period for a rental development is the greater of the affordability\nperiod required for development receiving city or Austin Housing Finance Corporation\n(AHFC) funds or 40 years following the issuance of the last certificate of occupancy\nrequired for the qualifying development.\n\n(F)\n\nThe minimum affordability period for an owner-occupied dwelling unit is 99 years following\nthe issuance of a certificate of occupancy for the owner-occupied dwelling unit.\n\n(G)\n\nIn a multi-phased qualifying development, the director may begin the minimum affordability\nperiod upon the issuance of the last certificate of occupancy for each phase.\n\nSource: 20190509-027, Pt. 2, 5-20-19.\n\n(A)\n\nIf the director certifies that a proposed development meets the requirements of this\ndivision, the accountable official is authorized to process a development application\nas a qualifying development.\n\n(B)\n\nBefore the director may certify that a proposed development meets the requirements\nof this division, the applicant shall execute:\n\n(1)\n\nan agreement to preserve the minimum affordability period and related requirements\nimposed by this division; and\n\n(2)\n\na document for recording in the real property records that provides notice of or preserves\nthe minimum affordability requirements imposed by this division.\n\n(C)\n\nThe form of the documents described in Subsection (B) must be approved by the city\nattorney.\n\n(D)\n\nThe director may certify an applicant who complies with the requirements in Subsection\n(B) because the applicant participates in a government-operated affordable housing\nprogram that imposes, at a minimum, the same affordability requirements.\n\nSource: 20190509-027, Pt. 2, 5-20-19.\n\n(A)\n\nFor a rental development, the property owner or the property owner's agent shall provide\nthe director with information that allows the director to verify compliance with the\naffordability requirements. The information shall be provided on an annual basis and\non a form approved by the director.\n\n(B)\n\nIf, for any reason, the director is unable to confirm that the affordability requirements\nwere met during any 12-month period, the preceding 12 months may not be used to satisfy\nthe minimum affordability requirements in Section 25-1-723 (Affordability Requirements).\n\n(C)\n\nAn applicant complies with the requirements in this section if the applicant complies\nwith monitoring and income verification requirements that are imposed and enforced\nas part of a government-operated affordable housing program.\n\n(D)\n\nA person commits an offense if the person fails to comply with the requirement in\nSubsection (A). A culpable mental state is not required, and need not be proved. A\nperson commits a separate offense for each day the person fails to provide the documentation.\nEach offense is punishable by a fine not to exceed $500.\n\nSource: 20190509-027, Pt. 2, 5-20-19.\n\nFootnotes:\n\n--- (**4**) ---\n\n**Editor's note—**\nOrd. No. 20240229-070, Pt. 1, effective March 11, 2024, repealed §§ 25-1-751—25-1-756,\nwhich pertained to Residential Uses in Commercial Districts Incentive Program and\nderived from Ord. No. 20221201-055, Pt. 1, 12-12-22.\n\n### ARTICLE 16. - NEIGHBORHOOD PLAN AMENDMENTS.\n\nIn this article:\n\n(1)\n\nDIRECTOR means the director of the Planning and Development Review Department.\n\n(2)\n\nNEIGHBORHOOD PLAN CONTACT TEAM means the individuals designated to implement an adopted\nneighborhood plan. The neighborhood plan contact team is a neighborhood organization\nthat qualifies as an interested party for purposes of notice, appeal, and other processes\nif all other qualifications for interested party status are satisfied. The neighborhood\nplan contact team is a separate body apart from any other existing or future neighborhood\norganization.\n\nSource: Ord. 20080306-073; Ord. 20091105-069; 20091217-053.\n\nThe director shall conduct a general review of a neighborhood plan not earlier than\nfive years after the adoption of the plan and may recommend amendments of a plan to\nthe Planning Commission and council. The director shall include neighborhood stakeholder\ninput in the review process.\n\nSource: Ord. 20080306-073.\n\nA neighborhood plan amendment may be initiated by:\n\n(1)\n\nfor an amendment regarding an individual property:\n\n(a)\n\nthe owner of the subject property;\n\n(b)\n\nthe council;\n\n(c)\n\nthe Planning Commission;\n\n(d)\n\nthe director;\n\n(e)\n\nthe neighborhood plan contact team for the planning area in which the property is\nlocated; or\n\n(2)\n\nfor an amendment regarding an area-wide or subdistrict-wide recommendation:\n\n(a)\n\nthe council;\n\n(b)\n\nthe Planning Commission;\n\n(c)\n\nthe director; or\n\n(d)\n\nthe neighborhood plan contact team for the affected neighborhood plan area.\n\nSource: Ord. 20080306-073; 20091217-053.\n\n(A)\n\nPre-Application Meeting. The applicant and the director's staff must meet before an\napplicant can submit an application to amend a neighborhood plan. At the meeting:\n\n(1)\n\nthe staff shall describe the application process to the applicant;\n\n(2)\n\nthe applicant shall describe the proposed neighborhood plan amendment to the staff;\n\n(3)\n\nif the applicant is proposing a change to the future land use map, the applicant shall\nprovide the staff with information regarding the proposed change, including the address,\nboundaries, acreage, current and proposed future land use map categories, and current\nand proposed uses; and\n\n(4)\n\nif the applicant is proposing a text change, the applicant shall provide the proposed\nlanguage and an explanation of the change.\n\n(B)\n\nApplications for an Individual Property.\n\n(1)\n\nThe director may accept an application to amend a neighborhood plan not earlier than\none year after the adoption of the plan.\n\n(2)\n\nAn applicant may not file an application for an amendment that is substantially the\nsame as an application denied by council until one year after the council action denying\nthe prior application.\n\n(C)\n\nApplications for Area-wide or Subdistrict-wide Amendments.\n\n(1)\n\nThe director may accept an application to amend a neighborhood plan two or more years\nafter council adopted the plan.\n\n(2)\n\nThe director may accept an application to amend a neighborhood plan two or more years\nafter the most recent council action on the plan occurred.\n\n(3)\n\nAn application initiated by council may be filed at any time.\n\n(D)\n\nThe director may waive all or a portion of the fees, as set by the City's annual fee\nordinance, for an amendment application initiated by a neighborhood plan contact team.\n\nSource: Ord. 20080306-073; 20091217-053; Ord. No. 20170608-057, Pt. 1, 6-8-17; Ord. No. 20200220-056, Pt. 2, 3-2-20; Ord. No. 20230831-104, Pt. 1, 9-11-23.\n\n(A)\n\nThe director shall initiate the formation of a neighborhood plan contact team.\n\n(B)\n\nThe neighborhood plan contact team shall to the greatest extent practicable include\nat least one representative from each of the following groups within a neighborhood\nplan area:\n\n(1)\n\nproperty owners;\n\n(2)\n\nresidential renters;\n\n(3)\n\nbusiness owners; and\n\n(4)\n\nneighborhood organization members owning or renting property within the neighborhood\nplan area.\n\n(C)\n\nRepresentatives shall to the greatest extent possible be drawn from the group of persons\ninvolved in the development of the neighborhood plan.\n\n(D)\n\nThe neighborhood plan contact team shall annually submit a list of its officers and\nmembers, including individual contact information and applicable membership category\nunder Subsection (B), to the director.\n\n(E)\n\nThe neighborhood plan contact team shall submit new bylaws or changes in existing\nbylaws to the director. The bylaws shall address roles and responsibilities, boundaries,\nmembership, decision-making, meetings and meeting notification, officers and duties,\namendments to the bylaws, finances, and conflicts of interest. The bylaws shall be\nconsistent with the standardized bylaws template and instructions provided by the\ndirector.\n\n(F)\n\nBefore the date on which the Planning Commission is scheduled to consider a proposed\nneighborhood plan amendment, the neighborhood plan contact team may submit a letter\nto the director stating its recommendation on the proposed amendment. The neighborhood\nplan contact team shall also identify any conflict of interest as defined in the bylaws\nof the neighborhood plan contact team.\n\n(G)\n\nNeighborhood plan contact teams shall have dispute resolution as follows:\n\n(1)\n\nFiling complaints. A person who meets the membership requirements described under\nSubsection (B) and believes that the neighborhood plan contact team has violated the\nprovisions of this section may file with the director a request to have the director\ninvestigate and mediate the complaint. Such complaints shall be in writing and shall\nidentify the neighborhood plan contact team alleged to be violating the provisions\nof this section. All complaints must be filed within 45 days following the occurrence\nof an alleged violation.\n\n(2)\n\nInvestigation. The director shall review with the charging party the allegations contained\nwithin the complaint and, if warranted based on the requirements of this chapter,\nshall conduct a prompt and full investigation of the matter stated in the complaint\nthrough interviews with the charging party, contact team officers, and through review\nof all available documentation. The director shall determine in writing whether dispute\nresolution is warranted within 14 days of receiving a complaint and shall render a\nwritten report identifying issues to be addressed through dispute resolution within\n28 days of receiving the complaint.\n\n(3)\n\nInformal Dispute Resolution. If after investigation it is determined that there is\nreasonable cause to believe that dispute resolution is warranted, the director shall\nendeavor to eliminate any such alleged violations by informal methods of conference,\nconciliation, and persuasion. All informal dispute resolution and determinations of\nthe director must be completed within 30 days after the director provides the written\nreport.\n\n(4)\n\nFormal Dispute Resolution. If, after determining that there is reasonable cause to\nbelieve that dispute resolution is warranted, and the director is unable to secure\nfrom the respondent an acceptable conciliation agreement, the director shall present\na report to the Planning Commission within 30 days of completing the informal dispute\nresolution. If after review of the report the Planning Commission agrees with the\nreport of the director, the Planning Commission may recommend a more formal mediation\nor dispute resolution process. The Planning Commission shall set a deadline for the\ncompletion of formal mediation based on the complexity and circumstances of a specific\ncase and shall identify a neutral third party to conduct the dispute resolution process.\n\n(5)\n\nRemedy.\n\n(a)\n\nIn cases where the informal and formal dispute resolution processes initiated by the\nCity are unable to secure from the respondent an acceptable conciliation agreement,\nthe Planning Commission may recommend that the director and the City discontinue recognition\nof the neighborhood plan contact team under the provisions of this chapter until a\nconciliation agreement acceptable to the Planning Commission is reached.\n\n(b)\n\nIn the event the City discontinues recognition of a neighborhood plan contact team,\nspecial designation of the organization as a neighborhood plan contact team will be\nremoved from the City of Austin Community Registry, the neighborhood plan contact\nteam will no longer be granted the authority to initiate Neighborhood Plan amendments,\nand the neighborhood plan contact team will no longer have access to any special resources\nor authority through the City based on its status as a neighborhood plan contact team.\n\n(c)\n\nIf recognition of a neighborhood plan contact team is discontinued for more than six\nmonths, the director may take action to initiate a new neighborhood plan contact team\nfor the planning area under the provisions of City Code Section 25-1-805(A)—(C). In the event that the director takes action to initiate a new neighborhood\nplan contact team, the initial officers of the new neighborhood plan contact team\nmay not have served as officers of the previous neighborhood plan contact team at\nthe time when recognition was discontinued.\n\n(6)\n\nAppeal. Charging parties and respondents may appeal the determination of the director\nand of the Planning Commission under this subsection to the City Council. Actions\nthat are appealable include the director's determination that dispute resolution is\nwarranted; findings/determinations that come out of the informal dispute resolution\nprocess; and discontinuation of recognition of a neighborhood plan contact team.\n\nSource: Ord. 20080306-073; 20091217-053; Ord. No. 20160128-084, Pts. 1, 2, 2-8-16.\n\n(A)\n\nThe director shall give notice of the filing of an application for a proposed neighborhood",
  "start_line": 7713,
  "end_line": 8226,
  "subsections": [
    "25-1-723-B",
    "25-1-723-C",
    "25-1-723-D",
    "25-1-723-A",
    "25-1-723-B",
    "25-1-723-C",
    "25-1-723-D",
    "25-1-723-E",
    "25-1-723-F",
    "25-1-723-G",
    "25-1-723-A",
    "25-1-723-B",
    "25-1-723-C",
    "25-1-723-D",
    "25-1-723-A",
    "25-1-723-B",
    "25-1-723-C",
    "25-1-723-D",
    "25-1-723-A",
    "25-1-723-B",
    "25-1-723-C",
    "25-1-723-D",
    "25-1-723-A",
    "25-1-723-B",
    "25-1-723-C",
    "25-1-723-D",
    "25-1-723-E",
    "25-1-723-F",
    "25-1-723-G",
    "25-1-723-A"
  ]
}