{
  "id": "25-1-article-10",
  "title": "ENFORCEMENT",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 10. - ENFORCEMENT.\n\nA person shall comply with the requirements of this title.\n\nSource: Section 13-1-60; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA permit holder must, as a condition of the permit, to allow City inspectors to enter\nand inspect the land or premises that is the subject of the permit.\n\n(B)\n\nAn applicant for an approval under this title shall agree in writing to allow City\ninspectors to enter and inspect the land or premises that is the subject of the application\nduring approval and development.\n\n(C)\n\nEntry and inspection under this section must be at a reasonable time for the purpose\nof investigating or enforcing the requirements of this title.\n\n(D)\n\nIf the premises are occupied, the City inspector shall present the inspector's credentials\nand request entry. If the premises are unoccupied, the inspector shall attempt to\ncontact a responsible person and request entry.\n\nSource: Section 13-1-74; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA contractor shall keep a copy of the released site plan at the development site and\nallow a City inspector to examine it on request.\n\n(B)\n\nA contractor's failure to produce the copy of the released site plan on request by\na City inspector is prima facie evidence that a released site plan does not exist.\n\nSource: Section 13-1-72(c); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA permit holder shall keep a copy of the right of way use permit in an accessible\nplace on the construction site or business premises during the period for which the\npermit is valid.\n\n(B)\n\nA permit must state the name of the site manager, supervisor, project superintendent,\nor prime contractor to be contacted by the inspector or police officer if problems\nexist.\n\n(C)\n\nA permit holder's failure to produce a copy of the permit on request from a police\nofficer, an authorized representative of the City, or a City building inspector, is\nprima facie evidence that a permit does not exist.\n\nSource: Section 13-1-71(b); Ord. 990225-70; Ord. 031211-11; Ord. 20060504-039.\n\n(A)\n\nThe accountable official may suspend a permit or license if the official determines\nthat:\n\n(1)\n\nthe permit or license was issued in error; or\n\n(2)\n\nthe permit or license holder has not complied with the requirements of this title.\n\n(B)\n\nA suspension is effective until the official determines that the permit holder has\ncomplied with the requirements of this title.\n\nSource: Section 13-1-63 (a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe director may suspend a released site plan or an approved subdivision construction\nplan if the director determines that:\n\n(1)\n\nthe site plan was released in error;\n\n(2)\n\nthe subdivision construction plan was approved in error; or\n\n(3)\n\nthe development does not comply with this title.\n\n(B)\n\nA suspension is effective until the director determines that the applicant has complied\nwith the requirements of this title.\n\nSource: Section 13-1-64 (a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe building official may suspend a certificate of occupancy if the building official\ndetermines that:\n\n(1)\n\nthe certificate of occupancy was issued in error; or\n\n(2)\n\nthe structure does not comply with the requirements of the City Code.\n\n(B)\n\nA suspension is effective until the building official determines that the person using\nthe building has complied with the requirements of the City Code.\n\nSource: Section 13-1-65 (a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this section, \"permit issuer\" means the department director who issued a right-of-way\nuse permit under Chapter 14-11 (Use of Right-of-Way).\n\n(B)\n\nThe permit issuer may suspend a right-of-way use permit if the permit issuer determines\nthat the permit holder has not complied with the requirements of the permit.\n\n(C)\n\nThe permit issuer may request review by the Compliance Review Committee of a proposed\nrevocation or suspension. The Committee's findings are not binding on the permit issuer.\n\n(D)\n\nThe permit issuer may require that a person found in violation of a permit requirement\npay an investigation fee before the director reinstates a suspended or revoked right-of-way\nuse permit. The fee is one-third of the cost of the permit.\n\n(E)\n\nA suspension is effective until the permit issuer determines that the person has complied\nwith the requirements of the permit.\n\nSource: Sections 13-1-66(a) and (d); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nIf the accountable official determines that a person is not in compliance with a requirement\nof a variance or special exception, the accountable official may suspend the variance\nor special exception pending compliance.\n\n(B)\n\nThe body granting the variance or special exception shall hold a public hearing and\ndetermine whether the person is in compliance with the requirements of the variance\nor special exception.\n\n(C)\n\nThe body shall hold the public hearing not later than the 45th day after notification\nof the suspension under Section 25-1-418 (Notice Of Suspension Or Revocation). The director shall give notice under Section 25-1-132(A) (Notice Of Public Hearing) of the public hearing.\n\n(D)\n\nIf the body determines that the person is not in compliance with a requirement of\nthe variance or special exception, the body may revoke the variance or special exception\nor take other action to obtain compliance.\n\n(E)\n\nThe body's decision to revoke a variance or special exception is effective immediately.\n\nSource: Sections 13-1-62 (a), (c), and (d); Ord. 990225-70; Ord. 031211-11.\n\nThe accountable official may immediately revoke a person's permit, license, released\nsite plan, approved subdivision construction plan, certificate of occupancy, or right-of-way\nuse permit that has been suspended if the accountable official determines that the\nperson:\n\n(1)\n\ndid not comply in a reasonable time with the requirements of this title for which\nthe suspension was ordered; or\n\n(2)\n\nduring the suspension, did not comply with other requirements of this title.\n\nSource: Sections 13-1-63(a), 13-1-64(a) and (c), 13-1-65(a) and (c), 13-1-66(a) and\n(c); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAn accountable official may give notice to the person affected of the official's intent\nto suspend or revoke a permit, license, released site plan, approved subdivision construction\nplan, certificate of occupancy, or right of way use permit under this division.\n\n(B)\n\nThe notice may specify a reasonable time for compliance with this title. If a time\nfor compliance is specified, the accountable official may not suspend or revoke before\nthe time for compliance has expired.\n\nSource: Section 13-1-61; Ord. 990225-70; Ord. 031211-11.\n\nThe accountable official shall give notice by certified mail, return receipt requested,\nunder Section 25-1-132(B) (Notice Of Public Hearing) of a suspension or revocation by the official under this division.\n\nSource: Sections 13-1-62(b) and (d), 13-1-63(b), 13-1-64(b), 13-1-65(b), and 13-1-66(b);\nOrd. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf the director determines that a person required to obtain a site plan, subdivision\nconstruction plan, or permit has not complied with a requirement of this title, the\ndirector may order the person to stop the development of or transportation of construction\nmaterial to the site until the person complies with the requirements of this title.\n\n(B)\n\nWhile a stop work order is in effect:\n\n(1)\n\na City inspection may not be performed, and work requiring an inspection may not be\napproved; and\n\n(2)\n\na person may not connect a utility at the site.\n\n(C)\n\nIf a stop work order is based on a failed inspection, a person may not further develop\nthe site until the development passes a reinspection.\n\n(D)\n\nIf a stop work order is based on a health or safety hazard, a person may not further\ndevelop the site until the director determines that the development complies with\nthe requirements of this title.\n\n(E)\n\nIf a stop work order is based on a violation of the requirements of this title for\na right of way use permit, the order:\n\n(1)\n\nmust state that no work may be performed at the site if traffic is obstructed, unless\nthe person obtains a right-of-way use permit;\n\n(2)\n\nmust state that noncompliance may result in the immediate removal of an obstruction\nfrom the right-of-way and the arrest of an equipment operator; and\n\n(3)\n\nshall require the immediate removal of an obstruction or traffic control device in\nthe public right-of-way.\n\n(F)\n\nA City employee shall post a stop work order on the site and mail a copy of the order\nto the record owner.\n\nSource: Sections 13-1-67(a), (b), (c), (e), (f), and (g); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf the building official determines that building service equipment regulated by the\ntechnical codes is hazardous to life, health, or property, the building official may\norder that the equipment be removed or restored to a safe condition.\n\n(B)\n\nA remove or restore order must be in writing, posted on the site, and state a deadline\nby which compliance must be achieved.\n\n(C)\n\nThe building official shall mail a copy of the remove or restore order to the record\nowner.\n\n(D)\n\nA person may not use or maintain building service equipment after a remove or restore\norder is posted.\n\nSource: Section 13-1-68; Ord. 990225-70; Ord. 031211-11.\n\nUnless a person complies with the requirements of Chapter 14-11 (Use Of Right-Of-Way)\nfor a right of way use permit, a police officer may order the person to immediately\nstop obstructing traffic and remove the obstruction from the public right-of-way.\nThe police officer may:\n\n(1)\n\nimpound a vehicle, machinery, or equipment;\n\n(2)\n\norder the driver to proceed to the Police Department;\n\n(3)\n\nremove a barricade or traffic diverting device;\n\n(4)\n\nissue a citation to a person who authorized or caused the violation; and\n\n(5)\n\narrest a person who does not comply with the order.\n\nSource: Section 13-1-66 (e); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA person may appeal a stop work order, remove or restore order, revocation, or suspension\nissued under this division by giving written notice to the accountable official not\nlater than the third day after:\n\n(1)\n\nthe stop work order or remove or restore order is posted; or\n\n(2)\n\nthe person receives notice of the revocation or suspension.\n\n(B)\n\nThe notice of appeal must contain:\n\n(1)\n\nthe name and address of the appellant;\n\n(2)\n\na statement of facts;\n\n(3)\n\nthe decision being appealed; and\n\n(4)\n\nthe reasons the decision should be set aside.\n\n(C)\n\nThe accountable official shall hear the appeal not later than the third working day\nafter the appeal is filed. The appellant, the appellant's expert, and the department\nmay offer testimony to the accountable official.\n\n(D)\n\nThe accountable official shall affirm or reverse the department's decision not later\nthan the second working day after the hearing. The official shall give written notice\nof the decision and a statement of the reasons for the decision to the appellant.\n\n(E)\n\nThe appellant may appeal the accountable official's decision to the Land Use Commission\nor appropriate technical board by giving written notice to the accountable official\nand the presiding officer of the Land Use Commission or appropriate technical board\nnot later than the third working day after receiving notice of the decision. The notice\nof appeal must contain the information described in Subsection (B).\n\n(F)\n\nThe Land Use Commission or appropriate technical board shall hear the appeal at the\nnext regularly scheduled meeting following receipt of the notice of appeal. An appeal\nis automatically granted if the Land Use Commission or appropriate technical board\ndoes not hear the appeal before the 21st day following receipt of the notice of appeal.\n\n(G)\n\nA stop work order, remove or restore order, suspension, or revocation remains in effect\nduring the pendency of an appeal under this section.\n\nSource: Section 13-1-69; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nA person who violates a provision of this title commits a separate offense for each\nday the violation continues.\n\n(B)\n\nA person who violates this title commits a misdemeanor punishable by a fine not to\nexceed $2000.\n\n(C)\n\nA culpable mental state is not required, and need not be proved, for fines of $500\nor less.\n\n(D)\n\nA person who violates Chapter 25-12 (Technical Codes) commits a misdemeanor punishable by a fine not to exceed $2000 and not less than:\n\n(1)\n\n$150 for a first conviction;\n\n(2)\n\n$250 for a second conviction; and\n\n(3)\n\n$500 for a third or subsequent conviction.\n\nSource: Sections 13-1-60, 13-1-70, 13-1-71, and 13-1-72; Ord. 990225-70; Ord. 031211-11;\nOrd. No. 20140515-058, Pt. 1, 5-26-14.\n",
  "start_line": 4566,
  "end_line": 4995,
  "subsections": []
}