{
  "id": "25-1-462",
  "title": "CRIMINAL ENFORCEMENT",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "Section 25-1-462 (Criminal Enforcement).\n\n(Ord. No. 20210603-059, Pt. 4, 9-1-21)\n\n\n\nFootnotes:\n\n--- (**2**) ---\n\n**Editor's note—**\nOrd. No. 20230831-105, Pt. 1, effective September 11, 2023, repealed the former Art. 4, §§ 25-12-111—25-12-114,\nand enacted a new Art. 4 as set out herein. The former Art. 4 pertained to similar\nsubject matter and derived from Ord. No. 20200507-027, Pt. 1, 9-1-20.\n\n(A)\n\nThe National Electrical Code, 2023 Edition and Annex H (collectively \"2023 Electrical\nCode\"), published by the National Fire Protection Association are adopted and incorporated\nby reference into this section with the deletions in Subsection (B) and amendments\nin Section 25-12-113 (Local Amendments to the 2023 Electrical Code - Administration and Enforcement) and Section 25-12-114 (Local Amendments to the 2023 Electrical Code - Technical).\n\n(B)\n\nThe following sections of the 2023 Electrical Code are deleted:\n\n|  |  |  |\n| --- | --- | --- |\n| Section 80.2 | Section 80.15 | Section 80.19(C) |\n| Section 80.19(D) | Section 80.19(E) | Section 80.21 |\n| Section 80.23(B) | Section 80.27 | Section 80.35 |\n| Section 110.12 | Section 210.5(C)(1) | Section 230.70(A) |\n| Section 680.41 |  |  |\n\n(C)\n\nThe city clerk shall retain a copy of the 2023 Electrical Code with the official ordinances\nof the City of Austin.\n\nSource: Ord. No. 20230831-105, Pt. 1, 9-11-23.\n\nIn the City Code, \"Electrical Code\" means the 2023 Electrical Code adopted and amended\nby Section 25-12-111 (Electrical Code), as amended by Section 25-12-113 (Local Amendments to the 2023 Electrical Code - Administration and Enforcement) and Section 25-12-114 (Local Amendments to the 2023 Electrical Code - Technical).\n\nSource: Ord. No. 20230831-105, Pt. 1, 9-11-23.\n\nThe following provisions are local amendments to the 2023 Electrical Code. Each provision\nof this section is a substitute for any identically numbered provision of the 2023\nElectrical Code deleted by Section 25-12-111(B) (Electrical Code) or is an addition to the 2023 Electrical Code:\n\n80.2 Definitions. The following definitions apply to the Electrical Code.\n\nAGENT. A person designated by an electrical contractor to obtain an electric permit on behalf\nof the electrical contractor. An agent must be the owner or an employee of the electrical\ncontracting business.\n\nCITATION. A document described in City Code Chapter 1-3 (Citation Program).\n\nCONTRACTOR. A person who is an electrical contractor.\n\nELECTRICAL CONTRACTOR. A person licensed as an electrical contractor by the Texas Department of Licensing\nand Regulation (TDLR), engaged in electrical contracting, and registered with the\nCity.\n\nELECTRICAL CONTRACTING. The business of designing, installing, erecting, repairing, maintaining, or altering\nelectrical wires or conductors to be used for light, heat, power, or signaling purposes.\nThe term includes the installation or repair of ducts, raceways, or conduits for the\nreception or protection of wires or conductors and the installation or repair of any\nelectrical machinery, apparatus, or system used for electrical light, heat, power,\nor signaling.\n\nELECTRICAL INSPECTOR. An individual who meets the requirements of Section 5.2.11 in the Building Criteria\nManual.\n\nELECTRICAL WORK. Installing, altering, repairing, or erecting any electrical wiring apparatus, raceways,\nor equipment used in connection therewith, whether inside or outside of a building\nor structure, lot or premises, under the requirements of the Electrical Code.\n\nOFFER TO PERFORM. A written or verbal communication, proposal, or advertisement that indicates or implies\na person is available to contract for or perform electrical work.\n\nREGISTRANT. A person required to register with the City as set forth in Section 80.37 (Registration).\n\nREPLACEMENT. The act or process to replace something of like design.\n\nRESIDENTIAL BUILDING OR STRUCTURE. Single-family, two-family, and multifamily dwelling units of five stories or less\nin height and located in a residential zone.\n\nSTATE ELECTRICAL CODE. The National Electrical Code adopted by the Texas Department of Licensing and Regulation.\n\nTEXAS DEPARTMENT OF LICENSING AND REGULATION. The state agency responsible for administering and enforcing Title 8, Chapter 1305\nof the Texas Occupations Code and 16 Texas Administrative Code Chapter 73.\n\nWORKMANLIKE MANNER. The standard established in Section 110.12 (Mechanical Execution of Work).\n\n80.15. Electric Board. The Electric Board shall comply with City Code Chapter 2-1 (Boards and Commissions).\n\n80.19(C) Issuance of Permits.\n\n(1)\n\nStandard Permits.\n\n(a)\n\nExcept as provided in Section 80.19(C)(5) (Homestead Permit), an applicant for an electrical permit must be an electrical contractor.\n\n(b)\n\nThe building official is responsible for reviewing applications, plan specifications,\nand other data submitted by an applicant. Other departments may review the plans as\nnecessary to verify compliance with applicable laws.\n\n(c)\n\nThe building official must issue a permit to an applicant if:\n\n(i)\n\nthe building official finds that the work described in the permit application and\nin the plans, specifications, and other support data submitted with the application\nconform to the requirements of the Electrical Code and other applicable laws and ordinances;\nand\n\n(ii)\n\nthe required fees have been paid.\n\n(d)\n\nA permit issued by the building official is not effective unless it includes a written\nstatement that the plans and specifications were reviewed. In this section, a written\nstatement means a stamp that reads \"REVIEWED FOR CODE COMPLIANCE\" and is placed on\nthe plans and specifications.\n\n(e)\n\nAfter the permit is issued, a person may not change, modify, or alter plans and specifications\nwithout the approval of the building official.\n\n(f)\n\nWork regulated by the Electrical Code shall be done consistent with reviewed plans\nand specifications.\n\n(g)\n\nIf a building, structure, or tenant finish out will exceed 5,000 square feet, a Professional\nEngineer licensed by the State of Texas must seal the required drawing.\n\n(h)\n\nIf a building, structure, or tenant finish out is 5,000 square feet or less, a master\nelectrician licensed by the Texas Department of Licensing and Regulation must sign\nthe required drawing and include the master electrician's license number or a Professional\nEngineer licensed by the State of Texas may seal the required drawing.\n\n(i)\n\nThe building official may issue a permit for the construction of part of an electrical\nsystem before the plans and specifications for the entire system have been submitted\nor approved if the applicant provides adequate information and detailed statements\nthat comply with the requirements of the Electrical Code. The electrical permit holder\nmay proceed at the permit holder's own risk, without assurance that the permit for\nthe entire building, structure, or building service will be approved. The issuance\nof a permit for part of an electrical system does not obligate the building official\nto approve the remaining electrical permits.\n\n(2)\n\nPermit required. Except as specified in Section 80.19(C)(3), a person who intends to install, alter,\nrepair, replace, or remodel an electrical system must apply for and obtain a permit\nbefore the activity commences.\n\n(3)\n\nExempt work. Work that may be performed without an electrical permit must comply with all applicable\nfederal, state, and local requirements. An electrical permit is not required:\n\n(a)\n\nto replace an approved cable or cord and plug connected to a motor or portable appliance;\n\n(b)\n\nto replace components of approved equipment or a fixed approved appliance of same\ntype and rating, in the same location;\n\n(c)\n\nto install temporary holiday decorative lighting;\n\n(d)\n\nwhen the maximum voltage is 480 and the maximum ampacity is 30, to replace a snap,\nsingle, three-way, or four-way or dimmer switch, receptacle, ceiling paddle fan, or\nluminaire;\n\n(e)\n\nto reinstall a receptacle with a ground-fault circuit interrupter receptacle, a tamper-resistance\nreceptacle, an arc-fault circuit interrupter receptacle, or weather-resistance receptacle;\n\n(f)\n\nwhen the service will not be de-energized, to replace an overcurrent protection device\nor fuse of same voltage and amperage and in the same location;\n\n(g)\n\nto repair or replace an electrode or transformer of the same size and capacity for\na sign or gas tube system;\n\n(h)\n\nto replace insulating material to a splice;\n\n(i)\n\nto remove electrical and communication wiring;\n\n(j)\n\nto install temporary wiring for experimental purposes in a suitable experimental laboratory;\n\n(k)\n\nto install wiring for a temporary theater, motion picture, or television stage set;\n\n(l)\n\nto install or repair an electrical device, appliance, apparatus, equipment, or electrical\nwiring operating at less than 25 volts and not capable of supplying more than 50 watts\nof energy;\n\n(m)\n\nto install or repair a low-energy power, control and signal circuit of Class II or\nClass III as defined in the 2023 Electrical Code;\n\n(n)\n\nfor the following activities, if performed in connection with the transmission of\nelectrical energy: to install, alter, or repair electrical wiring, apparatus, equipment,\nor the generation, transmission, distribution, or metering of electrical energy;\n\n(o)\n\nto operate signals or to transmit intelligence by a public or private utility in the\nexercise of its function as a serving utility; or\n\n(p)\n\nexcept for activities related to electrical service, for electrical work in a building\nor structure owned and occupied by the State of Texas or the federal government.\n\n(4)\n\nEmergency repair permits. An applicant who seeks a permit to make emergency electrical repairs on non-exempt\nwork must identify the emergency on the permit application.\n\n(5)\n\nHomestead permit.\n\n(a)\n\nA person who is not licensed to perform electrical work may perform electrical work\nunder a homestead permit if:\n\n(i)\n\nthe residence is the person's homestead and principal residence;\n\n(ii)\n\nthe electrical work does not include the main electric system;\n\n(iii)\n\nthe person has not secured a homestead permit for another residence within the prior\n12-month period;\n\n(iv)\n\nthe person has owned and occupied the property as of January 1 of the tax year in\nwhich the person applies for a homestead permit;\n\n(v)\n\nthe person applies for a homestead permit in person and files an affidavit stating\nthat the location where the work will be done is the person's homestead;\n\n(vi)\n\nthe person obtains a homestead permit and pays any required permit fees before electrical,\nmechanical, or plumbing work begins;\n\n(vii)\n\nthe person does not allow or cause another person to perform electrical work under\nthe permit;\n\n(viii)\n\nthe person does not transfer the homestead permit to another person;\n\n(ix)\n\nthe person will present a picture identification to the building official to verify\nthat the person is authorized to perform the work under the homestead permit; and\n\n(x)\n\nthe work that will be done is not for a mobile, modular, or manufactured home unless\nthe person owns the land on which the mobile, modular, or manufactured home is located.\n\n(b)\n\nA homestead permit cannot be issued for a mobile, modular, or manufactured home located\nin a mobile home park, mobile home community, or other commercial premises.\n\n(c)\n\nThe building official may suspend or revoke a homestead permit if the work done under\nthe homestead permit is performed by anyone other than the person who obtained the\nhomestead permit.\n\n80.19(D) Annual permit. Electrical work may be performed in a facility participating in the registered industrial\nplan program under an annual permit issued pursuant to Section 105.1.1 (Annual Permit) of the Building Code.\n\n80.19(E) Permit fees. The fee for a permit is set by separate ordinance.\n\n80.19(H) Time limitation on application; permit expiration and reactivation. The time limits for applications and the requirements for permit expiration and reactivation,\nincluding a fee for expired permits, are established in Chapter 25-12, Article 13 (Administration of Technical Codes).\n\nException. An annual permit is valid for 360 consecutive days from the date the permit is issued\nand may not be extended.\n\n80.19(I) Special inspections program. Electrical work may be performed under this program in occupied residential and commercial\nbuildings or structures within the zoning jurisdiction of the City. The program requirements\nand scope are:\n\n(1)\n\nA contractor who participates in this program must:\n\n(a)\n\nfor each permit, submit a completed compliance form to the building official no later\nthan one business day after the permitted electrical work is complete; and\n\n(b)\n\nobtain a permit as required by Section 80.19(C)(2) no later than one business day\nfrom the work start date.\n\n(2)\n\nThe scope of work may not:\n\n(a)\n\ninclude the disconnection, reconnection, or repair of an electrical service;\n\n(b)\n\ninvolve the penetration of a fire rated wall or component;\n\n(c)\n\nrequire an electrical rough inspection; or\n\n(d)\n\ninclude more than one stand-alone electrical or other permit.\n\n(3)\n\nAs part of the program, the building official may inspect the electrical work performed\nfor one out of five residential permits and one out of 10 commercial permits. As a\ncondition of the program, the electrical contractor must provide access to the permitted\nwork.\n\n(4)\n\nNothing in this section limits the building official's authority to inspect electrical\nwork when the building official deems necessary to determine that the electrical work\nperformed under this program complies with the Electrical Code.\n\n80.21 Plan review fees. The fee for plan review is set by separate ordinance.\n\n80.35 Authority to Enforce State Electrical Code. The building official may enforce the state electrical code when necessary.\n\n80.36 Licenses.\n\n80.36 (A) License required. Except as allowed in Subsection 80.19(C)(5) (Homestead Permit), a person must be licensed by the Texas Department of Licensing and Regulations\nto perform electrical work within the City or at a site that receives electric utility\nservices from the City.\n\n80.36 (B) License display. When performing electrical work, a licensee shall keep his or her license in possession\nand shall display the license upon request of the building official or the owner of\nthe premises or property where the licensee is working, offering to work, or has worked.\nA licensee shall also present a picture identification to verify identity.\n\n80.36 (C) Contractor. To establish an electrical contracting business within the City's full purpose jurisdiction,\na person must be licensed as an electrical contractor and comply with Section 80.37\n(Registration).\n\n80.36 (D) Temporary staffing companies. An employee who is licensed, registered, or certified by the Texas Department of\nLicensing and Regulations and is assigned to a client company by a professional temporary\nstaffing company is considered an employee of the client company for the purpose of\ncomplying with the requirement to hold an electrical contracting license.\n\n80.37 Registration.\n\n(A)\n\nRegistration Required. Before a person may perform or offer to perform electrical contracting services within\nthe City, the person must register with the City.\n\n(B)\n\nEligibility Requirements. A person is eligible to register with the City if:\n\n(1)\n\nthe person is licensed as an electrical contractor;\n\n(2)\n\nthe person designates an electrician of record; and\n\n(3)\n\nthe electrician of record appears in person when the electrical contracting business\nis registered.\n\n(C)\n\nElectrician of Record.\n\n(1)\n\nThe electrician of record may be the same as the registrant.\n\n(2)\n\nThe electrician of record must be licensed by the Texas Department of Licensing and\nRegulations as a master electrician.\n\n(3)\n\nThe electrician of record may not be designated as the electrician of record for more\nthan one electrical contractor business.\n\n(D)\n\nEmployees and Agents of Registrant.\n\n(1)\n\nAn employee of a registrant may perform electrical work that is associated with an\nelectrical permit issued to the registrant.\n\n(2)\n\nThe maximum number of agents who may obtain electrical permits on behalf of the registrant\nis six.\n\n(E)\n\nVehicle Display Requirements.\n\n(1)\n\nA registrant shall display its name and license number on each vehicle owned or operated\nby the registrant's business and used to perform electrical contracting services.\n\n(2)\n\nEach display shall satisfy the requirements set forth in Section 1305.166 of the Texas\nOccupations Code and Section 73.51 of Title 16 of the Texas Administrative Code.\n\n(3)\n\nA vehicle described in Subsection (E)(1) may not be used for more than one electrical\ncontracting business.\n\n(F)\n\nOffense. A person commits an offense if the person engages in electrical contracting without\na registration required by this section.\n\n80.38 Suspension of Registration.\n\n(A)\n\nExcept as provided in Subsection (B), the building official may suspend a registration\nafter three substantiated violations of Section 80.39 (Offenses) within a 12-month period.\n\n(B)\n\nThe building official may suspend a registration after one substantiated violation\nof Section 80.39(A)(2), (A)(9), (A)(15), or (A)(19) by the registrant or its employees.\n\n(C)\n\nThe suspension period ends:\n\n(1)\n\nsix months from the date the suspension begins for the first suspension; or\n\n(2)\n\n12 months from the date the suspension begins for a suspension that is not the first\nsuspension.\n\n(D)\n",
  "start_line": 69385,
  "end_line": 69905,
  "subsections": [
    "25-1-462-A",
    "25-1-462-B",
    "25-1-462-C",
    "25-1-462-A",
    "25-1-462-B",
    "25-1-462-C",
    "25-1-462-D",
    "25-1-462-E",
    "25-1-462-F",
    "25-1-462-A",
    "25-1-462-B",
    "25-1-462-C",
    "25-1-462-D"
  ]
}