{
  "id": "25-1-article-7",
  "title": "APPEALS, VARIANCES, SPECIAL EXCEPTIONS, AND ADJUSTMENTS",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 7. - APPEALS, VARIANCES, SPECIAL EXCEPTIONS, AND ADJUSTMENTS.\n\n(A)\n\nA person has standing to appeal a decision if:\n\n(1)\n\nthe person is an interested party or has standing to appeal under applicable provisions\nof state law; and\n\n(2)\n\na provision of this title or state law identifies the decision as one that may be\nappealed by that person.\n\n(B)\n\nA body holding a public hearing on an appeal shall determine whether a person has\nstanding to appeal the decision.\n\nSource: Section 13-1-250; Ord. 990225-70; Ord. 030828-65; Ord. 031211-11; Ord. No. 20230831-141, Pt. 15, 9-11-23.\n\nAn interested party or a person who has standing to appeal under applicable provisions\nof state law may initiate an appeal by filing a notice of appeal with the responsible\ndirector or building official, as applicable, not later than:\n\n(1)\n\nthe 14th day after the date of the decision of a board or commission; or\n\n(2)\n\nthe 20th day after an administrative decision; or\n\n(3)\n\nfor an appeal authorized under state law, the date specified by state law.\n\nSource: Section 13-1-251(a); Ord. 990225-70; Ord. 031211-11; Ord. No. 20230831-141, Pt. 16, 9-11-23.\n\nThe notice of appeal must be on a form prescribed by the responsible director or building\nofficial and must include:\n\n(1)\n\nthe name, address, and telephone number of the appellant;\n\n(2)\n\nthe name of the applicant, if the appellant is not the applicant;\n\n(3)\n\nthe decision being appealed;\n\n(4)\n\nthe date of the decision;\n\n(5)\n\na description of the appellant's status as an interested party; and\n\n(6)\n\nthe reasons the appellant believes the decision does not comply with the requirements\nof this title.\n\nSource: Section 13-1-251(a); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\nThe responsible director shall notify an applicant in writing if there is an interested\nparty to an administrative decision.\n\nSource: Section 13-1-251(b); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\nOn receipt of a notice of appeal or an amendment of a notice, the responsible director\nor building official shall promptly notify the presiding officer of the body to which\nthe appeal is made and, if the applicant is not the appellant, the applicant.\n\nSource: Section 3-1-253(a); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\nIf requested by an interested party, the responsible director shall schedule a meeting\nto discuss and attempt to resolve the issues raised by an appeal of an administrative\ndecision. The responsible director shall notify all interested parties of a meeting\nscheduled under this section. All interested parties may attend the meeting.\n\nSource: Section 13-1-251(b); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nDevelopment under a site plan may not occur during the time period during which an\nappeal of the site plan may be initiated.\n\n(B)\n\nAn approved plan or permit is suspended on the timely filing of an appeal of the plan\nor permit.\n\n(C)\n\nDevelopment affected by an appeal may not occur pending the final disposition of the\nappeal.\n\nSource: Section 13-1-252; Ord. 990225-70; Ord. 031211-11.\n\nA public hearing on an appeal shall be scheduled for the first available meeting for\nwhich notice of the hearing can be timely provided.\n\nSource: Section 13-1-253(b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe responsible director shall give notice under Section 25-1-132(B) (Notice of Public Hearing) of a public hearing on an appeal to the council.\n\n(B)\n\nExcept as provided in Subsection (C), the responsible director shall give notice under\nSection 25-1-132(A) (Notice of Public Hearing) of a public hearing on an appeal to a board or commission.\n\n(C)\n\nThe responsible director shall give notice under Chapter 25-12 (Technical Codes) and applicable state law of a public hearing on an appeal to a board or commission\ncreated by Chapter 25-12 (Technical Codes) or having jurisdiction over regulations contained in Chapter 25-12 (Technical Codes).\n\nSource: Section 13-1-253(b); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\nThe appellant must establish that the decision being appealed is contrary to applicable\nlaw or regulations.\n\nSource: Section 13-1-254; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nBefore opening a hearing, a body hearing an appeal shall decide preliminary issues\nraised by the parties, including whether to postpone or continue the hearing and whether\nthe appellant has standing to appeal.\n\n(B)\n\nA public hearing on an appeal shall proceed in the following order:\n\n(1)\n\na report from City staff;\n\n(2)\n\na presentation by the appellant;\n\n(3)\n\ncomment by persons supporting the appeal;\n\n(4)\n\ncomment by persons opposing the appeal; and\n\n(5)\n\na rebuttal by the appellant.\n\nSource: Section 13-1-255; Ord. 990225-70; Ord. 031211-11.\n\nA body hearing an appeal may, in accordance with the requirements of this title, exercise\nthe power of the official or body whose decision is appealed. A decision may be upheld,\nmodified, or reversed.\n\nSource: Section 13-1-256; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to a formal determination by the director under Section 25-2-2 (Determination of Use Classification) regarding the appropriate classification of a land use that is not specifically\nclassified under Chapter 25-2, Subchapter A (Zoning Uses).\n\n(B)\n\nExcept as otherwise provided by this section, a use determination may be requested\nat any time by filing an application on a form provided by the director and by paying\na fee established by separate ordinance.\n\n(C)\n\nIn addition to any additional information required by the director, an application\nfor a use determination must:\n\n(1)\n\nstate whether the determination is requested in connection with a specific project,\nand if so, reference the application number;\n\n(2)\n\nif the determination is not related to a specific development application, state whether\nit is requested for a particular address;\n\n(3)\n\ndescribe the land use(s) for which a determination is sought; and\n\n(4)\n\ninclude any information that the applicant requests the director to consider in making\nthe use determination, including but not limited to an explanation of the similarities,\nif any, of the use to other classified uses.\n\n(D)\n\nA use determination for a project that is subject to a pending development application\nis a \"project use determination\" and is subject to the requirements of this subsection.\n\n(1)\n\nThe director shall determine whether a site plan application requires a use determination\nunder Section 25-2-2 (Determination of Use Classification) within the applicable review period required by Section 25-5-114 (Time Periods for Determination; Notice) or Section 25-5-143 (Director's Report).\n\n(2)\n\nIf the director determines that a use determination is required, the applicant must\nsubmit a request for a project use determination under Subsection (B) before the application\nexpires.\n\n(3)\n\nWithin 14 days after receiving a request for a project use determination, the director\nshall issue a determination under Subsection (F) of this section and provide notice\nof the determination under Section 25-1-133(B) (Notice of Applications and Administrative Decisions).\n\n(4)\n\nAny person entitled to notice of a use determination under Section 25-1-133(B) (Notice of Applications and Administrative Decisions) may appeal the decision to the Board of Adjustment no later than 14 days after notice\nis provided.\n\n(E)\n\nA request for a use determination that is not associated with a pending development\napplication is a \"non-project use determination\" and is subject to the requirements\nof this subsection.\n\n(1)\n\nA non-project use determination may be requested by anyone, at any time, for a use\nthat requires a determination under Section 25-2-2 (Use Determination).\n\n(2)\n\nIn addition to the requirements in Subsection (C) of this section, an application\nfor a non-project use determination must include:\n\n(a)\n\nany information requested by the director regarding the nature of the use for which\na determination is requested, including the size, scale, or intensity of the use;\nand\n\n(b)\n\na specific address, if the applicant intends to rely on the determination in connection\nwith a development application.\n\n(3)\n\nWithin 14 days after receiving a request for a non-project use determination, the\ndirector shall provide notice of the determination:\n\n(a)\n\nto the applicant and to registered environmental and neighborhood organizations, if\nthe determination is not associated with a specific address; or\n\n(b)\n\nto all parties entitled to notice under Section 25-1-133(A) (Notice of Applications and Administrative Decisions), if the determination is associated with a particular address.\n\n(4)\n\nAny person entitled to notice of a non-project use determination under this subsection\nmay appeal the determination to the Board of Adjustment within 14 days.\n\n(F)\n\nThe director may not make a decision on an application that is dependent upon a use\ndetermination:\n\n(1)\n\nuntil after the period for appealing the use determination to the Board of Adjustment\nhas run;\n\n(2)\n\nif the use determination is appealed to the Board of Adjustment, until after the board\nhas decided the appeal; or\n\n(3)\n\nif a decision of the Board of Adjustment is appealed to district court, until after\nthe district court has decided the appeal.\n\n(G)\n\nUnless a use determination is reversed or modified by the Board of Adjustment, the\ndirector shall follow the determination in reviewing subsequent requests for a determination\non the same or substantially similar land uses.\n\n(H)\n\nA use determination is not subject to further notification or appeal under this section\nif it has been considered by the Board of Adjustment in response to an appeal or notice\nof the determination was previously provided under this section and no appeal was\nfiled.\n\n(I)\n\nA use determination issued by the director under this section must:\n\n(1)\n\ninclude all information required under Section 25-1-133(C) (Notice of Applications and Administrative Decisions);\n\n(2)\n\nstate the director's determination regarding how the use is classified under existing\nuse regulations;\n\n(3)\n\nexplain the factors considered by the director in making the determination under Section 25-2-2 (Determination of Use Classification), including the similarity of a use to other classified land uses; and\n\n(4)\n\ndescribe any special characteristics of the use determination, including limitations\non the size, scale, location or intensity, of the use.\n\n(J)\n\nA use determination issued under this section may not be used to render decisions\ninterpreting site development regulations.\n\nSource: Ord. 20120426-122.\n\n(A)\n\nA person may file an application for a variance or a special exception with:\n\n(1)\n\nthe building official for a variance or special exception granted by the Board of\nAdjustment; or\n\n(2)\n\nthe responsible director for a variance granted by the Land Use Commission or the\ncouncil.\n\n(B)\n\nAn application may include a request for:\n\n(1)\n\nvariances or special exceptions from regulations applicable to the same site; or\n\n(2)\n\nsimilar variances or special exceptions on two or more adjacent parcels with similar\ncharacteristics.\n\n(C)\n\nThe building official or responsible director may require that the applicant provide\ninformation that the building official or responsible director determines is necessary\nto evaluate the variance or special exception request.\n\nSource: Section 13-1-280; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11;\nOrd. 20110526-098.\n\n(A)\n\nFor an application for a variance or special exception requiring consideration by\nthe Board of Adjustment, the building official shall prepare and file a report with\nthe board not later than the 11th day before the public hearing.\n\n(B)\n\nFor an application for a variance requiring consideration by the Land Use Commission,\nthe responsible director shall prepare and file a report with the Land Use Commission\nnot later than the 11th day before the public hearing.\n\n(C)\n\nThe building official shall make a report described in this section available to the\npublic when the report is filed with the Board of Adjustment or Land Use Commission.\n\n(D)\n\nThis subsection applies to an application for a zoning variance or special exception\nfor property zoned as a family residence (SF-3) or more restrictive district.\n\n(1)\n\nThe building official shall waive the application fee if the official determines that\nthe variance or special exception is supported by the notice owners of 80 percent\nor more of the property located within 300 feet of the property for which the variance\nis sought.\n\n(2)\n\nAn applicant who seeks a fee waiver must:\n\n(a)\n\nobtain the signature of each notice owner who supports the variance or special exception,\non a form provided by the building official; and\n\n(b)\n\nsubmit the completed form to the building official.\n\nSource: Section 13-1-281 and 13-1-282; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8;\nOrd. 031211-11; Ord. 20080110-106; Ord. 20110526-098.\n\n(A)\n\nThis section applies to an application for a variance from the requirements of Chapter 25-8, Subchapter A (Water Quality).\n\n(B)\n\nThe Environmental Board shall consider an application for a variance and forward its\nrecommendation to the Land Use Commission.\n\n(C)\n\nThe Land Use Commission shall consider the Environmental Board's recommendation before\nacting on a variance.\n\nSource: Section 13-1-283(b); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThis subsection does not apply to a preliminary plan, plat, or subdivision construction\nplan. For all other development applications:\n\n(1)\n\nThe Board of Adjustment or Land Use Commission, as applicable, shall hold a public\nhearing on an application for a variance or special exception not later than the 45th\nday after the date the application is filed.\n\n(2)\n\nThe building official or responsible director, as applicable, shall give notice under\nSection 25-1-132(A) (Notice of Public Hearing) of a public hearing on an application for a variance or special exception, and,\nfor a variance or special exception heard by the Board of Adjustment, by posting one\nor more signs.\n\n(B)\n\nFor an application to replat without vacation of the preceding plat, the director\nshall give notice under Section 25-1-132(B) (Notice of Public Hearing) if:\n\n(1)\n\nDuring the preceding five years any of the area to be platted was limited by an interim\nor permanent zoning classification to residential use for not more than two residential\nunits per lot; or\n\n(2)\n\nAny lot in the preceding plan was limited by deed restriction to residential use for\nnot more than two residential units per lot.\n\nSource: Section 13-1-283(a); Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11;\nOrd. 20110526-098; Ord. No. 20190822-117, Pt. 14, 9-1-19.\n\n(A)\n\nExcept as otherwise provided in this chapter, the Board of Adjustment or the Land\nUse Commission shall act on an application for a variance or special exception not\nlater than the next meeting after the public hearing is closed.\n\n(B)\n\nThe Board of Adjustment or the Land Use Commission may:\n\n(1)\n\napprove an application for a variance;\n\n(2)\n\napprove an application for a variance with modifications; or\n\n(3)\n\ndeny an application for a variance.\n\n(C)\n\nThe Board of Adjustment or the Land Use Commission may require that a variance be:\n\n(1)\n\nrevocable;\n\n(2)\n\neffective for a specified time period; or\n\n(3)\n\nsubject to one or more conditions.\n\n(D)\n\nThe Board of Adjustment may act on a request for a special exception in the manner\nprovided for variances under Subsections (B) and (C) of this section.\n\nSource: Section 13-1-284; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 20110526-098.\n\n(A)\n\nExcept as provided in Subsection (B), a decision on a variance or special exception\nis effective immediately.\n\n(B)\n\nIf a variance or special exception is appealable, a decision on the variance is effective:\n\n(1)\n\nexcept as provided in Subsection (B)(2), at the expiration of the time period during\nwhich an appeal may be filed; or\n\n(2)\n\nif a notice of appeal is filed, when a final decision on the appeal is made.\n\nSource: Section 13-1-285; Ord. 990225-70; Ord. 031211-11; Ord. 20110526-098.\n\n(A)\n\nExcept as provided in Subsection (B), a variance or special exception expires:\n\n(1)\n\nexcept as provided in Subsection (A)(2), one year after the effective date of the\nvariance or special exception; or\n\n(2)\n\non the date established as a condition of approval.\n\n(B)\n\nA variance or special exception expires on the date an approved plan or permit expires\nif:\n\n(1)\n\nan application for approval of a plan or permit is submitted before a variance or\nspecial exception expires under Subsection (A); or\n\n(2)\n\nthe variance or special exception is granted in association with the approved plan\nor permit.\n\nSource: Section 13-1-286; Ord. 990225-70; Ord. 031211-11; Ord. 20110526-098.\n\nIf an application for a variance or special exception is denied or if a variance or\nspecial exception is revoked, a person may not file an application for the same or\na similar variance or special exception on the same or substantially the same site\nfor a period of one year from the date of denial or revocation.\n\nSource: Section 13-1-287; Ord. 990225-70; Ord. 031211-11; Ord. 20110526-098.\n\n\n\nFootnotes:\n\n--- (**1**) ---\n\n**Editor's note—**\nOrd. No. 20140612-084, Pt. 4, effective June 23, 2014, repealed Division 4, §§ 25-1-231—25-1-234, which pertained to special exceptions.\nSee References to Ordinances for complete derivation. Subsequently, Division 5 was\nrenumbered as Division 4.\n\n(A)\n\nAn application for an adjustment under Chapter 25-8, Subchapter A (Water Quality) may be considered only in connection with the review of:\n\n(1)\n\na site plan;\n\n(2)\n\na subdivision; or\n\n(3)\n\nother specific development project or proposal.\n\n(B)\n\nAn applicant may file an application for an adjustment with the director.\n\n(C)\n\nAn application for an adjustment must be on a form prescribed by the director and\nmust include:\n\n(1)\n\nthe names and addresses of the applicant and the owner;\n\n(2)\n\nthe address and legal description of the property;\n\n(3)\n\nproof that the applicant is either the record owner or the record owner's agent;\n\n(4)\n\nidentification of the section of Chapter 25-8, Subchapter A (Water Quality) that, as applied to the development project or proposal, the applicant claims violates\nthe United States Constitution, the Texas Constitution, or federal or state statute,\nand the provisions violated;\n\n(5)\n\na statement of the factual basis for applicant's claims;\n\n(6)\n\na legal brief supporting applicant's claims; and\n\n(7)\n\na description of the adjustment requested, and an explanation of how the adjustment\nis the minimum required to comply with the conflicting law and provides maximum protection\nof water quality.\n\nSource: Section 13-1-304; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\nThis section prescribes the order of process for an application for adjustment.\n\n(1)\n\nThe Law Department shall review an application for adjustment and advise the city\nmanager.\n\n(2)\n\nThe city manager shall present the application and the city manager's recommendation\nto the council.\n\n(3)\n\nThe council shall determine whether application of the identified section of Chapter 25-8, Subchapter A (Water Quality) to the applicant's development project or proposal violates the United States Constitution,\nthe Texas Constitution, or federal or state statute. An affirmative determination\nrequires a three-quarters vote of the city council. If the council does not make an\naffirmative determination, the application is denied.\n\n(4)\n\nThis subsection applies if the council makes an affirmative determination under Subsection\n(3).\n\n(a)\n\nThe Watershed Protection Department shall review the application and advise the city\nmanager.\n\n(b)\n\nThe city manager shall present the application and the city manager's recommendation\nto the council at a public hearing.\n\n(c)\n\nAfter a public hearing, the city council shall:\n\n(i)\n\ndetermine the minimum adjustment required to comply with the conflicting law and provide\nmaximum protection of water quality; and\n\n(ii)\n\ngrant the adjustment.\n\nSource: Section 13-1-305; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046.\n",
  "start_line": 3219,
  "end_line": 3914,
  "subsections": []
}