{
  "id": "25-1-606",
  "title": "SINGLE-FAMILY FEE IN LIEU OF PARKLAND DEDICATION",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "(A)\n\nFor a development proposing single-family uses, parkland dedication will be satisfied\nby the dedication of suitable land for park and recreational purposes in accordance\nwith this section or by payment of a fee in-lieu of dedication under Section 25-1-606 (Single-Family Fee In Lieu of Parkland Dedication).\n\n(B)\n\nThe following formula will apply to determine the amount of parkland dedication required:\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-1-602.png)\n\n(C)\n\nIn calculating the amount of parkland to be dedicated, the number of residents per\nunit is based on density as follows:\n\n| Density Classification | Residents Per Unit |\n| --- | --- |\n| Low Density: Not more than 6 units per acre | 2.8 |\n| Medium Density: More than 6 and not more than 12 units per acre | 2.2 |\n| High Density: More than 12 units per acre | 1.7 |\n\n(D)\n\nIf the density of a single-family development is not known:\n\n(1)\n\nthe density is assumed to be the highest permitted in the zoning district, or if the\nproperty is not zoned, 24 dwelling units per acre; or\n\n(2)\n\nfor a residential subdivision within the extraterritorial jurisdiction, the applicant\nmay reduce the assumed density by agreeing, in a manner that is enforceable by the\nCity and approved by the city attorney, that any subsequent increases in density may\nrequire additional dedication of parkland under this section or payment of a fee in\nlieu of dedication under Section 25-1-606 (Single-Family Fee In Lieu of Parkland Dedication).\n\n(E)\n\nThe amount of parkland required to be dedicated within the Parkland Dedication Urban\nCore may not exceed 15% of gross site area for the development required to provide\nthe dedication except upon consent of the applicant or as authorized under this subsection.\n\n(1)\n\nThe director may request that the Land Use Commission approve dedication greater than\n15% off the gross site area, up to the amount required under Subsection (B) of this\nsection, if doing so is necessary to:\n\n(a)\n\naddress a critical shortage of parkland for an area identified in the Deficient Parkland\nArea Map; or\n\n(b)\n\nprovide connectivity with existing or planned parks or recreational amenities.\n\n(2)\n\nBefore the Land Use Commission considers a request under this subsection for approval,\nthe director shall present the request to the Parks Board for a recommendation.\n\n(3)\n\nIn considering a request from the director under this subsection, the Land Use Commission\nmay:\n\n(a)\n\ndeny the director's request and limit the required dedication to no more than 15%\nof gross site area; or\n\n(b)\n\nrequire additional parkland dedication greater than the 15% if gross site area, up\nto the lesser of:\n\n(i)\n\nthe amount required under Subsection (B) of this section; or\n\n(ii)\n\nthe minimum amount the Land Use Commission finds to be necessary based on the criteria\nin Paragraph (l)(a)-(b) of this subsection and the Parkland Dedication Operating Procedures.\n\n(4)\n\nIf an applicant dedicates less than the amount of land required for dedication under\nSubsection (B) due to the cap imposed by this subsection, the director shall require\npayment of a fee in-lieu of dedication under Section 25-1-606 (Single-Family Fee in Lieu of Parkland Dedication) for the remaining undedicated land.\n\nSource: Ord. No. 20231130-087, Pt. 2, 1-1-24.",
  "start_line": 6004,
  "end_line": 6100,
  "subsections": []
}