{
  "id": "25-1-article-15",
  "title": "HOUSING",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 15. - HOUSING.\n\nIn this article:\n\n(1)\n\nDIRECTOR means the director of the City's Housing Department.\n\n(2)\n\nHIGH OPPORTUNITY AREA means an area that provides certain conditions that places individuals\nin a position to be more likely to succeed or excel. This area must include one or\nmore of the following conditions:\n\n(a)\n\nracial and economic integration;\n\n(b)\n\naccess to employment;\n\n(c)\n\nhigh performing schools;\n\n(d)\n\naccess to fresh and healthy foods;\n\n(e)\n\nlow levels of poverty;\n\n(f)\n\nlow crime rate;\n\n(g)\n\naccess to parks;\n\n(h)\n\nminimal environmental hazards; or\n\n(i)\n\nis identified in the Imagine Austin Plan as a center.\n\n(3)\n\nHOUSING COSTS means:\n\n(a)\n\nfor an owner-occupied dwelling unit, the average monthly cost for mortgage, utilities,\nand, if applicable, condominium dues; or\n\n(b)\n\nfor a dwelling unit for lease, the average monthly cost for rent and utilities.\n\n(4)\n\nMEDIAN FAMILY INCOME means the median family income for the Austin statistical metropolitan\narea as determined by the director of the City's Neighborhood Housing and Community\nDevelopment Department.\n\n(5)\n\nTENANT means any person who occupies a residential unit primarily for living or dwelling\npurposes under a rental agreement or lease, including those persons who are considered\nto be tenants under Section 92.001 or 94.001 of the Texas Property Code. For purposes\nof this article, \"tenant\" does not include owner of a dwelling unit or mobile home\nlot, or members of the owner's immediate family.\n\nSource: Ord. 20071129-100; Ord. No. 20141106-124, Pt. 1, 11-17-14; Ord. No. 20160901-050, Pt. 3, 9-12-16; Ord. No. 20230831-103, Pt. 2, 9-11-23; Ord. No. 20250522-063, Pt. 1, 6-2-25.\n\n(A)\n\nThe director administers, implements, and enforces the S.M.A.R.T. Housing program.\n\n(B)\n\nThe director is authorized to adopt, administer, and implement program guidelines\nand establish requirements for an application under the program.\n\nSource: Ord. 20071129-100; Ord. No. 20141106-124, Pt. 2, 11-17-14; Ord. No. 20250522-063, Pt. 2, 6-2-25.\n\n(A)\n\nS.M.A.R.T. Housing is housing that is safe, mixed-income, accessible, reasonably priced,\ntransit-oriented, and compliant with the City's Green Building Standards.\n\n(B)\n\nS.M.A.R.T. Housing must:\n\n(1)\n\nbe safe by providing housing that complies with Title 25 of the City Code (Land Development);\n\n(2)\n\nprovide mixed-income housing by including dwelling units that are reasonably-priced,\nas described in Subsections (C) and (D);\n\n(3)\n\nprovide for accessibility by:\n\n(a)\n\nincluding dwelling units that comply with the accessibility requirements of the Building\nCode in:\n\n(1)\n\neach building with four or more dwelling units; and\n\n(2)\n\nat least 10 percent of the dwelling units in each development; or\n\n(b)\n\nfor a development with three or fewer dwelling units, complying with the design and\nconstruction requirements of Chapter 5-1, Article 3, Division 2 (Design and Construction Requirements); and\n\n(4)\n\nexcept as provided in Subsection (E), be located within one-half mile walking distance\nof a local public transit route at time of application; and\n\n(5)\n\nachieve at least a one star rating under the Austin Green Building program.\n\n(C)\n\nA reasonably-priced dwelling unit is one that is affordable for purchase or rental\nby a household that meets the housing costs and income qualifications of this subsection.\n\n(1)\n\nThis paragraph provides qualifications on the amount of household income spent on\nhousing costs.\n\n(a)\n\nExcept as provided by Subparagraphs (b) and (c), housing costs of a household may\nnot exceed 30 percent of its gross income.\n\n(b)\n\nA household may spend up to 35 percent of its gross income on housing costs if a household\nmember receives City-approved homebuyer counseling.\n\n(c)\n\nA household that complies with other federal, state, or local income eligibility standards\nis not subject to the expenditure qualifications of Paragraphs (a) and (b).\n\n(2)\n\nThis paragraph provides qualifications on household income.\n\n(a)\n\nIf an applicant develops dwelling units for sale, reasonably-priced dwelling units\nmust serve households whose incomes average 80 percent of the median family income\nor below.\n\n(b)\n\nIf an applicant develops dwelling units for lease, reasonably-priced dwelling units\nmust serve households whose incomes average 60 percent of the median family income\nor below.\n\n(D)\n\nThe director may waive the transit-oriented requirement in (B)(4) if the project meets\none of the following criteria:\n\n(1)\n\nthe project will be located in a high opportunity area as identified by the director\nand established in the program guidelines;\n\n(2)\n\nthe application includes a letter from Capital Metropolitan Transportation Authority\nthat confirms a future route is documented in agency plans;\n\n(3)\n\ndeveloper applies for State or Federal Government funds, including the Low Income\nHousing Tax Credit Program, related to this project; or\n\n(4)\n\nproject affirmatively furthers fair housing as determined by the Director and in consideration\nof the City's Analysis of Impediments.\n\nSource: Ord. 20071129-100; Ord. No. 20141106-124, Pt. 3, 11-17-14; Ord. No. 20250522-063, Pt. 3, 6-2-25.\n\n(A)\n\nThe city manager may, in accordance with the director's determination under Subsection\n(B), waive all or a portion of fees described in the City's annual fee ordinance for\na S.M.A.R.T. housing development.\n\n(B)\n\nA developer is eligible for a waiver of the fees if the director determines that the\nS.M.A.R.T. housing development provides the percentage of reasonably priced dwelling\nunits prescribed by this subsection.\n\n(1)\n\nIf at least ten percent of the dwelling units are reasonably priced, the development\nis eligible for a waiver of 25 percent of the fees.\n\n(2)\n\nIf at least 20 percent of the dwelling units are reasonably priced, the development\nis eligible for a waiver of 50 percent of the fees.\n\n(3)\n\nIf at least 30 percent of the dwelling units are reasonably priced, the development\nis eligible for a waiver of 75 percent of the fees.\n\n(4)\n\nIf at least 40 percent of the dwelling units are reasonably priced, the development\nis eligible for a waiver of 100 percent of the fees.\n\nSource: Ord. 20071129-100; Ord. No. 20200220-056, Pt. 1, 3-2-20; Ord. No. 20240201-053, Pt. 1, 2-12-24; Ord. No. 20250522-063, Pt. 4, 6-2-25.\n\n(A)\n\nTo be eligible for the S.M.A.R.T. Housing program, unless a longer term is required\nby law, private agreement, or another provision of this Code, all reasonably priced\ndwelling units in a S.M.A.R.T. Housing development must remain reasonably priced for\nthe following affordability periods commencing on the date of initial occupancy:\n\n(1)\n\nif the unit is owner-occupied, a period of at least one year, or if the owner is receiving\nfederal housing assistance, a period of at least five years; or\n\n(2)\n\nif the unit is a rental unit, a period of at least five years.\n\n(B)\n\nIf a reasonably-priced dwelling unit within a S.M.A.R.T. Housing development is converted\nfrom a rental unit to an owner- occupied dwelling unit during the applicable affordability\nperiod, the dwelling unit shall be subject to the affordability period applicable\nto an owner-occupied dwelling unit, and the new affordability period begins on the\ndate that the converted dwelling unit is available for owner occupancy.\n\n(C)\n\nIf the development does not comply with the requirement to maintain the applicable\npercentage of dwelling units as reasonably- priced for the duration of the applicable\naffordability period, the developer shall reimburse the City for all fees.\n\n(D)\n\nBefore the director may certify, the applicant shall comply with Section 4-18-25 (Certification) except that the agreement must, at a minimum, include:\n\n(1)\n\nterms that require a defaulting applicant to pay the otherwise applicable fees;\n\n(2)\n\nliquidated damages in an amount up to twice the amount of fees waived, being such\nan amount that will fairly compensate the City for administrative costs incurred;\nand\n\n(3)\n\nliquidated damages that will fairly compensate the City for any breach that results\nin the loss of reasonably-priced dwelling units during the affordability period.\n\nSource: Ord. 20071129-100; Ord. No. 20250522-063, Pt. 5, 6-2-25.\n\n(A)\n\nThe requirements of this division seek to mitigate, through notification requirements\nand relocation assistance, the impacts of tenant displacement resulting from multi-family\nredevelopment and the demolition or change in use of multi-family properties and mobile\nhome parks. This division does not regulate or affect the landlord-tenant relationship.\n\n(B)\n\nExcept where otherwise provided, the requirements of this division do not apply to\nany dwelling unit:\n\n(1)\n\ndemolished or vacated because of damage caused by the tenant or by other events beyond\nthe owner's control, including fire, civil commotion, malicious mischief, vandalism,\ntenant waste, natural disaster or other destruction;\n\n(2)\n\nowned by a public housing agency;\n\n(3)\n\nlocated inside the boundaries of an educational institution that is occupied by students,\nfaculty, or staff of the institution;\n\n(4)\n\nfor which relocation assistance is required to be paid to the tenants under federal\nor state law; or\n\n(5)\n\nthat is operated as emergency or temporary shelter for homeless persons and owned\nor administered by a nonprofit organization or public agency.\n\n(C)\n\nIn this division,\n\n(1)\n\nMOBILE HOME PARK means a site containing five or more structures that:\n\n(a)\n\nare transportable in one or more sections;\n\n(b)\n\nin travelling mode, are at least 8 feet in width or 40 feet in length or, when erected\nonsite, are 320 square feet or more in area;\n\n(c)\n\nare built on a permanent chassis and designed to be used as a dwelling, with or without\na permanent foundation; and\n\n(d)\n\nincludes plumbing, heating, air-conditioning, and electrical systems; or\n\n(e)\n\nsatisfies all criteria other than the size requirements in Paragraph (1)(b).\n\n(2)\n\nMULTI-FAMILY PROPERTY means a property that includes at least five residential units;\n\n(3)\n\nMULTI-FAMILY REDEVELOPMENT means the demolition, alteration, repair, partial demolition,\nredevelopment, rezoning, or change in use of a multi-family property, or any portion\nof a multi-family property, or a mobile home park;\n\n(4)\n\nTENANT DISPLACEMENT means any condition that requires a tenant to vacate a multi-family\nbuilding or mobile home park due to multi-family redevelopment, where a tenant will\nnot be relocated to another comparably sized unit within the same building or site;\nand\n\n(5)\n\nUNPERMITTED REDEVELOPMENT means multi-family redevelopment that occurs without the\nappropriate approval under this title.\n\nSource: 20160901-050, Pt. 4, 9-12-16; Ord. No. 20230831-103, Pt. 3, 9-11-23.\n\n(A)\n\nThe requirements of this section apply to:\n\n(1)\n\nan application to:\n\n(a)\n\ndemolish, alter, or repair the interior or exterior of one or more residential units\nat a multi-family property that would result in the displacement of one or more tenants,\nincluding a demolition permit or a building permit;\n\n(b)\n\napprove a site plan or change of use permit for an existing mobile home park; or\n\n(c)\n\nrezone a property within the Mobile Home Residence (MH) District designation that\ncontains an existing mobile home park; or\n\n(2)\n\nunpermitted redevelopment that results in displacement of one or more tenants either\nbefore or after unpermitted redevelopment occurs.\n\n(B)\n\nNotification Timelines.\n\n(1)\n\nan applicant must provide tenant notification prior to submittal of the application\nin accordance with the timelines established under this subsection.\n\n(2)\n\nto demonstrate that required notification was provided prior to submittal of an application,\nthe applicant must include a certified statement, on a form approved by the director,\nconfirming that all tenants received notification required under this section within\nthe following timeframes:\n\n(a)\n\nfor a multi-family property, at least 120 days prior to the date application for a\nbuilding permit or a demolition permit was submitted; or\n\n(b)\n\nfor a mobile home park, at least 270 days prior to the date the application for a\nrezone, site plan, or change of use permit was submitted.\n\n(C)\n\nThe notification required by this section must be on a form approved by the director\nand must:\n\n(1)\n\nbe delivered:\n\n(a)\n\nby the applicant or the applicant's representative, or by registered or certified\nmail, with return receipt requested;\n\n(b)\n\nto all units:\n\n(i)\n\nproposed for demolition in a multi-family property under a permit application for\nwhich notice is required under Subsection (A)(1)(a) of this section; or\n\n(ii)\n\nlocated in a mobile home park included in a rezone, change of use, or site plan application\nfor which notice is required under Subsections (A)(1)(b), (c) of this section; or\n\n(c)\n\nin a manner authorized by the director; and\n\n(2)\n\ninclude the following information, in English, Spanish, and such other language as\nmay be required by the director:\n\n(a)\n\nthe applicant's name and contact information;\n\n(b)\n\na description of the development application for which notification is required under\nSubsection (A) of this section;\n\n(c)\n\na statement that the application may be reviewed on or after the 120th or 270th day,\nwhichever applies, following receipt of the notice and may result in displacement\nof tenants;\n\n(d)\n\na description of any tenant relocation assistance that may be available under Section 25-1-714 (Tenant Relocation Program), including income eligibility requirements and forms for requesting assistance;\n\n(e)\n\ninformation regarding applicable school district policies relating to district residency\nrequirements;\n\n(f)\n\ninformation regarding the requirements of state law for return of security deposits;\n\n(g)\n\ninformation regarding the availability of fee waivers from Austin Energy for obtaining\nutility service at a new residence where relocation is required due to displacement;\n\n(h)\n\nother information as may be required by the director, including programs and services\nto assistant displaced tenants; and\n\n(3)\n\nbe on a form provided by the director, which shall be uniform for all applicants except\nthat the director may require an additional language as provided under Paragraph (2).\n\n(D)\n\nIf an applicant requests an extension of a permit for which notification under this\nsection is required, the applicant must provide renotification to tenants consistent\nwith the requirements for a new application.\n\n(E)\n\nA landowner or landowner's agent must provide notification that complies with Subsection\n(C) prior to unpermitted redevelopment. In this subsection, prior to unpermitted redevelopment\nmeans:\n\n(1)\n\nfor a multi-family property, at least 120 days before unpermitted redevelopment begins;\nand\n\n(2)\n\nfor a mobile home park, at least 270 days before unpermitted redevelopment begins.\n\nSource: 20160901-050, Pt. 4, 9-12-16; Ord. No. 20220421-058, Pt. 2, 4-21-22; Ord. No. 20230831-103, Pt. 3, 9-11-23.\n\n(A)\n\nAt the time that notification is provided under Section 25-1-712 (Tenant Notification Required), the owner or operator of a multi-family property or mobile home park must post\none or more signs in accordance with this section.\n\n(B)\n\nThe sign must be on a form approved by the director and must:\n\n(1)\n\ndescribe the application for which notification is required under Section 25-1-712 (Tenant Notification) and state that any new or existing tenants may be required to relocate from the\nproperty as a result of proposed demolition or redevelopment; and\n\n(2)\n\nto the greatest extent feasible:\n\n(a)\n\nfor a mobile home park, be posted at the main entrance in a location visible to the\npublic from the adjacent public right-of-way or private drive; or\n\n(b)\n\nfor a multi-family property, be posted at the front of the leasing office or other\nprimary building entrance as determined by the director.\n\n(C)\n\nA sign required to be posted under this section must remain on the property until:\n\n(1)\n\nfor a multi-family property, the date that demolition, alteration, or repair activity\nbegins; and\n\n(2)\n\nfor a mobile home park, the earlier of:\n\n(a)\n\nthe date that the property ceases to be used as a mobile home park; or\n\n(b)\n\nif applicable, the date that the site plan approval or change of use permit expires;\nand\n\n(3)\n\nthe date that unpermitted redevelopment ends.\n\n(D)\n\nIf a landowner or a landowner's agent rents a unit to a new tenant following application\nfor a permit requiring notice under Section 25-1-712 (Tenant Notification Required), the landowner or landowner's agent must provide the tenant with notification that\nincludes the information required under Section 25-1-712(C) (Tenant Notification Required).\n\nSource: 20160901-050, Pt. 4, 9-12-16; Ord. No. 20230831-103, Pt. 3, 9-11-23.\n\n(A)\n\nThe director shall adopt a tenant relocation program by administrative rule for the\npurpose of mitigating the impacts of tenant displacement resulting from multifamily\nredevelopment within the City of Austin.\n\n(B)\n\nThe tenant relocation program must, at a minimum, include each of the elements described\nin this subsection.\n\n(1)\n\nTenant Relocation Fee. The program must include a methodology to be used by the director\nin recommending to the city council the amount of the fee required under Section 25-1-715 (Tenant Relocation Assistance—Developer Funded). The methodology shall include a nexus study that accounts for the impacts of displacement\nto tenant communities directly affected by multifamily redevelopment and to the community\nas a whole. The fee shall be consistently calculated and uniformly applied, but may\nvary based on number of units, bedrooms, and other objective criteria identified by\nthe nexus study.\n\n(2)\n\nEligibility for Tenant Relocation Assistance. The program shall establish eligibility\nrequirements that a tenant must meet in order to receive tenant relocation assistance\nunder Section 25-1-715 (Tenant Relocation Assistance—Developer Funded) or Section 25-1-716 (Tenant Relocation Assistance—City Funded). At a minimum, the eligibility requirements must:\n\n(a)\n\nrequire that a tenant:\n\n(i)\n\nhave a household income at or below 70% of median family income or, for residents\nof a mobile home park, 80% of median family income; and\n\n(ii)\n\nsubmit a claim form documenting income eligibility no later than the deadline established\nby the director; and\n\n(b)\n\nallow a tenant who resided at a property where multi-family redevelopment occurred\nif the tenant resided at the property:\n\n(i)\n\nfor a multi-family property, 120 days before multi-family redevelopment begins; or\n\n(ii)\n\nfor a mobile home park, 270 days before multi-family redevelopment begins; and\n\n(c)\n\nprohibit participation by tenants of multi-family redevelopment that is exempt from\nthis division under Section 25-1-711 (Purpose, Applicability, Exemptions, and Definitions), except that the director may allow use of funds under Section 25-1-716 (Tenant Relocation Assistance—City Funded) to provide relocation assistance for tenant displacement resulting from fire, civil\ncommotion, malicious mischief, vandalism, natural disaster, or other destruction beyond\nthe control of the owner or tenant.\n\n(3)\n\nUse of Tenant Relocation Assistance. The program must specify the types of expenses\nfor which tenant relocation assistance may be provided. Eligible expenses paid using\nfunds collected under Section 25-1-715 (Tenant Relocation Assistance—Developer Funded) must be reasonably attributable to tenant displacement based on the nexus study\nrequired under Paragraph (C)(1).\n\n(4)\n\nRefund Procedures. The program shall establish procedures by which an applicant who\npaid a tenant relocation fee under Section 25-1-715 (Tenant Relocation Assistance—Developer Funded) may request a refund of any fees not spent for an authorized purpose within ten\nyears after approval of an application for which notification is required under Section 25-1-712 (Tenant Notification Required).\n\n(C)\n\nThe director may include additional elements in the tenant relocation program, including\nbut not limited to notification forms and other documents required under Section 25-1-712 (Tenant Notification Required) and Section 25-1-713 (Additional Notice Requirements).\n\nSource: 20160901-050, Pt. 4, 9-12-16; Ord. No. 20230831-103, Pt. 3, 9-11-23.\n\n(A)\n\nAn applicant for multi-family redevelopment must pay a tenant relocation fee established\nby separate ordinance as a condition to approval of:\n\n(1)\n\na planned unit development (PUD) zoning district, as required under Section 2.3.2\n(Additional Requirements) of City Code Chapter 25-2, Subchapter B, Article 2, Division 5 (Planned Unit Developments); or\n\n(2)\n\na rezone or other discretionary land use approval that requires approval by the city\ncouncil and is reasonably likely to result in tenant displacement, unless waived by\nthe city council.\n\n(B)\n\nThe director shall deposit a fee imposed under this section into the Developer Fund\nfor Tenant Relocation Assistance, which is established under this section. The director\nshall use the fund to provide tenant relocation assistance to eligible tenants at\nthe development or site for which the payment was made, consistent with requirements\nadopted under Section 25-1-714 (Tenant Relocation Program).\n\nSource: 20160901-050, Pt. 4, 9-12-16.\n\n(A)\n\nThe City of Austin Tenant Relocation Fund is established for use in providing relocation\nassistance to tenants displaced by multi-family redevelopment.\n\n(B)\n\nThe director shall administer the fund consistently with guidelines established under\nSection 25-1-714 (Tenant Relocation Program) and may use the fund to provide relocation assistance to any tenant displaced due\nto:\n\n(1)\n\ndevelopment activity for which notification was required under Section 25-1-712 (Tenant Relocation Required), whether or not the applicant was required to pay a fee under Section 25-1-715 (Tenant Relocation Assistance—Developer Funded);\n\n(2)\n\nemergency orders to vacate based on health and safety concerns;\n\n(3)\n\nfire, civil commotion, malicious mischief, vandalism, natural disaster, or other destruction\nbeyond the control of the owner or tenant; or\n\n(4)\n\nmajor repairs or renovations of multifamily buildings.\n\nSource: 20160901-050, Pt. 4, 9-12-16.\n\n(A)\n\nA person commits an offense if the person fails to deliver the notification required\nunder Section 25-1-712 (Tenant Notification Required) to one or more units within a multi-family property or mobile home park. A person\ncommits a separate offense for each day the person fails to deliver required notification\nto an individual unit within a multi-family property or mobile home park for which\nnotification is required.\n\n(B)\n\nA person commits an offense if the person fails to post the notification required\nunder Section 25-1-713 (Additional Notification Requirements). A person commits a separate offense for each day the person fails to post the required\nnotification.\n\n(C)\n\nEach offense is punishable by a fine not to exceed $500 and requires proof of a culpable\nmental state.\n\nSource: 20160901-050, Pt. 4, 9-12-16; Ord. No. 20230831-103, Pt. 3, 9-11-23.\n\n(A)\n\nThe purpose of this division is to establish a voluntary affordable housing bonus\nprogram that allows for increased density for residential dwelling units.\n\n(B)\n\nThis division applies within the zoning jurisdiction.\n\n(C)\n\nThis division may be cited as \"Affordability Unlocked Bonus Program\".\n\n(D)\n\nThe director may adopt, implement, and enforce:\n\n(1)\n\nprogram guidelines; and\n\n(2)\n\nadministrative rules in accordance with Chapter 1-2 (Administrative Rules).\n\n(E)\n\nA provision of this title that is specifically applicable to a qualifying development\ngoverns over a conflicting provision of this title.\n\nSource: 20190509-027, Pt. 2, 5-20-19.\n\nIn this division,\n\n(1)\n\nGOVERNMENT-OPERATED AFFORDABLE HOUSING PROGRAM means a program operated by a federal,\nstate, or local department that provides financial or other form of subsidy for the\npurpose of providing affordable housing.\n\n(2)\n\nHOUSING FOR OLDER PERSONS means housing for households with at least one individual\nwho is at least 62 years of age at the time of initial occupancy.\n\n(3)\n\nMFI means median family income for the Austin metropolitan statistical area.\n\n(4)\n\nQUALIFYING DEVELOPMENT means a development certified under Section 25-1-724 (Certification) and participating in the Affordability Unlocked Bonus Program.\n\n(5)\n\nSLEEPING UNIT means a bedroom in a structure that serves as a dwelling unit for seven\nor more unrelated individuals who share amenities, such as a kitchen, bathrooms, or\nliving areas.\n\n(6)\n\nSUPPORTIVE HOUSING means housing that includes non-time-limited affordable housing\nassistance with wrap-around supportive services for individuals experiencing homelessness,\nas well as other individuals with disabilities.\n\n(A)\n\nA proposed development qualifies as a Type I development and is eligible for this\nprogram if:\n\n(1)\n\nit includes:\n\n(a)\n\na minimum of three dwelling units,\n\n(b)\n\nonly affordable dwelling units; or\n\n(c)\n\none or more structures that serve as a dwelling unit for seven or more unrelated individuals\nwho share amenities, such as a kitchen, bathrooms, or living areas;\n\n(2)\n\nat least 25 percent of the affordable dwelling units include two or more bedrooms,\nsupportive housing, housing for older persons, or any combination of the three;\n\n(3)\n\nnot more than 25 percent of the proposed development's gross floor area is for commercial\nuses;\n\n(4)\n\nit is new construction, it is redevelopment of a site without existing multi-family\nstructures, or the existing development on the site complies with the requirements\nin Subsection (D); and\n\n(5)\n\nit meets the requirements set forth in Section 25-1-723 (Affordability Requirements).\n\n(B)\n\nExcept for a proposed development participating in a government-operated affordable\nhousing program with stricter requirements, the applicant for a proposed rental development:\n\n(1)\n\nshall incorporate lease provisions that are consistent with:\n\n(a)\n\nthe U.S. Department of Housing and Urban Development (HUD) Section 8 Tenant-Based\nAssistance Housing Choice Voucher (HCV) Program related to the termination of tenancy\nby owner;\n\n(b)\n\nany lease addendum required as a condition to receive city or Austin Housing Finance\nCorporation (AHFC) funds; and\n\n(c)\n\n24 C.F.R. § 245.100 related to a tenant's right to organize; and\n\n(2)\n\nmay not discriminate on the basis of an individual 's source of income as defined\nin Section 5-1-13 (Definitions).\n\n(C)\n\nA proposed development qualifies as a Type 2 development and is eligible for additional\nbonuses if it meets the standards imposed in Subsections (A) and (B) plus one or more\nof the following:\n\n(1)\n\nat least 50 percent of the affordable dwelling units include two or more bedrooms;\n\n(2)\n\nfor a rental development:\n\n(a)\n\nat least 75 percent of the total units or sleeping units serve households whose incomes\naverage 60 percent MFI or below, rounded up to the nearest unit or sleeping unit;\nor\n\n(b)\n\nat least 10 percent of the affordable units or sleeping units serve households with\nincomes of 30 percent MFI or below, rounded up to the nearest unit or sleeping unit;\nor\n\n(3)\n\nfor an owner-occupied development, at least 75 percent of the owner-occupied dwelling\nunits or sleeping units serve households whose incomes average 80 percent MFI or below;\nor\n\n(4)\n\nis located within ¼ mile of an activity corridor designated in the Imagine Austin\nComprehensive Plan and is served by a bus or transit line.\n\n(D)\n\nA proposed development that will require the applicant to redevelop or rebuild an\nexisting multi-family structure is eligible for this program if:\n\n(1)\n\nthe proposed development meets the standards imposed in Subsections (A) and (B);\n\n(2)\n\nthe existing multi-family structure requires extensive repairs and for which rehabilitation\ncosts will exceed 50 percent of the market value, as determined by the building official;\n\n(3)\n\nthe proposed development will replace all existing units that were affordable to a\nhousehold earning 80 percent MFI or below in the previous year and have at least as\nmany bedrooms;\n\n(4)\n\nthe applicant provides current tenants with:\n\n(a)\n\nnotice and information about the proposed development on a form approved by the director;\nand\n\n(b)\n\nrelocation benefits that are consistent with Federal Uniform Relocation Assistance\nand Real Property Acquisition Policies Act of 1970, 42 U.S.C.A. 4601, et seq.; and\n\n(5)\n\nthe applicant grants current tenants the option to lease a unit of comparable affordability\nand size following completion of redevelopment.\n\nSource: 20190509-027, Pt. 2, 5-20-19.\n\n(A)\n\nAn applicant complies with the requirements in this section if the applicant participates\nin a government-operated affordable housing program that imposes, at a minimum, the\nsame affordability requirements.\n\n(B)\n\nA rental development must comply with at least the following:\n\n(1)\n\nat least 50 percent of the total units or sleeping units serve households whose incomes\naverage 60 percent MFI or below; and\n\n(2)\n\nat least 20 percent of the total units or sleeping units serve households with incomes\nof 50 percent MFI or below.\n\n(C)\n\nExcept for a Type 2 owner-occupied development that complies with the requirements\nin Section 25-1-722(C)(3), at least 50 percent of the owner-occupied dwelling units or sleeping units\nmust serve households whose incomes average 80 percent MFI or below.\n\n(D)\n\nIf the number of units required in this section include less than a whole unit, the\nunit number is rounded up to the nearest whole unit.\n\n(E)\n\nThe minimum affordability period for a rental development is the greater of the affordability\nperiod required for development receiving city or Austin Housing Finance Corporation\n(AHFC) funds or 40 years following the issuance of the last certificate of occupancy\nrequired for the qualifying development.\n\n(F)\n\nThe minimum affordability period for an owner-occupied dwelling unit is 99 years following\nthe issuance of a certificate of occupancy for the owner-occupied dwelling unit.\n\n(G)\n\nIn a multi-phased qualifying development, the director may begin the minimum affordability\nperiod upon the issuance of the last certificate of occupancy for each phase.\n\nSource: 20190509-027, Pt. 2, 5-20-19.\n\n(A)\n\nIf the director certifies that a proposed development meets the requirements of this\ndivision, the accountable official is authorized to process a development application\nas a qualifying development.\n\n(B)\n\nBefore the director may certify that a proposed development meets the requirements\nof this division, the applicant shall execute:\n\n(1)\n\nan agreement to preserve the minimum affordability period and related requirements\nimposed by this division; and\n\n(2)\n\na document for recording in the real property records that provides notice of or preserves\nthe minimum affordability requirements imposed by this division.\n\n(C)\n\nThe form of the documents described in Subsection (B) must be approved by the city\nattorney.\n\n(D)\n\nThe director may certify an applicant who complies with the requirements in Subsection\n(B) because the applicant participates in a government-operated affordable housing\nprogram that imposes, at a minimum, the same affordability requirements.\n\nSource: 20190509-027, Pt. 2, 5-20-19.\n\n(A)\n\nFor a rental development, the property owner or the property owner's agent shall provide\nthe director with information that allows the director to verify compliance with the\naffordability requirements. The information shall be provided on an annual basis and\non a form approved by the director.\n\n(B)\n\nIf, for any reason, the director is unable to confirm that the affordability requirements\nwere met during any 12-month period, the preceding 12 months may not be used to satisfy\nthe minimum affordability requirements in Section 25-1-723 (Affordability Requirements).\n\n(C)\n\nAn applicant complies with the requirements in this section if the applicant complies\nwith monitoring and income verification requirements that are imposed and enforced\nas part of a government-operated affordable housing program.\n\n(D)\n\nA person commits an offense if the person fails to comply with the requirement in\nSubsection (A). A culpable mental state is not required, and need not be proved. A\nperson commits a separate offense for each day the person fails to provide the documentation.\nEach offense is punishable by a fine not to exceed $500.\n\nSource: 20190509-027, Pt. 2, 5-20-19.\n\nFootnotes:\n\n--- (**4**) ---\n\n**Editor's note—**\nOrd. No. 20240229-070, Pt. 1, effective March 11, 2024, repealed §§ 25-1-751—25-1-756,\nwhich pertained to Residential Uses in Commercial Districts Incentive Program and\nderived from Ord. No. 20221201-055, Pt. 1, 12-12-22.\n",
  "start_line": 6849,
  "end_line": 7942,
  "subsections": []
}