{
  "id": "25-1-46",
  "title": "LAND USE COMMISSION",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "as determined in accordance with Section 25-1-46 (Land Use Commission).\n\n(61)\n\nLANDSCAPED AREA means an area devoted to plant material, planters, brick, stone, water,\naggregate, and other landscape features, excepting smooth concrete or asphalt, where\nthe use of inorganic materials does not predominate over the use of plants.\n\n(62)\n\nLARGE LOT means a lot of at least 10,000 square feet.\n\n(63)\n\nLOADING SPACE means an area used for loading or unloading goods from a vehicle in\nconnection with the use of the site on which the loading space is located.\n\n(64)\n\nLOCAL STREET means a street that serves traffic within a neighborhood or limited residential\ndistrict, and which is not necessarily continuous through several residential districts.\n\n(65)\n\nLOT means:\n\n(a)\n\na parcel of real property with a unique designation shown on a plat, record of survey,\nparcel map, or subdivision map recorded in the office of the County Clerk; or\n\n(b)\n\na parcel of real property established under zoning or subdivision regulations.\n\n(66)\n\nLOT LINE means a line or series of connected line segments bounding a lot.\n\n(67)\n\nMAINTENANCE EASEMENT, when used in reference to a small lot, means an easement granted\nby the owner of one lot to the owner of an adjoining lot for maintenance of a dwelling\nwithin five feet of a common side lot line.\n\n(68)\n\nMIRRORED GLASS means glass with a reflectivity index greater than 20 percent.\n\n(69)\n\nMOBILE HOME means a movable dwelling constructed on a chassis, designed for use without\na permanent foundation, and designed to be connected to utilities. The term excludes\nmanufactured modular housing designed to be set on a permanent foundation and recreational\nvehicles.\n\n(70)\n\nMOBILE HOME PARK means a unified development of mobile home spaces for rent or lease,\nincluding common areas and facilities for management, recreation, laundry and utility\nservices, storage, and similar services for the convenience of residents.\n\n(71)\n\nMUNICIPAL UTILITY DISTRICT means a district created under Chapters 50 and 54 of the\nTexas Water Code.\n\n(72)\n\nNEIGHBORHOOD ORGANIZATION means a an association that has registered as a neighborhood\norganization under this title.\n\n(73)\n\nNOTICE OWNER means the owner of real property as shown on the records of the tax appraisal\ndistrict in the county in which the property is located.\n\n(74)\n\n(RESERVED)\n\n(75)\n\nPARKING FACILITY means an area on a site for one or more off-street parking spaces\ntogether with driveways, maneuvering areas, and similar features, excluding commercial\noff-street parking and private garages.\n\n(76)\n\nPARKING SPACE means an area designated for parking a motor vehicle, excluding an area\nin a public right-of-way.\n\n(77)\n\nPARKING STRUCTURE means a building that includes five or more off-street parking spaces\ntogether with driveways, maneuvering areas, and similar features.\n\n(78)\n\nPEDESTRIAN WAY means the portion of a street right-of-way not used for a roadway.\n\n(79)\n\nPERMITTED USE means a use of property authorized by this title.\n\n(80)\n\nPLANNED DEVELOPMENT AREA means a combining district authorized by this chapter or\nan area subject to a planned development area agreement approved by the City.\n\n(81)\n\nPLANNED UNIT DEVELOPMENT means land developed as a single unit under unified control.\n\n(82)\n\nPLANNING JURISDICTION means the city and its extraterritorial jurisdiction.\n\n(83)\n\nPRELIMINARY PLAN means a map or drawing of a proposed plat, intended for consideration\nby the Land Use Commission or the city council in accordance with the requirements\nof this title.\n\n(84)\n\nPRINCIPAL BUILDING ENTRANCE means the primary building entrance where the majority\nof the public enters the building and which is open during all business hours, excluding\nsecondary access through an attached parking garage. For mixed use development in\na multi-tenant building, the entrance to each use at the tenant's outside entrance\nis considered a principal building entrance.\n\n(85)\n\nPRINCIPAL USE means the primary function of a site, building, or facility.\n\n(86)\n\nPRIVATE COMMON OPEN SPACE means a privately-owned outdoor or unenclosed area, located\non the ground or on a roof, balcony, deck, porch, or terrace, designed and accessible\nfor outdoor living, recreation, pedestrian access, or landscaping, and intended for\nuse by the residents, employees, and/or visitors to a development.\n\n(87)\n\nPRIVATE PERSONAL OPEN SPACE means a privately-owned outdoor or unenclosed area, located\non the ground or on a roof, balcony, deck, porch, or terrace, designed and accessible\nfor outdoor living, recreation, pedestrian access, or landscaping, and intended for\nuse solely by the individual residents of a condominium or multifamily dwelling unit.\n\n(88)\n\nPROPERTY means real property.\n\n(89)\n\nPUBLIC MOBILITY PROJECT means a transportation project, including a multi-use trail,\nrail or transit line, or street, funded by a public entity and located on publicly\nowned land or in the right-of-way or a public easement.\n\n(90)\n\nQUEUE LINE means an area for temporary parking of motor vehicles while awaiting service\nor other activity.\n\n(91)\n\nQUEUE SPACE means a space for a motor vehicle in a queue line.\n\n(92)\n\nREAR LOT LINE means the lot line that does not intersect the front lot line, or that",
  "start_line": 1145,
  "end_line": 1316,
  "subsections": []
}