{
  "id": "25-1-608",
  "title": "MULTI-FAMILY PARKLAND DEDICATION FEE",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "\n(A)\n\nFor a development application proposing multi-family uses, the director shall determine\nhow the applicant will satisfy applicable parkland dedication requirements. The director\nmay require the applicant to:\n\n(1)\n\ndedicate land that meets the criteria in Section 25-1-604 (Standards for Dedicated Parkland) as parkland;\n\n(2)\n\npay a parkland dedication fee under Section 25-1-608 (Multi-Family Parkland Dedication Fee); or\n\n(3)\n\ndedicate land that meets the criteria in Section 25-1-604 (Standards for Dedicated Parkland) as parkland and pay a reduced parkland dedication fee calculated under Section 25-1-608 (Multi-Family Parkland Dedication Fee).\n\n(B)\n\nIn determining how an applicant will satisfy their parkland dedication requirements\nunder this article, the director shall consider whether the development:\n\n(1)\n\nis located within the Deficient Park Area Map;\n\n(2)\n\nis adjacent to existing parkland;\n\n(3)\n\nhas sufficient acreage to meet the standards for dedicated parkland under the Parkland\nDedication Operating Procedures;\n\n(4)\n\nis needed to address a critical need for parkland or to remedy a deficiency identified\nby the Deficient Park Area Map; or\n\n(5)\n\nwould provide increased connectivity with existing or planned parks or recreational\namenities.\n\n(C)\n\nSubject to Subsection (D), if the director is requiring an applicant to satisfy their\nparkland dedication requirements entirely through land dedication, the following formula\nwill apply to determine the amount of land required:\n\n[# of multifamily units × .005] + [# of hotel/motel rooms × .004] = Acres of parkland\n\n(D)\n\nThe amount of land required to be dedicated may not exceed 10% of gross site area\nof the development.\n\n(E)\n\nIf a development application proposes both multi-family and commercial uses, the amount\nof land dedication required is based on a prorated portion of the land proposed for\nthe multi-family use.\n\nSource: Ord. No. 20231130-087, Pt. 2, 1-1-24.",
  "start_line": 6101,
  "end_line": 6167,
  "subsections": []
}