{
  "id": "25-1-365",
  "title": "EXEMPTION FROM COMPLIANCE",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "Except as provided in Section 25-1-364 (Temporary Certificate Of Occupancy) and Section 25-1-365 (Exemption From Compliance) of this article, the building official shall issue a certificate of occupancy if:\n\n(1)\n\nthe development has passed required inspections;\n\n(2)\n\nthe owner satisfies fiscal security requirements;\n\n(3)\n\nthe development has been completed in accordance with the released site plan, construction\nplans, and other ordinance requirements, as applicable; and\n\n(4)\n\nthe accountable official has signed a final acceptance letter for subdivision infrastructure\nor the accountable official and the developer have executed a developer agreement,\nif applicable.\n\nSource: Section 13-1-904(a); Ord. 990225-70; Ord. 000309-39; Ord. 031211-11.\n\n(A)\n\nA person may file an application with the building official for:\n\n(1)\n\na temporary certificate of occupancy before the building or structure is finished\nor\n\n(2)\n\na temporary certificate of retail occupancy in connection with a temporary retail\nuse permit approved under Section 25-2-921(F) (Temporary Uses Described).\n\n(B)\n\nThe building official may issue a temporary certificate of occupancy if the building\nofficial determines that the proposed use or occupancy is not a hazard to life, health,\nor the public safety.\n\nSource: Section 13-1-904(b); Ord. 990225-70; Ord. 031211-11; Ord. 20111110-075.\n\n(A)\n\nThis section applies to an existing use or occupancy for which a certificate of occupancy\nwas not issued if:\n\n(1)\n\nthe structure in which the use or occupancy occurs existed before March 1, 1986;\n\n(2)\n\nthe use or occupancy was established before March 1, 1986;\n\n(3)\n\nthe use or occupancy was not subject to an enforcement action on January 1, 1988;\n\n(4)\n\nthe use is a permitted use or is a nonconforming use; and\n\n(5)\n\nthe use is not an adult-oriented business use.\n\n(B)\n\nThe building official shall issue a certificate of occupancy for a use or occupancy\ndescribed in Subsection (A) if the building official determines that continuing the\nexisting use or occupancy is not a hazard to life, health, or the public safety.\n\n(C)\n\nThe building official shall issue a certificate of occupancy under Subsection (B)\nnotwithstanding the noncompliance of an existing use or occupancy or of a building\nin which the use or occupancy occurs with applicable technical code requirements or\nsite development regulations.\n\nSource: Section 13-1-732(f); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nSubject to the requirements of Subsection (B) of this section, the director shall:\n\n(1)\n",
  "start_line": 4421,
  "end_line": 4511,
  "subsections": [
    "25-1-365-A",
    "25-1-365-B",
    "25-1-365-A",
    "25-1-365-B",
    "25-1-365-C",
    "25-1-365-A"
  ]
}