{
  "id": "25-1-724",
  "title": "CERTIFICATION",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "(A)\n\nIn this section, a qualifying development is a development certified under Section 25-1-724 (Certification) and participating in the Affordability Unlocked Bonus Program.\n\n(B)\n\nNotwithstanding any ordinance or City Code provision to contrary, a qualifying development\nis a permitted use under Section 25-2-491 (Permitted, Conditional, and Prohibited Uses) in:\n\n(1)\n\na residential base zoning district;\n\n(2)\n\na commercial base zoning district;\n\n(3)\n\na special purpose base zoning district, except on a site designated:\n\n(a)\n\nagricultural (AG),\n\n(b)\n\naviation (AV); or\n\n(4)\n\na combining and overlay district.\n\n(C)\n\nNo more than 25 percent of the gross floor area of the qualifying development may\nbe comprised of commercial uses. The permitted commercial uses are determined using\nthe base zoning district.\n\n(D)\n\nA qualifying development is not required to comply with:\n\n(1)\n\nthe height and setback requirements of Article 10 (Compatibility Standards) except to maintain side setbacks as required by the base zoning district;\n\n(2)\n\nthe maximum floor-to-area ratio for the applicable base zoning district under Section 25-2-492 (Site Development Regulations);\n\n(3)\n\nSubchapter F (Residential Design and Compatibility Standards) except to maintain side setbacks as required by the base zoning district;\n\n(4)\n\nSection 25-2-773 (Duplex, Two-Unit and Three-Unit Residential Uses); or\n\n(5)\n\nminimum site area requirements.\n\n(E)\n\nThis subsection applies to a qualifying development located in urban residence (SF-5)\nor more restrictive zoning district and the height of the development exceeds 35 feet\nor three stories.\n\n(1)\n\nA qualifying development must comply with:\n\n(a)\n\nSection 25-2-1066 (Screening Requirements); and\n\n(b)\n\nSubsections (A) and (B) in Section 25-2-1067 (Design Regulations).\n\n(2)\n\nA person must enclose a refuse receptacle, including a dumpster.\n\n(3)\n\nThe location of and access to a refuse receptacle is subject to review and approval\nby the accountable official.\n\n(4)\n\nA person may not collect or allow another to collect refuse receptacles between 10:00\np.m. and 7:00 a.m.\n\nSource: Ord. No. 20190509-027, Pt. 3, 5-20-19; Ord. No. 20231207-001, Pt. 18, 12-18-23.",
  "start_line": 15149,
  "end_line": 15244,
  "subsections": []
}