{
  "id": "25-1-182",
  "title": "INITIATING AN APPEAL",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "An appellant's statement of specific reasons for appeal that is required by Section 25-1-182 (Initiating An Appeal) may only include information directly related to the director's\ndetermination under Subsection (A)(10) of this section of whether a replacement site\nplan changes a condition of approval of the zoning site plan.\n\nSource: Sections 13-1-617 and 13-1-644(a); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThis section does not apply to a site plan described in Section 25-5-82 (Expiration Of A Site Plan Approved Before January 1, 1988).\n\n(B)\n\nExcept as provided in Subsections (C), (D), and (E) of this section, a site plan expires\nthree years after the date of its approval.\n\n(C)\n\nA site plan does not expire if:\n\n(1)\n\nbuilding permits required to construct all the buildings shown on the site plan are\nissued, and those building permits are in effect until the work is completed and certificates\nof occupancy are issued;\n\n(2)\n\nif building permits are not required to finish development of the site plan, any required\nsite work is begun and diligently pursued to completion, and a certificate of compliance\nor certificate of occupancy is issued; or\n\n(3)\n\na request for extension granted under Section 25-5-62 (Extension Of Released Site Plan By Director).\n\n(D)\n\nA phase of a phased site plan expires on the expiration date determined under Section 25-5-21 (Phased Site Plan) unless:\n\n(1)\n\nbuilding permits required to construct all the buildings shown on the phase are issued,\nand those building permits are in effect until the work is completed and certificates\nof occupancy are issued; or\n\n(2)\n\nif building permits are not required to finish development of the phase, any required\nsite work on the phase is begun and diligently pursued to completion, and a certificate\nof compliance or certificate of occupancy is issued.\n\n(E)\n\nNotwithstanding Subsection (D) of this section, if the first phase of a phased site\nplan expires, the entire site plan expires.\n\nSource: Sections 13-1-614 and 13-1-616; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to a site plan approved before January 1, 1988.\n\n(B)\n\nExcept as provided in Subsections (C) and (D) of this section, a site plan approved\nbefore January 1, 1988 is expired.\n\n(C)\n\nIf the expiration date of a site plan was extended by the director or the Land Use\nCommission, the site plan expires on the extended expiration date.\n\n(D)\n\nThe expiration dates of the site plans described in this subsection are as follows:\n\n(1)\n\nA site plan incorporated into a planned development area agreement approved by council\nexpires on the date established in the agreement. If the agreement does not establish\nan expiration date, the site plan does not expire.\n\n(2)\n\nA site plan approved by council before December 15, 1988 for land designated as a\nplanned unit development zoning district does not expire.\n\n(3)\n\nA site plan incorporated into an ordinance zoning or rezoning the property covered\nby the site plan does not expire.\n\n(4)\n\nA site plan incorporated into a restrictive covenant that may be modified, amended,\nor terminated only by the mutual agreement of the council and the owner of the property\ndoes not expire except as provided by the restrictive covenant.\n\n(E)\n\nA person may use or develop land in accordance with an unexpired site plan described\nin this section if the use or development complies with the requirements of this subsection.\n\n(1)\n\nIf an application for site plan approval was filed after August 31, 1987, development\nof the site plan may comply with the ordinances and regulations in effect on the date\nthe application for site plan approval was filed.\n\n(2)\n\nIf an application for site plan approval was filed before September 1, 1987, development\nof the site plan shall comply with the ordinances and regulations in effect on the\ndate a request for a development permit is filed. The director may waive compliance\nwith a provision of an ordinance or regulation that the director determines is not\nrequired to protect life or public safety. A waiver under this subsection shall be\nthe minimum required to allow development in accordance with the site plan.\n\nSource: Section 13-1-615; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nIf a site plan is required under this chapter and an approved site plan expires, the\ndirector or building official may not issue a permit, certificate of occupancy, or\ncertificate of compliance for the use or development of the land.\n\nSource: Section 13-1-616; Ord. 990225-70; Ord. 031211-11.\n\nThis article applies to an administrative site plan. An administrative site plan is\na site plan that does not require approval by the Land Use Commission under Article\n3 (Land Use Commission Approved Site Plans).\n\nSource: Section 13-1-640; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe director shall approve a proposed site plan if the director determines that the\nsite plan complies with the requirements of this title.\n\n(B)\n\nIf the director determines that a proposed site plan does not comply with the requirements",
  "start_line": 46139,
  "end_line": 46278,
  "subsections": [
    "25-1-182-A",
    "25-1-182-B",
    "25-1-182-C",
    "25-1-182-D",
    "25-1-182-E",
    "25-1-182-A",
    "25-1-182-B",
    "25-1-182-C",
    "25-1-182-D",
    "25-1-182-E",
    "25-1-182-A",
    "25-1-182-B"
  ]
}