{
  "id": "25-1-541",
  "title": "VESTED RIGHTS DETERMINATION",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "in writing, after the director issues a vested rights determination under Section 25-1-541 (Vested Rights Determination) and before the application expires under Section 25-1-82 (Application Requirements and Expiration). The request must identify:\n\n(1)\n\ncurrent regulations for which compliance would be required, other than regulations\nexempt from vested rights protections under state law;\n\n(2)\n\nadditional restrictions on the nature and intensity of the proposed development; and\n\n(3)\n\nany modifications or waivers requested as a condition to the agreement, including\nbut not limited to provisions for the transfer or averaging of impervious cover to\ninclude additional property or changes to the original project that increase compatibility\nwith adjacent land uses.\n\n(C)\n\nThe director may recommend a project consent agreement for approval to the city council\nif the director finds that the agreement achieves a greater degree of environmental\nprotection and compatibility with adjacent land uses than would occur if a project\ndeveloped to the full extent of vested rights that have been verified or are reasonably\nlikely to exist for the project.\n\n(D)\n\nIn making a determination under Subsection (C) of this section, the director shall\nconsider:\n\n(1)\n\nthe degree to which vested rights for the project have been established;\n\n(2)\n\nthe importance of particular regulations to achieving adopted planning goals or policies\nfor the area in which the project is located; and\n\n(3)\n\na recommendation from the environmental officer regarding the environmental benefits\nof the proposed agreement, if vested rights from the regulations of Chapter 25-8 (Environment) are asserted for the project.\n\n(E)\n\nThe city council may consider approval of a project consent agreement under this section\nonly if the agreement is recommended by the director or initiated by the city council.\nBefore the council acts on a consent agreement, the director shall seek a recommendation\nfrom the Environmental Board and the Land Use Commission, and the council shall hold\na public hearing. The director shall provide notice of the hearing under Section 25-1-132(B) (Notice of Public Hearing).\n\n(F)\n\nIn acting on a project consent agreement, the city council may approve, deny, or modify\nthe agreement based on the standard applicable to the director's review under Subsections\n(C) and (D) of this section. A project consent agreement may waive or modify site\ndevelopment regulations applicable to a project as deemed appropriate by the city\ncouncil.\n\n(G)\n\nA project consent agreement for a project located in the extraterritorial jurisdiction\nmay include a development agreement as authorized under Section 212.172 of the Local\nGovernment Code. The director shall review a proposed development agreement concurrent\nwith an application for a project consent agreement, but council may consider the\nagreements separately or as a single agreement.\n\n(H)\n\nA project consent agreement is subject to the expiration requirements specified in\nthis subsection.\n\n(1)\n\nA project consent agreement approved by the city council expires on the 90\nth\nday after approval, unless the applicant has submitted a complete site plan application\nfor review by the director under the terms of the agreement.\n\n(2)\n\nFollowing submittal of a site plan application, a project consent agreement expires\nif:\n\n(a)\n",
  "start_line": 5436,
  "end_line": 5523,
  "subsections": [
    "25-1-541-C",
    "25-1-541-D",
    "25-1-541-E",
    "25-1-541-F",
    "25-1-541-G",
    "25-1-541-H"
  ]
}