{
  "id": "25-1-197",
  "title": "USE DETERMINATIONS",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "the Board of Adjustment under Section 25-1-197 (Use Determinations).\n\n(D)\n\nThe director shall notify the Planning Commission and the Zoning and Platting Commission\nof the filing of an appeal within 30 days of the filing, and of the disposition of\nthe appeal within 30 days of disposition.\n\n(E)\n\nThe director shall maintain a list of determinations made under this section.\n\nSource: Section 13-2-7; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11;\nOrd. 20120426-122.\n\n(A)\n\nResidential uses include the occupancy of living accommodations on a nontransient\nbasis. Residential uses exclude institutional living arrangements providing 24-hour\nskilled nursing or medical care and those providing forced residence, including mental\nhospitals and prisons.\n\n(B)\n\nResidential use classifications are described as follows:\n\n(1)\n\nBED AND BREAKFAST RESIDENTIAL use is the use of a residential structure to provide\nrooms for temporary lodging for overnight guests on a paying basis.\n\n(2)\n\nCONDOMINIUM RESIDENTIAL use is the use of a site for attached or detached condominiums,\nas defined in the Texas Property Code.\n\n(3)\n\nCONSERVATION SINGLE FAMILY RESIDENTIAL use is the use of a site for multiple detached\ndwelling units with each dwelling unit located on an individual lot and the remainder\nof the site being jointly-owned and preserved as open space.\n\n(4)\n\nDUPLEX RESIDENTIAL use is the use of a site for two dwelling units within a single\nbuilding, other than a mobile home.\n\n(5)\n\nGROUP RESIDENTIAL use is the use of a site for occupancy by 16 or more adults and\na third party prepares or provides food for the occupants on a weekly or longer basis.\nThis use includes fraternity and sorority houses, dormitories, residence halls, and\nboarding houses.\n\n(6)\n\nMOBILE HOME RESIDENTIAL use is the use of a site for occupancy of mobile homes on\na weekly or longer basis. This use includes mobile home parks and mobile home subdivisions.\n\n(7)\n\nMULTIFAMILY RESIDENTIAL use is the use of a site for four or more dwelling units,\nwithin one or more buildings, and includes condominium residential use.\n\n(8)\n\nRETIREMENT HOUSING (LARGE SITE) use is the use of a site for more than 12 dwelling\nunits designed and marketed specifically for the elderly, the physically handicapped,\nor both.\n\n(9)\n\nRETIREMENT HOUSING (SMALL SITE) use is the use of a site for 3 to 12 dwelling units\ndesigned and marketed specifically for the elderly, the physically handicapped, or\nboth.\n\n(10)\n\nSHORT-TERM RENTAL use is the rental of a housing unit or a portion of a housing unit\nfor a period of less than 30 consecutive days. The use does not include an extension\nfor less than 30 consecutive days of a previously existing rental agreement of 30\nconsecutive days or more or a rental between the parties to the sale of that housing\nunit.\n\n(11)\n\nSINGLE-FAMILY ATTACHED RESIDENTIAL use is the use of a site for two dwelling units,\neach located on a separate lot, that are constructed with common or abutting walls\nor connected by a carport, garage, or other structural element.\n\n(12)\n\nSINGLE-FAMILY RESIDENTIAL use is the use of a site for only one dwelling unit, other\nthan a mobile home.\n\n(13)\n\nSMALL LOT SINGLE-FAMILY RESIDENTIAL use is the use of a small lot for only one dwelling\nunit, other than a mobile home.\n\n(14)\n\nTOWNHOUSE RESIDENTIAL use is the use of a site for townhouses.\n\n(15)\n\nTHREE-UNIT RESIDENTIAL use is the use of a lot for three dwelling units other than\na mobile home.\n\n(16)\n\nTWO-UNIT RESIDENTIAL use is the use of a lot for two dwelling units, each in a separate\nbuilding, other than a mobile home.\n\nSource: Section 13-2-2; Ord. 990225-70; Ord. 990520-38; Ord. 031211-11; Ord. 041118-57;\nOrd. 20100819-064; Ord. 20120802-122; Ord. No. 20231207-001, Pt. 2, 12-18-23; Ord. No. 20240516-006, Pt. 3, 5-27-24; Ord. No. 20250227-039, Pt. 4, 10-1-25.\n\n(A)\n\nCommercial uses include the sale, rental, servicing, and distribution of goods, and\nthe provision of services, other than those classified as industrial or civic uses.\n\n(B)\n\nCommercial use classifications are described as follows:\n\n(1)\n\nADMINISTRATIVE AND BUSINESS OFFICES use is the use of a site for the provision of\nexecutive, management, or administrative services. This use includes:\n\n(a)\n\nadministrative offices and services, including real estate, insurance, property management,\ninvestment, personnel, travel, secretarial, telephone answering, and photocopy and\nreproduction; and\n\n(b)\n\nbusiness offices for public utilities, organizations, associations, and other use\nclassifications if the service rendered is customarily associated with administrative\noffice services.\n\n(2)\n\nAGRICULTURAL SALES AND SERVICES use is the use of a site for the on-site sale of feed,\ngrain, fertilizers, pesticides and similar goods, or the provision of agricultural\nservices with incidental storage of goods off-site. This use includes hay, feed, and\ngrain stores and tree service firms.\n\n(3)\n\nALTERNATIVE FINANCIAL SERVICES BUSINESSES use is the use of a site for a check cashing\nbusiness, payday advance or loan business, money transfer business, motor vehicle\ntitle loan business, or a credit access business as defined in this section.\n\n(a)\n\nThis use excludes:\n\n(1)\n\na state or federally chartered bank, savings and loan association or credit union,\nor a pawnshop, and\n\n(2)\n\na convenience store, supermarket, or other retail establishment where consumer retail\nsales constitute at least 75% of the total gross revenue generated on site.\n\n(b)\n\nA check cashing business is an establishment that provides one or more of the following:\n\n(1)\n\nan amount of money that is equal to the face of a check or the amount specified in\na written authorization for an electronic transfer of money, less any fee charged\nfor the transaction;\n\n(2)\n\nan agreement not to cash a check or execute an electronic transfer of money for a\nspecified period of time; or\n\n(3)\n\nthe cashing of checks, warrants, drafts, money orders, or other commercial paper for\ncompensation by any other person or entity for a fee.\n\n(c)\n\nA payday advance or loan business is an establishment that makes small consumer loans\nof $2,500 or less, usually backed by postdated check or authorization to make an electronic\ndebit against an existing financial account, where the check or debit is held for\nan agreed-upon term or until a customer's next payday and then cashed unless the customer\nrepays the loan to reclaim the check or debit. Such establishments may charge a flat\nfee or other service charge and/or a fee or interest rate based on the size of the\nloan amount.\n\n(d)\n\nA motor title loan business is an establishment that makes small consumer loans of\n$2,500 or less that leverage the equity value of a car or other vehicle as collateral\nwhere the title to such vehicle is owned free and clear by the loan applicant and\nany existing liens on the vehicle cancel the application. Failure to repay the loan\nor make interest payments to extend the loan allows the lender to take possession\nof the vehicle.\n\n(e)\n\nA credit access business has the same meaning as defined in Section 393.601 of the\nTexas Finance Code.\n\n(4)\n\nART GALLERY use is the use of a site for the display or sale of art.\n\n(5)\n\nART WORKSHOP use is use of a site for the production of art or handcrafted goods,\nand it includes the incidental sale of the art produced.\n\n(6)\n\nAUTOMOTIVE RENTALS use is the use of a site for the rental of automobiles, noncommercial\ntrucks, trailers, or recreational vehicles, including incidental parking and servicing\nof vehicles. This use includes auto rental agencies, trailer rental agencies, and\ntaxicab parking and dispatching.\n\n(7)\n\nAUTOMOTIVE REPAIR SERVICES use is the use of a site for the repair of automobiles,\nnoncommercial trucks, motorcycles, motor-homes, recreational vehicles, or boats, including\nthe sale, installation, and servicing of equipment and parts. This use includes muffler\nshops, auto repair garages, tire sales and installation, wheel and brake shops, body\nand fender shops, and similar repair and service activities, but excludes dismantling\nor salvage.\n\n(8)\n\nAUTOMOTIVE SALES use is the use of a site for sale or rental of automobiles, noncommercial\ntrucks, motorcycles, motor-homes, recreational vehicles, or boats, including incidental\nstorage, maintenance, and servicing. This use includes new and used car dealerships,\nmotorcycle dealerships, and boat, trailer, and recreational vehicle dealerships.\n\n(9)\n\nAUTOMOTIVE WASHING use is the use of a site for washing and cleaning of passenger\nvehicles, recreational vehicles, or other light duty equipment.\n\n(10)\n\nBAIL BOND SERVICES use is the use of a site by a licensed bail bond surety to provide\nbail bond services regulated by Texas Occupations Code Chapter 1704. The use does\nnot include bail bond services that are provided by an attorney and that are exempt\nfrom the state licensure requirements under Texas Occupations Code Section 1704.163.\n\n(11)\n\nBUILDING MAINTENANCE SERVICES use is the use of a site for provision of maintenance\nand custodial services to firms rather than individuals. This use includes janitorial\nservice, landscape maintenance, and window cleaning services.\n\n(12)\n\nBUSINESS OR TRADE SCHOOL use is the use of a site for provision of education or training\nin business, commerce, language, or other similar activity or occupational pursuit\nthat is not otherwise described as a home occupation, college, university, or public\nor private educational facility.\n\n(13)\n\nBUSINESS SUPPORT SERVICES use is the use of a site for sale, rental, or repair of\nequipment or supplies used by office, professional, or service establishments, but\nexcludes automotive, construction, and farm equipment. This use includes office equipment\nand supply firms, small business machine repair shops, and hotel equipment and supply\nfirms.\n\n(14)\n\nCAMPGROUND use is the use of a site for provision of camping or parking areas and\nincidental services for travelers in recreational vehicles or tents. This use includes\nrecreation vehicle parks.\n\n(15)\n\nCARRIAGE STABLE use is the use of a site for housing of horses used solely to pull\ncarriages, but excludes uses permitted in the description of stable.\n\n(16)\n\nCOCKTAIL LOUNGE use is the use of a site for retail sale of alcoholic beverages for\nconsumption on the premises, including taverns, bars, and similar uses, other than\na restaurant use as that term is described in this section.\n\n(17)\n\nCOMMERCIAL BLOOD PLASMA CENTER use is the use of a site as a facility for the donation\nor sale by individual donors of blood plasma and other blood products, with the exception\nof whole blood. A \"blood bank\" as defined by Texas Health and Safety Code Section\n162.001 is not a commercial blood plasma center.\n\n(18)\n\nCOMMERCIAL OFF-STREET PARKING use is the use of a site for the parking of motor vehicles\non a temporary basis within a privately owned off-street parking facility. This use\nincludes commercial parking lots and garages and excludes parking as an accessory\nuse.\n\n(19)\n\nCOMMUNICATIONS SERVICES use is the use of a site for the provision of broadcasting\nor information relay services through electronic and telephonic mechanisms, but excludes\nmajor utility facilities. This use includes television, film, or sound recording studios,\ntelecommunication service centers, and telegraph service offices.\n\n(20)\n\nCONSTRUCTION SALES AND SERVICES use is a use involving construction activities, the\nincidental storage of materials on sites other than construction sites, and the on-site\nsale of materials used in the construction of buildings or other structures, other\nthan retail sale of paint, fixtures and hardware. This use includes building materials\nstores, tool and equipment rental or sales, and building contractor businesses, but\nexcludes automobile sales, automobile rentals, automobile washing, automotive repair\nservices, commercial off-street parking, equipment repair services, equipment sales,\nservice stations, and vehicle storage.\n\n(21)\n\nCONSUMER CONVENIENCE SERVICES use is the use of a site for the provision of convenient\nand limited services to individuals in access-controlled facilities that make twenty-four\nhour operation possible. This use includes the renting of private postal and safety\ndeposit boxes to individuals and automated banking machines.\n\n(22)\n\nCONSUMER REPAIR SERVICES use is the use of a site for the provision of repair services\nto individuals or households rather than firms. This use includes appliance repair\nshops, watch or jewelry repair shops, and musical instrument repair shops, and excludes\nautomotive repair services, equipment repair services, and service stations.\n\n(23)\n\nCONVENIENCE STORAGE use is storage services primarily for personal effects and household\ngoods within enclosed storage areas having individual access. This use includes mini-warehouses,\nand excludes workshops, hobby shops, manufacturing, and commercial activity.\n\n(24)\n\nDROP-OFF RECYCLING COLLECTION FACILITY use is a facility used for the collection and\ntransfer, but not the actual processing, of recyclable materials. Recyclable materials\ninclude glass, paper, plastic, cans, or other source-separated, nonputrescible materials,\nand excludes motor oil, chemicals, household appliances, tires, automobiles, automobile\nparts, and putrescible materials.\n\n(25)\n\nELECTRIC VEHICLE CHARGING use is the use of a site for the charging of an electric\nvehicle, including battery charging stations and rapid charging stations, each as\ndefined by the United States Department of Energy.\n\n(26)\n\nELECTRONIC PROTOTYPE ASSEMBLY use is the use of a site for the assembly of prototype\nelectrical and electronic components for computers, computer peripherals, scientific\nor medical measuring or analyzing instruments, radio, telephone, and similar equipment.\nThis use excludes the production of goods for sale to customers, and chip, wafer,\nor semiconductor prototype assembly.\n\n(27)\n\nELECTRONIC TESTING use is the use of a site for testing an electrical or electronic\ncomponent for a computer, computer peripheral, radio, telephone, scientific or medical\ninstrument, or similar equipment. The use excludes the manufacture or assembly of\na product.\n\n(28)\n\nEQUIPMENT REPAIR SERVICES use is the use of a site for the repair of trucks of one\nton or greater capacity, tractors, construction equipment, agricultural implements,\nor similar heavy equipment. This use includes truck repair garages, tractor and farm\nimplement repair services, and machine shops, but excludes dismantling and salvage\nactivity.\n\n(29)\n\nEQUIPMENT SALES use is the use of a site for the sale or rental of trucks of one ton\nor greater capacity, tractors, construction equipment, agricultural implements, mobile\nhomes, or similar heavy equipment, including incidental storage, maintenance, and\nservicing. This use includes truck dealerships, construction equipment dealerships,\nand mobile home sales establishments.\n\n(30)\n\nEXTERMINATING SERVICES use is the use of a site for the eradication or control of\nrodents, insects, or other pests with incidental storage on sites other than where\nthe service is rendered.\n\n(31)\n\nFINANCIAL SERVICES use is the use of a site for the provision of financial and banking\nservices. This use includes banks, savings and loan institutions, stock and bond brokers,\nloan and lending activities, and similar services. This use excludes alternative financial\nservices businesses uses as defined in this section.\n\n(32)\n\nFOOD PREPARATION use is the use of a site for the production of prepared food for\nwholesale distribution in a structure with not more than 5,000 square feet of gross\nfloor area. The use includes wholesale bakeries, commercial kitchens, and specialty\nfood processing or packaging shops, but excludes the on-site slaughter of animals\nand the commercial production of ice.\n\n(33)\n\nFOOD SALES use is the use of a site for the retail sale of food or household products\nfor home consumption. This use includes grocery stores, delicatessens, meat markets,\nretail bakeries, and candy shops.\n\n(34)\n\nFUNERAL SERVICES use is the use of a site for the preparation human dead for burial\nor arranging or managing funerals. This use includes funeral homes and mortuaries.\n\n(35)\n\nGENERAL RETAIL SALES (CONVENIENCE) use is the use of a site for the sale or rental\nof commonly used goods and merchandise for personal or household use, but excludes\nuses classified more specifically in this section. This use includes the provision\nof household cleaning and maintenance products, drugs, cards, stationery, notions,\nbooks, tobacco products, cosmetics, specialty items, apparel, jewelry, fabrics, cameras,\nphotography services, household electronic equipment, records, sporting equipment,\nkitchen utensils, small home appliances, art supplies and framing, arts and antiques,\npaint, interior decorating services, office supplies, and bicycles.\n\n(36)\n\nGENERAL RETAIL SALES (GENERAL) use is the use of a site for the sale or rental of\ncommonly used goods for personal or household use, but excludes uses classified more\nspecifically in this section. This use includes department stores, furniture stores,\nand establishments providing home furnishings, appliances, wallpaper, floor-covering,\nor automotive parts and accessories (excluding service and installation).\n\n(37)\n\nHOTEL-MOTEL use is the use of a site for the provision of rooms for temporary lodging.\nThis use includes hotels, motels, and transient boarding houses.\n\n(38)\n\nINDOOR ENTERTAINMENT use is a predominantly spectator use conducted within an enclosed\nbuilding. This use includes meeting halls and dance halls.\n\n(39)\n\nINDOOR SPORTS AND RECREATION use is a recreational use conducted within an enclosed\nbuilding. This use includes bowling alleys, billiard parlors, ice and roller skating\nrinks, penny arcades, electronic video arcades, and indoor racquetball courts.\n\n(40)\n\nKENNELS use is the use of a site for the boarding and care of dogs, cats, or similar\nsmall animals. This use includes boarding kennels, pet motels, and dog training centers.\n\n(41)\n\nLAUNDRY SERVICES use is the use of a site for the provision of laundering, dry cleaning,\nor dyeing services other than those classified as personal services. This use includes\nbulk laundry and cleaning plants, diaper services, and linen supply services.\n\n(42)\n\nLIQUOR SALES use is the use of a site for the retail sale of alcoholic beverages for\noff-premises consumption. This use includes liquor stores and bottle shops.\n\n(43)\n\nMARINA use is:\n\n(a)\n\nthe wet or dry storage or docking of seaworthy watercraft, including ramps and hoists\nfor boats, for profit; or\n\n(b)\n\nthe provision of docks, wharves, piers, floats, or similar structures for the anchoring,\nmooring, housing, or storing of more than three watercraft.\n\n(44)\n\nMEDICAL OFFICES use is the use of a site for the consultation, diagnosis, therapeutic,\npreventative, or corrective personal treatment by doctors, dentists, medical or dental\nlaboratories, or similar practitioners of medical and healing arts for humans, licensed\nfor practice by the state. The use includes a compounding pharmacy that does not exceed\n3,000 square feet of gross floor area. A compounding pharmacy may prepare and sell\nprescription drugs and also sell non-prescription drugs, medical supplies, and other\nhealth products. The sale of other merchandise is permitted only as an accessory use.\n\n(45)\n\nMONUMENT RETAIL SALES use is the use of a site primarily for the retail sale of monuments\nfor placement on graves. This use includes the sale, storage, and delivery of headstones,\nfootstones, markers, statues, obelisks, cornerstones, and ledgers.\n\n(46)\n\nOFF-SITE ACCESSORY PARKING use is the use of a site for the provision of parking spaces,\ntogether with driveways, aisles, turning and maneuvering areas, clearances, and similar\nfeatures, located on a different site from the principal use.\n\n(47)\n\nOUTDOOR ENTERTAINMENT use is a predominantly spectator use conducted in open, partially\nenclosed, or screened facilities. This use includes sports arenas, racing facilities,\nand amusement parks.\n\n(48)\n\nOUTDOOR SPORTS AND RECREATION use is a recreational use conducted in open, partially\nenclosed, or screened facilities. This use includes driving ranges, miniature golf\ncourses, golf courses, swimming pools, tennis courts, and outdoor racquetball courts.\n\n(49)\n\nPAWN SHOP SERVICES use is the use of a site for the lending of money on the security\nof property pledged in the keeping of the pawnbroker, and the incidental sale of the\nproperty.\n\n(50)\n\nPEDICAB STORAGE AND DISPATCH use is the use of a site for the staging, storage, and\ndispatch of non-motorized vehicles, including incidental parking and servicing of\nthese vehicles.\n\n(51)\n\nPERFORMANCE VENUE use is the use of a site for presentation of plays, motion pictures,\nor other performances that includes the retail sale of alcoholic beverages for consumption\non the premises. This use also includes live music performances.\n\n(52)\n\nPERSONAL IMPROVEMENT SERVICES use is the use of a site for the provision of informational,\ninstructional, personal improvement, and similar services. This use includes music\nstudios, martial arts studios, photography studios, driving schools, health or physical\nfitness studios, reducing salons, dance studios, and handicraft or hobby instruction.\n\n(53)\n\nPERSONAL SERVICES use is the use of a site for the provision of periodically needed\nservices of a personal nature. This use includes beauty or barber shops, seamstress\nor tailor services, shoe repair shops, and dry cleaning pick-up station services.\n\n(54)\n\nPET SERVICES use is the use of a site for the retail sale of small animals customarily\nused as household pets, or the provision of veterinary, grooming, or boarding services,\ntotally within a building. This use includes pet stores, small animal clinics, and\npet grooming shops, but excludes uses for livestock and large animals.\n\n(55)\n\nPLANT NURSERY use is the use of a site for sale of plants or related goods or services.\nThis use includes garden centers and tree service firms.\n\n(56)\n\nPRINTING AND PUBLISHING use is the use of a site for the bulk reproduction, printing,\ncutting, or binding of written or graphic material.\n\n(57)\n\nPROFESSIONAL OFFICE use is the use of a site for the provision of professional or\nconsulting services in the fields of law, architecture, design, engineering, accounting,\nor similar professions.\n\n(58)\n\nRECREATIONAL EQUIPMENT MAINTENANCE AND STORAGE use is the use of a site for the maintenance,\nservice, or storage of sports equipment, watercraft, watercraft motors, trailers,\nmotorcycles, or motor-homes.\n\n(59)\n\nRECREATIONAL EQUIPMENT SALES use is the use of a site for the sale or rental of sports\nequipment, watercraft, watercraft motors, trailers, motorcycles, or motor-homes, and\nincludes incidental storage, maintenance, and servicing.\n\n(60)\n\nRESEARCH ASSEMBLY SERVICES use is the use of a site for the assembly of products related\nto research services and used by the owners of the research establishment or affiliated\nentities in the delivery of services performed by the owner or affiliated entities.\nThis use excludes the mass production of products for general sale to customers.\n\n(61)\n\nRESEARCH SERVICES use is research of an industrial or scientific nature. This use\nincludes electronics research laboratories, space research or development firms, and\npharmaceutical research labs, and excludes product testing.\n\n(62)\n\nRESEARCH TESTING SERVICES use is research activity that may be permitted only with\nthe approval of the council within a planned development area district.\n\n(63)\n\nRESEARCH WAREHOUSING SERVICES use is the use of a site for enclosed or screened storage\nof materials or equipment related to research services, and excludes bulk warehousing\nor permanent storage of hazardous or toxic substances, except as authorized by a planned\ndevelopment area district ordinance.\n\n(64)\n\nRESTAURANT (GENERAL) use is the use of a site for the preparation and retail sale\nof food and beverages and includes the sale and on-premises consumption of alcoholic\nbeverages as an accessory use.\n\n(65)\n\nRESTAURANT (LIMITED) use is the use of a site for the preparation and retail sale\nof food and beverages and excludes the sale of alcoholic beverages for on-premises\nconsumption.\n\n(66)\n\nSCRAP AND SALVAGE SERVICES use is the use of a site for the storage, sale, dismantling\nor other processing of used or waste materials that are not intended for re-use in\ntheir original forms. This use includes automotive wrecking yards, junk yards, and\npaper salvage yards.\n\n(67)\n\nSERVICE STATION use is the use of a site for the provision of fuel, lubricants, parts\nand accessories, or incidental services to motor vehicles.\n\n(68)\n\nSOFTWARE DEVELOPMENT use is the use of a site for development or testing of computer\nsoftware packages including magnetic disks, tapes, and associated operating manuals.\nThis use excludes printing, distribution, and software manufacturing.\n\n(69)\n",
  "start_line": 9257,
  "end_line": 9903,
  "subsections": [
    "25-1-197-D",
    "25-1-197-E",
    "25-1-197-A",
    "25-1-197-B",
    "25-1-197-A",
    "25-1-197-B"
  ]
}