{
  "id": "25-1-713",
  "title": "ADDITIONAL NOTICE REQUIREMENTS",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "\n(A)\n\nThe director shall adopt a tenant relocation program by administrative rule for the\npurpose of mitigating the impacts of tenant displacement resulting from multifamily\nredevelopment within the City of Austin.\n\n(B)\n\nThe tenant relocation program must, at a minimum, include each of the elements described\nin this subsection.\n\n(1)\n\nTenant Relocation Fee. The program must include a methodology to be used by the director\nin recommending to the city council the amount of the fee required under Section 25-1-715 (Tenant Relocation Assistance—Developer Funded). The methodology shall include a nexus study that accounts for the impacts of displacement\nto tenant communities directly affected by multifamily redevelopment and to the community\nas a whole. The fee shall be consistently calculated and uniformly applied, but may\nvary based on number of units, bedrooms, and other objective criteria identified by\nthe nexus study.\n\n(2)\n\nEligibility for Tenant Relocation Assistance. The program shall establish eligibility\nrequirements that a tenant must meet in order to receive tenant relocation assistance\nunder Section 25-1-715 (Tenant Relocation Assistance—Developer Funded) or Section 25-1-716 (Tenant Relocation Assistance—City Funded). At a minimum, the eligibility requirements must:\n\n(a)\n\nrequire that a tenant:\n\n(i)\n\nhave a household income at or below 70% of median family income or, for residents\nof a mobile home park, 80% of median family income; and\n\n(ii)\n\nsubmit a claim form documenting income eligibility no later than the deadline established\nby the director; and\n\n(b)\n\nallow a tenant who resided at a property where multi-family redevelopment occurred\nif the tenant resided at the property:\n\n(i)\n\nfor a multi-family property, 120 days before multi-family redevelopment begins; or\n\n(ii)\n\nfor a mobile home park, 270 days before multi-family redevelopment begins; and\n\n(c)\n\nprohibit participation by tenants of multi-family redevelopment that is exempt from\nthis division under Section 25-1-711 (Purpose, Applicability, Exemptions, and Definitions), except that the director may allow use of funds under Section 25-1-716 (Tenant Relocation Assistance—City Funded) to provide relocation assistance for tenant displacement resulting from fire, civil\ncommotion, malicious mischief, vandalism, natural disaster, or other destruction beyond\nthe control of the owner or tenant.\n\n(3)\n\nUse of Tenant Relocation Assistance. The program must specify the types of expenses\nfor which tenant relocation assistance may be provided. Eligible expenses paid using\nfunds collected under Section 25-1-715 (Tenant Relocation Assistance—Developer Funded) must be reasonably attributable to tenant displacement based on the nexus study\nrequired under Paragraph (C)(1).\n\n(4)\n\nRefund Procedures. The program shall establish procedures by which an applicant who\npaid a tenant relocation fee under Section 25-1-715 (Tenant Relocation Assistance—Developer Funded) may request a refund of any fees not spent for an authorized purpose within ten\nyears after approval of an application for which notification is required under Section 25-1-712 (Tenant Notification Required).\n\n(C)\n\nThe director may include additional elements in the tenant relocation program, including\nbut not limited to notification forms and other documents required under Section 25-1-712 (Tenant Notification Required) and Section 25-1-713 (Additional Notice Requirements).\n\nSource: 20160901-050, Pt. 4, 9-12-16; Ord. No. 20230831-103, Pt. 3, 9-11-23.",
  "start_line": 7450,
  "end_line": 7529,
  "subsections": []
}