{
  "id": "25-1-418",
  "title": "NOTICE OF SUSPENSION OR REVOCATION",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "of the suspension under Section 25-1-418 (Notice Of Suspension Or Revocation). The director shall give notice under Section 25-1-132(A) (Notice Of Public Hearing) of the public hearing.\n\n(D)\n\nIf the body determines that the person is not in compliance with a requirement of\nthe variance or special exception, the body may revoke the variance or special exception\nor take other action to obtain compliance.\n\n(E)\n\nThe body's decision to revoke a variance or special exception is effective immediately.\n\nSource: Sections 13-1-62 (a), (c), and (d); Ord. 990225-70; Ord. 031211-11.\n\nThe accountable official may immediately revoke a person's permit, license, released\nsite plan, approved subdivision construction plan, certificate of occupancy, or right-of-way\nuse permit that has been suspended if the accountable official determines that the\nperson:\n\n(1)\n\ndid not comply in a reasonable time with the requirements of this title for which\nthe suspension was ordered; or\n\n(2)\n\nduring the suspension, did not comply with other requirements of this title.\n\nSource: Sections 13-1-63(a), 13-1-64(a) and (c), 13-1-65(a) and (c), 13-1-66(a) and\n(c); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAn accountable official may give notice to the person affected of the official's intent\nto suspend or revoke a permit, license, released site plan, approved subdivision construction\nplan, certificate of occupancy, or right of way use permit under this division.\n\n(B)\n\nThe notice may specify a reasonable time for compliance with this title. If a time\nfor compliance is specified, the accountable official may not suspend or revoke before\nthe time for compliance has expired.\n\nSource: Section 13-1-61; Ord. 990225-70; Ord. 031211-11.\n\nThe accountable official shall give notice by certified mail, return receipt requested,\nunder Section 25-1-132(B) (Notice Of Public Hearing) of a suspension or revocation by the official under this division.\n\nSource: Sections 13-1-62(b) and (d), 13-1-63(b), 13-1-64(b), 13-1-65(b), and 13-1-66(b);\nOrd. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf the director determines that a person required to obtain a site plan, subdivision\nconstruction plan, or permit has not complied with a requirement of this title, the\ndirector may order the person to stop the development of or transportation of construction\nmaterial to the site until the person complies with the requirements of this title.\n\n(B)\n\nWhile a stop work order is in effect:\n\n(1)\n\na City inspection may not be performed, and work requiring an inspection may not be\napproved; and\n\n(2)\n\na person may not connect a utility at the site.\n\n(C)\n\nIf a stop work order is based on a failed inspection, a person may not further develop\nthe site until the development passes a reinspection.\n\n(D)\n\nIf a stop work order is based on a health or safety hazard, a person may not further\ndevelop the site until the director determines that the development complies with\nthe requirements of this title.\n\n(E)\n\nIf a stop work order is based on a violation of the requirements of this title for\na right of way use permit, the order:\n\n(1)\n\nmust state that no work may be performed at the site if traffic is obstructed, unless\nthe person obtains a right-of-way use permit;\n\n(2)\n\nmust state that noncompliance may result in the immediate removal of an obstruction\nfrom the right-of-way and the arrest of an equipment operator; and\n\n(3)\n\nshall require the immediate removal of an obstruction or traffic control device in\nthe public right-of-way.\n\n(F)\n\nA City employee shall post a stop work order on the site and mail a copy of the order\nto the record owner.\n\nSource: Sections 13-1-67(a), (b), (c), (e), (f), and (g); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf the building official determines that building service equipment regulated by the\ntechnical codes is hazardous to life, health, or property, the building official may\norder that the equipment be removed or restored to a safe condition.\n\n(B)\n\nA remove or restore order must be in writing, posted on the site, and state a deadline\nby which compliance must be achieved.\n\n(C)\n\nThe building official shall mail a copy of the remove or restore order to the record\nowner.\n\n(D)\n\nA person may not use or maintain building service equipment after a remove or restore\norder is posted.\n\nSource: Section 13-1-68; Ord. 990225-70; Ord. 031211-11.\n\nUnless a person complies with the requirements of Chapter 14-11 (Use Of Right-Of-Way)\nfor a right of way use permit, a police officer may order the person to immediately\nstop obstructing traffic and remove the obstruction from the public right-of-way.\nThe police officer may:\n\n(1)\n\nimpound a vehicle, machinery, or equipment;\n\n(2)\n\norder the driver to proceed to the Police Department;\n\n(3)\n\nremove a barricade or traffic diverting device;\n\n(4)\n\nissue a citation to a person who authorized or caused the violation; and\n\n(5)\n\narrest a person who does not comply with the order.\n\nSource: Section 13-1-66 (e); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA person may appeal a stop work order, remove or restore order, revocation, or suspension\nissued under this division by giving written notice to the accountable official not\nlater than the third day after:\n\n(1)\n\nthe stop work order or remove or restore order is posted; or\n\n(2)\n\nthe person receives notice of the revocation or suspension.\n\n(B)\n\nThe notice of appeal must contain:\n\n(1)\n\nthe name and address of the appellant;\n\n(2)\n\na statement of facts;\n\n(3)\n\nthe decision being appealed; and\n\n(4)\n\nthe reasons the decision should be set aside.\n\n(C)\n\nThe accountable official shall hear the appeal not later than the third working day\nafter the appeal is filed. The appellant, the appellant's expert, and the department\nmay offer testimony to the accountable official.\n\n(D)\n\nThe accountable official shall affirm or reverse the department's decision not later\nthan the second working day after the hearing. The official shall give written notice\nof the decision and a statement of the reasons for the decision to the appellant.\n\n(E)\n\nThe appellant may appeal the accountable official's decision to the Land Use Commission\nor appropriate technical board by giving written notice to the accountable official\nand the presiding officer of the Land Use Commission or appropriate technical board\nnot later than the third working day after receiving notice of the decision. The notice\nof appeal must contain the information described in Subsection (B).\n\n(F)\n\nThe Land Use Commission or appropriate technical board shall hear the appeal at the\nnext regularly scheduled meeting following receipt of the notice of appeal. An appeal\nis automatically granted if the Land Use Commission or appropriate technical board\ndoes not hear the appeal before the 21st day following receipt of the notice of appeal.\n\n(G)\n\nA stop work order, remove or restore order, suspension, or revocation remains in effect\nduring the pendency of an appeal under this section.\n\nSource: Section 13-1-69; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nA person who violates a provision of this title commits a separate offense for each\nday the violation continues.\n\n(B)\n\nA person who violates this title commits a misdemeanor punishable by a fine not to\nexceed $2000.\n\n(C)\n\nA culpable mental state is not required, and need not be proved, for fines of $500\nor less.\n\n(D)\n\nA person who violates Chapter 25-12 (Technical Codes) commits a misdemeanor punishable by a fine not to exceed $2000 and not less than:\n\n(1)\n\n$150 for a first conviction;\n\n(2)\n\n$250 for a second conviction; and\n\n(3)\n\n$500 for a third or subsequent conviction.\n\nSource: Sections 13-1-60, 13-1-70, 13-1-71, and 13-1-72; Ord. 990225-70; Ord. 031211-11;\nOrd. No. 20140515-058, Pt. 1, 5-26-14.\n\n### ARTICLE 11. - AMENDMENT PROCEDURE.\n\n(A)\n\nOther than the city council, only the Planning Commission may initiate an amendment\nto the regulations in this title.\n\n(B)\n\nAn amendment to the zoning map may be initiated in accordance with the procedures\nin Chapter 25-2 (Zoning).\n\nSource: Sections 13-1-980 and 13-1-990; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section prescribes the procedure for amending the regulations in this title.\nThe procedure for amending the zoning map is prescribed by Chapter 25-2 (Zoning).\n\n(B)\n\nThe council may amend this title after a public hearing. The council must receive\na recommendation required by Subsection (C), (D), or (E) before opening a public hearing\nor acting on an amendment.\n\n(C)\n\nExcept as provided in Subsection (D), Planning Commission review of a proposed amendment\nof this title is required. The Planning Commission must hold a public hearing on the\nproposed amendment before forwarding its recommendation to the council.\n\n(D)\n\nFor a proposed amendment to or repeal of a technical code in Chapter 25-12 (Technical Codes), review by the appropriate technical board, if any, is required.\n\n(E)\n\nFor a proposed amendment that only affects historic zoning, Historic Landmark Commission\nreview is required. Historic Landmark Commission review must occur before the Planning\nCommission's review of the proposed amendment. The Historic Landmark Commission shall\nforward its recommendation to the Planning Commission and the council.\n\n(F)\n\nNotice of a public hearing required by this section shall be provided in accordance\nwith Section 25-1-132(C) (Notice Of Public Hearing).\n\nSource: Section 13-1-981; Ord. 990225-70; Ord. 031211-11.\n\n### ARTICLE 12. - VESTED RIGHTS.\n\n(1)\n\nIn this article, \"permit,\" \"project,\" and \"regulatory agency\" have the meanings assigned\nto them by Chapter 245 of the Local Government Code.\n\n(2)\n\nTYPE 1 (CHAPTER 245) PETITION means a vested rights petition that alleges rights under\nChapter 245 of the Local Government Code to develop property under ordinances, regulations,\nor rules other than those in effect on the date the permit application is submitted.\n\n(3)\n\nTYPE 2 (CONTINUING USE) PETITION means a vested rights petition that alleges rights\nunder Section 43.002 of the Local Government Code to continue or begin a land use\nthat was begun or planned prior to annexation of the land by the City of Austin.\n\n(4)\n\nVESTING DATE means the date on which a project accrued development rights under Chapter\n245 or use rights under Section 43.002 of the Local Government Code.\n\n(5)\n\nVESTED RIGHTS means a right conferred by state law to develop property under ordinances,\nregulations, or rules other than those in effect on the date a permit application\nis submitted. The term includes development rights under Chapter 245 and use rights\nunder Section 43.002 of the Local Government Code, but does not include a right existing\nunder common law.\n\n(6)\n\nVESTED RIGHTS PETITION or PETITION means a petition requesting a determination of\ndevelopment rights under Chapter 245 or use rights under Section 43.002 of the Local\nGovernment Code.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nThis article establishes requirements for determining whether a project is entitled\nto vested rights under Chapter 245 or Section 43.002 of the Local Government Code.\nTo the extent a project is entitled to vested rights, as determined under this article,\na permit necessary to initiate, continue, or complete the project may be exempt from\ncurrent regulations.\n\n(B)\n\nThe purpose of this article is to:\n\n(1)\n\nEstablish a clear and consistent process for evaluating vested rights claims;\n\n(2)\n\nEnsure that vested rights determinations are based on accurate and complete information,\nincluding the nature and scope of the original project for which vested rights are\nasserted and actual development, if any, that has occurred over time; and\n\n(3)\n\nRecognize legitimate claims of vested rights under state law, while ensuring that\nnew development complies to the greatest extent possible with current regulations.\n\n(C)\n\nThe requirements of this article apply within the planning jurisdiction.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n",
  "start_line": 4735,
  "end_line": 5117,
  "subsections": [
    "25-1-418-D",
    "25-1-418-E",
    "25-1-418-A",
    "25-1-418-B",
    "25-1-418-A",
    "25-1-418-B",
    "25-1-418-C",
    "25-1-418-D",
    "25-1-418-E",
    "25-1-418-F",
    "25-1-418-A",
    "25-1-418-B",
    "25-1-418-C",
    "25-1-418-D",
    "25-1-418-A",
    "25-1-418-B",
    "25-1-418-C",
    "25-1-418-D",
    "25-1-418-E",
    "25-1-418-F",
    "25-1-418-G",
    "25-1-418-A",
    "25-1-418-B",
    "25-1-418-C",
    "25-1-418-D",
    "25-1-418-A",
    "25-1-418-B",
    "25-1-418-A",
    "25-1-418-B",
    "25-1-418-C",
    "25-1-418-D",
    "25-1-418-E",
    "25-1-418-F",
    "25-1-418-A",
    "25-1-418-B",
    "25-1-418-C"
  ]
}