{
  "id": "25-1-article-8",
  "title": "CONSTRUCTION MANAGEMENT",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 8. - CONSTRUCTION MANAGEMENT.\n\nThis article applies to development that occurs under an approved subdivision construction\nplan or site plan in the planning jurisdiction of the City.\n\nSource: Section 13-1-830; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (C), the owner of a project, or owner representative,\nshall participate in a preconstruction conference with accountable officials before\nstarting construction under an approved site plan or subdivision construction plan.\n\n(B)\n\nAn owner, or owner representative, shall request the accountable official to schedule\nthe preconstruction conference when the owner pays the required inspection fees.\n\n(C)\n\nThe director may waive the requirement for a preconstruction conference.\n\nSource: Section 13-1-831(a); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nThe accountable official shall provide notice of the conference to the following persons\nor entities not later than the second day before the conference:\n\n(1)\n\nowner representative;\n\n(2)\n\nconsulting engineer;\n\n(3)\n\ncontractors;\n\n(4)\n\ncounty engineers, as appropriate; and\n\n(5)\n\naffected utilities and appropriate city departments.\n\n(B)\n\nBefore convening a preconstruction conference, the accountable official shall distribute\napproved plans for the development to the persons and entities receiving notice of\nthe conference.\n\nSource: Section 13-1-831(b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe conference participants shall exchange telephone numbers and addresses at the\nconference.\n\n(B)\n\nThe participants shall discuss:\n\n(1)\n\nthe sequence of construction;\n\n(2)\n\nstart dates and schedule of events;\n\n(3)\n\nerosion and sedimentation controls;\n\n(4)\n\ntraffic control barricades;\n\n(5)\n\nsite supervision;\n\n(6)\n\nemergency response;\n\n(7)\n\nspecial conditions or provisions of plans or specifications;\n\n(8)\n\nfinal acceptance guidelines; and\n\n(9)\n\npublishing and distribution of minutes of the conference.\n\nSource: Section 131-831(b); Ord. 990225-70; Ord. 031211-11.\n\nBefore construction begins, the owner's consulting engineer shall prepare and distribute\nminutes of the preconstruction conference. Conference participants may file exceptions\nto the minutes. The engineer shall distribute copies of exceptions to the conference\nparticipants and shall include the exceptions in the inspection file.\n\nSource: Section 13-1-831(b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe central dispatcher for the City shall coordinate contact between a permittee and\nan inspector.\n\n(B)\n\nA permittee shall contact the central dispatcher to request an inspection.\n\n(C)\n\nThe accountable official may:\n\n(1)\n\nrequire that a request be made 48 hours before the date the inspection is desired;\nand\n\n(2)\n\nspecify the manner in which the request is made.\n\n(D)\n\nThe central dispatcher shall maintain inspection requests for the city departments.\n\nSource: Section 13-1-833; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA permittee may not begin work under a permit until an inspection record card is posted\non the site.\n\n(B)\n\nThe permittee shall post the card in a readily accessible location.\n\n(C)\n\nThe inspector shall note each inspection on the record card.\n\n(D)\n\nThe permittee shall post the record card until the accountable official finds that\nthe permittee meets all City requirements.\n\nSource: Section 13-1-834; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe owner shall request an inspection of erosion and sedimentation controls and tree\nprotection measures after the owner installs the controls and measures.\n\n(B)\n\nThe accountable official shall schedule the inspection. The owner, consulting engineer,\nand contractor shall attend the inspection.\n\n(C)\n\nDuring the inspection, the owner shall:\n\n(1)\n\ndemonstrate that the erosion and sedimentation controls and tree protection measures\ncomply with the City's Environmental Criteria Manual; and\n\n(2)\n\npresent a plan to the inspector that includes future erosion and sedimentation controls,\ndrainage, and utility and street layout.\n\n(D)\n\nAfter two days notice to the owner, the inspector may modify the approved erosion\ncontrol and construction sequencing if:\n\n(1)\n\nthe inspector determines that the plans are inadequate;\n\n(2)\n\nthe inspector confirms the determination with the accountable official in the Watershed\nProtection and Development Review Department; and\n\n(3)\n\nthe accountable official provides written approval of the modification.\n\n(E)\n\nThe inspector may make minor changes to the erosion control and construction sequencing\nplans without written approval from an accountable official in the Watershed Protection\nand Development Review Department if the modification upgrades erosion controls or\nreflects construction progress.\n\n(F)\n\nExcept as provided in Subsection (G), the owner may not begin construction until the\naccountable official determines that the erosion and sedimentation controls and tree\nprotection measures comply with City requirements.\n\n(G)\n\nIf the accountable official does not conduct an inspection on or before the fifth\nday after receiving a request, the owner may proceed with construction.\n\nSource: Section 13-1-832; Ord. 99-0225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), the director may charge a reinspection fee if\nat the time that an inspector attempts to conduct an inspection, the permittee:\n\n(1)\n\nhas not finished the work to be inspected;\n\n(2)\n\nhas not finished corrections previously required by an inspector;\n\n(3)\n\nhas not posted the record inspection card;\n\n(4)\n\ndoes not make approved plans readily available to the inspector; or\n\n(5)\n\ndoes not provide access to the work on the scheduled inspection date.\n\n(B)\n\nWork that was rejected at the first inspection for failure to comply with a technical\ncode may be reinspected without payment of a reinspection fee.\n\n(C)\n\nIf a reinspection fee is due, additional inspections may not be performed until the\nreinspection fee is paid.\n\nSource: Section 13-1-835; Ord. 990225-70; Ord. 031211-11.\n\nThe director shall deliver two copies of the released subdivision construction plans\nand approved plan revisions to the accountable official for inspection.\n\nSource: Section 13-1-860; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nApproximately 10 days before work under the subdivision construction plans is finished,\nthe owner shall notify the accountable official in writing that the work is substantially\ncomplete and shall request a list of work to be completed.\n\n(B)\n\nOn the day that the owner provides notice under Subsection (A), the consulting engineer\nshall submit a construction summary report to the accountable official.\n\nSource: Section 13-1-861; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nNot later than the fourth day after the owner gives written notice that work under\na subdivision construction plan is substantially complete, the accountable official\nshall:\n\n(1)\n\nreview the work; and\n\n(2)\n\nprepare a report identifying work that does not comply with the construction plans\nand work that must be performed before the accountable official issues a final acceptance\nletter.\n\n(B)\n\nWhen the owner finishes the work listed in the report issued under Subsection (A),\nthe accountable official shall modify the report to reflect that the required work\nis finished.\n\nSource: Section 13-1-862; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe accountable official shall schedule a final acceptance meeting at the site and\nshall invite the:\n\n(1)\n\nconsulting engineer;\n\n(2)\n\ncontractors, as appropriate;\n\n(3)\n\ncounty engineer, as appropriate;\n\n(4)\n\nstaff of affected utilities and City departments;\n\n(B)\n\nThe accountable official may not issue a final acceptance letter until:\n\n(1)\n\nwork identified in the accountable official's report has been completed;\n\n(2)\n\nthe following items have been submitted:\n\n(a)\n\nconstruction summary report;\n\n(b)\n\nconsulting engineer's concurrence letter;\n\n(c)\n\nreproducible plans, certified \"as built\" by the consulting engineer;\n\n(d)\n\nrequired one-year warranty bonds;\n\n(e)\n\ncash or cashier's check for balances due, if any; and\n\n(3)\n\nif the owner executed a developer contract, the conditions of the contract have been\nsatisfied.\n\n(C)\n\nThe accountable official shall issue an acceptance letter to an owner who meets the\nrequirements of Subsection (B). If the owner has not satisfied all requirements, the\naccountable official shall issue a list of requirements that the owner must satisfy.\n\nSource: Section 13-1-863; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe director shall forward to the accountable official two copies of the approved\nsite plan, approved building permit construction plan, approved revision, and applicable\nspecifications for a development.\n\n(B)\n\nThe building official shall provide a copy of the approved plans required by Subsection\n(A) to the owner. The owner shall retain the plans at the site during construction\nand inspections.\n\nSource: Section 13-1-900; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDuring construction, the accountable official shall inspect land grading, drainage,\nand detention and water quality control facilities to determine whether the facilities\ncomply with the released site plan.\n\n(B)\n\nAfter construction of the land grading, drainage, and detention and water quality\ncontrol facilities on a site is finished, the design engineer must submit a letter\nto the accountable official stating that the project substantially complies with the\napproved construction plans.\n\n(C)\n\nThe accountable official shall perform the final inspection of the facilities after\nthe design engineer submits the letter described in Subsection (B).\n\n(D)\n\nExcept as provided in Subsection (E), the accountable official may issue a certificate\nof occupancy or compliance only if the land grading, drainage, and detention and water\nquality facilities have been completed in accordance with the requirements of the\nCode, site plan, and building permit construction plan.\n\n(E)\n\nExcept in the Barton Springs Zone, the accountable official may issue a certificate\nof compliance or certificate of occupancy before the construction is finished if:\n\n(1)\n\nthe accountable official determines that the unfinished construction is minor and\nthe facility, as constructed, can perform the task for which it was designed; and\n\n(2)\n\nthe owner executes an agreement on a form prescribed by the accountable official providing\nfor the finishing of the construction and the posting of fiscal security in the amount\nand for the length of time determined by the accountable official.\n\nSource: Section 13-1-901; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), City utilities may be provided to a property\nif:\n\n(1)\n\nfor a property located in the extraterritorial jurisdiction of the City, the accountable\nofficial issues a certificate of compliance for the development and signs a final\nacceptance letter for the subdivision infrastructure; or\n\n(2)\n\nfor a property located in the City's zoning jurisdiction, the building official issues\na certificate of occupancy for the building.\n\n(B)\n\nIf required erosion and sedimentation controls are finished, the accountable official\nmay authorize a temporary electrical connection:\n\n(1)\n\nto test building service equipment before a certificate of occupancy or certificate\nof compliance has been issued; or\n\n(2)\n\nto provide electrical service to a building for which a temporary certificate of occupancy\nhas been issued.\n\nSource: Section 13-1-905; Ord. 990225-70; Ord. 031211-11.\n",
  "start_line": 3915,
  "end_line": 4370,
  "subsections": []
}