{
  "id": "25-1-article-1",
  "title": "GENERAL PROVISIONS",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 1. - GENERAL PROVISIONS.\n\nThis title implements the planning policies of the Comprehensive Plan and shall be\nconstrued to achieve its purposes.\n\nSource: Section 13-1-5; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nRegulations in this title apply as follows:\n\n(1)\n\nexcept as provided in Paragraph (5) and Subsection (B), all regulations apply to property\nin the zoning jurisdiction;\n\n(2)\n\nexcept as provided in Subsection (B), water quality, utility district, city utility,\nand subdivision regulations apply to property in the planning jurisdiction;\n\n(3)\n\nChapter 25-1, Article 12 (Vested Rights) applies to projects in the planning jurisdiction;\n\n(4)\n\nChapter 25-12, Article 4 (Electrical Code) applies to a structure served by the City's electric utility;\n\n(5)\n\nChapter 25-12, Article 6 (Uniform Plumbing Code) applies to a structure served by the City's water utility; and\n\n(6)\n\nChapter 25-13 (Airport Hazard and Compatible Land Use Regulations) applies in the geographic area described in that chapter.\n\n(B)\n\nTitle 30 (Austin/Travis County Subdivision Regulations) governs the subdivision of land in the portion of the city's extraterritorial jurisdiction\nthat is within Travis County.\n\nSource: Sections 13-1-4 and 13-1-602; Ord. 990225-70; Ord. 010809-78; Ord. 031211-11;\nOrd. 031211-42; Ord. No. 20140612-084, Pt. 5, 6-23-14.\n\n(A)\n\nRequirements of this title are cumulative of requirements that are imposed by other\nordinances, rules, or regulations, or by private easements, covenants, restrictions,\nor agreements. If a conflict occurs, the requirements of this title control.\n\n(B)\n\nIf there is a difference of meaning or implication between the text of a provision\nof this title and an illustration or table, the text controls.\n\nSource: Sections 13-1-20 and 13-1-21(d); Ord. 990225-70; Ord. 031211-11.\n",
  "start_line": 698,
  "end_line": 755,
  "subsections": []
}