{
  "id": "25-1-62",
  "title": "DEVELOPMENT ASSESSMENT",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "\n(A)\n\nA person considering development in the planning jurisdiction may request that the\nsingle office prepare an assessment of the proposed development. The city and county\nencourage a development assessment for a residential project of more than 200 acres,\nor a commercial or mixed use project of more than 50 acres.\n\n(B)\n\nA development assessment is based on information provided by the requestor and the\nrequirements applicable at the time of the request.\n\n(C)\n\nA development assessment includes:\n\n(1)\n\nan explanation of the procedures and requirements of this title for zoning and rezoning,\nsubdivision, site plan approval, and building permits;\n\n(2)\n\nan estimate of fees; and\n\n(3)\n\nan identification of potential major issues for the project, including whether:\n\n(a)\n\nfor an area annexed by the city for limited purposes, the proposed land use conforms\nto the comprehensive plan and current zoning;\n\n(b)\n\nproposed arterials, if any, comply with the transportation plan;\n\n(c)\n\nproposed collector streets, if any, are adequate for the projected traffic;\n\n(d)\n\nthere are significant environmental issues;\n\n(e)\n\nthere are significant drainage or floodplain issues;\n\n(f)\n\nadequate utilities are available; and\n\n(g)\n\nthe proposed density or floor area:\n\n(i)\n\nis consistent with the requirements of this title;\n\n(ii)\n\nfor an area annexed by the city for limited purposes, is appropriate, considering\nthe surrounding land use or zoning; and\n\n(iii)\n\nis consistent with watershed requirements.\n\n(D)\n\nThe single office shall deliver a development assessment to the requestor within 21\ndays after the request is received. After its delivery, the requestor may seek a meeting\nwith the single office to discuss the development assessment.\n\nSource: City Code Section 25-1-62; Ord. 031211-11; Ord. 031211-42.\n\nIn this section, subdivision means preliminary plan, plat, or subdivision construction\nplan.\n\n(A)\n\nA person considering subdivision development in the extra territorial jurisdiction\nmay request that the director prepare a project assessment of the proposed development.\n\n(B)\n\nA project assessment may be submitted before submitting an application if the application\nas designed requires consideration of discretionary approvals such as:\n\n(1)\n\nA variance or waiver from a provision in Title 25 or Title 30;\n\n(2)\n\nA variance or waiver from criteria manuals adopted to implement the provisions of\nTitle 25 or Title 30;\n\n(3)\n\nAn alternative method of compliance allowed under Title 25, Title 30, or the associated criteria manuals;\n\n(4)\n\nA recommendation from an advisory board or commission; or\n\n(5)\n\nOther discretionary considerations as specified by rule.\n\n(C)\n\nA project assessment is based on information provided by the requestor.\n\n(D)\n\nA project assessment includes:\n\n(1)\n\nan explanation of the procedures and requirements of Title 25 and Title 30 for subdivision development;\n\n(2)\n\nan identification of potential major issues for the project, including whether:\n\n(a)\n\nthe proposed land use conforms to the Comprehensive Plan and current zoning;\n\n(b)\n\nproposed arterials, if any, comply with the Transportation Plan;\n\n(c)\n\nproposed collector streets, if any, are adequate for the projected traffic;\n\n(d)\n\nthere are significant environmental issues;\n\n(e)\n\nthere is an official floodplain map delineated;\n\n(f)\n\nadequate utilities are available; and\n\n(g)\n\nthe proposed density is:\n\n(i)\n\nconsistent with the requirements of Title 25 and Title 30;\n\n(ii)\n\nappropriate, considering the surrounding land use or zoning; and\n\n(iii)\n\nconsistent with watershed requirements.\n\n(E)\n\nA recommendation included in a project assessment is not a final determination on\na variance or waiver. A recommendation included in a project assessment remains valid\nfor 180 days.\n\n(F)\n\nAfter the request is received, the director shall deliver a project assessment to\nthe requestor within the time frame established by the director by administrative\nrule. After its delivery, the requestor may seek a meeting with the director or the\ndirector's designee to discuss the project assessment.\n\nSource: Ord. No. 20190822-117, Pts. 39, 40, 9-1-19; Ord. No. 20230831-142, Pt. 4, 9-1-23.",
  "start_line": 83880,
  "end_line": 84063,
  "subsections": []
}