{
  "id": "25-1-903",
  "title": "CITY COUNCIL HEARING AND ACTION",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "under Section 25-1-903 (Review and Recommendation of the Land Use Commission); or\n\n(4)\n\nreject the proposed agreement and discontinue negotiations.\n\nSource: Ord. 20091105-068.\n\n(A)\n\nMailed notice required under this article shall comply with the requirements of Subsection\n25-1-134(B) (Procedures and Requirements for Notice) and shall be sent to:\n\n(1)\n\ngovernmental entity, municipal corporation, or political subdivision that is to be\na party to the agreement;\n\n(2)\n\nnotice owner of property located within 500 feet of the subject property;\n\n(3)\n\nregistered environmental or neighborhood organization whose declared boundaries are\nwithin 500 feet of the site of the subject property; and\n\n(4)\n\nutility account addresses located within 500 feet of the site of the subject property,\nas shown in the City utility records on the date of the filing of the application.\n\n(B)\n\nMailed and published notice required under this article must:\n\n(1)\n\ndescribe the general nature of the proposed interlocal development agreement;\n\n(2)\n\nidentify the governmental entity, municipal corporation, or political subdivision\nthat is to be a party to the agreement;\n\n(3)\n\ngenerally describe the proposed agreement;\n\n(4)\n\nidentify the entities that may approve the proposed agreement;\n\n(5)\n\nstate the earliest date that action on the proposed agreement may occur; and\n\n(6)\n\ninclude the address and telephone number of the accountable official or staff from\nwhom additional information may be obtained.\n\nSource: Ord. 20091105-068.\n\nIn this article:\n\n(A)\n\nDIRECTOR means the director of the Planning Department.\n\n(B)\n\nAREA PLAN means a long-range policy plan adopted by ordinance as an element of the\ncomprehensive plan that establishes land use policy for a specific geographic area.\nArea plan may include a neighborhood plan, district plan, station area plan, small\narea plan, land use-focused corridor plan, framework plan, and plans incorporating\nfuture land use maps.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\n(A)\n\nAn area plan shall be prepared by the director.\n\n(B)\n\nThe director may conduct a general review of an area plan at any time and may recommend\namendments of an area plan to the Land Use Commission and council.\n\n(C)\n\nThe director may establish a list of community stakeholders to seek input in the review\nprocess.\n\n(D)\n\nThe director may establish a list of community resources available to assist the director\nwith technical aspects of area planning.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\nAn amendment to an area plan shall follow the process outlined by this Article, except\nfor:\n\n(1)\n\nAn amendment to the Lamar Blvd./Justin Station Area Plan, Plaza Saltillo Station Area\nPlan, or East MLK TOD Station Area Plan, shall follow the process in 25-2-766.23.\n\n(2)\n\nAn amendment to a neighborhood plan adopted by ordinance shall follow the process\nin Chapter 25-1, Article 16 (Neighborhood Plan Amendments).\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\nAn area plan amendment may be initiated by:\n\n(1)\n\nfor an individual property amendment:\n\n(a)\n\nthe owner of the subject property;\n\n(b)\n\nthe council;\n\n(c)\n\nthe Land Use Commission; or\n\n(d)\n\nthe director.\n\n(2)\n\nfor an area-wide or subdistrict-wide amendment:\n\n(a)\n\nthe council;\n\n(b)\n\nthe Land Use Commission; or\n\n(c)\n\nthe director.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\n(A)\n\nPre-Application Meeting. The applicant and the director's staff must meet before an\napplicant can submit an application to amend an area plan. At the meeting:\n\n(1)\n\nthe staff shall describe the application process to the applicant;\n\n(2)\n\nthe applicant shall describe the proposed area plan amendment to the staff;\n\n(3)\n\nif the applicant is proposing a change to the future land use map, the applicant shall\nprovide the staff with information regarding the proposed change, including the address,\nboundaries, acreage, current and proposed future land use map categories, and current\nand proposed uses; and\n\n(4)\n\nif the applicant is proposing a text change, the applicant shall provide the proposed\nlanguage and an explanation of the change.\n\n(B)\n\nApplication for an individual property.\n\n(1)\n\nThe director may accept an application to amend an area plan not earlier than one\nyear after the adoption of the plan.\n\n(2)\n\nAn applicant may not file an application for an amendment that is substantially the\nsame as an application denied by council until one year after the council action denying\nthe prior application.\n\n(C)\n\nApplication for area-wide or subdistrict-wide amendment.\n\n(1)\n\nThe director may accept an application to amend an area plan two or more years after\ncouncil adopted the plan.\n\n(2)\n\nThe director may accept an application to amend an area plan two or more years after\nthe most recent council action on the plan occurred.\n\n(3)\n\nAn application initiated by council may be filed at any time.\n\nSource: Ord. No. 20250522-065, Pt. 1, 6-2-25.\n\n(A)\n\nThe director shall give notice of the filing of an application for a proposed area",
  "start_line": 8555,
  "end_line": 8773,
  "subsections": [
    "25-1-903-A",
    "25-1-903-B",
    "25-1-903-A",
    "25-1-903-B",
    "25-1-903-A",
    "25-1-903-B",
    "25-1-903-C",
    "25-1-903-D",
    "25-1-903-A",
    "25-1-903-B",
    "25-1-903-C",
    "25-1-903-A"
  ]
}