{
  "id": "25-1-21",
  "title": "DEFINITIONS",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "In this Subchapter, GROSS FLOOR AREA has the meaning assigned by Section 25-1-21 (Definitions), with the following modifications:\n\n3.3.1.\n\nIn this Subchapter, GROSS FLOOR AREA means all enclosed space, regardless of its dimensions,\nthat is not exempted under subsections 3.3.2, 3.3.3, or 3.3.4.\n\n3.3.2.\n\nSubject to the limitations in paragraph C below, the following parking areas and structures\nare excluded from gross floor area for purposes of this Subchapter:\n\nA.\n\nUp to 450 square feet of:\n\n1.\n\nA detached rear parking area that is separated from the principal structure by not\nless than 10 feet;\n\n2.\n\nA rear parking area that is 10 feet or more from the principal structure, provided\nthat the parking area is either:\n\na.\n\ndetached from the principal structure; or\n\nb.\n\nattached by a covered breezeway that is completely open on all sides, with a walkway\nnot exceeding 6 feet in width and a roof not exceeding 8 feet in width; or\n\n3.\n\nA parking area that is open on two or more sides, if:\n\ni.\n\nit does not have habitable space above it; and\n\nii.\n\nthe open sides are clear and unobstructed for at least 80% of the area measured below\nthe top of the wall plate to the finished floor of the carport.\n\nB.\n\nUp to 200 square feet of:\n\n1.\n\nAn attached parking area if it is used to meet the minimum accessible spaces requirement;\nor\n\n2.\n\nA garage that is less than 10 feet from the rear of the principal structure, provided\nthat the garage is either:\n\na.\n\ndetached from the principal structure; or\n\nb.\n\nattached by a covered breezeway that is completely open on all sides, with a walkway\nnot exceeding 6 feet in width and a roof not exceeding 8 feet in width.\n\nC.\n\nAn applicant may receive only one 450-square foot exemption per site under paragraph\nA. An applicant who receives a 450-square foot exemption may receive an additional\n200-foot exemption for the same site under paragraph B, but only for an attached parking\narea used to meet the minimum accessible spaces requirement.\n\n3.3.3.\n\nPorches, basements, and attics that meet the following requirements shall be excluded\nfrom the calculation of gross floor area:\n\nA.\n\nA ground floor porch, including a screened porch, provided that:\n\n1.\n\nthe porch is not accessible by automobile and is not connected to a driveway; and\n\n2.\n\nthe exemption may not exceed 200 square feet if a porch has habitable space or a balcony\nabove it.\n\nB.\n\nA habitable portion of a building that is below grade if:\n\n1.\n\nThe habitable portion does not extend beyond the first-story footprint and is:\n\na.\n\nBelow natural or finished grade, whichever is lower; and\n\nb.\n\nSurrounded by natural grade for at least 50% of its perimeter wall area, if the habitable\nportion is required to be below natural grade under Paragraph 1.a.\n\n2.\n\nThe finished floor of the first story is not more than three feet above the average\nelevation at the intersections of the minimum front yard setback line and the side\nproperty lines.\n\nC.\n\nA habitable portion of an attic, if:\n\n1.\n\nThe roof above it is not a flat or mansard roof and has a slope of 3 to 12 or greater;\n\n2.\n\nIt is fully contained within the roof structure;\n\n3.\n\nIt has only one floor;\n\n4.\n\nIt does not extend beyond the footprint of the floors below;\n\n5.\n\nIt is the highest habitable portion of the building, or a section of the building,\nand adds no additional mass to the structure; and\n\n6.\n\nFifty percent or more of the area has a ceiling height of seven feet or less.\n\n3.3.4.\n\nAn enclosed area shall be excluded from the calculation of gross floor area if it\nis five feet or less in height. For purposes of this subsection:\n\nA.\n\nArea is measured on the outside surface of the exterior walls; and\n\nB.\n\nHeight is measured from the finished floor elevation, up to either:\n\n1.\n\nthe underside of the roof rafters; or\n\n2.\n\nthe bottom of the top chord of the roof truss, but not to collar ties, ceiling joists,\nor any type of furred-down ceiling.\n\n3.3.5.\n\nAn area with a ceiling height greater than 15 feet is counted twice.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;",
  "start_line": 39796,
  "end_line": 39970,
  "subsections": []
}