{
  "id": "25-1-89",
  "title": "EXTENSION OF REVIEW PERIOD FOR PRELIMINARY PLANS AND PLATS",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "extend the initial review period pursuant to Section 25-1-89 (Extension of Review Period).\n\n(C)\n\nA condition for approval or reason for disapproval must be in writing and may not\nbe arbitrary. The condition or reason must:\n\n(1)\n\nbe directly related to requirements adopted under Texas Local Government Code Chapter\n212 Subchapter A (Regulation of Subdivisions); and\n\n(2)\n\ninclude a citation to the law, including a statute or municipal ordinance, that is\nthe basis for the condition for approval or reason for disapproval.\n\n(D)\n\nIf the director fails to comply with Subsection (B), the application for preliminary\nplan or plat is approved by operation of law, unless the deadline for action has been\nextended pursuant to Section 25-1-89 (Extension of Review Period).\n\nSource: Section 13-1-484(e); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No.\n20190822-117, Pt. 19, 9-1-19; Ord. No. 20230831-141, Pt. 18, 9-11-23.\n\nIf the director disapproves the preliminary plan or plat, the applicant can appeal\nthe director's decision to the Land Use Commission or city council.\n\nSource: Ord. No. 20230831-141, Pt. 19, 9-11-23.\n\n**Editor's note—**\nOrd. No. 20230831-141, Pt. 20, effective September 11, 2024, repealed the former § 25-4-33, and enacted\na new § 25-4-33 as set out herein. The former § 25-4-33 pertained to administrative\napproval of certain subdivision applications and derived from Ord. No. 20190822-117, Pt. 21, 9-1-19.\n\n(A)\n\nAn original tract is a tract that:\n\n(1)\n\nis a legal lot or tract; or\n\n(2)\n\nwas a legal lot or tract before being subdivided in violation of ordinance requirements.\n\n(B)\n\nAn applicant shall include all land in the original tract in an application for preliminary\nplan or plat approval.\n\n(C)\n\nThe director may waive the requirement of Subsection (B) if the director determines\nthat:\n\n(1)\n\nsubdividing only a portion of the original tract will not substantially impair the\norderly planning of roads, utilities, drainage, and other public facilities;\n\n(2)\n\nthe portion of the original tract contiguous to the area to be subdivided has direct\naccess to a public street, or the applicant has provided access to a public street\nby dedicating right-of-way at least 50 feet wide;\n\n(3)\n\na reasonable use of the balance of the original tract is possible; and\n\n(4)\n\nthe applicant has mailed, by certified mail, to all owners of land that is a portion\nof the original tract and contiguous to the land included in the application a request\nthat each owner provide written confirmation to the director that:\n\n(a)\n\nthe owner's land is not a legal lot or tract; and\n\n(b)\n\nthe owner must plat the land before the City may approve a development permit or a\nutility company may provide initial or additional service.\n\n(D)\n\nIn making a determination under Subsection (D)(3) that a reasonable use of the balance\nof the original tract is possible, the director may require that the applicant provide\na schematic land plan of the balance of the original tract. The director may not require\nthat the applicant provide detailed engineering information.\n\n(E)\n\nAn applicant who satisfies the requirement of Subsection (C)(2) by dedicating right-of-way\nto provide access to a public street is not required to construct improvements within\nthe right-of-way.\n\nSource: Sections 13-1-481(c) and 13-1-481.1; Ord. 990225-70; Ord. 000309-39; Ord.\n010607-8; Ord. 031211-11; Ord. No. 20190822-117, Pts. 20, 22, 9-1-19; Ord. No. 20230831-141, Pt. 20, 9-11-23.\n\n(A)\n\nThe director shall determine whether board or commission review of a request associated\nwith an application for preliminary plan or plat approval is required under this section.\nThe director shall schedule an associated request for board or commission review on\nthe earliest available date.\n\n(B)\n\nThe following board or commission must review an associated request before the director\nor Land Use Commission may consider the application or the associated request:\n\n(1)\n\nthe Urban Transportation Commission and the Environmental Commission shall review\na request for an amendment to the Transportation Plan;\n\n(2)\n\nthe Water and Wastewater Commission and, if requested by the city council, the Environmental\nCommission shall review a request for an amendment to the city's water or wastewater\nservice area boundary; and\n\n(3)\n\nthe Water and Wastewater Commission shall review a request for City cost participation\nin construction of water or wastewater facilities.\n\nSource: Section 13-1-484; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No.\n20190822-117, Pts. 20, 23, 9-1-19; Ord. No. 20230831-141, Pt. 21, 9-11-23.\n\n(A)\n\nIf an application for a preliminary plan, plat requires a variance from a subdivision\nrequirement, an applicant is required to obtain approval for the variance before associated\napplication for a preliminary plan, plat or subdivision construction plan can be approved\nby the director.\n\n(B)\n",
  "start_line": 43133,
  "end_line": 43276,
  "subsections": [
    "25-1-89-C",
    "25-1-89-D",
    "25-1-89-A",
    "25-1-89-B",
    "25-1-89-C",
    "25-1-89-D",
    "25-1-89-E",
    "25-1-89-A",
    "25-1-89-B",
    "25-1-89-A",
    "25-1-89-B"
  ]
}