{
  "id": "25-1-282",
  "title": "PRECONSTRUCTION CONFERENCE REQUIRED",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "the requirement for a pre-construction conference under Section 25-1-282 (Preconstruction Conference Required) is noted on the fast track permit;\n\n(8)\n\nthe applicant has posted cash fiscal surety for erosion and sedimentation controls\nand revegetation for the fast track development;\n\n(9)\n\nthe applicant has authorized the City to draw on the cash fiscal surety, enter the\nsite, and restore the site to its original condition if the fast track permit expires\nor is revoked; and\n\n(10)\n\nif required, other governmental entities have approved the fast track development.\n\n(C)\n\nAn approved fast track permit expires if the director determines that the site plan\nis denied under Section 25-5-113 (Updates). An applicant may appeal the director's determination under this subsection to the\nLand Use Commission.\n\n(D)\n\nIf the director determines that development of a site does not comply with the requirements\nof an approved fast track permit, the director may revoke the fast track permit.\n\n(E)\n\nApproval of a site plan supersedes an approved fast track permit.\n\nSource: Section 13-1-618; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe director may issue fast track certification to a person who successfully completes\nthe required training.\n\n(B)\n\nThe director shall adopt rules for fast track certification that include provisions\nfor the following:\n\n(1)\n\nstandards for certification;\n\n(2)\n\nthe amount and type of training required; and\n\n(3)\n\nsuspension and revocation of certification by the director.\n\n(C)\n\nRules under Subsection (B)(3) of this section regarding suspensions and revocations\nof certification must provide for graduated sanctions.\n\n(D)\n\nA person whose certification under this section is suspended or revoked by the director\nmay appeal the director's decision to the Land Use Commission. The Land Use Commission\nmay only overturn or modify the director's decision if the Land Use Commission determines\nthat the director abused the director's discretion in ordering the suspension or revocation.\n\n(E)\n\nThe director may require that a person with certification under this section receive\nadditional training.\n\nSource: Section 13-1-619; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe director may approve an administrative site plan under Article 2 (Administrative Site Plans).\n\n(B)\n\nThe Land Use Commission:\n\n(1)\n\nmay approve a conditional use site plan or Hill Country Roadway Corridor site plan\nunder Article 3 (Land Use Commission Approved Site Plans); and\n\n(2)\n\nmay act on an appeal of the director's approval or denial of a replacement site plan.\n\n(C)\n\nThe council may act on an appeal of the Land Use Commission's approval or denial of\na conditional use site plan, Hill Country Roadway Corridor site plan, or replacement\nsite plan.\n\nSource: Sections 13-1-601 and 13-1-644; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nIf a site plan is approved, the approval date is:\n\n(1)\n\nthe last day that an appeal may be filed, if final approval is by the director or\nthe Land Use Commission; or\n\n(2)\n\nthe date of council approval.\n\nSource: Section 13-1-614(b); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe director may release a site plan after:\n\n(1)\n\nthe site plan is approved;\n\n(2)\n\nthe applicant posts the required fiscal security with the director;\n\n(3)\n\nthe time period for filing an appeal of the approval expires, or each interested party\nsigns and submits to the director a written waiver of the right to appeal; and\n\n(4)\n\nif applicable, tenant notification has been provided for the period required under",
  "start_line": 45718,
  "end_line": 45850,
  "subsections": [
    "25-1-282-C",
    "25-1-282-D",
    "25-1-282-E",
    "25-1-282-A",
    "25-1-282-B",
    "25-1-282-C",
    "25-1-282-D",
    "25-1-282-E",
    "25-1-282-A",
    "25-1-282-B",
    "25-1-282-C",
    "25-1-282-A"
  ]
}