{
  "id": "25-1-133",
  "title": "NOTICE OF APPLICATIONS AND ADMINISTRATIVE DECISIONS",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "plan amendment under Section 25-1-133 (Notice of Applications and Administrative Decisions).\n\n(B)\n\nThe director shall conduct a community meeting on a proposed neighborhood plan amendment\nprior to the date on which the Planning Commission is scheduled to consider the amendment.\nThe director shall give notice of the meeting under Section 25-1-132(A) (Notice of Public Hearing).\n\n(C)\n\nThe Planning Commission and the council shall each hold a public hearing on a proposed\nneighborhood plan amendment.\n\n(D)\n\nThis subsection prescribes notice for a public hearing on a proposed neighborhood\nplan amendment regarding an individual property.\n\n(1)\n\nFor a hearing before the Planning Commission, the director shall give notice under\nSection 25-1-132(A) (Notice of Public Hearing).\n\n(2)\n\nFor a hearing before council, the director shall give notice under Section 25-1-132(B)(2) (Notice of Public Hearing).\n\n(3)\n\nThe applicant is responsible for the cost of notice, unless the applicant is a neighborhood\nplan contact team. In that event, the City is responsible for the cost of notice.\n\n(E)\n\nThis subsection prescribes notice for a public hearing on a proposed neighborhood\nplan amendment regarding an area-wide or subdistrict-wide recommendation.\n\n(1)\n\nThe director shall give notice of a public hearing before the Planning Commission\nor council to:\n\n(a)\n\neach notice owner of property located within the proposed amendment boundaries;\n\n(b)\n\neach City of Austin utility account address within the proposed amendment boundaries;\nand\n\n(c)\n\neach neighborhood plan contact team and registered neighborhood organization within\nthe proposed amendment boundaries and within 500 feet of the proposed amendment boundaries.\n\n(2)\n\nThe City is responsible for the cost of notice.\n\nSource: Ord. 20080306-073; 20091217-053.\n\n(A)\n\nA neighborhood plan amendment application expires if the director does not schedule\nthe application for a public hearing:\n\n(1)\n\nby the Planning Commission before the 181st day after the date of filing; or\n\n(2)\n\nby the Planning Commission or council before the 181st day after the date on which\nthe Planning Commission or council grants an indefinite postponement of a scheduled\npublic hearing.\n\n(B)\n\nExcept as provided in Subsection (D), a neighborhood plan amendment application expires\nif the council does not adopt an ordinance before the 361st day after council closes\nthe public hearing on the application.\n\n(C)\n\nExcept as provided in Subsection (D), a neighborhood plan amendment application initially\nsubmitted before the effective date of this section expires 180 days after the effective\ndate of this section.\n\n(D)\n\nAn applicant may file one request with the director and one request with council to\nextend an application that will expire under Subsection (B) or Subsection (C). The\nrequest must be in writing, be filed before the application expires, state good cause\nfor the extension, and be for not more than 180 days.\n\nSource: 20091217-053.\n\n(A)\n\nThe Land Use Commission shall hold a public hearing on a neighborhood plan amendment\napplication not later than the 90th day after the date the application is filed.\n\n(B)\n\nThe Land Use Commission shall make a recommendation to the council on a neighborhood\nplan amendment application not later than the 14th day after the Land Use Commission\ncloses the public hearing on the application.\n\n(C)\n\nIf the Land Use Commission does not adopt a recommendation on an application, the\nDirector shall forward the application to council without a Land Use Commission recommendation.\n\n(D)\n\nIf the Land Use Commission does not hold a public hearing in accordance with Subsection\n(A), the applicant may file a written request for a hearing as prescribed in Section 25-2-282(E).\n\n(E)\n\nThe Director shall report the Land Use Commission's recommendation on each neighborhood\nplan amendment application to the council.\n\nSource: 20091217-053.\n\n(A)\n\nThe council shall hold a public hearing on a neighborhood plan amendment application\nnot later than the 40th day after the date of the Land Use Commission recommendation.\n\n(B)\n\nSection 25-2-283(C) shall apply to requests for postponement of the public hearing on a neighborhood\nplan amendment application.\n\nSource: 20091217-053.\n\n(A)\n\nThe director may not recommend approval of a neighborhood plan amendment unless the\nrequirements of Subsections (B) and (C) are satisfied.\n\n(B)\n\nThe applicant must demonstrate that:\n\n(1)\n\nthe proposed amendment is appropriate because of a mapping or textual error or omission\nmade when the original plan was adopted or during subsequent amendments;\n\n(2)\n\nthe denial of the proposed amendment would jeopardize public health, safety, or welfare;\n\n(3)\n\nthe proposed amendment is appropriate:\n\n(a)\n\nbecause of a material change in circumstances since the adoption of the plan; and\n\n(b)\n\ndenial would result in a hardship to the applicant;\n\n(4)\n\nthe proposed project:\n\n(a)\n\nprovides environmental protection that is superior to the protection that would otherwise\nbe achieved under existing zoning and development regulations; or\n\n(b)\n\npromotes the recruitment or retention of an employment center with 100 or more employees;\n\n(5)\n\nthe proposed amendment is consistent with the goals and objectives of the neighborhood\nplan; or\n\n(6)\n\nthe proposed amendment promotes additional S.M.A.R.T. Housing opportunities.\n\n(C)\n\nThe applicant must demonstrate that:\n\n(1)\n\nthe proposed amendment complies with applicable regulations and standards established\nby Title 25 (Land Development), the objectives of Chapter 25-2 (Zoning), and the purposes of the zoning district proposed for the subject property; and\n\n(2)\n\nthe proposed amendment is consistent with sound planning principles.\n\nSource: Ord. 20080306-073; 20091217-053.\n\n**Editor's note—**\nOrd. No. 20230831-104, Pt. 2, effective September 11, 2023, repealed § 25-1-811, which pertained to map;\nfiling dates and derived from Ord. No. 20080306-073; Ord. No. 20091217-053.\n\n### ARTICLE 17. - INTERLOCAL DEVELOPMENT AGREEMENTS.\n\nIn this article:\n\n(1)\n\nDIRECTOR means the Director of the Planning and Development Review Department.\n\n(2)\n\nINTERLOCAL DEVELOPMENT AGREEMENT means an agreement between the City and any governmental\nentity, municipal corporation or political subdivision that establishes or modifies\nregulations for the use, development, or construction of property containing one or\nmore existing or proposed structures. The term includes new agreements and amendments\nto existing agreements, but does not include agreements or amendments related to roads\nor road facilities or the provision of utility services.\n\nSource: Ord. 20091105-068.\n\n(A)\n\nPrior to council consideration of a proposed interlocal agreement, the director shall\nschedule a public hearing before the Land Use Commission.\n\n(B)\n\nThe director shall give notice of a public hearing required under Subsection (A) consistent\nwith the following requirements:\n\n(1)\n\nIf a proposed interlocal development agreement establishes or modifies use, development,\nor construction regulations applicable to a particular site or structure, the director\nshall mail notice not later than the 11th day before the date of the hearing as provided\nunder Subsection 25-1-904(A) (Notice Requirements for Proposed Interlocal Development Agreements).\n\n(2)\n\nIf a proposed interlocal development agreement establishes or modifies general use,\ndevelopment, or construction regulations contained in a master plan or agreement applicable\nto a governmental entity, municipal corporation, or political subdivision, rather\nthan regulations applicable to a particular site or structure, the director shall\nprovide notice as required under Subsection 25-1-132(C) (Notice of Public Hearing).\n\n(C)\n\nThe Land Use Commission shall make a recommendation to the council on a proposed interlocal\ndevelopment agreement not later than the 14th day after the public hearing on the\nproposed agreement is closed.\n\n(D)\n\nThe Land Use Commission may recommend that the council:\n\n(1)\n\napprove the interlocal development agreement as proposed;\n\n(2)\n\napprove a more restrictive interlocal development agreement; or\n\n(3)\n\nreject the proposed interlocal development agreement.\n\nSource: Ord. 20091105-068.\n\n(A)\n\nThe council shall hold a public hearing on a proposed interlocal development agreement\nnot later than the 40th day after the date of the Land Use Commission recommendation.\n\n(B)\n\nThe director shall give notice of a public hearing required under Subsection (A) consistent\nwith the following requirements:\n\n(1)\n\nIf a proposed interlocal development agreement establishes or modifies use, development,\nor construction regulations applicable to a particular site or structure, the director\nshall provide notice by:\n\n(a)\n\npublishing notice not later than the 16th day before the date of the public hearing\nas provided under Subsection 25-1-132(B)(1) (Notice of Public Hearing); and\n\n(b)\n\nmailing notice not later than the 16th day before the date of the hearing as provided\nunder Subsection 25-1-904(A) (Notice Requirements for Proposed Interlocal Development Agreements).\n\n(2)\n\nIf a proposed interlocal development agreement establishes or modifies general use,\nconstruction, or development regulations contained in a master plan or agreement applicable\nto a governmental entity, municipal corporation, or political subdivision, rather\nthan a particular site or structure, the director shall provide notice as required\nunder Subsection 25-1-132(C) (Notice of Public Hearing).\n\n(C)\n\nAfter a public hearing on a proposed interlocal development agreement, the council\nmay authorize the city manager to:\n\n(1)\n\nexecute the agreement as proposed;\n\n(2)\n\nexecute a modified agreement, which may include different use, development, or construction\nregulations or other conditions not contained in the proposed agreement;\n\n(3)\n\nnegotiate a new agreement, which shall be subject to review by the Land Use Commission",
  "start_line": 8227,
  "end_line": 8554,
  "subsections": [
    "25-1-133-B",
    "25-1-133-C",
    "25-1-133-D",
    "25-1-133-E",
    "25-1-133-A",
    "25-1-133-B",
    "25-1-133-C",
    "25-1-133-D",
    "25-1-133-A",
    "25-1-133-B",
    "25-1-133-C",
    "25-1-133-D",
    "25-1-133-E",
    "25-1-133-A",
    "25-1-133-B",
    "25-1-133-A",
    "25-1-133-B",
    "25-1-133-C",
    "25-1-133-A",
    "25-1-133-B",
    "25-1-133-C",
    "25-1-133-D",
    "25-1-133-A",
    "25-1-133-B",
    "25-1-133-C"
  ]
}