{
  "id": "25-1-84",
  "title": "SUBDIVISION CONSTRUCTION PLAN APPLICATION REQUIREMENTS AND EXPIRATION",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "the subdivision construction plan has been certified complete under Section 25-1-84 (Subdivision Construction Application Requirements and Expiration).\n\nSource: Section 13-1-36; Ord. 990225-70; Ord. 031211-11; Ord. No. 20190822-117, Pt. 2, 9-1-19; Ord. No. 20230831-141, Pt. 3, 9-11-23.\n\n(A)\n\nA person considering development in the planning jurisdiction may request that the\ndirector prepare an assessment of the proposed development. The City encourages a\ndevelopment assessment for a residential project of more than 200 acres, or a commercial\nor mixed use project of more than 50 acres.\n\n(B)\n\nA development assessment is based on information provided by the requestor and the\nrequirements applicable at the time of the request.\n\n(C)\n\nA development assessment includes:\n\n(1)\n\nan explanation of the procedures and requirements of this title for zoning and rezoning,\nsubdivision, site plan approval, and building permits;\n\n(2)\n\nan estimate of fees; and\n\n(3)\n\nan identification of potential major issues for the project, including whether:\n\n(a)\n\nthe proposed land use conforms to the Comprehensive Plan and current zoning;\n\n(b)\n\nproposed arterials, if any, comply with the Transportation Plan;\n\n(c)\n\nproposed collector streets, if any, are adequate for the projected traffic;\n\n(d)\n\nthere are significant environmental issues;\n\n(e)\n\nadequate utilities are available; and\n\n(f)\n\nthe proposed density or floor area is:\n\n(i)\n\nconsistent with the requirements of this title;\n\n(ii)\n\nappropriate, considering the surrounding land use or zoning; and\n\n(iii)\n\nconsistent with watershed requirements.\n\n(D)\n\nAfter the request is received, the director shall deliver a development assessment\nto the requestor within the time frame established by the director by administrative\nrule. After its delivery, the requestor may seek a meeting with the director or the\ndirector's designee to discuss the development assessment.\n\nSource: Section 13-1-90; Ord. 990225-70; Ord. 031211-11; Ord. No. 20160421-039, Pt. 2, 5-2-16.\n\nIn this section, subdivision means preliminary plan, plat, or subdivision construction\nplan.\n\n(A)\n\nA person considering subdivision in the planning jurisdiction may request that the\ndirector prepare a project assessment of the proposed development.\n\n(B)\n\nA project assessment may be submitted before submitting an application if the application\nas designed requires consideration of discretionary approvals such as:\n\n(1)\n\nA variance or waiver from a provision in Title 25;\n\n(2)\n\nA variance or waiver from criteria manuals adopted to implement the provisions of\nTitle 25;\n\n(3)\n\nAn alternative method of compliance allowed under Title 25 or the associated criteria manuals;\n\n(4)\n\nA recommendation from an advisory board or commission; or\n\n(5)\n\nOther discretionary considerations as specified by rule.\n\n(C)\n\nA project assessment is based on information provided by the requestor.\n\n(D)\n\nA project assessment includes:\n\n(1)\n\nan explanation of the procedures and requirements of this title for subdivision;\n\n(2)\n\nan identification of potential major issues for the project, including whether:\n\n(a)\n\nthe proposed land use conforms to the Comprehensive Plan and current zoning;\n\n(b)\n\nproposed arterials, if any, comply with the Transportation Plan;\n\n(c)\n\nproposed collector streets, if any, are adequate for the projected traffic;\n\n(d)\n\nthere are significant environmental issues;\n\n(e)\n\nthere is an official floodplain map delineated;\n\n(f)\n\nthere is a wildfire risk area map delineated;\n\n(g)\n\nadequate utilities are available; and\n\n(h)\n\nthe proposed density is:\n\n(i)\n\nconsistent with the requirements of this title;\n\n(ii)\n\nappropriate, considering the surrounding land use or zoning; and\n\n(iii)\n\nconsistent with watershed requirements.\n\n(E)\n\nA recommendation included in a project assessment is not a final determination on\na variance or waiver. A recommendation included in a project assessment remains valid\nfor 180 days.\n\n(F)\n\nAfter the request is received, the director shall deliver a project assessment to\nthe requestor within the time frame established by the director by administrative\nrule. After its delivery, the requestor may seek a meeting with the director or the\ndirector's designee to discuss the project assessment.\n\nSource: Ord. No. 20190822-117, Pt. 4, 9-1-19; Ord. No. 20230413-057, Pt. 2, 4-24-23; Ord. No. 20230831-141, Pt. 4, 9-11-23.\n\n(A)\n\nThe director shall grant or deny an application for a permit or approval required\nby this title within the timeframe established by state law.\n\n(B)\n\nNothing in this section limits any exceptions to the deadlines provided for in state\nlaw.\n\nSource: Section 13-1-22; Ord. 990225-70; Ord. 031211-11; Ord. No. 20190822-117, Pts. 3, 5, 9-1-19Ord. No. 20230831-141, Pt. 6, 9-11-23.\n\n(A)\n\nThis section does not apply to an application for a preliminary plan or plat. An application",
  "start_line": 1875,
  "end_line": 2076,
  "subsections": [
    "25-1-84-A",
    "25-1-84-B",
    "25-1-84-C",
    "25-1-84-D",
    "25-1-84-A",
    "25-1-84-B",
    "25-1-84-C",
    "25-1-84-D",
    "25-1-84-E",
    "25-1-84-F",
    "25-1-84-A",
    "25-1-84-B",
    "25-1-84-A"
  ]
}