{
  "id": "25-1-712",
  "title": "TENANT NOTIFICATION REQUIRED",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "Applications subject to Section 25-1-712 (Tenant Notification Required).\n\n(1)\n\nThe responsible director may not certify a site plan application as complete until\nthe applicant has paid the required fee, provided the information required to be included,\nand complied with the notification requirements or the required number of days lapse.\n\n(2)\n\nThe responsible director or building official may not accept an application as complete\nuntil the applicant has paid the required fee, provided the information required to\nbe included, and complied with the notification requirements or the required number\nof days lapse.\n\n(3)\n\nIf, at the time an application is submitted, a multi-family property is unoccupied\nbut was occupied within the previous 120 days, the application will be rejected as\nincomplete.\n\n(4)\n\nIf, at the time an application is submitted, a mobile home park is unoccupied but\nwas occupied within the previous 270 days, the application will be rejected as incomplete.\n\nSource: Section 13-1-31; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. No. 20140612-084, Pt. 6, 6-23-14; Ord. No. 20160421-039, Pt. 3, 5-2-16; Ord. No. 20160901-050, Pt. 6, 9-12-16; Ord. No. 20190822-117, Pt. 6, 9-1-19; Ord. No. 20230831-141, Pt. 8, 9-11-23; Ord. No. 20230831-103, Pt. 1, 9-11-23.\n\nThis section applies only to an application for preliminary plan or plat.\n\n(A)\n\nThe responsible director may adopt rules establishing the requirements for an application,\nincluding timelines for completing staff review as well as when an application may\nbe updated to meet the requirements of this title and other applicable regulations.\nThe rules adopted must be in accordance with the timelines for action established\nwithin Section 25-4-32 (Action Within 30 Days).\n\n(B)\n\nAn application for preliminary plan or plat expires 180 days after the application\nis filed unless the application has been approved.\n\n(C)\n\nAn application that has been disapproved with reasons may be updated to address those\nreasons until the application expires.\n\n(D)\n\nThe responsible director may permit an applicant to omit required information from\nan application that the responsible director determines is not material to a decision\non the application.\n\n(E)\n\nThe responsible director shall consider an application filed only if the applicant\nhas paid the required fee and provided the information required by the director consistent\nwith state law.\n\n(1)\n\nThe applicant has 45 days to provide all the information required by the director\nafter the application is submitted.\n\n(2)\n\nIf an application is rejected as incomplete, the responsible director shall provide\nthe applicant a written explanation identifying the deficiencies and the information\nrequired to complete the application 10 working days after the application is received.\n\n(3)\n\nAn application expires if it is not complete on or before the 45th day after the application\nis submitted. An applicant may submit an update to provide additional information\nand to correct deficiencies at any time before the application expires.\n\nSource: Ord. No. 20190822-117, Pt. 8, 9-1-19; Ord. No. 20230831-141, Pt. 9, 9-11-23; Ord. No. 20240718-102, Pt. 1, 7-29-24.\n\n(A)\n\nThe responsible director may adopt rules establishing the requirements for a subdivision\nconstruction plan application, including timelines for completing staff review as\nwell as when an application may be updated to meet the requirements of this title\nand other applicable regulations.\n\n(B)\n\nThe director is authorized to certify a subdivision construction plan as complete\nif it complies with this subsection.\n\n(1)\n\nAn application is complete if the applicant has paid the required fee and provided\nthe information required to be included in the application no later than the 45th\nday after it was submitted. The responsible director may permit an applicant to omit\nrequired information from an application that the responsible director determines\nis not material to a decision on the application.\n\n(2)\n\nWhen the director rejects an application as incomplete, the director shall provide\nan applicant with a written explanation that identifies the deficiencies and information\nneeded to complete the application. The director must provide the written explanation\nwithin 10 working days after the application is received.\n\n(3)\n\nAn application expires if it is not complete on or before the 45th day after the application\nis submitted. An applicant may submit an update to provide additional information\nand correct any deficiencies at any time before the 45th day.\n\n(4)\n\nA certification that the subdivision construction application is administratively\ncomplete is valid for 45 days after the certification has been issued.\n\n(C)\n\nThe director is authorized to review the subdivision construction plan application\nif the applicant pays the required fee and the application has a valid certification\nof completeness. If the application has not yet been certified, the certification\nis no longer valid, or the submitted construction plan application does not match\nthe certified materials, the director will not review the application but shall provide\nthe applicant a written explanation identifying the deficiencies 10 working days after\nthe application is received.\n\n(D)\n\nAn application for subdivision construction plan expires one year after the application\nis submitted unless the application has been approved.\n\nSource: Ord. No. 20230831-141, Pt. 11, 9-11-23.\n\n(A)\n\nIn this section:\n\n(1)\n\nCMSWL means an area defined as a closed municipal solid waste landfill in Texas Administrative\nCode, Title 30, Section 330.951.\n\n(2)\n\nLANDFILL AREA means an area marked on a map created by the City and maintained in\nthe Watershed Protection and Development Review Department showing all known CMSWL\nand including property within:\n\n(a)\n\nthe known boundary of a CMSWL;\n\n(b)\n\n200 feet around the estimated boundary of a CMSWL if the boundary is not known; or\n\n(c)\n\n1,500 feet from the estimated center of the CMSWL if neither a known boundary nor\nan estimated boundary is known.\n\n(B)\n\nExcept as provided in Subsection (C), this section applies to development of a residential,\ncommercial, or public enclosed structure that is designed for use by humans and that\nis located on:\n\n(1)\n\na site over 1 acre in size; or\n\n(2)\n\na site located within a landfill area.\n\n(C)\n\nThis section does not apply to the remodel of or addition to a single family or duplex\nresidential use permitted in a single family residential small lot (SF-4A) or more\nrestrictive zoning district.\n\n(D)\n\nThe responsible director or building official may not approve an application for subdivision,\nsite plan, or building permit unless the applicant has delivered to the responsible\ndirector or building official:\n\n(1)\n\ncertification from a licensed professional engineer that the site does not overlie\na CMSWL; or\n\n(2)\n\nif the site overlies a CMSWL:\n\n(a)\n\na development permit from the Texas Commission on Environmental Quality;\n\n(b)\n\nwritten notification from the Texas Commission on Environmental Quality that a development\npermit is not required; or\n\n(3)\n\ncertification from a licensed professional engineer that the applicant will conduct\nsoil testing under the requirements of the Texas Commission on Environmental Quality\nduring construction of the foundation to determine whether the site overlies a CMSWL.\n\nSource: Section 13-1-37; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20080925-138;\nOrd. No. 20190822-117, Pt. 7, 9-1-19; Ord. No. 20230831-141, Pt. 10, 9-11-23.\n\n(A)\n\nThe responsible director may establish regular cycles for consideration of applications\nby City staff, boards, commissions, and the council. The city manager shall advise\nthe council of the creation or change of a cycle.\n\n(B)\n\nAn established cycle supersedes conflicting requirements of this title, except the\nrequirements relating to the duration of a project and those mandated by state law.\n\nSource: Section 13-1-33; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. No.\n20190822-117, Pt. 7, 9-1-19; Ord. No. 20230831-141, Pt. 10, 9-11-23.\n\n(A)\n\nAn application may not be placed on a board or commission agenda unless staff review\nis finished and a staff recommendation is available for board or commission consideration.\nThis requirement does not apply if staff review is not finished by the deadline prescribed\nby this title.\n\n(B)\n\nAn application may not be placed on the Land Use Commission or council agenda unless\nrecommendations from all other boards and commissions required to review the application\nare available for Land Use Commission or council consideration. The responsible director\nmay waive this requirement if the responsible director determines that:\n\n(1)\n\na board or commission did not review the application in a reasonable period of time;\nand\n\n(2)\n\nthe delay is attributable to the board or commission and not the applicant.\n\nSource: Section 13-1-110; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11;\nOrd. No. 20190822-117, Pts. 7, 9, 9-1-19; Ord. No. 20230831-141, Pts. 10, 12, 9-11-23.\n\nThe city manager shall inform a board or commission of the dates that other boards\nor commissions are scheduled to consider an application. A board or commission shall\nact diligently to finish its review in accordance with the schedule.\n\nSource: Section 13-1-111; Ord. 990225-70; Ord. 031211-11; Ord. No. 20190822-117, Pt. 7, 9-1-19; Ord. No. 20230831-141, Pt. 10, 9-11-23.\n\n(A)\n\nFor preliminary plan and plat applications, the director may extend the review period\none time if the applicant submits a written request for an extension before the time\nlimitations in Section 25-4-32 (Action Within 30 Days). The review period can only be extended to one time.\n\n(B)\n\nIf the director approves an extension request under Subsection (A), the director shall\napprove, approve with conditions, or disapprove an application for a preliminary plan\nor plat no later than the expiration of the extended review period.\n\nSource: Section 13-1-34; Ord. 990225-70; Am. Ord. 010329-18; Ord. 031211-11; Ord.\nNo. 20190822-117, Pts. 7, 10, 9-1-19; Ord. No. 20230831-141, Pts. 10, 13, 9-11-23.\n\nThis section does not apply to a preliminary plan, plat, or subdivision construction\nplan. For all other development applications:\n\n(A)\n\nIf the time required for staff review of an application exceeds the review time established",
  "start_line": 2208,
  "end_line": 2489,
  "subsections": [
    "25-1-712-A",
    "25-1-712-B",
    "25-1-712-C",
    "25-1-712-D",
    "25-1-712-E",
    "25-1-712-A",
    "25-1-712-B",
    "25-1-712-C",
    "25-1-712-D",
    "25-1-712-A",
    "25-1-712-B",
    "25-1-712-C",
    "25-1-712-D",
    "25-1-712-A",
    "25-1-712-B",
    "25-1-712-A",
    "25-1-712-B",
    "25-1-712-A",
    "25-1-712-B",
    "25-1-712-A"
  ]
}