{
  "id": "25-1-article-12",
  "title": "VESTED RIGHTS",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 12. - VESTED RIGHTS.\n\n(1)\n\nIn this article, \"permit,\" \"project,\" and \"regulatory agency\" have the meanings assigned\nto them by Chapter 245 of the Local Government Code.\n\n(2)\n\nTYPE 1 (CHAPTER 245) PETITION means a vested rights petition that alleges rights under\nChapter 245 of the Local Government Code to develop property under ordinances, regulations,\nor rules other than those in effect on the date the permit application is submitted.\n\n(3)\n\nTYPE 2 (CONTINUING USE) PETITION means a vested rights petition that alleges rights\nunder Section 43.002 of the Local Government Code to continue or begin a land use\nthat was begun or planned prior to annexation of the land by the City of Austin.\n\n(4)\n\nVESTING DATE means the date on which a project accrued development rights under Chapter\n245 or use rights under Section 43.002 of the Local Government Code.\n\n(5)\n\nVESTED RIGHTS means a right conferred by state law to develop property under ordinances,\nregulations, or rules other than those in effect on the date a permit application\nis submitted. The term includes development rights under Chapter 245 and use rights\nunder Section 43.002 of the Local Government Code, but does not include a right existing\nunder common law.\n\n(6)\n\nVESTED RIGHTS PETITION or PETITION means a petition requesting a determination of\ndevelopment rights under Chapter 245 or use rights under Section 43.002 of the Local\nGovernment Code.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nThis article establishes requirements for determining whether a project is entitled\nto vested rights under Chapter 245 or Section 43.002 of the Local Government Code.\nTo the extent a project is entitled to vested rights, as determined under this article,\na permit necessary to initiate, continue, or complete the project may be exempt from\ncurrent regulations.\n\n(B)\n\nThe purpose of this article is to:\n\n(1)\n\nEstablish a clear and consistent process for evaluating vested rights claims;\n\n(2)\n\nEnsure that vested rights determinations are based on accurate and complete information,\nincluding the nature and scope of the original project for which vested rights are\nasserted and actual development, if any, that has occurred over time; and\n\n(3)\n\nRecognize legitimate claims of vested rights under state law, while ensuring that\nnew development complies to the greatest extent possible with current regulations.\n\n(C)\n\nThe requirements of this article apply within the planning jurisdiction.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\nA petition for vested rights that meets the requirements of Section 25-1-534 (Contents of Vested Rights Petition) must be submitted by a landowner or a landowner's agent in order to request that\nan application for a permit be reviewed under ordinances, regulations, or rules other\nthan those in effect on the date the application is filed.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nExcept as provided in Subsection (B) of this section, a petition for vested rights\nrequired by Section 25-1-533 (Vested Rights Petition Required) must be submitted on a form approved by the director and must include, at a minimum,\nthe following information:\n\n(1)\n\nreference to one of the following applications, which must be submitted concurrent\nwith the vested rights petition:\n\n(a)\n\na permit application for development of the property; or\n\n(b)\n\na development plan, on a form provided by the director, that establishes the nature\nof the permit sought, including the scope and intensity of proposed development and\nthe type of land use, but need not include construction-level detail;\n\n(2)\n\na summary of the basis on which the applicant claims vested rights;\n\n(3)\n\nthe date on which the applicant claims that vested rights accrued and any permit or\nfair notice application that was submitted on that date; and\n\n(4)\n\na complete chronological history of the project for which vested rights are claimed,\nincluding:\n\n(a)\n\na list of permits for development of the property, along with supporting documents,\nthat were issued or applied for after the date the applicant claims that vested rights\naccrued;\n\n(b)\n\na description of any permitted or unpermitted development that occurred on the property\nafter the date the applicant claims that vested rights accrued;\n\n(c)\n\na description of existing development on the property, regardless of whether the development\nis permitted or unpermitted;\n\n(d)\n\na list of all annexations and zoning changes affecting the property, if any;\n\n(e)\n\nany covenants, conditions, or restrictions recorded in the deed records for the property;\nand\n\n(f)\n\nif deemed relevant by the director, evidence regarding progress towards completion\nof the project under Section 25-1-554 (Dormant Projects).\n\n(B)\n\nThe director may allow an applicant to omit information required under this section\nif, in the sole judgment of the director, an application is associated with a project\nfor which vested rights have been conclusively established by a court order, or by\na settlement agreement or project consent agreement approved by the city council.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nA fair notice application may be used in lieu of a permit application to establish\nvested rights for a new project.\n\n(B)\n\nThe director shall adopt a Fair Notice (New Project) application, which may be used\nto establish a vesting date for a new project that is filed for review under current\nregulations and for which no prior permits have been sought. The application must\ninclude a proposed plan for development of the property, including the scope and intensity\nof development and the nature of the land use, but need not include construction-level\ndetail.\n\n(C)\n\nAcceptance of a fair notice application does not authorize construction or have any\neffect other than that prescribed by this article.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nA vested rights petition and associated permit or Fair Notice (New Project) application\nare treated as a single application for purposes of completeness review and expiration\nunder Section 25-1-82 (Non-Subdivision Application Requirements and Expiration). This subsection does not apply to a permit for a preliminary plan, plat, or subdivision\nconstruction plan.\n\n(B)\n\nA vested rights petition and permit for a preliminary plan, plat, or subdivision construction\nplan, are not treated as a single application for the purposes of completeness review\nand expiration under Section 25-1-83 (Subdivision Application Requirements and Expiration).\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14; Ord. No. 20190822-117, Pt. 15, 9-1-19.\n\n(A)\n\nNot later than 10 working days after acceptance of a complete vested rights petition,\nthe director shall review the petition under Section 25-1-542 (Criteria for Approval) and render a determination consistent with the requirements of this section.\n\n(B)\n\nIn acting on a petition, the director may:\n\n(1)\n\napprove the petition and require the development applications necessary to initiate,\ncontinue, or complete the project to be reviewed in accordance with regulations in\neffect on the vesting date, except for those regulations exempt from vesting under\nstate law;\n\n(2)\n\ndeny the petition and require the development application associated with the project\nto be reviewed under current regulations of this title; or\n\n(3)\n\napprove the petition in part, as authorized by Subsection (C) of this section.\n\n(C)\n\nThe director may approve a petition in part if a project is legally entitled to some,\nbut not all, of the rights asserted in the petition, or if a change in the scale or\nintensity of development is necessary to maintain conformity with the original project.\nA vested rights determination may not waive or modify applicable regulations or provide\nrelief not required by Chapter 245 or Section 43.002 of the Local Government Code.\n\n(D)\n\nThe director shall provide a written determination to the applicant, which must state:\n\n(1)\n\nWhether the petition is approved or denied, in whole or in part, and the basis for\nthe decision;\n\n(2)\n\nFindings of fact in support of the decision and information sufficient to identify\nthe permit or fair notice application on which the petition is based; and\n\n(3)\n\nIf the petition is approved:\n\n(a)\n\na description of the project for which vested rights are recognized; and\n\n(b)\n\na vesting date.\n\n(E)\n\nAn applicant may request that the director reconsider a vested rights determination\nat any time before the application expires under Section 25-1-82 (Application Requirements and Expiration). The director's decision on a reconsideration request is final and not subject to\nfurther reconsideration.\n\n(F)\n\nA vested rights determination under this section does not affect the availability\nof a variance or other administrative remedy authorized by this title, but requesting\na variance is not required to exhaust administrative remedies for purposes of challenging\na determination by the director that a project is not entitled to vested rights.\n\n(G)\n\nThe director shall make vested rights petitions submitted under Section 25-1-533 (Vested Rights Petition Required) and vested rights determinations issued under this section available on the City\nof Austin's website.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nThe director shall review a Type 1 (Chapter 245) petition for vested rights under\nthe criteria described in this subsection.\n\n(1)\n\nGeneral Standard. A permit application is entitled to development rights under Chapter\n245 of the Local Government Code if the permit is required to initiate, continue,\nor complete a project for which a prior application was submitted to the City of Austin.\nAn application is not entitled to development rights if it is unrelated to or inconsistent\nwith the original project or if the original project has been completed, changed,\nor expired.\n\n(2)\n\nReview Criteria. In determining whether a petition meets the standard for approval\nunder this subsection, the director shall consider the following factors:\n\n(a)\n\nThe nature and extent of proposed development shown on the prior permit or other application\nthat initiated the project for which vested rights are claimed;\n\n(b)\n\nWhether the permit application submitted in connection with the vested rights petition\nis related to and consistent with the original project;\n\n(c)\n\nThe nature and extent of prior development of the property, including any permitting\nor construction activity that occurred subsequent to the vesting date requested by\nthe applicant;\n\n(d)\n\nAny prior vested rights determinations made for development of the property; and\n\n(e)\n\nWhether the project has expired in accordance with Division 3 (Expirations) of this article or other applicable regulations.\n\n(B)\n\nThe director shall review a Type 2 (Continuing Use) petition for vested rights under\nthe criteria described in this subsection.\n\n(1)\n\nGeneral Standard. A permit application is entitled to use rights under Section 43.002\nof the Local Government Code to the extent that current regulations would prohibit:\n\n(a)\n\ncontinuing to use the land in the manner in which it was being used on the date the\nannexation proceedings were instituted, if the land use was legal at that time; or\n\n(b)\n\nbeginning to use land in the manner that was planned before the 90\nth\nday before the effective date of the annexation if:\n\n(i)\n\none or more licenses, certificates, permits, approvals, or other forms of authorization\nby a governmental entity were required by law for the planned land use; and\n\n(ii)\n\na completed application for the initial authorization was filed with the governmental\nentity before the date the annexation proceedings were instituted.\n\n(2)\n\nReview Criteria. In determining whether a petition meets the standard for approval\nunder this subsection, the director shall consider the nature and extent of development\nthat:\n\n(a)\n\noccurred on the property prior to initiation of annexation proceedings, including\nphotographs or other evidence substantiating the use; or\n\n(b)\n\nwas proposed in one or more required applications submitted to a governmental entity.\n\n(3)\n\nDate of Annexation. For purposes of this subsection, annexation proceedings are deemed\nto have been instituted on the date of the first public hearing before the city council\non the annexation ordinance for the property.\n\n(C)\n\nThe criteria in this section are intended to assist the director in reviewing Type\n1 (Chapter 245) and Type 2 (Continuing Use) petitions for vested rights, but do not\nlimit the director from considering other factors relevant to the determination of\nrights for a particular project. The director may consider whether a project is entitled\nto common law vested rights if the project is not subject to Chapter 245 or Section\n43.002 of the Local Government Code.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\nIf the director approves a vested rights petition, any permit required to initiate,\ncontinue, or complete the project shall be entitled to the development or continuing\nuse rights recognized by the vested rights determination, unless the project expires\nunder Division 3 (Expirations) of this article or other applicable regulations.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nThis section provides a voluntary mechanism for determining applicable regulations\nwhere the extent of a project's vested rights are unclear and for incentivizing projects\nwith clearly established vested rights to achieve greater compliance with current\nregulations.\n\n(B)\n\nAn applicant may submit a request for a project consent agreement to the director,\nin writing, after the director issues a vested rights determination under Section 25-1-541 (Vested Rights Determination) and before the application expires under Section 25-1-82 (Application Requirements and Expiration). The request must identify:\n\n(1)\n\ncurrent regulations for which compliance would be required, other than regulations\nexempt from vested rights protections under state law;\n\n(2)\n\nadditional restrictions on the nature and intensity of the proposed development; and\n\n(3)\n\nany modifications or waivers requested as a condition to the agreement, including\nbut not limited to provisions for the transfer or averaging of impervious cover to\ninclude additional property or changes to the original project that increase compatibility\nwith adjacent land uses.\n\n(C)\n\nThe director may recommend a project consent agreement for approval to the city council\nif the director finds that the agreement achieves a greater degree of environmental\nprotection and compatibility with adjacent land uses than would occur if a project\ndeveloped to the full extent of vested rights that have been verified or are reasonably\nlikely to exist for the project.\n\n(D)\n\nIn making a determination under Subsection (C) of this section, the director shall\nconsider:\n\n(1)\n\nthe degree to which vested rights for the project have been established;\n\n(2)\n\nthe importance of particular regulations to achieving adopted planning goals or policies\nfor the area in which the project is located; and\n\n(3)\n\na recommendation from the environmental officer regarding the environmental benefits\nof the proposed agreement, if vested rights from the regulations of Chapter 25-8 (Environment) are asserted for the project.\n\n(E)\n\nThe city council may consider approval of a project consent agreement under this section\nonly if the agreement is recommended by the director or initiated by the city council.\nBefore the council acts on a consent agreement, the director shall seek a recommendation\nfrom the Environmental Board and the Land Use Commission, and the council shall hold\na public hearing. The director shall provide notice of the hearing under Section 25-1-132(B) (Notice of Public Hearing).\n\n(F)\n\nIn acting on a project consent agreement, the city council may approve, deny, or modify\nthe agreement based on the standard applicable to the director's review under Subsections\n(C) and (D) of this section. A project consent agreement may waive or modify site\ndevelopment regulations applicable to a project as deemed appropriate by the city\ncouncil.\n\n(G)\n\nA project consent agreement for a project located in the extraterritorial jurisdiction\nmay include a development agreement as authorized under Section 212.172 of the Local\nGovernment Code. The director shall review a proposed development agreement concurrent\nwith an application for a project consent agreement, but council may consider the\nagreements separately or as a single agreement.\n\n(H)\n\nA project consent agreement is subject to the expiration requirements specified in\nthis subsection.\n\n(1)\n\nA project consent agreement approved by the city council expires on the 90\nth\nday after approval, unless the applicant has submitted a complete site plan application\nfor review by the director under the terms of the agreement.\n\n(2)\n\nFollowing submittal of a site plan application, a project consent agreement expires\nif:\n\n(a)\n\nthe site plan application expires under Section 25-1-82 (Application Requirements and Expiration); or\n\n(b)\n\nthe site plan expires under Section 25-5-81 (Site Plan Expiration).\n\n(3)\n\nIn approving a project consent agreement, the city council may extend the expiration\nperiods established under this subsection.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nThe director may adopt guidelines to assist in reviewing applications under Section 25-1-533 (Vested Rights Petition Required), Section 25-1-544 (Project Consent Agreements), and Section 25-1-553 (Managed Growth Agreements).\n\n(B)\n\nGuidelines adopted under this section for review of vested rights petitions may be\nused to help address common questions that arise in determining vested rights, including\nbut not limited to:\n\n(a)\n\nwhether a permit application is required to continue, complete, or initiate the project\nfor which vested rights are claimed;\n\n(b)\n\nwhether the project for which vested rights are claimed has been completed, changed,\nor expired; and\n\n(c)\n\nwhether progress towards completion of a project has been made under Section 25-1-554 (Dormant Projects).\n\n(C)\n\nGuidelines adopted under this section shall be posted on the department's website\nand made available to the public, but need not be adopted by administrative rule under\nSection 1-2 (Adoption of Rules).\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nDuring the timeframes established under this division, a vested rights determination\nfor a project approved under Section 25-1-541 (Vested Rights Determination) applies to any permit application required to initiate, continue, or complete the\nproject.\n\n(B)\n\nIf the vesting date approved for a project under Section 25-1-541 (Vested Rights Determination) is based on a permit application that is submitted on or after June 23, 2014, the\nproject is subject to the expiration periods specified in Section 25-1-552 (Expiration of Projects Begun On or After June 23, 2014).\n\n(C)\n\nIf all permits for a project expire, the project expires.\n\n(D)\n\nA permit application submitted after a project expires constitutes a new project and\nis subject to the current regulations of this title, except that:\n\n(1)\n\nif a site plan associated with a project remains active at the time the project expires,\nthe vested rights determination for the project applies to any application for a building\npermit necessary to complete construction of the site plan for as long as the site\nplan remains active; and\n\n(2)\n\nan application to extend a site plan associated with a project may be approved in\naccordance with Section 25-5-62 (Extensions of Released Site Plan by Director).\n\n(E)\n\nThe expiration of a project associated with a preliminary plan or a final plat does\nnot affect the validity of a platted lot under this title.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nThe project expiration period established by this section applies if the vesting date\napproved for a project under Section 25-1-541 (Vested Rights Determination) is based on a permit application that is submitted on or after June 23, 2014.\n\n(B)\n\nExcept as provided in Subsection (C) of this section or in Section 25-1-551 (Expirations Generally), a project expires nine years after the vesting date approved for the project under\nSection 25-1-541 (Vested Rights Determination).\n\n(C)\n\nIf the vesting date approved for a project under Section 25-1-541 (Vested Rights Determination) is based on a fair notice application (new project) submitted under Section 25-1-535 (Fair Notice Application):\n\n(1)\n\nthe project expires one year after the date the application was submitted; or\n\n(2)\n\nif a permit application is submitted before the fair notice application expires, the\nproject expires on the date applicable to the permit under this section, except that\nthe project expiration period shall be deemed to run from the date of the fair notice\napplication.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nThis section provides a voluntary mechanism to request longer project expiration periods\nthan those established under Section 25-1-552 (Expiration of Projects Begun On or After June 23, 2014) for large-scale projects or projects located within a planned development center.\n\n(B)\n\nTo be accepted for review, an application for a proposed managed growth agreement\nmust include all information required by the director, including a proposed expiration\ndate, and must meet the requirements of this subsection.\n\n(1)\n\nAn application for a managed growth agreement may be submitted concurrent with the\nfirst permit application, or before the review period expires, if the project associated\nwith the proposed agreement:\n\n(a)\n\nis filed for review under current regulations;\n\n(b)\n\ndoes not require a variance approved by the Land Use Commission or Board of Adjustment,\nunless the project is limited to residential uses that do not require a site plan\nunder Section 25-5-2 (Exemptions);\n\n(c)\n\nincludes only property located within the zoning jurisdiction, outside of the Barton\nSprings Zone; and\n\n(d)\n\nincludes at least 10 acres of land.\n\n(2)\n\nAn application for a managed growth agreement may be submitted after approval of the\nfirst permit application, but no later than one year before the project expires, if\nthe project associated with the proposed agreement:\n\n(a)\n\ncomplies with the regulations in effect on the date the application for a managed\ngrowth agreement was submitted or, in extraordinary circumstances, includes community\nbenefits or superior development features that mitigate noncompliance with current\nregulations;\n\n(b)\n\ndoes not require a variance approved by the Land Use Commission or Board of Adjustment,\nunless the project is limited to residential uses that do not require a site plan\nunder Section 25-5-2 (Exemptions);\n\n(c)\n\nincludes only property located within the zoning jurisdiction, outside of the Barton\nSprings Zone; and\n\n(d)\n\ndoes not impede or delay official City of Austin economic development or sustainability\ninitiatives.\n\n(C)\n\nIf an application meets the requirements in Subsection (B) of this section, the director\nshall:\n\n(1)\n\nschedule a public hearing on the proposed agreement and provide notice of the hearing\nunder Section 25-1-132(B) (Notice of Public Hearing); and\n\n(2)\n\nmake a recommendation to approve or deny the agreement based on whether the project:\n\n(a)\n\nrequires a longer period of time to construct than the timeframes established under\nSection 25-1-552 (Expiration of Projects Begun On or After June 23, 2014);\n\n(b)\n\nfurthers the goals and policies of the Imagine Austin Comprehensive Plan; and\n\n(c)\n\nis environmentally superior to the minimum standards applicable to the project under\nChapter 25-8 (Environment), as determined based on a recommendation from the environmental officer.\n\n(D)\n\nThe city council may approve or deny a proposed managed growth agreement based on\nthe criteria in Subsection (C) of this section and may establish whatever expiration\nperiod the council deems appropriate, but may not waive or modify current regulations\napplicable to the project.\n\n(E)\n\nIf a managed growth agreement is approved under this section, the director shall treat\nthe project as vested to the regulations in effect on the date of the first application\nuntil the date the agreement expires.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n\n(A)\n\nThis section is adopted under Section 245.005 of the Local Government Code to provide\nexpiration dates for permits that lack an expiration date under applicable regulations.\nThis section does not apply to a permit that is subject to an expiration date under\nthe regulations applicable to the permit. For purposes of this section, a permit that\nis not subject to an expiration date is an \"unexpired permit.\"\n\n(B)\n\nIf an unexpired permit was approved prior to May 11, 2000, then the permit expired\non May 11, 2004, unless the applicant submits evidence sufficient to show that progress\ntowards completion of the project was made under Subsection (D) of this section prior\nto May 11, 2000.\n\n(C)\n\nIf an application for an unexpired permit was submitted after September 5, 2005, then\nthe permit expires five years after the permit was approved unless the applicant submits\nevidence sufficient to show that progress towards completion of the project was made\nprior to that date under Subsection (D) of this section.\n\n(D)\n\nFor purposes of this section, progress towards completion of a project includes any\none of the following:\n\n(1)\n\nan application for a final plat or plan is submitted to a regulatory agency;\n\n(2)\n\na good-faith attempt is made to file with a regulatory agency an application for a\npermit necessary to begin or continue towards completion of the project;\n\n(3)\n\ncosts have been incurred for developing the project including, without limitation,\ncosts associated with roadway, utility, and other infrastructure facilities designed\nto serve, in whole or in part, the project (but exclusive of land acquisition) in\nthe aggregate amount of five percent of the most recent appraised market value of\nthe real property on which the project is located;\n\n(4)\n\nfiscal security is posted with a regulatory agency to ensure performance of an obligation\nrequired by the regulatory agency; or\n\n(5)\n\nutility connection fees or impact fees for the project have been paid to a regulatory\nagency.\n\n(E)\n\nIf the first permit in a series of permits for a project expires based on dormancy\nof the project, then it cannot form the basis of a vested rights petition.\n\nSource: Ord. 20140612-084, Pt. 2, 6-23-14.\n",
  "start_line": 5045,
  "end_line": 5803,
  "subsections": []
}