{
  "id": "25-1-461",
  "title": "APPEAL",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "A registrant may appeal a suspension as set forth in Section 25-1-461 (Appeal).\n\n(E)\n\nA suspension under this section is not an exclusive remedy for a violation of Section\n80.39.\n\n80.39 Offenses.\n\n(A)\n\nA person may not:\n\n(1)\n\nallow another to use an electrical permit in an unlawful or fraudulent manner;\n\n(2)\n\nperform, or cause to be performed, electrical work that causes injury to a person\nor property;\n\n(3)\n\nsupervise, perform, or cause to be performed electrical work that does not comply\nwith the supervision requirements in the Electrical Code;\n\n(4)\n\nperform electrical work without the required license or permit classification;\n\n(5)\n\ndisplay, cause to be displayed, allow to be displayed, or possess a document that\npurports to be a license to perform electrical work that is false, expired, suspended,\nor altered;\n\n(6)\n\nfail or refuse to display a license or permit to perform electrical work when requested\nby the building official;\n\n(7)\n\nallow a person, other than the person to whom the license was issued, to perform electrical\nwork;\n\n(8)\n\ncontract for, or cause to be performed, electrical work that requires a permit by\na person who lacks a license required by the Electrical Code;\n\n(9)\n\nemploy a person who is not licensed as a master electrician or electrical contractor,\njourneyman electrician, residential wireman, or apprentice electrician to perform\nelectrical work that requires an electrical license;\n\n(10)\n\nrequest the building official to perform inspections of work that is incomplete or\nwork that has not been properly reviewed by the permit holder or the designated supervisor\nthree or more times during a 12-month period;\n\n(11)\n\nemploy a person to perform electrical work for which the person is not qualified;\n\n(12)\n\nsupervise a person who is performing electrical work for which the person performing\nthe work is not qualified to perform;\n\n(13)\n\nobtain a permit for a business or person other than the business or person identified\non the person's electrical contractor's license;\n\n(14)\n\nperform electrical work under a permit for a business other than the business identified\non the permit authorizing the electrical work;\n\n(15)\n\nperform, or cause to be performed, electrical work in a manner that endangers a person\nor property;\n\n(16)\n\nfail to provide notification for a change of business address, qualifying master electrician,\nor contact information included on the electrical contractors license on or before\nthe 10\nth\nday after the change occurs;\n\n(17)\n\nrefuse to provide picture identification when requested by the building official;\n\n(18)\n\nfail to comply with the requirements of the Electrical Code; or\n\n(19)\n\nallow more than five electrical permits to expire.\n\n(B)\n\nThe building official may report offenses to the Texas Department of Licensing and\nRegulation.\n\n80.40 Supervision.\n\n(A)\n\nAt least one licensed journeyman electrician, licensed master electrician, or licensed\nresidential wireman shall be present on a site to supervise the electrical work being\nperformed.\n\n(B)\n\nA contractor who is responsible for the electrical work being performed shall provide\nfulltime supervision, management, direction, and control. A residential wireman may\nonly supervise residential projects.\n\n(C)\n\nThe ratio of licensed master electrician, licensed journeyman electrician, or residential\nwireman to licensed apprentice electricians may not exceed one licensed master electrician,\nlicensed journeyman electrician, or residential wireman to five licensed apprentice\nelectricians.\n\n(D)\n\nThe designated supervisor shall review the electrical work before submitting a request\nfor the building official to inspect.\n\n80.41 Special Requirements for Installations Below Regulatory Flood Datum.\n\n(A)\n\nFor purposes of this section, regulatory flood datum (RFD) has the meaning assigned\nin Section 1612 (Flood loads) of the Building Code.\n\n(B)\n\nIf a circuit can be de-energized by automatic operating electrical disconnection equipment,\nthen a lighting circuit, switch, receptacle, or luminaire that operates at no more\nthan 120 volts to ground may be installed below the RFD. The electrical circuit shall\nbe de-energized before water is present on the floor of the affected areas. If any\nequipment is flooded, its particular circuit may not be re-energized until the circuit\nand the equipment are:\n\n(1)\n\napproved by the wiring and equipment manufacturer for reuse after being submerged\nin water; or\n\n(2)\n\nreplaced and approved for use by the building official.\n\n(C)\n\nExcept for a switch, receptacle, and luminaire, all other electrical equipment permanently\ninstalled below the RFD shall be rated by the equipment manufacturer for submergence\nfor at least 72 hours for a head of water above the equipment to the RFD.\n\n(D)\n\nAn electrical wiring system installed below the RFD shall be suitable for continuous\nsubmergence in water. Only a submersible splice is allowed below the RFD. A conduit\nlocated below the RFD shall be installed so that it can be self-draining if subject\nto flooding.\n\n(E)\n\nThe electrical power equipment and components of an elevator system shall be located\nabove the RFD. An automatic type elevator shall be provided with a home station located\nabove the RFD to which the elevator will automatically return after use.\n\n(F)\n\nAn electrical unit heater installed below the RFD shall be capable of being disconnected\nas outlined in Subsection (B). An electrical control on a gas or oil furnace located\nbelow the RFD may not exceed 120 volts to ground and the control circuits shall be\nautomatically de-energized before water is present on the floor of the affected area.\n\n(G)\n\nSump pumping equipment of any type shall be provided with a float operated warning\nalarm that acts independently of any other float actuating device used to start and\nstop pumping equipment. A building or structure that utilizes sump pumping equipment\nshall have automatic starting standby electrical generating equipment located above\nthe RFD. The standby generating equipment shall be capable of remaining in continuous\noperation at 125 percent of the anticipated duration of the design flood.\n\n(H)\n\nA control center, privately owned transformer, distribution and main lighting panel,\nand switchgear, in addition to other stationary equipment, shall be located above\nthe RFD. Portable or moveable electrical equipment may be located below the RFD if\nthe equipment can be disconnected by a single plug or socket assembly of the submersible\ntype and rated for a minimum of 72 hours for the head of water above the assembly\nto the RFD.\n\n(I)\n\nAll components of emergency lighting systems installed below the RFD shall be located\nso that a component of the emergency lighting system is not within reach of personnel\nworking at floor level in the area where an emergency lighting system is used unless\nthe emergency lighting circuit(s) are provided with ground-fault circuit interrupters\nhaving a maximum leakage current to ground sensitivity of 5 milliamperes.\n\n(J)\n\nBefore the building official can release electrical utilities or issue a certificate\nof occupancy, the building official must verify that all incoming main city power\nservice equipment, including all metering equipment, is located two feet above RFD.\n\n80.42 Other Applicable City Code and Criteria Manual Requirements.\n\nWhen applicable, an electrical installation shall also comply with:\n\n(1)\n\nChapter 25-2, Subchapter C, Article 13 (Docks, Bulkheads, and Shoreline Access);\n\n(2)\n\nBuilding Criteria Manual, Section 5.2.4 (Wiring Over and Under Navigable Water);\n\n(3)\n\nBuilding Criteria Manual, Section 5.2.10 (Subchapter E, Section 2.5, Exterior Lighting Rules for Alternative Equivalent Compliance); and\n\n(4)\n\nBuilding Criteria Manual, Section 4.4.7 (Visitability).\n\nSource: Ord. No. 20230831-105, Pt. 1, 9-11-23.\n\nThe following provisions are local amendments to the 2023 Electrical Code. Each provision\nof this section is a substitute for any identically numbered provision of the 2023\nElectrical Code deleted by Section 25-12-111(B) (Electrical Code) or is an addition to the 2023 Electrical Code:\n\n110.12 Mechanical Execution of Work. Neat and workmanlike. All electrical work shall be installed in a neat and workmanlike\nmanner. In the Electrical Code, workmanlike manner means, but is not limited to, the\nfollowing:\n\n(1)\n\nwork that is skillfully installed consistent with the Electrical Code's requirements;\n\n(2)\n\nequipment, raceways, and cables are installed parallel or perpendicular to the building\nor structure's structural members;\n\n(3)\n\nwhen raceways or cables are grouped, the raceways and cables remain straight, parallel,\nor perpendicular to the building or structure's structural members;\n\n(4)\n\neach cable is cut to a length that prevents sagging, except when flexibility requires\nmoderate sagging; and\n\n(5)\n\neach box, cabinet, enclosure, and device is installed level, parallel, or perpendicular\nto the building or structure's structural members.\n\n210.5(C)(1) Conductor Identification. Color coding of conductors shall be consistent at all terminations, connections,\nand splice points as follows:\n\n(1)\n\nSingle phase 120/240-volt wiring systems.\n\n(A)     (B)       (N)\n\nRED—BLACK—WHITE\n\n(2)\n\nThree phase four wire 120/208-volt wiring systems.\n\n(A)    (B)       (C)        (N)\n\nRED—BLACK—BLUE—WHITE\n\n(3)\n\nThree phase three, and four wire 120/240-volt delta wiring systems.\n\n(A)    (B)         (C)      (N)\n\nRED—ORANGE—BLACK—WHITE\n\n(4)\n\n277/480-wye or 480-volt delta wiring systems.\n\n(A)       (B)        (C)        (N)\n\nBROWN—YELLOW—PURPLE—GRAY\n\nException: NM Cable installed in one, two, or multifamily dwelling units.\n\n230.70(A) Service Disconnecting Means Location.\n\n(1)\n\nExcept as provided in Subsection (A)(2), the service disconnecting means shall be\ninstalled at a readily accessible location that is located outside of a building or\nstructure.\n\n(2)\n\nThe service disconnecting means may be installed at a readily accessible location\nthat is located:\n\n(a)\n\ninside of a building or structure that is not a one- or two-family dwelling;\n\n(b)\n\nat the nearest point of entrance to the service conductors;\n\n(c)\n\non a direct path that 25-feet or less from an exterior entrance; and\n\n(d)\n\nis first floor accessible from an exterior entrance inside of a building or structure.\n\n(3)\n\nA service disconnecting means may not be installed in a bathroom.\n\n680.13(1) Emergency switch for swimming pools. A clearly labeled emergency shutoff switch shall be installed to disconnect all ungrounded\nconductors for swimming pool equipment and underwater lighting systems. The switch\nshall be installed in a place that is readily accessible, within sight, and not less\nthan five feet from the water's edge. The sign for the shut-off switch shall be capable\nof being read from a distance of 50 feet; shall be made of plastic, metal, or other\ndurable material; and shall read \"Emergency Shut Off\".\n\nException: One- and two-family dwellings.\n\n680.41 Emergency shut-off for spas and hot tubs.\n\n(A)\n\nA clearly labeled emergency shutoff switch shall be installed to disconnect all ungrounded\nconductors for spa or hot tub equipment and underwater lighting systems. The switch\nshall be installed in a place that is readily accessible, within sight, and not less\nthan five feet from the water's edge.\n\n(B)\n\nThe sign for the shut-off switch shall be capable of being read from a distance of\n50 feet; shall be made of plastic, metal, or other durable material; and shall read\n\"Emergency Shut Off\".\n\nException: One- and two-family dwellings.\n\nSource: Ord. No. 20230831-105, Pt. 1, 9-11-23.\n\n(A)\n\nThe Uniform Mechanical Code, 2024 Edition, published by the International Association\nof Plumbing and Mechanical Officials Council (\"2024 Uniform Mechanical Code\") is adopted\nand incorporated by reference into this section with the deletions in Subsections\n(B) and the amendments in Section 25-12-133\n(Local Amendments to the Uniform Mechanical Code).\n\n(B)\n\nThe following provisions of the 2024 Uniform Mechanical Code are deleted. Unless specifically\nlisted in this table, a subsection contained within a deleted section or subsection\nis not deleted:\n\n|  |  |  |\n| --- | --- | --- |\n| Section 104.2 | Section 104.3.3 | Section 104.4.3 |\n| Section 104.4.4 | Section 104.5 and associated subsections | Section 107.0 |\n| Table 104.5 | Section 303.8.4 and associated subsections | Section 403.10 |\n| Section 405.4.1 | Section 504.4.2 and associated subsection | Section 609.0 and associated subsections |\n| Section 939.0 | Section 1126.0 | Chapter 13 |\n\n(C)\n\nThe city clerk shall retain a copy of the 2024 Uniform Mechanical Code with the official\nordinances of the City.\n\nSource: Ord. 20130606-090; Ord. 20140410-011, Pt. 5, 4-21-14; Ord. No. 20170608-056, Pt. 4, 9-6-17; Ord. No. 20210603-058, Pt. 1, 9-1-21; Ord. No. 20250410-044, Pt. 1, 7-10-25.\n\nIn the City Code, \"Mechanical Code\" means the 2024 Uniform Mechanical Code adopted\nby Section 25-12-131\n(Uniform Mechanical Code) and as amended by Section 25-12-133\n(Local Amendments to the Uniform Mechanical Code). In this article, \"this code\" means the Uniform Mechanical Code.\n\nSource: Ord. 20130606-090; Ord. No. 20170608-056, Pt. 4, 9-6-17; Ord. No. 20210603-058, Pt. 1, 9-1-21; Ord. No. 20250410-044, Pt. 1, 7-10-25.\n\nThe following provisions are local amendments to the commercial provisions of the\n2024 Uniform Mechanical Code. Each provision in this section is a substitute for an\nidentically numbered provision deleted by Section 25-12-131(B) or an addition to the 2024 Uniform Mechanical Code.\n\nChapter 1 Administration.\n\n104.1.1 Commercial Mechanical Change-Out Program. For buildings not covered under the Residential Code, the building official may establish,\nby rule, an inspection program for commercial mechanical components identified in\nthis section or a change-out program authorized in other technical or building codes.\nThe buildings must be located within the zoning jurisdiction of the City, outside\nof the zoning jurisdiction under agreement with a municipal utility district, where\nthe City provides electrical service, or as determined by the building official.\n\n104.2 Exempt Work. A mechanical permit is not required for the work described in this provision. Work\nexempt from a permit must still comply with this code and all other applicable laws\nand City Code requirements.\n\n1.\n\nA portable heating appliance, portable ventilating equipment, a portable cooling unit,\nor a portable evaporative cooler.\n\n2.\n\nReplacing a component part that does not alter the original approval and complies\nwith other applicable requirements of this code.\n\n3.\n\nRefrigerating equipment that is part of equipment subject to a permit issued under\nthis code.\n\n4.\n\nReplacement or relocation of controls and thermostats (less than 24 volts).\n\n5.\n\nInstalling self-contained refrigerators or freezers.\n\n6.\n\nServicing and repairing ice machines.\n\n7.\n\nRelocation of return and supply grilles within range of existing duct lengths if they\nremain within the same space.\n\n8.\n\nOther work as determined by the building official.\n\n104.3.3 Time Limits. Article 13 (Administration of Technical Codes) of Chapter 25-12\n(Technical Codes) establishes permit application time limits and requirements applicable to permit\nexpiration and reactivation, including a review fee for expired permits.\n\n104.5 Fees. Fees applicable to this code are set by a separate ordinance.\n\n104.6 Registration of Air Conditioning and Refrigeration Contractors. An air conditioning and refrigeration contractor must register with the City before\nperforming work regulated by this code. A contractor must provide the contractor's\nname and State of Texas license number. A contractor must pay a registration fee,\nestablished by separate ordinance, for an initial registration, registration after\na license suspension, and registration after the license expires. A new registration\nfee is not required to renew a license that is not suspended or expired.\n\n107.0 Appeals. A person aggrieved by an order, decision, or determination of the building official\nrelated to an application or interpretation of this code may appeal the order, decision,\nor determination consistent with the procedures set forth in Chapter 25-1, Article 7, Division 1 (Appeals). The Mechanical and Plumbing Board, established in Section 2-1-161 (Mechanical and Plumbing Board), hears appeals authorized by this section.\n\nChapter 2 Definitions.\n\n202.1.1 Amended and Supplemented Definitions. The definitions in this subsection apply throughout this code and amend or supplement\nthe definitions in Chapter 2.\n\nBleed-off (Blowdown). The circulating water in a cooling tower which is discharged to help keep the dissolved\nsolids in the water below a maximum allowable concentration limit.\n\nBlow-Down Meter. A meter that tracks the amount of water discharged from a cooling tower system.\n\nConcentration. The recirculated water in a cooling tower that has elevated levels of total dissolved\nsolids as compared to the original make-up water.\n\nConductivity Controller. A device used to measure the conductivity of total dissolved solids in the water\nof a cooling system to control the discharge of water in order to maintain efficiency.\n\nCooling Tower. An open- or closed-loop water recirculation system that uses fans or natural draft\nto force or draw air to contact and cool water through the evaporative process that\nremoves heat from water-cooled A/C systems and from industrial processes.\n\nCycle of Concentration. The ratio of the dissolved solids in recirculating water to the dissolved solids\nin the makeup water.\n\nDrift Eliminator. A device that captures large water droplets caught in the cooling tower air stream\nto prevent the water droplets and mist from escaping the cooling tower.\n\nInsanitary Location. An area, space, public/private balcony, or room where the air is unfit or undesirable\nfor circulation to occupiable parts of a building.\n\nMakeup. The amount of water required to replace normal losses caused by bleed-off (blowdown),\ndrift, and evaporation.\n\nMakeup Meter. A meter that measures the amount of water entering a cooling tower system.\n\nOverflow Alarm. A system that includes a level switch and an electronic signaling device that sends\nan audible signal or provides an alert via the energy management control system to\nthe tower operator in case of sump overflow.\n\nChapter 3 General Regulations.\n\n303.8.4 Roof Drainage and Rails. Equipment shall be installed on a well-drained surface of the roof. Guards must be\nprovided where an appliance, equipment, fan, solar system, or other components require\nservice and are located within 10 feet (3,048 mm) of a roof edge or open side of a\nwalking surface and the edge or walking surface is located 30 inches above the grade\nbelow. Rigid fixed rails or guards at least 42 inches (1,067 mm) in height must be\nprovided on the exposed side. The guard must be constructed to prevent a 21-inch-diameter\n(533 mm) sphere from passing through and must extend at least 30 inches (762 mm) beyond\neach end of the appliance, equipment, fan, or component. If a parapet or other building\nstructure is used in lieu of a guard, it must be at least 42 inches (1,067 mm) in\nheight.\n\nException: Guards shall not be required where a permanent fall arrest anchorage connector system\nin accordance with ASSE Z359.1 is installed.\n\n304.3.1.2.1 Ladders. Permanent ladders to access equipment located on a roof shall be provided at parapet\nwalls that exceed 30 inches in height.\n\n304.4.5 Concealed Space Designed for Appliances. An unobstructed access panel with a minimum of 22 inches by 30 inches at each point\nof maintenance and repair access shall be required. An opening as large as the largest\ncomponent of an appliance is not required if:\n\n1.\n\nthe largest appliance can be removed by other means;\n\n2.\n\na plan for removal of the appliance is clearly documented on the approved plans; and\n\n3.\n\nfire protection components, any part of the electrical installation, or structural\nload resisting systems and plumbing are not being affected.\n\n310.1.2 Sling-Style Equipment. Sling-style A/C equipment that reintroduces condensation back into the atmosphere\nis prohibited.\n\n318 Cooling Systems. Interior spaces intended for human occupancy shall be provided with active or passive\ncooling systems capable of maintaining an indoor temperature of not more than 80°F\n(27°C) at a point three feet (914 mm) above floor on the design cooling day. The installation\nof portable cooling systems shall not be used to achieve compliance with this section.\n\nExceptions:\n\n1.\n\nInterior spaces where the primary purpose is not associated with human comfort.\n\n2.\n\nGroup F, H, S, and U occupancies.\n\nChapter 4 Ventilation Air.\n\n403.7.3 Occupied Spaces Accessory to Public Garages. Connecting offices, waiting rooms, ticket booths, and similar uses accessory to a\npublic garage must be maintained at a positive pressure and must include ventilation\nconsistent with Section 403.0 Ventilation Rates.\n\n405.4.1 Residential Kitchen Exhaust Rate. For intermittent-controlled operations, the exhaust rate shall be not less than 100\nft\n3\n/min (47.2 L/s) and 300 ft\n3\n/min (142 L/s) for downdraft appliances. For continuous operation the exhaust rate\nshall be not less than 50 ft\n3\n/min (23.6 L/s).\n\nChapter 5 Exhaust Systems.\n\n504.1.2 Environmental Exhaust Duct Termination Over Covered Walkway. An exhaust duct serving a domestic clothes dryer shall not terminate over a covered\nwalkway unless the duct is extended to the outer edge of the covered walkway.\n\n1.\n\nAn exhaust duct serving a domestic range or bathroom exhaust fan shall not terminate\nover a covered walkway unless three sides are open for dilution air movement.\n\nException: If adequate dilution air cannot be provided, an exhaust duct serving a domestic range\nor bathroom exhaust fan shall be extended to the outer edge of the covered walkway.\n\n2.\n\nAn exhaust duct shall terminate over a private use balcony if the balcony serves the\nsame space or dwelling unit as the duct serves and required clearances from openings\nare maintained.\n\n504.4.2 Domestic Cloth Dryers. Section 504, subsections, and associated tables and references and duct support requirements\nin Subsection B of the International Mechanical Code, 2024 Edition, apply to a clothes\ndryer installation. Alternatively, clothes dryer installation may qualify as an alternate\nengineered system if it meets the requirements of this section.\n\n1.\n\nAlternate Engineered Systems. If the dryer duct system is designed by a professional\nengineer, the system must comply with ANSI Z21.5.I/CSA 7.1. The design professional\nmust provide calculations and design criteria on plans submitted under Section 104.0\nof this code and must demonstrate dryer vent system is equivalent to a system that\ncomplies with the International Mechanical Code, 2024 Edition.\n\n2.\n\nDuct Supports. Ducts shall be supported in accordance with SMACNA HVAC Duct Construction\nStandards - Metal and Flexible.\n\n520.0 Hazardous Materials. Sections 502.8 through 502.8.5., associated tables and referenced sections of the\nInternational Mechanical Code, 2024 Edition, shall apply except for Section 502.8.4\nthat is replaced with the following:\n\nWhere gases, liquids, or solids in amounts exceeding the maximum allowable quantity\nper control area and having a hazard ranking of 2, 3, or 4 accordance with NFPA 704\nare dispensed or used, mechanical exhaust ventilation shall be provided to capture\ngases, fumes, mists, or vapors at the point of generation.\n\n521.0 Hazardous Materials - Requirements for Specific Materials. Section 502.9, subsections, associated tables, and referenced sections of the International\nMechanical Code, 2024 Edition, apply.\n\n522.0 Hazardous Production Materials (HPM). Section 502.10, subsections, associated tables and referenced sections of the International\nMechanical Code, 2024 Edition, apply.\n\n523.0 Hazardous Exhaust Systems. Section 509, subsections, and associated tables and referenced sections of the International\nMechanical Code, 2024 Edition, apply.\n\n524.0 Manicure and pedicure stations. Section 502.20, subsections, and associated tables and referenced sections of the\nInternational Mechanical Code, 2024 Edition, apply.\n\nChapter 6 Duct Systems.\n\n603.10.1 Cross Contamination. A non-hazardous duct under positive or negative pressure may be routed through a\nduct or plenum or occupied space when longitudinal and traverse joints (seal class\nA per SMACNA) are sealed with materials designed for that use and sealed consistent\nwith acceptable methods.\n\n609 Smoke Detection Systems Control. Section 606, subsections, and associated tables and referenced sections of the International\nMechanical Code, 2024 Edition apply.\n\nChapter 9 Installation of Specific Appliances.\n\n939.0 Sauna Heaters. Section 914, subsections, and associated tables and references of the International\nMechanical Code, 2024 Edition, apply.\n\nChapter 10 Boilers and Pressure Vessels.\n\n1015.0 Efficiency Standards for Steam Boilers. A steam boiler shall:\n\n1.\n\nBe equipped with conductivity controllers that control blowdown and a coldwater makeup\nmeter. If the system is a 50 Boiler Horsepower or greater, the meter must be connected\nto the building's energy management system or utility monitoring dashboard;\n\n2.\n\nInclude a steam condensate return system;\n\n3.\n\nBe fitted with a blowdown heat exchanger to transfer heat from blowdown to the feed\nwater; and\n\n4.\n\nIf the boiler exceeds 15 psi and 100 Boiler Horsepower, and the heat recovery can\nbe used to heat boiler makeup water or other purposes, the boiler blowdown must be\ndirected to a heat recovery system that reduces the temperature of the blowdown discharge\nto below 140 degrees Fahrenheit without using tempering water.\n\nChapter 11 Refrigeration.\n\n1126.0 Standards for Cooling Towers.\n\n1.\n\nA cooling tower shall:\n\na.\n\nAchieve a minimum of five cycles of concentration if the cooling tower utilizes potable\nwater as its primary source of make-up water;\n\nb.\n\nBe fitted with overflow sensors and alarms, make-up water, and blowdown meters to\nmanage water consumption, and conductivity controllers;\n\nc.\n\nBe equipped with drift eliminators with a drift rate of not more than 0.005% of the\ncirculated water flow rate for crossflow towers and 0.002% for counterflow towers\nwhen operated consistent with the equipment manufacturer's instructions and with the\ncooling tower, evaporative condensers, and fluid coolers; and\n\nd.\n\nIf the cooling tower is 100 tons or more, the make-up and blowdown meters and overflow\nalarm shall be connected to the building's central energy management system or utility\nmonitoring dashboard.\n\n2.\n\nA biocide shall be used to treat the cooling system recirculation to minimize the\ngrowth of Legionella and other microorganisms and to increase water use efficiency.\n\n3.\n\nCommercial and multifamily facilities constructed after September 5, 2017, with an\nevaporative cooling tower system with a combined cooling capacity equal to or greater\nthan 100 tons, shall have a minimum of 10 percent of the cooling tower make-up water\noffset with reclaimed or onsite water reuse.\n\nSource: Ord. 20130606-090; Ord. 20140410-011, Pt. 6, 4-21-14; Ord. No. 20170608-056, Pt. 4, 9-6-17; Ord. No. 20191114-064, Pt. 18, 11-25-19; Ord. No. 20210603-058, Pt. 1, 9-1-21; Ord. No. 20250410-044, Pt. 1, 7-10-25.\n\n(A)\n\nThe Uniform Plumbing Code, 2024 Edition, published by the International Association\nof Plumbing and Mechanical Officials (\"2024 Uniform Plumbing Code\") and Appendices\nA, B, C, D, E, G, I, J, K, M, and N are adopted and incorporated by reference into\nthis section with the deletions in Subsection (B) and the amendments in Section 25-12-153\n(Local Amendments to the Uniform Plumbing Code).\n\n(B)\n\nThe following provisions of the 2024 Uniform Plumbing Code are deleted. Unless specifically\nlisted in this table, a subsection contained within a deleted section or subsection\nis not deleted:\n\n|  |  |  |\n| --- | --- | --- |\n| 104.3.2 | 1107 and subsections | 1605.3 and subsections |\n| 104.4 | Chapter 13 | Table 601.3.2 |\n| 104.4.4 | 1502 and subsections | Table 603.2 |\n| 601.3 and subsections and tables | 1503.3 | Table 603.3.1 |\n| 602 and subsections | 1505.4 | K102.2 |\n| 603 and subsections and tables | 1505.6 |  |\n| 612.2 | 1506.4 |  |\n| 712.0 and subsections | 1602.5 |  |\n\n(C)\n\nEach provision in this section is a substitute for the identically numbered provision\ndeleted in Section 25-12-151(B) (Uniform Plumbing Code) or an addition to the 2024 Uniform Plumbing Code.\n\n|  |  |  |  |\n| --- | --- | --- | --- |\n| 104.1.1 | Table 610.1 | 1014.3.6 | 1503.6 |\n| 104.1.2 | 610.1.1 | 1015.0 | 1503.10 |\n| 104.1.3 | 612.0 | 1015.1 | 1503.10.1 |\n| 104.1.4 | 613.0 | 1015.2 | 1503.10.2 |\n| 104.1.5 | 614.0 | 1015.3 | 1503.10.4 |\n| 104.2 | 614.1 | 1015.4 | 1503.10.5 |\n| 104.4.3 | 614.1.1 | 1015.5 | 1503.10.6 |\n| 104.5 | 614.2 | 1016.0 | 1503.10.7 |\n| 104.6 | 616.0 | 1016.1 | 1503.10.8 |\n| 107.0 | 617.0 | 1016.2 | 1505.5 |\n| 108.0 | 704.3 | 1016.3 | 1505.10 |\n| 202.1.1 | 710.10.1 | 1017.0 | 1506.1 |\n| 202.1.2 | 712.1 | 1017.2 | Table 1601.5 |\n| 304.2 | 712.2 | 1017.3 | K 101.7 |\n| 312.6.1 | 713.4 | 1201.1.1 |  |\n| 319.0 | 723.0 | 1213.3 |  |\n| 321.0 | 723.1 | 1302.0 |  |\n| 321.1 | 804.1.1 | 1303.0 |  |\n| 402.5 | 807.3 | 1304.1 |  |\n| 407.4 | 905.3.1 | 1304.2 |  |\n| 422.0 | 908.3 | 1500.0 |  |\n| 504.8 | 1007.3 | 1501.2 |  |\n| 504.8.1 | 1009.2 | 1501.3 |  |\n| 508.2.1 | 1014.1 | Table 1501.5 |  |\n| 601.1 | 1014.1.1 | 1501.5.2 |  |\n| 601.1.1 | 1014.1.2 | 1501.7 |  |\n| 606.2.1 | 1014.1.3 | 1503.1 |  |\n| 608.2 | 1014.2 | 1503.2 |  |\n| 609.13 | 1014.3.3 | Table 1503.4 |  |\n\n(D)\n\nThe city clerk shall retain a copy of the 2024 Uniform Plumbing Code with the official\nordinances of the City.\n\nSource: Ord. 20100624-146; Ord. 20130606-093; Ord. No. 20141120-008, Pt. 2, 12-1-14; Ord. No. 20170615-104, Pt. 1, 9-13-17; Ord. No. 20210603-057, Pt. 1, 9-1-21; Ord. No. 20250410-042, Pt. 1, 7-10-25.\n\nIn the City Code, \"Plumbing Code\" means the 2024 Uniform Plumbing Code adopted by\nSection 25-12-151\n(Uniform Plumbing Code) and as amended by Section 25-12-153\n(Local Amendments to the Uniform Plumbing Code). In this article, \"this code\" means the Uniform Plumbing Code.\n\nSource: Ord. 20100624-146; Ord. 20130606-093; Ord. No. 20170615-104, Pt. 1, 9-13-17; Ord. No. 20210603-057, Pt. 1, 9-1-21; Ord. No. 20250410-042, Pt. 1, 7-10-25.\n\nEach provision in this section is a substitute for the identically numbered provision\ndeleted in Section 25-12-151(B) (Uniform Plumbing Code) or is an addition to the 2024 Uniform Plumbing Code.\n\n104.1.1 Persons authorized to obtain permits. A responsible master plumber licensed by the State of Texas and registered with the\nCity may apply for and obtain a permit required by this code. Only a responsible master\nplumber with a master medical gas endorsement may obtain a plumbing permit related\nto medical gas installations. Only a responsible master plumber with a master water\nsupply protection specialist endorsement may obtain a plumbing permit for a potable\nrain-water system.\n\nException: An individual who is not licensed as a plumber may obtain a plumbing permit for plumbing\nwork that, under state law, may be completed by an unlicensed individual.\n\n104.1.2 Licensing. A person who enters into a contract to install or repair a plumbing system subject\nto this code and the plumbing permit requirement must be licensed by the State of\nTexas.\n\n104.1.3 Registration. A licensed plumber must register with the City before performing any work regulated\nby this code.\n\n104.1.4 Landscape irrigation. A person licensed by the Texas Commission on Environmental Quality (TCEQ) to install\nirrigation systems must register with the City before performing any work regulated\nby this code. A person must pay a registration fee set by separate ordinance at the\ninitial registration with the City or after a license is suspended or expired. A plumbing\npermit must be obtained before installing a landscape irrigation or yard sprinkler\nsystem.\n\n104.1.5 Commercial plumbing change-out program. The building official may establish by rule an inspection program for commercial\nplumbing components identified in this section in buildings not covered under the\nResidential Code or a change-out program authorized by another article in this chapter.\nThe building must be located within the City's full purpose jurisdiction. This program\napplies to replacing a water heater, backflow device, or assembly; and to repairing\nor replacing a sewer line in occupied structures.\n\n104.2 Exempt work.\n\nA.\n\nA permit is not required for the following:\n\n1.\n\nTo stop leaks in drains, soil, waste, or vent pipes, except when a trap, drainpipe,\nsoil, waste, or vent becomes defective and it is necessary to remove and replace the\nsame with new material, a permit shall be procured and inspection made as provided\nin this code.\n\n2.\n\nTo clear stoppages, including the removal and reinstallation of water closets, or\nthe repairing of leaks in pipes, valves, or fixtures if the work does not involve\nor require the replacement or rearrangement of valves, pipes, or fixtures.\n\n3.\n\nWork required to repair or replace fixtures and to replace exposed traps, continuous\nwaste piping, fixture supply valves, or faucets if the work does not involve other\ncity departments or inspections from other trades.\n\n4.\n\nOther work as determined by the building official.\n\nB.\n\nExemption from the permit requirements of this code does not authorize work to be\ndone in violation of other provisions of the City Code or City requirements.\n\nC.\n\nFor purposes of Section 104.2, a new installation or replacement of a shower, tub,\nor combination tub and shower is not exempt from the permit requirements of this code.\n\n104.4.3. Time limits. Article 13 (Administration of Technical Codes) of Title 25\n(Land Development) establishes permit application time limits and requirements applicable to permit\nexpiration and reactivation, including a review fee for expired permits.\n\n104.5 Fees. A fee applicable to this code is set by separate ordinance.\n\n104.6 Offense and Penalty. A person who violates a provision of this code commits an offense that is subject",
  "start_line": 69906,
  "end_line": 70793,
  "subsections": [
    "25-1-461-E",
    "25-1-461-A",
    "25-1-461-B",
    "25-1-461-A",
    "25-1-461-B",
    "25-1-461-C",
    "25-1-461-D",
    "25-1-461-A",
    "25-1-461-B",
    "25-1-461-C",
    "25-1-461-D",
    "25-1-461-E",
    "25-1-461-F",
    "25-1-461-G",
    "25-1-461-H",
    "25-1-461-I",
    "25-1-461-J",
    "25-1-461-A",
    "25-1-461-B",
    "25-1-461-A",
    "25-1-461-B",
    "25-1-461-C",
    "25-1-461-A",
    "25-1-461-B",
    "25-1-461-C",
    "25-1-461-D"
  ]
}