{
  "id": "25-1-90",
  "title": "EXTENSION OF UPDATE DEADLINE",
  "level": 2,
  "parent_id": "chapter-25-1",
  "content": "\nThis section does not apply to an application for preliminary plan, plat, or subdivision\nconstruction plan.\n\n(A)\n\nThe responsible director may adopt rules establishing the requirements for an application,\nincluding timelines for completing staff review and deadlines by which an application\nmust be updated to meet the requirements of this title and other applicable regulations.\nThe rules adopted must be consistent with the timelines for action established in\nSection 25-1-64 (Action on an Application; Deadline).\n\n(B)\n\nThe responsible director or building official may permit an applicant to omit required\ninformation from an application that the responsible director or building official\ndetermines is not material to a decision on the application. An applicant who disagrees\nwith a determination under this subsection may appeal the decision to the city manager.\n\n(C)\n\nExcept as otherwise provided for in this section, the director is authorized to certify\na site plan application if it complies with this subsection.\n\n(1)\n\nAn application is complete after the applicant pays the required fee and provides\nthe information required to be included in the application no later than the 45th\nday after the application is submitted.\n\n(2)\n\nIf the director rejects an application as incomplete, the director shall provide an\napplicant with a written explanation that identifies the deficiencies and information\nneeded to complete the application. The director must provide the written explanation\nwithin 10 working days after the application is received.\n\n(3)\n\nAn application expires if it is not complete on or before the 45th day after the application\nis submitted. An applicant may submit additional information and correct any deficiencies\nat any time before the 45th day after the application was submitted.\n\n(4)\n\nA certification that the site plan application is administratively complete is valid\nfor 45 days after the certification has been issued.\n\n(D)\n\nThe director is authorized to review a site plan application if the applicant pays\nthe required fee and the site plan application has a valid certification of completeness.\nIf the application has not yet been certified, the certification is no longer valid,\nor the submitted site plan does not match the certified materials, the director may\nnot review the application but shall provide the applicant a written explanation that\nidentifies the deficiencies within 10 working days after application is received.\n\n(E)\n\nThe responsible director or building official may not accept a building or demolition\npermit application described in Chapter 25-11, Article 2 (Building and Demolition Permits) unless the application is determined to be complete in accordance with this subsection.\n\n(1)\n\nThe responsible director or building official shall accept an application as complete\nif the applicant has paid the required fee and provided the information required to\nbe included in the application no later than the 45th day after the application is\nsubmitted.\n\n(2)\n\nIf the responsible director or building official rejects an application as incomplete,\nthe responsible director or building official shall provide an applicant with a written\nexplanation that identifies the deficiencies and information needed to complete the\napplication. The responsible director or building official must provide the written\nexplanation within 10 working days after the application is received.\n\n(3)\n\nAn application expires if it is not complete on or before the 45th day after the application\nis submitted. An applicant may submit an update to provide additional information\nand to correct deficiencies at any time before the application expires.\n\n(F)\n\nAn application for a site plan expires one year after the application is submitted\nunless:\n\n(1)\n\nthe application has been approved; or\n\n(2)\n\nthe director has granted additional days for the applicant to submit an update under\nSection 25-1-90(A) (Extension of Update Deadline).\n\n(G)\n\nIf the director grants additional days to the applicant under Subsection (F)(2), then\nthe expiration date of the application is extended by the number of days granted.\n\n(H)\n\nApplications subject to Section 25-1-712 (Tenant Notification Required).\n\n(1)\n\nThe responsible director may not certify a site plan application as complete until\nthe applicant has paid the required fee, provided the information required to be included,\nand complied with the notification requirements or the required number of days lapse.\n\n(2)\n\nThe responsible director or building official may not accept an application as complete\nuntil the applicant has paid the required fee, provided the information required to\nbe included, and complied with the notification requirements or the required number\nof days lapse.\n\n(3)\n\nIf, at the time an application is submitted, a multi-family property is unoccupied\nbut was occupied within the previous 120 days, the application will be rejected as\nincomplete.\n\n(4)\n\nIf, at the time an application is submitted, a mobile home park is unoccupied but\nwas occupied within the previous 270 days, the application will be rejected as incomplete.\n\nSource: Section 13-1-31; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. No. 20140612-084, Pt. 6, 6-23-14; Ord. No. 20160421-039, Pt. 3, 5-2-16; Ord. No. 20160901-050, Pt. 6, 9-12-16; Ord. No. 20190822-117, Pt. 6, 9-1-19; Ord. No. 20230831-141, Pt. 8, 9-11-23; Ord. No. 20230831-103, Pt. 1, 9-11-23.",
  "start_line": 2104,
  "end_line": 2234,
  "subsections": []
}