{
  "id": "25-1-article-2",
  "title": "DEFINITIONS; MEASUREMENTS",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 2. - DEFINITIONS; MEASUREMENTS.\n\nUnless a different definition is expressly provided, in this title:\n\n(1)\n\nACCESSIBLE SPACE means a parking space for an individual with a disability that complies\nwith the Americans with Disabilities Act (ADA) and Fair Housing Act Amendments (FHAA),\nas appropriate.\n\n(2)\n\nACCESSORY, when used as an adjective to describe a land use, means incidental to,\nand customarily associated with, a principal use.\n\n(3)\n\nACCOUNTABLE OFFICIAL means the City officer or employee designated by this title or\nthe city manager with a particular administrative or enforcement responsibility.\n\n(4)\n\nADVISORY BODY means a City board, commission, or other appointed body that does not\nmake a final decision and whose review is not required by state law.\n\n(5)\n\nAGGREGATE means creating a site on which a structure has been built across two or\nmore lots, at least one of which is substandard.\n\n(6)\n\nAGRICULTURAL OPERATIONS means:\n\n(a)\n\nproducing crops for human food, animal feed, planting seed, or fiber;\n\n(b)\n\nfloriculture, viticulture, horticulture, or silviculture;\n\n(c)\n\nraising or keeping livestock or poultry;\n\n(d)\n\nwildlife management; and\n\n(e)\n\nplanting cover crops or leaving land idle for the purpose of participating in any\ngovernmental program or normal crop or livestock rotation procedure.\n\n(7)\n\nAMPHITHEATER means an outdoor or open-air structure or manmade area specifically designed\nand used for assembly of 50 or more people and the viewing of an area capable of being\nused for entertainment and performances.\n\n(8)\n\nAPPROVAL means:\n\n(a)\n\na final decision granting or approving an application; or\n\n(b)\n\nan approval granted subject to modifications or conditions.\n\n(9)\n\nAPPROVAL AUTHORITY means the City officer, employee, or body charged with reviewing\nand determining whether to approve an application.\n\n(10)\n\nATTACHED, when used with reference to two or more buildings, means having one or more\ncommon walls or being joined by a covered porch, loggia, or passageway.\n\n(11)\n\nBASE DISTRICT means a zoning district established by this chapter to prescribe basic\nregulations governing land use and site development.\n\n(12)\n\nBLOCK means one or more lots, tracts, or parcels of land bounded by streets, railroads,\nor subdivision boundary lines.\n\n(13)\n\nBUFFER ZONE means a strip of land used to separate one land use from another incompatible\nland use.\n\n(14)\n\nBUILDING COVERAGE means the area of a lot covered by buildings or roofed areas, but\nexcludes ground level paving, landscaping, open recreational facilities, incidental\nprojecting eaves, balconies, and similar features.\n\n(15)\n\nBUILDING LINE means a line beyond which a building must be set back from the street\nline.\n\n(16)\n\nBUILDING SERVICE EQUIPMENT means plumbing, mechanical, electrical, and elevator equipment\nnecessary for the occupancy or use of a structure.\n\n(17)\n\nCARPORT means a roofed space used as shelter for a parked vehicle.\n\n(18)\n\nCHANGE, when used in reference to a land use, means the replacement of an existing\nuse with a new use, or a change in the nature of an existing use. A change of ownership,\ntenancy, name, or management, or a change in product or service within the same use\nclassification where the previous nature of the use, line of business, or other function\nis substantially unchanged is not a change of use.\n\n(19)\n\nCOLLECTOR STREET means a street collecting traffic from other streets and serving\nas the most direct route to a thoroughfare.\n\n(20)\n\nCOMBINING DISTRICT means a zoning district established by this title to prescribe\nregulations to be applied to a site in combination with regulations applicable to\na base district.\n\n(21)\n\nCOMMON AREA means an area held, designed, or designated for the common use of the\nowners or occupants of a townhouse project, planned unit development, apartment, condominium,\nmobile home park, or subdivision.\n\n(22)\n\nCOMMON SIDE LOT LINE means a side lot line between two or more lots.\n\n(23)\n\nCOMPREHENSIVE PLAN means the plan adopted by the city council in accordance with Article\nX, Section 5, of the City Charter.\n\n(24)\n\nCONDEMNATION includes a purchase or donation of property under the threat of condemnation,\nbut excludes a dedication of property as a condition of zoning, subdivision, site\nplan, or building permit approval.\n\n(25)\n\nCONDITIONAL USE means a use that is allowed on a discretionary and conditional basis\nin accordance with the conditional use process established in Chapter 25-5 (Site Plans).\n\n(26)\n\nCONTRACTOR means a person employed by an owner to develop property.\n\n(27)\n\nCORNER LOT means a lot located at the intersection of two streets, or of two segments\nof a curved street, forming an angle of not more than 135 degrees.\n\n(28)\n\nCURB means a vertical sloping structure located along the edge of a roadway, normally\nconstructed integrally with the gutter, that strengthens and protects the pavement\nedge and clearly defines the pavement edge.\n\n(29)\n\nDESIRED DEVELOPMENT ZONE means the area not within the drinking water protection zone.\n\n(30)\n\nDEVELOPMENT means the construction or reconstruction of a building or road; the placement\nof a structure on land; the excavation, mining, dredging, grading, or filling of land;\nthe removal of vegetation from land; or the deposit of refuse or waste on land. Development\ndoes not include:\n\n(a)\n\nlawn and yard care, including mowing, gardening, tree care, and maintenance of landscaped\nareas;\n\n(b)\n\nremoval of trees or vegetation damaged by natural forces;\n\n(c)\n\nremoval of vegetation or cultivation of the soil for agricultural operations, unless\nprohibited by Subsection 25-8-321(B) (Clearing of Vegetation); or\n\n(d)\n\nthe repair, maintenance, or installation of a utility, drainage or street system that\ndoes not disturb land or increase impervious cover.\n\n(31)\n\nDIRECTOR, when used without a qualifier, means the director of the Watershed Protection\nand Development Review Department or the director's designee.\n\n(32)\n\nDOMINANT SIDE YARD, when used in reference to a small lot, means the side yard having\nthe larger width.\n\n(33)\n\nDRINKING WATER PROTECTION ZONE means the areas within the Barton Springs Zone, the\nBarton Creek watershed, all water supply rural watersheds, and all water supply suburban\nwatersheds, as described in Section 25-8-2 (Descriptions of Regulated Areas), that are in the planning jurisdiction.\n\n(34)\n\nDRIPLINE, when used in reference to a tree, means a line on the ground encircling\nthe tree that is directly beneath the outermost portion of the tree canopy.\n\n(35)\n\nDRIVE-IN SERVICE means the sale of products or the provision of services to occupants\nin vehicles.\n\n(36)\n\nDRIVEWAY means a surfaced area providing vehicular access between a street and an\noff-street parking or loading area.\n\n(37)\n\nDRIVEWAY APPROACH means an area between the roadway and private property designed\nfor and intended to provide vehicular access from the roadway to private property.\n\n(38)\n\nDWELLING UNIT means a residential unit other than a mobile home providing complete,\nindependent living facilities including permanent provisions for living, sleeping,\neating, and cooking.\n\n(39)\n\nEFFICIENCY, when used in reference to a dwelling unit, means a dwelling unit containing\nnot more than 400 square feet of floor area, and not having a bedroom or sleeping\narea separate from the principal living area.\n\n(40)\n\nENCLOSED means a roofed or covered space fully surrounded by walls, including windows,\ndoors, and similar openings or architectural features, or an open space of less than\n100 square feet fully surrounded by a building or walls exceeding eight feet in height.\n\n(41)\n\nFIRE PROTECTION PLAN means a document prepared for a specific project or development\nproposed for the wildland-urban interface area that describes ways to minimize and\nmitigate the fire problems created by the project or development, with the purpose\nof reducing the effect on the community's fire protection delivery system.\n\n(42)\n\nFLAG LOT means a lot that abuts a street by means of a strip of land that does not\ncomply with the requirements of this chapter for minimum lot width.\n\n(43)\n\nFLOOR AREA RATIO means the ratio of gross floor area to gross site area.\n\n(44)\n\nFRONT LOT LINE means:\n\n(a)\n\nfor an interior lot, the lot line abutting the street;\n\n(b)\n\nfor a corner lot, the lot line designated as the front lot line by a subdivision or\nparcel map, or, if none, the shorter lot line abutting a street;\n\n(c)\n\nfor a through lot, the lot line abutting the street that provides the primary access\nto the lot; and\n\n(d)\n\nfor a flag lot, the lot line designated as the front lot line by a subdivision or\nparcel map, or if none, the line determined by the building official to be the front\nlot line.\n\n(45)\n\nFRONT YARD means a yard extending the full width of a lot between the front lot line\nand the front setback line.\n\n(46)\n\nGRADE means the horizontal elevation of a finished surface.\n\n(47)\n\nGROSS FLOOR AREA means the total enclosed area of all floors in a building with a\nclear height of more than six feet, measured to the outside surface of the exterior\nwalls. The term includes loading docks and excludes atria airspace, parking facilities,\ndriveways, and enclosed loading berths and off-street maneuvering areas.\n\n(48)\n\nGROSS SITE AREA means the total site area.\n\n(49)\n\nGUTTER means a shallow water drainage area adjacent to a curb.\n\n(50)\n\nHEIGHT, when used in reference to a building, means the vertical distance from the\naverage of the highest and lowest grades adjacent to the building to:\n\n(a)\n\nfor a flat roof, the highest point of the coping;\n\n(b)\n\nfor a mansard roof, the deck line;\n\n(c)\n\nor a pitched or hip roof, the average height of the highest gable; or\n\n(d)\n\nfor other roof styles, the highest point of the building.\n\n(51)\n\nHILL COUNTRY ROADWAY means a roadway described in Chapter 25-2, Subchapter C, Article 11 (Hill Country Roadway Requirements).\n\n(52)\n\nHILL COUNTRY ROADWAY AREA means an area described in Chapter 25-2, Subchapter C, Article 11 (Hill Country Roadway Requirements).\n\n(53)\n\nHISTORIC DISTRICT means an area included in a historic area (HD) combining district.\n\n(54)\n\nHISTORIC LANDMARK means a structure or site designated as a historic landmark (H)\ncombining district.\n\n(55)\n\nINTERESTED PARTY means a person who meets the criteria established by Section 25-1-131 (Interested Parties).\n\n(56)\n\nINTERIOR LOT means a lot other than a corner lot.\n\n(57)\n\nINTERIOR LOT LINE means a lot line not abutting a street.\n\n(58)\n\nINTERIOR YARD means a yard, not adjacent to a street, that is determined on the basis\nof an interior lot line.\n\n(59)\n\nINTERNAL STREET means a private street in a mobile home park, planned unit development,\nplanned development area, or other similar development.\n\n(60)\n\nLAND USE COMMISSION means the Planning Commission or the Zoning and Platting Commission,\nas determined in accordance with Section 25-1-46 (Land Use Commission).\n\n(61)\n\nLANDSCAPED AREA means an area devoted to plant material, planters, brick, stone, water,\naggregate, and other landscape features, excepting smooth concrete or asphalt, where\nthe use of inorganic materials does not predominate over the use of plants.\n\n(62)\n\nLARGE LOT means a lot of at least 10,000 square feet.\n\n(63)\n\nLOADING SPACE means an area used for loading or unloading goods from a vehicle in\nconnection with the use of the site on which the loading space is located.\n\n(64)\n\nLOCAL STREET means a street that serves traffic within a neighborhood or limited residential\ndistrict, and which is not necessarily continuous through several residential districts.\n\n(65)\n\nLOT means:\n\n(a)\n\na parcel of real property with a unique designation shown on a plat, record of survey,\nparcel map, or subdivision map recorded in the office of the County Clerk; or\n\n(b)\n\na parcel of real property established under zoning or subdivision regulations.\n\n(66)\n\nLOT LINE means a line or series of connected line segments bounding a lot.\n\n(67)\n\nMAINTENANCE EASEMENT, when used in reference to a small lot, means an easement granted\nby the owner of one lot to the owner of an adjoining lot for maintenance of a dwelling\nwithin five feet of a common side lot line.\n\n(68)\n\nMIRRORED GLASS means glass with a reflectivity index greater than 20 percent.\n\n(69)\n\nMOBILE HOME means a movable dwelling constructed on a chassis, designed for use without\na permanent foundation, and designed to be connected to utilities. The term excludes\nmanufactured modular housing designed to be set on a permanent foundation and recreational\nvehicles.\n\n(70)\n\nMOBILE HOME PARK means a unified development of mobile home spaces for rent or lease,\nincluding common areas and facilities for management, recreation, laundry and utility\nservices, storage, and similar services for the convenience of residents.\n\n(71)\n\nMUNICIPAL UTILITY DISTRICT means a district created under Chapters 50 and 54 of the\nTexas Water Code.\n\n(72)\n\nNEIGHBORHOOD ORGANIZATION means a an association that has registered as a neighborhood\norganization under this title.\n\n(73)\n\nNOTICE OWNER means the owner of real property as shown on the records of the tax appraisal\ndistrict in the county in which the property is located.\n\n(74)\n\n(RESERVED)\n\n(75)\n\nPARKING FACILITY means an area on a site for one or more off-street parking spaces\ntogether with driveways, maneuvering areas, and similar features, excluding commercial\noff-street parking and private garages.\n\n(76)\n\nPARKING SPACE means an area designated for parking a motor vehicle, excluding an area\nin a public right-of-way.\n\n(77)\n\nPARKING STRUCTURE means a building that includes five or more off-street parking spaces\ntogether with driveways, maneuvering areas, and similar features.\n\n(78)\n\nPEDESTRIAN WAY means the portion of a street right-of-way not used for a roadway.\n\n(79)\n\nPERMITTED USE means a use of property authorized by this title.\n\n(80)\n\nPLANNED DEVELOPMENT AREA means a combining district authorized by this chapter or\nan area subject to a planned development area agreement approved by the City.\n\n(81)\n\nPLANNED UNIT DEVELOPMENT means land developed as a single unit under unified control.\n\n(82)\n\nPLANNING JURISDICTION means the city and its extraterritorial jurisdiction.\n\n(83)\n\nPRELIMINARY PLAN means a map or drawing of a proposed plat, intended for consideration\nby the Land Use Commission or the city council in accordance with the requirements\nof this title.\n\n(84)\n\nPRINCIPAL BUILDING ENTRANCE means the primary building entrance where the majority\nof the public enters the building and which is open during all business hours, excluding\nsecondary access through an attached parking garage. For mixed use development in\na multi-tenant building, the entrance to each use at the tenant's outside entrance\nis considered a principal building entrance.\n\n(85)\n\nPRINCIPAL USE means the primary function of a site, building, or facility.\n\n(86)\n\nPRIVATE COMMON OPEN SPACE means a privately-owned outdoor or unenclosed area, located\non the ground or on a roof, balcony, deck, porch, or terrace, designed and accessible\nfor outdoor living, recreation, pedestrian access, or landscaping, and intended for\nuse by the residents, employees, and/or visitors to a development.\n\n(87)\n\nPRIVATE PERSONAL OPEN SPACE means a privately-owned outdoor or unenclosed area, located\non the ground or on a roof, balcony, deck, porch, or terrace, designed and accessible\nfor outdoor living, recreation, pedestrian access, or landscaping, and intended for\nuse solely by the individual residents of a condominium or multifamily dwelling unit.\n\n(88)\n\nPROPERTY means real property.\n\n(89)\n\nPUBLIC MOBILITY PROJECT means a transportation project, including a multi-use trail,\nrail or transit line, or street, funded by a public entity and located on publicly\nowned land or in the right-of-way or a public easement.\n\n(90)\n\nQUEUE LINE means an area for temporary parking of motor vehicles while awaiting service\nor other activity.\n\n(91)\n\nQUEUE SPACE means a space for a motor vehicle in a queue line.\n\n(92)\n\nREAR LOT LINE means the lot line that does not intersect the front lot line, or that\nis determined in accordance with Section 25-1-22 (Measurements).\n\n(93)\n\nREAR YARD means a yard extending the full width of a lot between the rear lot line\nand the rear setback line, excluding any area located within the street side yard\nof a corner lot.\n\n(94)\n\nRECORD OWNER means the owner of real property as shown by the deed records of the\ncounty in which the property is located.\n\n(95)\n\nRECREATIONAL VEHICLE means a vehicle or trailer designed for temporary dwelling or\nrecreational purposes, and includes travel trailers, pick-up campers, camping trailers,\nmotor coach homes, converted trucks and buses, boats, and boat trailers.\n\n(96)\n\nRELEASE means:\n\n(a)\n\nthe written certification of the director that a site plan has been approved, that\nthe site plan complies with this title, and that the conditions of approval for the\nsite plan have been satisfied; or\n\n(b)\n\nthe written certification of the director and the presiding officer of the Land Use\nCommission, that a plat has been approved, that the plat complies with this title,\nand that the conditions of approval for the plat have been satisfied.\n\n(97)\n\nRESIDENTIAL INFILL PROJECT means development of a site not exceeding 1.00 acre that\nconsists of:\n\n(a)\n\nfive to sixteen dwelling units; or\n\n(b)\n\na re-subdivision of property that:\n\n(i)\n\nis zoned SF-1, SF-2, or SF-3;\n\n(ii)\n\nincludes only land that was originally platted as a residential subdivision; and\n\n(iii)\n\ndoes not require a plat vacation.\n\n(98)\n\nRESPONSIBLE DIRECTOR means:\n\n(a)\n\nthe director of the Watershed Protection and Development Review Department or the\ndirector's designee; or\n\n(b)\n\nthe director of the Planning and Development Review Department or the director's designee\nfor responsibilities arising under:\n\n(i)\n\nChapter 25-2, Subchapter A, B, or D; or\n\n(ii)\n\nChapter 25-3, except Article 3.\n\n(99)\n\nREVISION means a change in an approved or released plan that is initiated by an applicant.\n\n(100)\n\nRIGHT-OF-WAY means land dedicated or reserved for streets, utilities, or other public\nfacilities.\n\n(101)\n\nROADWAY means the portion of a street right-of-way used for vehicular travel.\n\n(102)\n\nSCREENED means hidden from the view of a person standing at ground level on an abutting\nsite by an architectural or landscape feature that is, or will grow to, at least six\nfeet in height.\n\n(103)\n\nSECURE means either in a dedicated locked room, an area enclosed by a fence with a\nlocked gate, and/or within 100 feet of a permanent security guard station. For residential\nuse enclosed private garage space is considered to be secure.\n\n(104)\n\nSETBACK LINE means a line within a lot parallel to and measured from a corresponding\nlot line, forming the boundary of a yard and governing the placement of structures\nand uses on the lot.\n\n(105)\n\nSIDE LOT LINE means a lot line intersecting the front lot line and extending a minimum\ndistance of 25 feet.\n\n(106)\n\nSIDEWALK means the paved portion of a pedestrian way.\n\n(107)\n\nSIDE YARD means a yard extending the depth of a lot from the front yard to the rear\nlot line between the side lot line and the side setback line. For a corner lot, a\nstreet side yard is a yard that extends from the front yard to the rear lot line.\n\n(108)\n\nSITE means a contiguous area intended for development, or the area on which a building\nhas been proposed to be built or has been built. A site may not cross a public street\nor right-of-way.\n\n(109)\n\nSITE PLAN means a plan for a development, other than a subdivision construction plan,\nsubmitted by an applicant to demonstrate that the development complies with the requirements\nof this title.\n\n(110)\n\nSMALL LOT means a lot with an area of less than 5,750 square feet.\n\n(111)\n\nSPECIAL EXCEPTION means the waiver of a requirement because of vested rights established\nin accordance with the procedures prescribed by Article 7, Division 3 (Special Exceptions).\n\n(112)\n\nSTAFF means a City employee.\n\n(113)\n\nSTANDARD LOT means a lot of at least 5,750 square feet and less than 10,000 square\nfeet.\n\n(114)\n\nSTREET LINE means a lot line abutting a street.\n\n(115)\n\nSTREET YARD means a yard adjacent to a street and determined on the basis of a street\nlot line.\n\n(116)\n\nSTRUCTURAL ALTERATION means a change in the supporting members of a building including\nload bearing walls, columns, girders, and beams over eight feet long.\n\n(117)\n\nSTRUCTURE means a building of any kind, or a piece of work artificially built-up or\ncomposed of parts joined together in a definite manner.\n\n(118)\n\nSUBDIVIDE means:\n\n(a)\n\nto divide land into two or more lots or sites for the purpose of sale or development;\n\n(b)\n\nto resubdivide an existing lot; or\n\n(c)\n\nto combine of two or more lots into the same number or fewer lots with different boundaries.\n\n(119)\n\nSUBORDINATE SIDE YARD, when used in reference to a small lot, means the side yard\nhaving the smaller width.\n\n(120)\n\nSUBSTANDARD LOT means a lot or tract recorded by deed or plat that does not comply\nwith current area, width, or depth requirements, but that complied with the requirements\nin effect when it was placed on record.\n\n(121)\n\nTECHNICAL CODE means the International Building Code, the National Electrical Code,\nthe Uniform Mechanical Code, the Uniform Plumbing Code, the International Fire Code,\nthe Uniform Solar Energy Code, the Uniform Housing Code, or the International Property\nMaintenance Code, as adopted by the city council.\n\n(122)\n\nTHROUGH LOT means a lot, other than a corner lot, abutting more than one street.\n\n(123)\n\nTINY HOME means a dwelling unit that is 400 square feet or less in floor area excluding\nloft space.\n\n(124)\n\nTOWNHOUSE means a dwelling unit having a common wall with or abutting one or more\nadjoining dwelling units in a townhouse group.\n\n(125)\n\nTOWNHOUSE GROUP means two or more contiguous townhouses.\n\n(126)\n\nTOWNHOUSE LOT means the portion of a townhouse development that is intended for separate\nownership as the location of a single townhouse and associated private yard area.\n\n(127)\n\nTRANSPORTATION PLAN means the Austin Metropolitan Area Transportation Plan or an equivalent\nplan adopted by the city council as part of the Comprehensive Plan.\n\n(128)\n\nUPDATE means additional information, a plan, or a plat submitted by an applicant in\nresponse to comments by a review entity.\n\n(129)\n\nUSE means the conduct of an activity, or the performance of a function, on a site\nor in a structure.\n\n(130)\n\nUSE EASEMENT, when used in reference to a small lot, means an easement granted by\nthe owner of a small lot with the subordinate side yard to the owner of a small lot\nwith a dominant side yard along the common lot line, and which allows the occupant\nof the dwelling unit on the lot having the dominant side yard the use, enjoyment,\nand privacy of the dominant side yard.\n\n(131)\n\nVALUE or VALUATION, when used in reference to a structure, means the estimated cost\nto replace the structure in kind, based on current replacement costs.\n\n(132)\n\nVARIANCE means a waiver of a provision of this title under Article 7, Division 2 (Variances).\n\n(133)\n\nWATER CONTROL AND IMPROVEMENT DISTRICT means a district created under Chapters 50\nand 51 of the Water Code.\n\n(134)\n\nWATER DISTRICT means a district created under Title 4 of the Water Code.\n\n(135)\n\nWILDLAND-URBAN INTERFACE AREA means an area designated by the city council as one\nwhere conditions affecting the combustibility of both wildland and built fuels allow\nfor the ignition and spread of fire through the combined fuel complex.\n\n(136)\n\nWORKING DAY is synonymous with BUSINESS DAY and excludes a Saturday, Sunday, an official\nCity holiday, or any other day on which City offices are closed for regular business\nat any time during normal business hours.\n\n(137)\n\nYARD means an open space on a lot adjoining a lot line.\n\n(138)\n\nZERO LOT LINE means a common lot line on which a wall of a structure may be constructed.\n\n(139)\n\nZONING MAP means the zoning district map of the City as adopted by ordinance.\n\nSource: Sections 13-1-22, 13-2-1, 13-2-401, 13-2-435, and 13-5-61; Ord. 990225-70;\nOrd. 990805-46; Ord. 000309-39; Ord. 000406-85; Ord. 010329-18; Ord. 010607-8; Ord.\n031211-11; Ord. 041202-16; Ord. 20111215-096; Ord. 20120524-139; Ord. 20130228-074;\nOrd. 20130523-104; Ord. 20130926-145; Ord. No. 20160303-036, Pt. 1, 3-14-16; Ord. No. 20160421-039, Pt. 1, 5-2-16; Ord. No. 20170615-102, Pt. 1, 6-15-17; Ord. No. 20220519-094, Pt. 1, 5-30-22; Ord. No. 20230413-057, Pt. 1, 4-24-23; Ord. No. 20230831-141, Pt. 1, 9-11-23; Ord. No. 20231207-001, Pt. 1, 12-18-23; Ord. No. 20231102-028, Pt. 1, 11-13-23; Ord. No. 20240516-006, Pt. 1, 5-27-24; Ord. No. 20250306-037, Pt. 1, 5-23-25.\n\n(A)\n\nLot area is the net horizontal area within the lot lines, excluding the portion of\nthe lot:\n\n(1)\n\nthat provides street access, if the lot is a flag lot; or\n\n(2)\n\nthat is located below 492.8 feet of elevation above sea level, if the lot is adjacent\nto Lake Austin.\n\n(B)\n\nLot depth is the horizontal distance between the mid-point of the front lot line and\nthe midpoint of the rear lot line.\n\n(C)\n\nExcept as otherwise provided in this title, lot width is measured at the front setback\nline and at a distance of 20 feet to the rear of the front setback line.\n\n(D)\n\nIn determining required yards and setbacks for an irregularly shaped lot or a lot\nbounded by only three lot lines, the rear lot line is:\n\n(1)\n\na line ten feet long;\n\n(2)\n\nparallel to the front lot line; and\n\n(3)\n\nat the most distant location from the front lot line.\n\n(E)\n\nA distance from a structure to a line or location is measured from the exterior face\nof the nearest wall or vertical support of the structure to the line or location.\nFor a structure that does not have a wall or vertical support, the building official\nshall determine the point of measurement.\n\nSource: Sections 13-2-1, 13-2-602 and 13-2-603; Ord. 990225-70; Ord. 031211-11; Ord. No. 20240516-006, Pt. 2, 5-27-24.\n\n(A)\n\nExcept as otherwise provided in this section, impervious cover means the total area\nof any surface that prevents the infiltration of water into the ground, such as roads,\nparking areas, concrete, and buildings.\n\n(B)\n\nImpervious cover shall be calculated in accordance with the Environmental Criteria\nManual and Section 25-8-63 (Impervious Cover Calculations).\n\nSource: Ord. 000406-85; Ord. 031211-11; Ord. 20080306-072; Ord. 20131017-046.\n",
  "start_line": 756,
  "end_line": 1683,
  "subsections": []
}