{
  "id": "25-2-511",
  "title": "RESERVED",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "A qualifying development is not subject to Section 25-2-511 (Dwelling Unit Occupancy Limit).\n\n(C)\n\nMinimum lot size for a qualifying development is 2,500 square feet.\n\n(D)\n\nMinimum lot width for a qualifying development is 25 feet.\n\n(E)\n\nA Type I development may:\n\n(1)\n\nconstruct to a height that is the applicable base zoning district height limit multiplied\nby 1.25;\n\n(2)\n\nreduce front yard setbacks by 50 percent;\n\n(3)\n\nreduce rear setbacks by 50 percent; and\n\n(4)\n\ninclude six dwelling units if the existing zoning on the site is Single Family Residential\nSmall (SF-4A), Single Family Residence Condominium Site (SF-4B), or more restrictive.\n\n(F)\n\nIn addition to Subsection (E), a Type 2 development may:\n\n(1)\n\nconstruct to a height that is the applicable base zoning district height limit multiplied\nby 1.5; and\n\n(2)\n\ninclude eight dwelling units if the existing zoning on the site is Single Family Residential\nSmall (SF-4A), Single Family Residence Condominium Site (SF-4B), or more restrictive.\n\n(G)\n\nIf a qualifying development is also eligible to utilize a separate density bonus program\nthat grants density bonuses for the provision of affordable dwelling units or for\nthe payment of a fee-in-lieu for affordable housing, then the qualifying development\nmay comply with the least restrictive site development requirements if all affordable\ndwelling units are provided on-site.\n\n(H)\n\nA qualifying development will comply with impervious cover as allowed by zoning.\n\nSource: Ord. No. 20190509-027, Pt. 4, 5-20-19.\n\n### ARTICLE 3. - ADDITIONAL REQUIREMENTS FOR CERTAIN DISTRICTS.\n\n(A)\n\nIn this section:\n\n(1)\n\nSHORELINE means the 492.8 topographic contour line along the shores of Lake Austin.\n\n(2)\n\nSHORELINE SETBACK means a line parallel to the shoreline and at a distance from the\nshoreline that is prescribed in this section.\n\n(3)\n\nSHORELINE SETBACK AREA means an area between the shoreline and the shoreline setback.\n\n(B)\n\nThis subsection specifies shoreline setbacks in a Lake Austin (LA) district.\n\n(1)\n\nThe shoreline setback is:\n\n(a)\n\n75 feet; or\n\n(b)\n\n25 feet, if:\n\n(i)\n\nthe lot is located in a subdivision plat recorded before April 22, 1982, or is a legal\ntract exempt from the requirement to plat; and\n\n(ii)\n\nthe distance between the shoreline and the front lot line, or the property line of\na legal tract, is 200 feet or less.\n\n(2)\n\nA shoreline setback area is excluded from impervious cover calculations.\n\n(3)\n\nNo structures are allowed in a shoreline setback area, except that:\n\n(a)\n\na bulkhead, retaining wall, fence, dock, public boat ramp, non-mechanized pedestrian\naccess facility, or marina may be constructed and maintained in accordance with applicable\nregulations of this title; and\n\n(b)\n\nan on-site sewage facility may be constructed and maintained in accordance with the\napplicable regulations of Chapter 15-5 (Private Sewage Facilities).\n\n(C)\n\nThis subsection specifies lot width and impervious cover restrictions in a Lake Austin\n(LA) district.\n\n(1)\n\nIf a lot fronts on a cul-de-sac and is included in a subdivision plat recorded after\nApril 22, 1982 or is exempt from the requirement to plat it must have:\n\n(a)\n\na chord width of not less than 33 feet at the front lot line;\n\n(b)\n\na width of not less than 60 feet at the front yard setback line; and\n\n(c)\n\na width of not less than 100 feet at all points 100 feet or more behind the front\nlot line.\n\n(2)\n\nFor a lot included in a subdivision plat recorded after April 22, 1982, impervious\ncover may not exceed:\n\n(a)\n\n20 percent, on a slope with a gradient of 25 percent or less;\n\n(b)\n\n10 percent, on a slope with a gradient of more than 25 percent and not more than 35\npercent; or\n\n(c)\n\nif impervious cover is transferred under Subsection (D), 30 percent.\n\n(3)\n\nFor a lot included in a subdivision plat recorded before April 22, 1982, or a tract\nthat is not required to be platted, impervious cover may not exceed:\n\n(a)\n\n35 percent, on a slope with a gradient of 15 percent or less;\n\n(b)\n\n10 percent, on a slope with a gradient of more than 15 percent and not more than 25\npercent;\n\n(c)\n\n5 percent, on a slope with a gradient of more than 25 percent and not more than 35\npercent; or\n\n(d)\n\n40 percent, if impervious cover is transferred under Subsection (D).\n\n(D)\n\nThis subsection authorizes the transfer of impervious cover in a Lake Austin (LA)\ndistrict.\n\n(1)\n\nImpervious cover may be transferred only:\n\n(a)\n\nbetween tracts within an LA district; and\n\n(b)\n\nfrom land with a gradient of 35 percent or less, to land with a gradient of 15 percent\nor less.\n\n(2)\n\nLand from which impervious cover is transferred must remain undisturbed, if the land\nexists in a natural condition, or be restored to a natural condition as prescribed\nby the Environmental Criteria Manual.\n\n(3)\n\nA transfer of impervious cover must be documented in a manner approved by the director\nand documented in the county deed records.\n\n(E)\n\nThis subsection specifies additional development standards based on slope gradient\nin a Lake Austin (LA) district.\n\n(1)\n\nOn a slope with a gradient of more than 15 percent:\n\n(a)\n\nvegetation must be restored with native vegetation, as prescribed by the Environmental\nCriteria Manual, if it is disturbed or removed as a result of construction; and\n\n(b)\n\nconstruction uphill or downhill from the slope must comply with the Environmental\nCriteria Manual.\n\n(2)\n\nOn a slope with a gradient of more than 35 percent, development is prohibited except\nfor the construction of a fence, driveway, road or utility that cannot be reasonably\nplaced elsewhere, or a non-mechanized pedestrian facility, such as a foot path, sidewalk,\nor stairs.\n\n(F)\n\nIn an LA district, a person may transfer impervious cover in accordance with this\nsubsection.\n\n(1)\n\nImpervious cover may be transferred only:\n\n(a)\n\nbetween tracts within an LA district; and\n\n(b)\n\nfrom land with a gradient of 35 percent or less, to land with a gradient of 15 percent\nor less.\n\n(2)\n\nLand from which impervious cover is transferred may not be developed. The land must\neither remain undisturbed or be restored to a natural state.\n\n(3)\n\nA transfer of impervious cover must be described in a restrictive covenant that runs\nwith the land, is approved by the city attorney, and is recorded in the county deed\nrecords.\n\nSource: Section 13-2-631; Ord. 990225-70; Ord. 031211-11; Ord. No. 20140626-113, Pt. 2, 7-7-14; Ord. No. 20160922-048, Pt. 1, 10-3-16.\n\n(A)\n\nThis section applies in a rural residence (RR) district.\n\n(B)\n\nA lot that fronts on a cul-de-sac must have:\n\n(1)\n\na chord width of not less than 33 feet at the front lot line;\n\n(2)\n\na width of not less than 60 feet at the front yard setback line; and\n\n(3)\n\na width of not less than 100 feet at all points 100 feet or more behind the front\nlot line.\n\n(C)\n\nThis subsection applies to lot clustering.\n\n(1)\n\nLot clustering is a conditional use that requires Land Use Commission approval before\na final plat may be approved.\n\n(2)\n\nLot clustering requires a minimum of five lots.\n\n(3)\n\nAn average lot size of not less than one acre is required.\n\n(4)\n\nEach lot must contain a building site not less than 3,000 square feet in area that\nis located on land with a gradient of not more than 25 percent.\n\n(5)\n\nDevelopment on land with a gradient greater than 35 percent is prohibited.\n\n(6)\n\nThe subdivider shall provide for maintenance of common areas. The maintenance provisions\nmust be included in a homeowners association agreement, unless the Land Use Commission\napproves a different method when the subdivision is approved.\n\nSource: Sections 13-2-222 and 13-2-632; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nIn a single-family residence large lot (SF-1) district, the rear yard setback is five\nfeet for an accessory building that is not more than one story or 15 feet in height.\n\nSource: Section 13-2-633; Ord. 990225-70; Ord. 031211-11.\n\nIn a single-family residence standard lot (SF-2) district, the rear yard setback is\nfive feet for an accessory building that is not more than one story or 15 feet in\nheight.\n\nSource: Section 13-2-634(a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in a family residence (SF-3) district.\n\n(B)\n\nThe rear yard setback is five feet for an accessory building that is not more than\none story or 15 feet in height.\n\n(C)\n\nFor a retirement housing (small site) use:\n\n(1)\n\nthe minimum site area is 18,675 square feet;\n\n(2)\n\na site may be developed with not more than 122 dwelling units;\n\n(3)\n\nat least 6,225 square feet of site area is required for each dwelling unit; and\n\n(4)\n\nexcept for a parking space in a driveway, a parking space may not be located in a\nfront street yard.\n\nSource: Section 13-2-635; Ord. 99025-70; Ord. 030605-49; Ord. 031211-11; Ord. No. 20231207-001, Pt. 7, 12-18-23.\n\n(A)\n\nIn a single-family standard lot (SF-2) or family residence (SF-3) district, the building\nofficial may approve impervious cover of up to 55 percent on a lot after determining\nthat the requirements of this section are satisfied.\n\n(B)\n\nThe principal use of the lot must be a residential use.\n\n(C)\n\nThe lot must be included in a plat that was recorded before January 2, 1989.\n\n(D)\n\nThe lot must adjoin open space, including a golf course or regional park, and the\nopen space:\n\n(1)\n\nmust not contain a significant amount of impervious cover;\n\n(2)\n\nmust not be likely to be developed with a significant amount of impervious cover;\n\n(3)\n\nmust contain at least twice the area of the adjacent lots; and\n\n(4)\n\nmust not be separated from the lot by an impervious barrier, including street pavement\nor a paved plaza.\n\n(E)\n\nA variance from a required building setback on the lot must not have been granted\nor requested, and the owner of the lot must agree not to request a variance from a\nrequired building setback.\n\n(F)\n\nA development intensity transfer affecting the open space must not have been granted.\n\nSource: Sections 13-2-634(b) and 635(d); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in a single-family residence condominium site (SF-4B) district.\n\n(B)\n\nA site must be not less than one acre and not more than five acres.\n\n(C)\n\nFor the portion of a site facing a public right-of-way on one side, at least 40 feet\nof site width is required for each building.\n\n(D)\n\nFor the portion of a site facing a public right-of-way on two sides, at least 50 feet\nof site width is required for each building.\n\n(E)\n\nAt least 3,600 square feet of site area is required for each dwelling unit.\n\n(F)\n\nAt least 2,800 square feet of site area is required for each building.\n\n(G)\n\nExcept as provided in Subsection (H), the maximum height of a building is two stories.\nA story may not exceed a plate height of 10 feet.\n\n(H)\n\nAttic living space is permitted above a second floor if:\n\n(1)\n\nthe attic walls along the building perimeter do not exceed a height of three feet;\nand\n\n(2)\n\nthe floor area of the attic does not exceed 50 percent of the floor area of the second\nfloor.\n\n(I)\n\nIf a building faces a public right-of-way:\n\n(1)\n\nthe minimum front yard setback is 25 feet; and\n\n(2)\n\nthe minimum side street yard setback is 15 feet.\n\n(J)\n\nThe minimum distance between structures is 10 feet.\n\n(K)\n\nThe minimum rear yard setback is 15 feet.\n\n(L)\n\nThe minimum setback between a rear access easement and a building or fence is 10 feet.\n\nSource: Section 13-2-637; Ord. 990225-70; Ord. 031120-44; Ord. 031211-11; Ord. 041118-57.\n\n(A)\n\nIn an urban family residence (SF-5) or townhouse and condominium residence (SF-6)\ndistrict, a retirement housing use must comply with the requirements of this section.\n\n(B)\n\nThe minimum site area is 10,500 square feet.\n\n(C)\n\nAt least 3,500 square feet of site area is required for each dwelling unit.\n\n(D)\n\nExcept for a parking space in a driveway, a parking space may not be located in a\nfront street yard.\n\nSource: Section 13-2-639; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in a multifamily residence limited density (MF-1) district.\n\n(B)\n\nThe minimum site area for each dwelling unit is:\n\n(1)\n\n2,500 square feet, for an efficiency dwelling unit;\n\n(2)\n\n3,000 square feet, for a one bedroom dwelling unit; and\n\n(3)\n\n3,500 square feet, for a dwelling unit with two or more bedrooms.\n\nSource: Section 13-2-638; Ord. 990225-70; Ord. 031211-11; Ord. 20111215-096.\n\n(A)\n\nThis section applies in a multifamily residence low density (MF-2) district.\n\n(B)\n\nThe minimum site area for each dwelling unit is:\n\n(1)\n\n1,600 square feet, for an efficiency dwelling unit;\n\n(2)\n\n2,000 square feet, for a one bedroom dwelling unit; and\n\n(3)\n\n2,400 square feet, for a dwelling unit with two or more bedrooms.\n\nSource: Section 13-2-640; Ord. 990225-70; Ord. 031211-11; Ord. 20111215-096.\n\n(A)\n\nThis section applies in an MF-3 district.\n\n(B)\n\nThe minimum site area for each dwelling unit is:\n\n(1)\n\n1,200 square feet, for an efficiency dwelling unit;\n\n(2)\n\n1,500 square feet, for a one bedroom dwelling unit; and\n\n(3)\n\n1,800 square feet, for a dwelling unit with two or more bedrooms.\n\nSource: Section 13-2-641; Ord. 990225-70; Ord. 031211-11; Ord. 20111215-096.\n\n(A)\n\nThis section applies in a multifamily residence moderate-high density (MF-4) or multifamily\nresidence high density (MF-5) district.\n\n(B)\n\nThe minimum site area for each dwelling unit is:\n\n(1)\n\n800 square feet, for an efficiency dwelling unit;\n\n(2)\n\n1,000 square feet, for a one bedroom dwelling unit; and\n\n(3)\n\n1,200 square feet, for a dwelling unit with two or more bedrooms.\n\nSource: Sections 13-2-642 and 13-2-643; Ord. 990225-70; Ord. 031211-11; Ord. 20111215-096.\n\n(A)\n\nThis section applies to a lot that is located in a rural residence (RR), single-family\nlarge lot (SF-1), single-family standard lot (SF-2), family residence (SF-3), single-family\nresidence small lot (SF-4A), single-family residence condominium site (SF-4B), urban\nfamily (SF-5), or townhouse and condominium residence (SF-6) district that:\n\n(1)\n\nwas annexed after December 1, 1997; and\n\n(2)\n\nis included in a plat that:\n\n(a)\n\nwas recorded when the lot was outside the zoning jurisdiction; or\n\n(b)\n\nbefore September 7, 1998.\n\n(B)\n\nIf the plat establishes a front yard setback, the minimum front yard setback is the\ngreater of:\n\n(1)\n\nthe setback established on the plat; or\n\n(2)\n\n15 feet.\n\n(C)\n\nIf the plat establishes a street side yard setback, the minimum street yard setback\nis the greater of:\n\n(1)\n\nthe setback established on the plat; or\n\n(2)\n\n10 feet.\n\nSource: Section 13-2-645; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in a single family residence standard lot (SF-2) district or\nfamily residence (SF-3) district.\n\n(B)\n\nA development may comply with single-family residence small lot (SF-4A) district site\ndevelopment regulations if:\n\n(1)\n\nthe development is on three or more acres of previously unsubdivided land; and\n\n(2)\n\nthe director of the Neighborhood Housing and Community Development Department certifies\nthat the development complies with the City's S.M.A.R.T. Housing Program.\n\nSource: Ord. 20080131-132.\n\n(A)\n\nThis section applies in a multifamily residence low density (MF-2) district, multifamily\nresidence medium density (MF-3) district, multifamily residence moderate-high density\n(MF-4) district, or multifamily residence high density (MF-5) district on property\nthat either has not been developed or that has been developed only with an agricultural\nuse.\n\n(B)\n\nExcept as provided in Subsection (C), a development may comply with multifamily residence\nhighest density (MF-6) district site development regulations if the director of the\nNeighborhood Housing and Community Development Department certifies that the development\ncomplies with the City's S.M.A.R.T. Housing Program, and:\n\n(1)\n\nfor a rental development, ten percent of the residential units in the development\nare reserved as affordable for a minimum of 40 years following the issuance of a certificate\nof occupancy for rental by a household earning not more that 60 percent of the median\nfamily income for the Austin metropolitan statistical area; or\n\n(2)\n\nfor an owner-occupied development:\n\n(a)\n\nfive percent of the residential units in the development are reserved as affordable\nfor a minimum of 99 years following the issuance of a certificate of occupancy for\nownership and occupancy by a household earning not more than 80 percent of the median\nfamily income for the Austin metropolitan statistical area; and\n\n(b)\n\nfive percent of the residential units in the development are reserved as affordable\nfor a minimum of 99 years following the issuance of a certificate of occupancy for\nownership and occupancy by a household earning not more than 100 percent of the median\nfamily income for the Austin metropolitan statistical area.\n\n(C)\n\nDevelopment under this section must comply with the height regulations established\nin other provisions of this code.\n\nSource: Ord. 20080131-132.\n\n(A)\n\nThis section applies in a central business (CBD) district.\n\n(B)\n\nNotwithstanding any other provision of this chapter, the requirements of Article 10\n(Compatibility Standards) do not apply.\n\n(C)\n\nThis subsection applies to a convention center use.\n\n(1)\n\ncouncil approval is required for a site plan for a convention center use. Approval\nof a site plan:\n\n(a)\n\nestablishes the site development regulations; and\n\n(b)\n\nwaives regulations that are inconsistent with the site plan, if any.\n\n(2)\n\nA public hearing is required for each site plan considered under this subsection.\n\n(3)\n\nThe director shall give notice of a public hearing required by this subsection in\naccordance with Section 25-1-132(C) (Notice of Public Hearing).\n\n(D)\n\nCommercial off-street parking is a permitted use when it constitutes less than 50\npercent of the parking spaces in a parking structure.\n\nSource: Section 13-2-661; Ord. 990225-70; Ord. 031211-11; Ord. 20130411-061.\n\n(A)\n\nThis section applies in a commercial highway (CH) district.\n\n(B)\n\nExcept as provided in Subsection (C), the maximum height permitted for a building\nis:\n\n(1)\n\n60 feet, if the impervious cover on the site is more than 80 percent and not more\nthan 85 percent;\n\n(2)\n\n80 feet, if the impervious cover on the site is more than 75 percent and not more\nthan 80 percent;\n\n(3)\n\n100 feet, if the impervious cover on the site is more than 70 percent and not more\nthan 75 percent;\n\n(4)\n\n110 feet, if the impervious cover on the site is more than 65 percent and not more\nthan 70 percent; and\n\n(5)\n\n120 feet, if the impervious cover on the site is not more than 65 percent.\n\n(C)\n\nThis subsection applies in a zoning district that combines a CH base district with\na PDA combining district. If there is a conflict between the requirements of Subsection\n(B) and the zoning ordinance establishing the CH-PDA district, the zoning ordinance\ngoverns.\n\nSource: Section 13-2-663; Ord. 990225-70; Ord. 031211-11; Ord. No. 20230518-058, Pt. 2, 5-29-23.\n\n(A)\n\nThis section applies in a commercial recreation (CR) district.\n\n(B)\n\nIn this section, SHORELINE means:\n\n(1)\n\nfor Lake Austin, the 492.8 topographic contour line along the shores of Lake Austin;\nand\n\n(2)\n\nfor Lake Travis, the 681 topographic contour line along the shores of Lake Travis.\n\n(C)\n\nThis subsection applies to property located within 1000 feet horizontally of the shoreline\nof Lake Austin.\n\n(1)\n\nThe areas within 75 feet of the shoreline are excluded from impervious cover calculations.\n\n(2)\n\nDevelopment is prohibited on land with a gradient that exceeds 35 percent. This prohibition\ndoes not apply to a fence, driveway, road or utility that cannot be reasonably placed\nelsewhere, or a pedestrian facility.\n\n(3)\n\nImpervious cover may not exceed:\n\n(a)\n\n20 percent, on a slope with a gradient of 25 percent or less;\n\n(b)\n\n10 percent, on a slope with a gradient of more than 25 percent and less than 35 percent;\nor\n\n(c)\n\nif impervious cover is transferred under Subsection (C)(4), 30 percent.\n\n(4)\n\nA person may transfer impervious cover in accordance with this subsection.\n\n(a)\n\nImpervious cover may be transferred only:\n\n(i)\n\nbetween tracts within a CR district; and\n\n(ii)\n\nfrom land with a gradient of 35 percent or less, to land with a gradient of 15 percent\nor less.\n\n(b)\n\nLand from which impervious cover is transferred may not be developed. The land must\neither remain undisturbed or be restored to a natural state.\n\n(c)\n\nA transfer of impervious cover must be described in a restrictive covenant that runs\nwith the land, is approved by the city attorney, and is recorded in the county deed\nrecords.\n\n(D)\n\nA permanent improvement is prohibited within 75 feet of the shoreline of Lake Austin\nor Lake Travis, except for a retaining wall, pier, wharf, boathouse, or marina, or\na driveway to the structures.\n\n(E)\n\nOutdoor storage of merchandise, material, or equipment is permitted if:\n\n(1)\n\nthe outdoor storage is incidental to a use located on the premises;\n\n(2)\n\nthe storage area is located on the rear 50 percent of the site;\n\n(3)\n\nthe storage area does not exceed:\n\n(a)\n\n20 percent of the site; or\n\n(b)\n\nfor a marina use, recreational equipment sales use, or recreational equipment maintenance\nand storage use, 50 percent of the site; and\n\n(4)\n\nthe storage area is screened in accordance with the Environmental Criteria Manual\nand, except for watercraft, the stored items do not exceed the height of the screen.\n\n(F)\n\nExcept along a property line of a lot zoned for a residential use, the following merchandise\nmay be displayed outdoors:\n\n(1)\n\nartwork or pottery;\n\n(2)\n\nflowers or plants;\n\n(3)\n\nfood products;\n\n(4)\n\nhandcrafted goods; and\n\n(5)\n\nrecreational equipment, including roller skates, bicycles, windsurf boards, and watercraft.\n\n(G)\n\nMerchandise other than that described in Subsection (F) may be displayed outdoors\nduring business hours if screened from view off-premises.\n\n(H)\n\nAt least 40 percent of a site, excluding dedicated right-of-way, must be left in a\nnatural state. Up to 25 percent of a natural area may be used as a sewage disposal\nfield. A natural critical area identified in the Comprehensive Plan must be left in\na natural state.\n\n(I)\n\nLandscaped areas at least ten feet wide are required adjacent to public streets and\nproperty zoned for residential use. Landscaped areas must contain trees, shrubs, and\nground cover.\n\n(J)\n\nMedians at least 5 feet wide are required between rows of parking spaces. Each median\nmust contain either existing native trees or densely massed installed trees.\n\n(K)\n\nThe noise level of live music may not exceed 70 decibels, measured at the property\nline.\n\nSource: Section 13-2-660; Ord. 990225-70; Ord. 031211-11; Ord. 20090521-017.\n\n(A)\n\nThis section applies in a warehouse/limited office (W/LO) district.\n\n(B)\n\nThe building must include an office use. The minimum floor area for the office use\nis the lesser of:\n\n(1)\n\n20 percent; or\n\n(2)\n\n1,000 square feet.\n\n(C)\n\nA truck loading dock may not be located on the same building face as an office entrance.\n\n(D)\n\nAn office use must face the street that provides primary access.\n\n(E)\n\nA construction sales and service use may not exceed 10,000 square feet of gross floor\narea.\n\n(F)\n\nThe Land Use Commission may approve, in accordance with the applicable provisions\nof Chapter 25-5, Article 3 (Land Use Commission Approved Site Plans), the following modifications to the site development regulations:\n\n(1)\n\na lot that contains at least 21,780 square feet, but less than 43,560 square feet;\n\n(2)\n\na structure with a height greater than 25 feet, but not more than 35 feet; or\n\n(3)\n\na structure with a floor area ratio of more than 0.25, but not more than 0.50.\n\nSource: Section 13-2-662; Ord. 990225-70; Ord. 991104-46; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThis section applies to a building in a general office (GO), neighborhood commercial\n(LR), general commercial services (CS), or commercial services - liquor sales (CS-1)\ndistrict that:\n\n(1)\n\nis located on property adjacent to an Lake Austin residence (LA), rural residence\n(RR), or single-family residence large lot (SF-1) district; and\n\n(2)\n\nexceeds a height of 35 feet.\n\n(B)\n\nA building's exterior glass is required to be either clear or lightly tinted.\n\n(C)\n\nExterior light illuminating a building above the second floor is prohibited.\n\nSource: Section 13-2-607; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDefinitions. In this section:\n\n(1)\n\nBONUS AREA means the greater of:\n\n(a)\n\nThe gross floor area that exceeds the maximum allowable floor-to-area ratio allowed\nwith the site's primary entitlements; or\n\n(b)\n\nThe gross floor area contained within the portion of a structure that exceeds the\nmaximum height allowed under the site's primary entitlements.\n\n(2)\n\nCOMMUNITY BENEFIT is a public amenity that exceeds the Gatekeeper Requirements of\nthe Downtown Density Bonus Program as described in (C)(1) of this section and that\nis provided by an applicant in order to obtain bonus area.\n\n(3)\n\nCULTURAL USES are uses that are eligible to participate in the City of Austin Core\nCultural Funding Program.\n\n(4)\n\nDAY CARE SERVICES is the provision of one of the adult or child care services defined",
  "start_line": 15392,
  "end_line": 16468,
  "subsections": [
    "25-2-511-C",
    "25-2-511-D",
    "25-2-511-E",
    "25-2-511-F",
    "25-2-511-G",
    "25-2-511-H",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-D",
    "25-2-511-E",
    "25-2-511-F",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-D",
    "25-2-511-E",
    "25-2-511-F",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-D",
    "25-2-511-E",
    "25-2-511-F",
    "25-2-511-G",
    "25-2-511-H",
    "25-2-511-I",
    "25-2-511-J",
    "25-2-511-K",
    "25-2-511-L",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-D",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-D",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-D",
    "25-2-511-E",
    "25-2-511-F",
    "25-2-511-G",
    "25-2-511-H",
    "25-2-511-I",
    "25-2-511-J",
    "25-2-511-K",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-D",
    "25-2-511-E",
    "25-2-511-F",
    "25-2-511-A",
    "25-2-511-B",
    "25-2-511-C",
    "25-2-511-A"
  ]
}