{
  "id": "25-2-642",
  "title": "CAPITOL VIEW CORRIDOR (CVC) OVERLAY DISTRICT REGULATIONS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "in Section 25-2-642 (Capitol View Corridor Overlay District Regulations).\n\n(C)\n\nProgram Requirements.\n\n(1)\n\nGatekeeper Requirements.\n\n(a)\n\nTo receive bonus area, the director must determine that the project substantially\ncomplies with the Urban Design Guidelines.\n\n(i)\n\nThe applicant must submit to the director a schematic level site plan, building elevations,\nand other drawings, simulations or other documents necessary to fully describe the\nurban design character of the project and relationship of the project to its surroundings.\n\n(ii)\n\nThe Design Commission shall evaluate and make recommendations regarding whether the\nproject complies with the Urban Design Guidelines and the director shall consider\ncomments and recommendations of the Design Commission.\n\n(b)\n\nExcept as provided in Subsection (C)(1)(c), the applicant shall execute a restrictive\ncovenant committing to provide streetscape improvements along all public street frontages,\nconsistent with the Great Streets Standards.\n\n(c)\n\nFor a property located on a Texas Department of Transportation frontage, an applicant\nprovides for Great Streets streetscape improvements along all public street frontages\nif the applicant pays a fee-in-lieu set by separate ordinance and a one-time maintenance\nobligation fee set by separate ordinance. The director of the Transportation and Public\nWorks Department may spend a fee paid under this subsection for Great Streets capital\nimprovement projects within the Downtown area.\n\n(d)\n\nThe applicant shall execute a restrictive covenant committing to achieve a minimum\ntwo star rating under the Austin Energy Green Building program using the ratings in\neffect at the time the project is registered with the Austin Energy Green Building\nprogram. The applicant shall also provide the director with a copy of the project's\nsigned Austin Energy Green Building Letter of Intent before the director may approve\nbonus area for a site.\n\n(2)\n\nAfter the director determines the applicant meets the gatekeeper requirements, the\napplicant shall provide sufficient written information so that the director can determine:\n\n(a)\n\nthe site's primary entitlement;\n\n(b)\n\nthe amount of bonus area that the applicant is requesting;\n\n(c)\n\nthe total dollar amount the applicant will pay if the applicant chooses to obtain\nthe entire bonus area exclusively by paying a development bonus fee, and the amount\nof the fee to be dedicated to each community benefit; and,\n\n(d)\n\nthe community benefits the applicant proposes to provide to obtain bonus area if the\nbonus area will not be obtained exclusively by paying a development bonus fee.\n\n(D)\n\nChanges in Design of Proposed Building. If the design of a building changes after a bonus is granted under this section,\nthe director shall review the new design for substantial compliance with the Urban\nDesign Guidelines prior to building permit approval. A building permit for a final\ndesign will not be approved until the design substantially complies with the gatekeeper\nrequirements and the restrictive covenants are amended to reflect new or revised community\nbenefits.\n\n(E)\n\nCommunity Benefits. A person may achieve bonus area by providing community benefits outlined in this\nsubsection. If the applicant chooses to achieve 100 percent of the desired bonus area\nby providing community benefits described in Subsections (E)(1)—(12), the director\nmay approve the bonus area administratively.\n\n(1)\n\nAffordable Housing Community Benefits.\n\n(a)\n\nAffordable Housing Community Benefit. An applicant may use one or more of the following.\n\n(i)\n\nOn-site affordable housing. A project may achieve bonus area by providing on-site affordable housing within the\nproject. The amount of bonus area that may be achieved for each one square foot of\ndwelling unit space that is devoted to on-site affordable housing is established by\nordinance.\n\n(ii)\n\nFamily-friendly housing. A project providing on-site affordable housing may achieve additional bonus area\nby providing one or more family-friendly eligible bedrooms. The amount of bonus area\nthat may be achieved for each family-friendly eligible bedroom is established by ordinance.\n\n(iii)\n\nDevelopment bonus fee for affordable housing. The project may achieve bonus area by paying a development bonus fee at the dollar\nper square foot amount set by ordinance. The fee will be paid into the Affordable\nHousing Trust Fund.\n\n(b)\n\nAffordable housing community benefit percentages.\n\n(i)\n\nA project must achieve at least 50 percent of the desired bonus area by providing\naffordable housing community benefits.\n\n(ii)\n\nFor any portion of the desired bonus area not achieved by providing affordable housing\nbenefits, the applicant shall achieve bonus area by providing one or more of the community\nbenefits described in Subsections (E)(2)—(12) below.\n\n(2)\n\nRainey Street Subdistrict Historic Preservation Community Benefit.\n\n(a)\n\nA project may achieve bonus area for each historically significant building that is:\n\n(i)\n\nrehabilitated; and\n\n(ii)\n\npreserved on site, relocated to a site within the Rainey Street Subdistrict, or relocated\nto a location within the city limits as determined appropriate by the Historic Landmark\nCommission.\n\n(b)\n\nThe amount of bonus area that may be achieved for on-site improvements for Rainey\nStreet Subdistrict historic preservation is established by ordinance.\n\n(c)\n\nBuildings eligible for this community benefit include those buildings within the Rainey\nStreet National Historic Register District that the City's historic preservation officer\nhas determined contribute to the historic character of the Rainey Street National\nHistoric Register District.\n\n(d)\n\nRequirements:\n\n(i)\n\nDevelopment using this community benefit option shall maintain the architectural integrity\nof the building as determined by the Historic Landmark Commission (HLC) whether or\nnot the building is zoned H-Historic or HD-Local Historic District.\n\n(ii)\n\nThe HLC must review and approve modifications to a building before the City may grant\na density bonus.\n\n(iii)\n\nDevelopment may use this option only in cases where a substantial percentage of the\nexternal walls and internal structure remain intact at project completion.\n\n(iv)\n\nAn applicant must provide a description of the rehabilitation that describes the existing\nconditions of the building and the proposed work. The applicant must submit photographs\nshowing the major character-defining features of the building prior to the start of\nwork.\n\n(v)\n\nBefore the director may issue any type of certificate of occupancy, an applicant must\nsubmit documentation verifying that the work has been completed as proposed. The documentation\nmust be submitted in a format similar to the Description of Rehabilitation portion\nof the United States Department of the Interior National Park Service Historic Preservation\nCertification Application.\n\n(vi)\n\nAn applicant who cannot complete restoration as proposed must pay into the Historic\nPreservation Fund the applicable development bonus fee for the bonus area initially\ngranted for this community benefit. The applicant's payment will be based on the development\nbonus fee in effect at the time the applicant pays the fee.\n\n(3)\n\nDay Care Services Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing day care services within the project.\nThe amount of bonus area that may be achieved for each square foot of day care services\nthat are provided is established by ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nThe applicant must execute a restrictive covenant that requires compliance with all\nrelevant requirements of this section and that ensures continuation of operations\nand maintenance of the facility with the specified community benefit use for a period\nof at least 10 years, which is the life of the agreement.\n\n(ii)\n\nCity of Austin must approve of the operator and the lease terms, which shall be for\nno less than ten years.\n\n(iii)\n\nThe facility must comply with applicable state and local codes.\n\n(iv)\n\nThe facility must be open during normal business hours at least five days each week\nand fifty weeks each calendar year.\n\n(v)\n\nThe facility must be maintained and kept in a good state of repair throughout the\nlife of the agreement.\n\n(vi)\n\nIf the day care services use is non-operational for more than 180 consecutive days\nor for 180 days in any 365 day period, the owner must pay into the Affordable Housing\nTrust Fund the applicable development bonus fee for the bonus area initially granted\nfor this community benefit. The payment will be a pro-rated amount based on the time\nleft in the term of the agreement and based on the development bonus fee in effect\nwhen the owner pays.\n\n(4)\n\nCultural Uses Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing on-site cultural uses within the project.\nThe amount of bonus area that may be achieved for each square foot of cultural uses\nprovided is established by ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nThe applicant must execute a restrictive covenant that requires compliance with all\nrequirements of this section and that ensures continuation of operations and maintenance\nof the facility with the specified community benefit use for a period of at least\n10 years, which is the life of the agreement.\n\n(ii)\n\nCity of Austin must approve of the operator and the lease terms, which shall be for\nno less than ten years.\n\n(iii)\n\nUse must meet the definition of cultural uses and the space must be leased to a 501(c)\norganization.\n\n(iv)\n\nIf the required use is non-operational for more than 180 consecutive days or for 180\ndays in any 365 day period, the owner must pay into the Affordable Housing Trust Fund\nthe applicable development bonus fee for the bonus area initially granted for this\ncommunity benefit. The payment will be a pro-rated amount based on the time left in\nthe term of the agreement and based on the development bonus fee in effect when the\nowner pays.\n\n(5)\n\nLive Music Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing an on-site live music use. The amount\nof bonus area that may be achieved for each square foot of live music use is established\nby ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nThe applicant must ensure continuation of operations and maintenance of the facility\nwith the specified community benefit use for a period of at least 10 years, which\nis the life of the agreement.\n\n(ii)\n\nCity of Austin must approve of the operator and the lease terms, which shall be for\nno less than ten years.\n\n(iii)\n\nThe operator of the facility must maintain proper permitting and documentation to\nplay amplified music in said space.\n\n(iv)\n\nThe space must meet the City of Austin's sound-proofing specifications.\n\n(v)\n\nIf the required use is non-operational for more than 180 consecutive days or for 180\ndays in any 365 day period, the owner must pay into the Affordable Housing Trust Fund\nthe applicable development bonus fee for the bonus area initially granted for this\ncommunity benefit. The payment will be a pro-rated amount based on the time left in\nthe term of the agreement and based on the development bonus fee in effect when the\nowner pays.\n\n(vi)\n\nVenues may not charge an up-front fee to performing artists for the use of their facilities\nor require performing artists to guarantee a minimum attendance through pre-show ticket\nsales.\n\n(6)\n\nOn-Site Improvements for Historic Preservation Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing on-site improvements for historic preservation.\nThe amount of bonus area that may be achieved for on-site improvements for historic\npreservation is established by ordinance.\n\n(b)\n\nBuildings Eligible for On-Site Improvements for Historic Preservation Community Benefit\ninclude:\n\n(i)\n\nBuildings designated as City landmarks, Recorded Texas Historic Landmarks, State Antiquities\nLandmarks, or listed on the National Register of Historic Places;\n\n(ii)\n\nContributing properties within National Register or Local Historic Districts;\n\n(iii)\n\nBuildings determined by the City's Historic Preservation Officer to be historically\nsignificant; or\n\n(iv)\n\nBuildings determined eligible for listing on the National Register of Historic Places\nby the State Historic Preservation Officer.\n\n(c)\n\nRequirements:\n\n(i)\n\nDevelopment using this community benefit option for on-site improvements shall maintain\nthe architectural integrity of the building, as determined by the Historic Landmark\nCommission (HLC) whether or not the building is zoned H-Historic or HD-Local Historic\nDistrict.\n\n(ii)\n\nThe HLC must review and approve modifications to a building before the City may grant\na density bonus.\n\n(iii)\n\nA project may be granted bonus area for on-site improvements for historic preservation\nonly in cases where a substantial percentage of the external walls and internal structure\nremain intact at project completion.\n\n(iv)\n\nApplicant must provide a description of rehabilitation that describes the existing\ncondition of the building and the proposed work. The applicant must submit photographs\nshowing the major character-defining features of the building prior to the start of\nwork.\n\n(v)\n\nBefore the director may issue any type of Certificate of Occupancy, an applicant must\nsubmit documents verifying that the work has been completed as proposed. The documents\nmust be submitted in a format similar to the Description of Rehabilitation portion\nof the United States Department of the Interior National Park Service Historic Preservation\nCertification Application.\n\n(vi)\n\nIf restoration cannot be completed as proposed, the owner must pay into the Historic\nPreservation Fund the applicable development bonus fee for the bonus area initially\ngranted for this community benefit. The owner's payment will be based on the development\nbonus fee in effect at the time the owner pays the fee.\n\n(7)\n\nDevelopment Bonus Fee for Off-Site Historic Preservation Community Benefit.\n\n(a)\n\nThe project may achieve bonus area by paying a development bonus fee at the dollar\nper square foot amount set by ordinance based on the district in which the proposed\ndevelopment is located. The fee will be paid into the Historic Preservation Fund.\n\n(b)\n\nRequirements:\n\n(i)\n\nThe City of Austin will administer the Historic Preservation Fund.\n\n(ii)\n\nThis option cannot be used if developer is proposing to demolish all or a substantial\npercentage of a building the Historic Preservation Officer deems historically significant.\n\n(8)\n\nGreen Building Community Benefit.\n\n(a)\n\nAn applicant may achieve bonus area by constructing a project to green building standards\nthat exceed the Gatekeeper requirements. The amount of bonus area that may be achieved\nfor constructing a project to green building standards is established by ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nThe applicant shall execute a restrictive covenant committing to achieve a specified\nrating under the Austin Energy Green Building (AEGB) program using the ratings in\neffect at the time the ratings application is submitted for the project or Leadership\nin Energy & Environmental Design (LEED) program using the most recently launched version\nof the LEED for New Construction rating at the time of the project's registration.\n\n(ii)\n\nThe applicant shall also provide the director with a copy of the project's signed\nAustin Energy Green Building Letter of Intent for projects seeking AEGB rating or\na copy of the completed LEED registration for projects seeking LEED rating before\nthe director may approve bonus area for a site.\n\n(iii)\n\nAn applicant must submit an AEGB or LEED checklist indicating the measures the project\nintends to complete to meet the applicable green building requirement before the director\nmay approve bonus area for a site.\n\n(iv)\n\nA project seeking an AEGB rating will be subject to at least one inspection during\nconstruction and an inspection at substantial completion. A project seeking LEED certification\nmust submit the LEED design review results and an updated LEED checklist or scorecard\nindicating the project will be able to obtain LEED certification by substantial completion.\n\n(v)\n\nIf the specified AEGB rating or LEED certification is not achieved within nine months\nfrom time of occupancy, an owner must pay into the Affordable Housing Trust Fund the\napplicable development bonus fee for the bonus area initially granted for this community\nbenefit. The owner's payment will be based on the development bonus fee in effect\nwhen the owner pays.\n\n(9)\n\nPublicly Accessible On-Site Plaza Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing a publicly accessible on-site plaza.\nThe amount of bonus area that may be achieved by providing a publicly accessible on-site\nplaza is established by ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nIf the required plaza is non-operational for more than 180 consecutive days or for\n180 days in any 365 day period, the owner must pay into the Downtown Open Space Fund\nthe applicable development bonus fee for the bonus area initially granted for this\ncommunity benefit. The payment will be based on the development bonus fee in effect\nwhen the owner pays.\n\n(10)\n\nOff-Site Open Space Development Bonus Fee Community Benefit.\n\n(a)\n\nThe project may achieve bonus area by paying a development bonus fee for off-site\nopen space at the dollar per square foot amount set by ordinance based on the district\nin which the proposed development is located. The fee will be paid into the Downtown\nOpen Space Fund.\n\n(b)\n\nRequirements:\n\n(i)\n\nCity will administer the Downtown Open Space Fund.\n\n(ii)\n\nThe development bonus fee option is only available for open space beyond what is already\nrequired by City Code.\n\n(iii)\n\nThe applicant must deposit a nonrefundable cash payment with the City.\n\n(11)\n\nGreen Roof Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing green roofs. The amount of bonus area\nthat may be achieved for the construction of green roofs is established by ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nGreen Roofs must be built to the Vegetated (\"Green\") Roof Performance Standards in\nAppendix W of the Environmental Criteria Manual. The percent of vegetated roof cover\nis calculated as a portion of total roof area excluding mechanical equipment, photovoltaic\npanels, swimming pools, and skylights.\n\n(ii)\n\nIf the green roof fails to meet the Vegetated (\"Green\") Roof Performance Standards\nfor more than 180 consecutive days or for 180 days in any 365 day period, the owner\nmust pay into the Downtown Open Space Fund the applicable development bonus fee for\nthe bonus area initially granted for this community benefit. The payment will be based\non the development bonus fee in effect when the owner pays.\n\n(iii)\n\nGreen roof areas used to achieve bonus area through the Green Roof Community Benefit\nmay not be used to achieve bonus area through the Publicly Accessible On-Site Plaza\nCommunity Benefit.\n\n(12)\n\nOther Community Benefits.\n\n(a)\n\nAn applicant may offer to provide other community benefits not described in (E)(1)\n- (11). The applicant must provide sufficient information about the other community\nbenefits for the director to determine whether the other community benefits serve\na public and municipal purpose considering the criteria listed below.\n\n(b)\n\nThe director will consider the following to make a determination:\n\n(i)\n\nif members of the general public will be able to enjoy the proposed other community\nbenefit without paying for its access, use or enjoyment;\n\n(ii)\n\nif the proposed other community benefit will connect to and be accessible from public\nright-of-way or other publicly-accessible space;\n\n(iii)\n\nif the proposed other community benefit will provide a public amenity that is particularly\nlacking in the proposed location;\n\n(iv)\n\nif the proposed other community benefit will impose a significant burden on public\nresources for maintenance, management, policing, or other reasons; and,\n\n(v)\n\nany other information provided by the applicant that shows the other community benefit\nserves a public and municipal purpose and furthers the City's comprehensive planning\ngoals.\n\n(c)\n\nIf a proposed other community benefit provides a partial benefit to a project, it\nwill not be disqualified; the director will allocate only the cost of the public portion\nof the benefit to the other community benefits.\n\n(d)\n\nIf the director determines that the proposed benefit qualifies as a community benefit,\nthe director shall:\n\n(i)\n\nquantify the monetary cost for the proposed other community benefit by using standard\nindustry sources as well as locally based data on development costs to quantify the\nmonetary cost, without mark-up, for the proposed other community benefit; and,\n\n(ii)\n\ndetermine the cost to be applied towards achieving the desired bonus area.\n\n(e)\n\nThe amount determined by the director may be applied to achieve bonus area on the\nsame basis as the development bonus fee applicable to the type and location of the\nproject.\n\n(f)\n\nThe director's recommendation concerning the proposed other community benefit and\nthe monetary value that is applied to achieve the bonus area shall be presented to\nthe planning commission for recommendation and the city council for approval.\n\n(g)\n\nIf the applicant proposes to achieve bonus area by providing other community benefits,\nthe value of the public portion of the proposed other community benefits must be equal\nto or greater than the total dollar amount the applicant would pay if the payment\nwere based on the applicable development bonus fee required to earn that requested\nbonus area.\n\n(F)\n\nCommunity Benefit Calculations for Mixed-Use Projects. Mixed-use projects shall provide community benefits in proportion to the amount of\nfloor area in the project that is devoted to different use categories.\n\n(G)\n\nAffordability Requirements. For purposes of this section, a unit is affordable for purchase or rental if, in\naddition to the other requirements of this section, the household is required to spend\nno more than 30 percent of its gross monthly income on mortgage or rental payments\nfor the unit.\n\n(1)\n\nAffordability requirements for owner-occupied units.\n\n(a)\n\nOn-site for sale affordable housing units shall be reserved, sold and transferred\nto an income eligible buyer subject to a resale restricted, shared equity agreement\napproved by the director of Neighborhood Housing and Community Development, for not\nless than 99 years from the date a certificate of occupancy is issued.\n\n(b)\n\nThe units shall be made available for ownership and occupancy by households earning\nno more than 120 percent of the Annual Median Family Income for the City of Austin\nMetropolitan Statistical Area as determined by the director of Neighborhood Housing\nand Community Development.\n\n(2)\n\nAffordability requirements for rental units.\n\n(a)\n\nOn-site rental affordability housing units shall be reserved as affordable for a minimum\nof 40 years following the issuance of the certificate of occupancy.\n\n(b)\n\nThe units shall be made available for rental by households earning no more than 80\npercent of the annual median family income for the City of Austin metropolitan statistical\narea as determined by the director of Neighborhood Housing and Community Development.\n\n(c)\n\nAn applicant may not deny a prospective tenant affordable rental housing based solely\non the prospective tenant's participation in the Housing Choice Voucher Program or\nin any other housing voucher program that provides rental assistance.\n\n(3)\n\nRules. The Neighborhood Housing and Community Development Office shall conduct compliance\nand monitoring of the affordability requirements of this ordinance. The director of\nNeighborhood Housing and Community Development shall establish compliance and monitoring\nrules and criteria for implementing the affordability requirements of this ordinance.\n\n(H)\n\nApplicant's obligation. Before the director may issue any type of Certificate of Occupancy, an applicant\nmust fulfill all obligations including but not limited to the payment of all fees\nand execution of restrictive covenants in order to ensure that the applicant provides\nall required community benefits. All approvals must be obtained and evidence of the\napprovals must be provided to the director prior to site plan submittal.\n\n(I)\n\nDirector's approval. Once an applicant meets the submission requirements of the downtown density bonus\nprogram and executes the necessary restrictive covenants to ensure that the applicant\nprovides all required community benefits, the director will issue a written notice\nof approval that indicates the project's allowable floor-to- area ratio and height.\n\n(J)\n\nAppeal.\n\n(1)\n\nAn applicant may appeal to the city council the director's determination that the\ngatekeeper requirements have not been met.\n\n(2)\n\nAn applicant must appeal the determination within 30 days from the date of the director's\ndenial.\n\n(3)\n",
  "start_line": 16643,
  "end_line": 17391,
  "subsections": [
    "25-2-642-C",
    "25-2-642-D",
    "25-2-642-E",
    "25-2-642-F",
    "25-2-642-G",
    "25-2-642-H",
    "25-2-642-I",
    "25-2-642-J"
  ]
}