{
  "id": "25-2-648",
  "title": "PLANNED DEVELOPMENT AREA (PDA) PERFORMANCE STANDARDS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "An industrial use must comply with the performance standards established by Section 25-2-648 (Planned Development Area (PDA) Performance Standards).\n\nSource: Ord. 20080618-098.\n\nThe council may consider a preliminary plan or final plat processed concurrently with\nan application requesting a PUD zoning district classification for a property.\n\nSource: Ord. 20080618-098.\n\n**Editor's note—**\nOrd. No. 20190822-117, Pt. 17, effective September 1, 2019, repealed § 4.2, which pertained to development\napplications must comply with land use plan and derived from Ord. No. 20080618-098.\n\nThe director of the Neighborhood Planning and Zoning Department shall request that\nthe council initiate the rezoning of property in a PUD zoning district if:\n\nA.\n\na preliminary plan or site plan for a portion of the property is not approved within\nthree years after the effective date of the ordinance approving the PUD zoning classification\nfor the property; or\n\nB.\n\nan approved preliminary plan or site plan expires.\n\nSource: Ord. 20080618-098.\n\n(A)\n\nA planned development area (PDA) combining district may be combined with the following\nbase districts:\n\n(1)\n\nindustrial park;\n\n(2)\n\nlimited industrial services;\n\n(3)\n\ncommercial highway services;\n\n(4)\n\nmajor industry; and\n\n(5)\n\nresearch and development.\n\n(B)\n\nRegulations established by a PDA combining district may modify:\n\n(1)\n\npermitted or conditional uses authorized in the base district;\n\n(2)\n\nexcept for Subchapter C, Article 10 (Compatibility Standards), the site development regulations applicable in the base district; or\n\n(3)\n\noff-street parking design or loading regulations, sign regulations, or landscaping\nor screening regulations applicable in the base district.\n\n(C)\n\nModifications to the base district regulations must be identified in the ordinance\nzoning or rezoning property as a PDA combining district.\n\nSource: Sections 13-2-151, 13-2-152, 13-2-153; Ord. 990225-70; Ord. 030306-48A; Ord.\n031211-11; Ord. No. 20231102-028, Pt. 7, 11-13-23.\n\nIn this division,\n\n(1)\n\nCOCKTAIL LOUNGE means a cocktail lounge use described in Chapter 25-2 (Zoning) and established on or before October 31, 2024.\n\n(2)\n\nCREATIVE SPACE means a use described in Chapter 25-2 (Zoning) that allows one or more of the following occupancies:\n\n(a)\n\nart gallery;\n\n(b)\n\nart workshop;\n\n(c)\n\ncocktail lounge;\n\n(d)\n\ncultural services:\n\n(e)\n\nperformance venue;\n\n(f)\n\npersonal improvement services; or\n\n(g)\n\ntheater.\n\n(3)\n\nCREATIVE SPACES DISTRICT means an area designated and zoned as density bonus creative\nspaces (DBCS) combining district.\n\nSource: Ord. No. 20241010-034, Pt. 3, 10-21-24.\n\n(A)\n\nApplication Requirements.\n\n(1)\n\nThe Land Use Commission may consider no more than a total of three applications per\nmonth to designate a creative spaces district and to apply density bonus creative\nspaces (DBCS) combining district zoning to the property within the creative spaces\ndistrict.\n\n(2)\n\nAn application to designate a creative spaces district must demonstrate that the area\nsatisfies the criteria for designation and include the information required by the\ndirector of the Economic Development Department.\n\n(3)\n",
  "start_line": 13715,
  "end_line": 13856,
  "subsections": [
    "25-2-648-A",
    "25-2-648-B",
    "25-2-648-C",
    "25-2-648-A"
  ]
}