{
  "id": "25-2",
  "title": "766.01 - CONFLICTS; NONAPPLICABILITY",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "\n(A)\n\nThis section applies to a formal determination by the director under Section 25-2-2 (Determination of Use Classification) regarding the appropriate classification of a land use that is not specifically\nclassified under Chapter 25-2, Subchapter A (Zoning Uses).\n\n(B)\n\nExcept as otherwise provided by this section, a use determination may be requested\nat any time by filing an application on a form provided by the director and by paying\na fee established by separate ordinance.\n\n(C)\n\nIn addition to any additional information required by the director, an application\nfor a use determination must:\n\n(1)\n\nstate whether the determination is requested in connection with a specific project,\nand if so, reference the application number;\n\n(2)\n\nif the determination is not related to a specific development application, state whether\nit is requested for a particular address;\n\n(3)\n\ndescribe the land use(s) for which a determination is sought; and\n\n(4)\n\ninclude any information that the applicant requests the director to consider in making\nthe use determination, including but not limited to an explanation of the similarities,\nif any, of the use to other classified uses.\n\n(D)\n\nA use determination for a project that is subject to a pending development application\nis a \"project use determination\" and is subject to the requirements of this subsection.\n\n(1)\n\nThe director shall determine whether a site plan application requires a use determination\nunder Section 25-2-2 (Determination of Use Classification) within the applicable review period required by Section 25-5-114 (Time Periods for Determination; Notice) or Section 25-5-143 (Director's Report).\n\n(2)\n\nIf the director determines that a use determination is required, the applicant must\nsubmit a request for a project use determination under Subsection (B) before the application\nexpires.\n\n(3)\n\nWithin 14 days after receiving a request for a project use determination, the director\nshall issue a determination under Subsection (F) of this section and provide notice\nof the determination under Section 25-1-133(B) (Notice of Applications and Administrative Decisions).\n\n(4)\n\nAny person entitled to notice of a use determination under Section 25-1-133(B) (Notice of Applications and Administrative Decisions) may appeal the decision to the Board of Adjustment no later than 14 days after notice\nis provided.\n\n(E)\n\nA request for a use determination that is not associated with a pending development\napplication is a \"non-project use determination\" and is subject to the requirements\nof this subsection.\n\n(1)\n\nA non-project use determination may be requested by anyone, at any time, for a use\nthat requires a determination under Section 25-2-2 (Use Determination).\n\n(2)\n\nIn addition to the requirements in Subsection (C) of this section, an application\nfor a non-project use determination must include:\n\n(a)\n\nany information requested by the director regarding the nature of the use for which\na determination is requested, including the size, scale, or intensity of the use;\nand\n\n(b)\n\na specific address, if the applicant intends to rely on the determination in connection\nwith a development application.\n\n(3)\n\nWithin 14 days after receiving a request for a non-project use determination, the\ndirector shall provide notice of the determination:\n\n(a)\n\nto the applicant and to registered environmental and neighborhood organizations, if\nthe determination is not associated with a specific address; or\n\n(b)\n\nto all parties entitled to notice under Section 25-1-133(A) (Notice of Applications and Administrative Decisions), if the determination is associated with a particular address.\n\n(4)\n\nAny person entitled to notice of a non-project use determination under this subsection\nmay appeal the determination to the Board of Adjustment within 14 days.\n\n(F)\n\nThe director may not make a decision on an application that is dependent upon a use\ndetermination:\n\n(1)\n\nuntil after the period for appealing the use determination to the Board of Adjustment\nhas run;\n\n(2)\n\nif the use determination is appealed to the Board of Adjustment, until after the board\nhas decided the appeal; or\n\n(3)\n\nif a decision of the Board of Adjustment is appealed to district court, until after\nthe district court has decided the appeal.\n\n(G)\n\nUnless a use determination is reversed or modified by the Board of Adjustment, the\ndirector shall follow the determination in reviewing subsequent requests for a determination\non the same or substantially similar land uses.\n\n(H)\n\nA use determination is not subject to further notification or appeal under this section\nif it has been considered by the Board of Adjustment in response to an appeal or notice\nof the determination was previously provided under this section and no appeal was\nfiled.\n\n(I)\n\nA use determination issued by the director under this section must:\n\n(1)\n\ninclude all information required under Section 25-1-133(C) (Notice of Applications and Administrative Decisions);\n\n(2)\n\nstate the director's determination regarding how the use is classified under existing\nuse regulations;\n\n(3)\n\nexplain the factors considered by the director in making the determination under Section 25-2-2 (Determination of Use Classification), including the similarity of a use to other classified land uses; and\n\n(4)\n\ndescribe any special characteristics of the use determination, including limitations\non the size, scale, location or intensity, of the use.\n\n(J)\n\nA use determination issued under this section may not be used to render decisions\ninterpreting site development regulations.\n\nSource: Ord. 20120426-122.",
  "start_line": 3388,
  "end_line": 3558,
  "subsections": []
}