{
  "id": "25-2-article-6",
  "title": "TEMPORARY USES",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 6. - TEMPORARY USES.\n\n(A)\n\nThe following may be permitted by the building official as temporary uses under this\ndivision:\n\n(1)\n\nmodel homes or apartments and related real estate services, if the use is located\nwithin the residential development to which the use pertains;\n\n(2)\n\na circus, carnival, rodeo, fair, or similar activity, if the use is located at least\n200 feet from a dwelling and located in a CS or less restrictive zoning district;\n\n(3)\n\nan outdoor art or craft show or exhibit, if the use is located in an LR or less restrictive\nzoning district;\n\n(4)\n\nChristmas tree sales;\n\n(5)\n\nan on-site construction field office, if the use is located in a portable structure\nand conducted for not more than 6 months;\n\n(6)\n\nseasonal retail sale of agricultural or horticultural products, if the use is located\nat least 200 feet from a dwelling and located in an LR or less restrictive zoning\ndistrict;\n\n(7)\n\nseasonal day care, if the use is conducted for not more than eight hours a day and\nnot more than 30 days a year; and\n\n(8)\n\ntemporary day care, if the use is conducted for not more than eight hours a day and\nnot more than 12 hours a week.\n\n(B)\n\nA sales office for a new subdivision may be permitted as a temporary use under this\ndivision if the sales office is located within the subdivision and at least 200 feet\nfrom existing dwellings outside the subdivision.\n\n(1)\n\nA sales office for a new subdivision may not be operated after:\n\n(a)\n\nthe expiration of four years from the date the first construction permit issued in\nthe subdivi sion; or\n\n(b)\n\nthe date by which 95 percent of the lots are sold.\n\n(2)\n\nThe board of adjustment may grant an extension of the deadlines described in this\nsubsection.\n\n(C)\n\nAn outdoor public, religious, patriotic, or historic assembly or exhibit, including\na festival, benefit, fund raising event, or similar use that typically attracts a\nmass audience may be permitted as a temporary use under this division if:\n\n(1)\n\nfor a gathering of not more than 50 persons, the use is located in an SF-4 or less\nrestrictive zoning district;\n\n(2)\n\nfor a gathering of more than 50 persons, the use is located in an LO or less restrictive\nzoning district; or\n\n(3)\n\nfor an exhibit, the use is located in a GR or less restrictive zoning district.\n\n(D)\n\nA single dwelling located in a mobile structure on a construction site may be permitted\nas a temporary use under this division if the building official determines that the\ndwelling is required to provide security against nighttime theft or vandalism. The\nbuilding official may allow the use for a period of up to 6 months and, if requested\nby the applicant, may extend that period for an additional 6 months. An applicant\nmay appeal to the board of adjustment a denial of the use by the building official.\n\n(E)\n\nAn outdoor special sale, including a swap meet, flea market, parking lot sale, or\nsimilar activity may be permitted as a temporary use under this division if the use\nis located in a commercial or industrial zoning district. An outdoor special sale\nmay be conducted on not more than three days in the same week and not more than five\ndays in the same month.\n\n(F)\n\nWithin the Central Business District (CBD) or Downtown Mixed Use (DMU) zoning districts,\nretail services may be permitted as a temporary use in accordance with the requirements\nof this subsection.\n\n(1)\n\nThe retail use must:\n\n(a)\n\nbe located within an enclosed fire area, as defined by the Building Code, that does\nnot require structural changes to accommodate the use; and\n\n(b)\n\nhave an approved certificate of occupancy or temporary certificate of occupancy.\n\n(2)\n\nThe retail use may not exceed 12,000 square feet in area unless an approved sprinkler\nsystem has been installed in accordance with the Fire Code;\n\n(3)\n\nThe following uses and activities may not be permitted as a temporary retail use under\nthis subsection:\n\n(a)\n\npersonal services;\n\n(b)\n\nfood preparation or the sale or consumption of alcoholic beverages;\n\n(c)\n\na portable toilet serving the retail use, whether located inside or outside of the\nuse; or\n\n(d)\n\nstorage of hazardous materials as defined by the Fire Code.\n\n(4)\n\nA permit for a temporary retail use under this subsection may be issued for up to\n45 days and renewed once, for a total operating period not to exceed 90 days.\n\n(G)\n\nThis section applies to an urban farm.\n\n(1)\n\nAn urban farm may apply for and be permitted to hold a temporary use permit under\nthis section no more than six times per year.\n\n(2)\n\nThe limitations set forth above in Subsections (C)(1), (C)(2) and (C)(3) do not apply\nto a temporary use permit on an urban farm.\n\n(H)\n\nThe building official may permit other temporary uses that are similar to those described\nin this section.\n\nSource: Section 13-2-321; Ord. 990225-70; Ord. 031211-11; Ord. 20111103-075; Ord. 20131121-105, Pt. 5.\n\n(A)\n\nA person may file an application to conduct a temporary use with the building official.\nThe person must file the application at least ten days before the requested date for\nbeginning the temporary use.\n\n(B)\n\nAn application must include a diagram and description of the use and all additional\ninformation required by the building official to make a determination under this division.\n\n(C)\n\nAfter making a determination under Section 25-2-923 (Determinations), the building official shall approve, conditionally approve under Section 25-2-924 (Conditions of Approval), or deny an application for a temporary use not later than the 10th day after the\ndate the application is filed.\n\n(D)\n\nIf the building official approves or conditionally approves a temporary use, the building\nofficial shall issue a building permit, certificate of occupancy, or temporary use\npermit.\n\n(E)\n\nExcept as provided in Subsection (F), the building official may renew or extend an\nauthorization for a temporary use if requested by the applicant.\n\n(F)\n\nUnless further limited by the requirements of this division, a temporary use may continue\nfor not more than one year. An applicant must file a new application to continue a\ntemporary use beyond that period.\n\nSource: Sections 13-2-324 and 13-2-325; Ord. 990225-70; Ord. 031211-11.\n\nThe building official may permit a temporary use after determining that the temporary\nuse:\n\n(1)\n\nwill not impair the normal, safe, and effective operation of a permanent use on the\nsame site;\n\n(2)\n\nwill be compatible with nearby uses;\n\n(3)\n\nwill not adversely affect public health, safety, or convenience;\n\n(4)\n\nwill not create a traffic hazard or congestion; and\n\n(5)\n\nwill not interrupt or interfere with the normal conduct of uses and activities in\nthe vicinity.\n\nSource: Section 13-2-323; Ord. 990225-70; Ord. 031211-11.\n\nThe building official may condition the approval of a temporary use on compliance\nwith additional requirements that the building official determines are necessary to\nensure land use compatibility and minimize adverse effects on nearby uses, including\nrequirements for hours of operation, frequency of use, parking design, traffic circulation,\nscreening, enclosure, site restoration, and cleanup.\n\nSource: Section 13-2-322(b); Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 20, 11-13-23.\n\nOn termination of a temporary use, the person engaging in the temporary use shall\nremove all debris, litter, and other evidence of the use from the site.\n\nSource: Section 13-2-322(a); Ord. 990225-70; Ord. 031211-11.\n",
  "start_line": 28578,
  "end_line": 28832,
  "subsections": []
}