{
  "id": "25-2-586",
  "title": "DOWNTOWN DENSITY BONUS PROGRAM",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Street Subdistrict, development must comply with the requirements of Section 25-2-586 (Downtown Density Bonus Program) of the City Code. The requirements of the Downtown Density Bonus Program apply only\nto that portion of development that exceeds a floor-to-area ratio of 8:1.\n\n(b)\n\nThe maximum height and maximum floor-to-area ratio that development in the Rainey\nStreet Subdistrict may achieve by participating in the Downtown Density Bonus Program\nare shown on Figure 2 of Section 25-2-586 (Downtown Density Bonus Program) of the City Code.\n\n(c)\n\nThe Neighborhood Housing and Community Development Office will conduct compliance\nand monitoring of the affordability requirements of this ordinance. The director of\nNeighborhood Housing and Community Development shall establish compliance and monitoring\nrules and criteria for implementing the affordability requirements of this ordinance.\n\nSource: Section 13-2-702(d); Ord. 990225-70; Ord. 031211-11; Ord. 20050407-063; Ord.\n20130523-106; Ord. 20140227-054, Pt. 2, 3-10-14.\n\n(A)\n\nThis section applies in the Red Bluff subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n40 feet from the 450 foot contour line, from Pleasant Valley road to the extension\nof Shady Lane; and\n\n(2)\n\n40 feet from the 440 foot contour line from the extension of Shady Lane to US 183.\n\n(C)\n\nA secondary setback line is located 110 feet from the corresponding primary setback\nline.\n\n(D)\n\nFor the exterior of a building adjacent to Town Lake, natural building materials are\nrequired on the exterior surface.\n\n(E)\n\nThe maximum height within the secondary setback is the lower of 35 feet or the maximum\nheight allowed in the base zoning district.\n\nSource: Section 13-2-702(f); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the South Lakeshore subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n65 feet landward from the Town Lake shoreline; and\n\n(2)\n\n50 feet south of Lakeshore Boulevard.\n\n(C)\n\nThe maximum height is the lower of 60 feet or the maximum height allowed in the base\nzoning district.\n\nSource: Section 13-2-702(h); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the South Shore Central subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n150 feet landward from the Town Lake shoreline;\n\n(2)\n\n80 feet from the East Bouldin Creek centerline; and\n\n(3)\n\n35 feet north of the northern public right-of-way boundary of Riverside Drive.\n\n(C)\n\nThe secondary setback lines are located:\n\n(1)\n\n50 feet landward from the primary setback line parallel to the Town Lake shoreline;\nand\n\n(2)\n\n130 feet from the primary setback line parallel to the East Bouldin Creek centerline.\n\n(D)\n\nThis subsection applies to a nonresidential use in a building adjacent to park land\nadjoining Town Lake.\n\n(1)\n\nFor a ground level wall that is visible from park land or a public right-of-way that\nadjoins park land, at least 60 percent of the wall area that is between 2 and 10 feet\nabove grade must be constructed of clear or lightly tinted glass. The glass must allow\npedestrians a view of the interior of the building.\n\n(2)\n\nEntryways or architectural detailing is required to break the continuity of nontransparent\nbasewalls.\n\n(3)\n\nExcept for transparent glass required by this subsection, natural building materials\nare required for an exterior surface visible from park land adjacent to Town Lake.\n\n(E)\n\nFor a structure property adjacent to and oriented toward Riverside Drive, a building\nbasewall is required, with a maximum height of:\n\n(1)\n\n45 feet, if north of Riverside Drive; or\n\n(2)\n\n35 feet, if south of Riverside Drive.\n\n(F)\n\nThat portion of a structure built above the basewall and oriented toward Riverside\nDrive must fit within an envelope delineated by a 70 degree angle starting at a line\nalong the top of the basewall with the base of the angle being a horizontal plane\nextending from the line parallel to and away from the surface of Riverside Drive.\n\n(G)\n\nThe maximum height is:\n\n(1)\n\nfor structures located between the primary and secondary setback lines, the lower\nof 35 feet or the maximum height allowed in the base zoning district;\n\n(2)\n\nfor structures located south of Riverside Drive between South Congress Avenue and\nEast Bouldin Creek, the lower of 45 feet or the maximum height allowed in the base\nzoning district;\n\n(3)\n\nfor structures located within 100 feet of the right-of-way of South Congress Avenue\nor South First Street, the lower of 60 feet or the maximum height allowed in the base\nzoning district; and\n\n(4)\n\nfor structures located in all other areas of the subdistrict, the lower of 96 feet\nor the maximum height allowed in the base zoning district.\n\nSource: Section 13-2-702(k); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the Travis Heights subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n100 feet landward from the Town Lake shoreline;\n\n(2)\n\n80 feet from the East Bouldin Creek centerline; and\n\n(3)\n\n80 feet from the Blunn Creek centerline.\n\n(C)\n",
  "start_line": 21715,
  "end_line": 21915,
  "subsections": [
    "25-2-586-A",
    "25-2-586-B",
    "25-2-586-C",
    "25-2-586-D",
    "25-2-586-E",
    "25-2-586-A",
    "25-2-586-B",
    "25-2-586-C",
    "25-2-586-A",
    "25-2-586-B",
    "25-2-586-C",
    "25-2-586-D",
    "25-2-586-E",
    "25-2-586-F",
    "25-2-586-G",
    "25-2-586-A",
    "25-2-586-B",
    "25-2-586-C"
  ]
}