{
  "id": "25-2-647",
  "title": "LAKE AUSTIN (LA) OVERLAY DISTRICT REGULATIONS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "(PUD) zoning district control over the regulations prescribed in Section 25-2-647.\n\n(D)\n\nThe official map of the Lake Austin Overlay district is on file with the Planning\nand Development Review Department, which shall resolve any uncertainty regarding the\nboundary of the district.\n\nSource: Ord. No. 20140626-114, Pt. 1, 7-7-14.\n\n(A)\n\nDensity bonus (DB) combining districts authorize a particular property to participate\nin a voluntary density bonus or incentive program that provides modifications to development\nregulations or other regulatory-related benefits in exchange for community benefits.\n\n(B)\n\nDB 90 Combining District allows residential uses on sites with certain commercial\nbase zoning districts, modifies compatibility requirements, and grants additional\nheight in exchange for income-restricted housing.\n\n(C)\n\nDBETOD Combining District allows residential uses, preserves certain existing residential\nand non-residential uses, modifies compatibility standards and site development regulations,\nand grants additional building height in exchange for income-restricted housing.\n\n(D)\n\nDBCS Combining District allows for resiliency and posterity for centers of art and\nlive music while encouraging affordable creative spaces in new developments.\n\nSource: 20240229-073, Pt. 2, 3-11-24; Ord. No. 20240516-005, Pt. 4, 7-15-24; Ord. No. 20241010-034, Pt. 2, 10-21-24.\n\n**Editor's note—**\nOrd. No. 20240229-070, Pt. 1, effective March 11, 2024, repealed § 25-2-181, which pertained to Corridor\nOverlay (COR) District Purpose And Boundaries and derived from Ord. No. 20221201-056, Pt. 2, 12-12-22; Ord. No. 20231102-028, Pt. 4, 11-13-23.\n\n(A)\n\nThe purpose of the equitable transit-oriented development (ETOD) combining district\nis to enhance transit-supportive uses, encourage more intentional and equitable land\nstewardship with increased bicycle, pedestrian, and transit connectivity, housing\noptions and opportunities, public realm activation, and new economic opportunities\nnear public transit.\n\n(B)\n\nThe boundaries of the ETOD district are identified in Appendix G (ETOD Boundaries) of this chapter.\n\nSource: Ord. No. 20240516-005, Pt. 2, 7-15-24.\n\n(A)\n\nThe boundaries of all zoning districts are depicted on the zoning map. The zoning\nmap is incorporated by reference into this section.\n\n(B)\n\nThe city clerk shall maintain in the City's files the original zoning map and all\nzoning map amendments. The director of the Neighborhood Planning and Zoning Department\nand the building official shall retain a copy of the current zoning map.\n\n(C)\n\nThe zoning map may be divided into sections or include a supplemental map.\n\nSource: Section 13-2-22; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nIf a site is divided by a zoning district boundary, the regulations of each zoning\ndistrict apply to the portion of the site located in that zoning district.\n\n(B)\n\nThe boundary of a zoning district shown on the zoning map is determined in accordance\nwith this subsection.\n\n(1)\n\nIf a zoning district boundary is shown as approximately following a street, alley,\nor property boundary, the zoning district boundary coincides with the street, alley,\nor property boundary.\n\n(2)\n\nIf a zoning district boundary is shown to be within a street, alley, right-of-way,\nor creek, the center line of the street, alley, right-of-way, or creek is the zoning\ndistrict boundary.\n\n(3)\n\nIf a zoning district boundary divides a parcel, the location of the zoning district\nboundary shall be determined:\n\n(a)\n\nby the dimensions shown on the zoning map; or\n\n(b)\n\nif the dimensions are not shown, by use of the scale appearing on the zoning map.\n\n(4)\n\nIf a public street, alley, or right-of-way is vacated or abandoned, the zoning regulations\napplicable to the abutting property apply out to the centerline of the vacated or\nabandoned street, alley, or right-of-way.\n\n(5)\n\nThe director of the Neighborhood Planning and Zoning Department shall determine the\nlocation or meaning of a boundary or other feature on the zoning map.\n\nSource: Section 13-2-23; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n## SUBCHAPTER B. - ZONING PROCEDURES; SPECIAL REQUIREMENTS FOR CERTAIN DISTRICTS.\n\n(A)\n\nAll land within the zoning jurisdiction shall be designated as a named zoning base\ndistrict in accordance with the procedures of state law and this subchapter. Different\nportions of a site may be designated as different zoning base districts, but only\none zoning base district designation may apply to any portion of a site.\n\n(B)\n\nA zoning combining district designation may be applied to property in addition to\nthe zoning base district designation.\n\nSource: Section 13-2-24; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAnnexed property shall be zoned in accordance with the procedures required by state\nlaw and this chapter.\n\n(B)\n\nFrom the date of annexation until the property is zoned, annexed property is designated\nas an interim rural residence (RR) district except as otherwise provided in this subsection.\n\n(1)\n\nProperty that is subject to a planned development area agreement is designated as\nan interim limited industrial services (LI) district and regulated by the planned\ndevelopment area agreement.\n\n(2)\n\nProperty that is included in an approved preliminary plan or final plat for a planned\nunit development subdivision is designated as an interim planned unit development\n(PUD) district regulated by the approved plan.\n\n(3)\n\nProperty that is located within 1,000 feet landward, measured horizontally, on either\nside of Lake Austin, from and parallel to the 492.8 foot topographic contour line,\nis designated as an interim Lake Austin (LA) district.\n\n(4)\n\nProperty included in a final plat or an unexpired preliminary plan for a small lot\nsubdivision that was approved under Chapter 25-4 (Subdivision) or Chapter 30-2 (Subdivision Requirements) is designated as an interim single-family residence small lot (SF-4A) district.\n\n(5)\n\nA lot is designated as an interim single-family residence standard lot (SF-2) district\nif the lot:\n\n(a)\n\nis smaller than one acre;\n\n(b)\n\nincluded in a final plat or unexpired preliminary plan approved under Chapter 25-4 (Subdivision) or Chapter 30-2 (Subdivision Requirements); and\n\n(c)\n\ndoes not meet the criteria in Subsection (B)(1) through (B)(4) of this section.\n\n(6)\n\nThe director of the Planning & Development Review Department may not collect a base\nzoning application fee between the date of approval of an annexation ordinance and\na date one year following the effective date of annexation for property formerly in\nthe ETJ and within the annexed area that:\n\n(a)\n\nhas an existing use or planned use as defined by Texas Local Government Code Section\n43.002(a) that is not allowed by the interim zoning designated for the property under\nthis Section; and\n\n(b)\n\nis smaller than 25 acres in size.\n\nSource: Section 13-2-26; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 20091210-091;\nOrd. 20110609-056.\n\n(A)\n\nZoning is the initial classification of property as a particular zoning base district.\nZoning amends the zoning map to include property that was not previously in the zoning\njurisdiction or that was not previously included in the boundaries of a base district.\n\n(B)\n\nRezoning amends the zoning map to change the base district classification of property\nthat was previously zoned.\n\nSource: Section 13-1-401; Ord. 990225-70; Ord. 031211-11.\n\nZoning or rezoning of property may be initiated by the:\n\n(1)\n\nCouncil;\n\n(2)\n\nLand Use Commission;\n\n(3)\n\nRecord owner;\n\n(4)\n\nHistoric Landmark Commission, if the property is, or is proposed to be, designated\nas a historic landmark (H) combining district or a historic area (HD) combining district;\nor\n\n(5)\n\nFor a proposed historic area (HD) combining district:\n\n(a)\n\npetition of:\n\n(i)\n\nthe owners of at least 51 percent of the land, by land area, in the proposed district;\nor\n\n(ii)\n\nat least 51 percent of the owners of individual properties in the proposed district.\n\n(b)\n\nproperty owned by the City of Austin or other governmental entities shall be fully\nexcluded from the area subject to petition of the owners, except such property may\nbe included in support if it contains structures or features that contribute to the\nhistoric character of the district, as determined by the Historic Landmark Commission.\nThe amount of such property to be calculated as supporting shall not exceed one-third\nof the 51% of the land in the proposed district.\n\nSource: Section 13-1-400; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 041202-16;\nOrd. 20060622-128; 20090806-068; Ord. 20091210-092; Ord. 20111215-091.\n\n(A)\n\nExcept as provided in Subsection (B), the boundaries of the districts proposed in\na zoning or rezoning application must be contiguous.\n\n(B)\n\nThe boundaries of the districts proposed in a zoning application may be noncontiguous\nif the zoning is initiated by the Council or the Land Use Commission.\n\nSource: Section 13-1-402; Ord. 990225-70; Ord. 031211-11; Ord. 20110609-056.\n\n(A)\n\nAn applicant may file a rezoning application to request that restrictions identical\nto those contained in a public restrictive covenant be included in a rezoning ordinance\nas a conditional overlay.\n\n(B)\n\nA vote by council to amend the zoning designation of a property as requested in an\napplication filed under Subsection (A) constitutes the consent of the council to terminate\nthe public restrictive covenant on the property.\n\n(C)\n\nThe director of the Neighborhood Planning and Zoning Department may not collect an\napplication fee for an application filed under Subsection (A).\n\nSource: Section 13-1-431; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\nIf an applicant files multiple applications for zoning or rezoning of separate properties\nin a single development under common ownership or control, the director of the Neighborhood\nPlanning and Zoning Department shall:\n\n(1)\n\nprocess the applications concurrently;\n\n(2)\n\nschedule the applications for the same Land Use Commission meeting date; and\n\n(3)\n\nschedule the applications for the same council meeting date.\n\nSource: Section 13-1-402; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nA zoning or rezoning application expires if the director of the Neighborhood Planning\nand Zoning Department does not schedule the application for a public hearing:\n\n(1)\n\nby the Land Use Commission before the 181st day after the date of filing; or\n\n(2)\n\nby the Land Use Commission or council before the 181st day after the date on which\nthe Land Use Commission or council grants an indefinite postponement of a scheduled\npublic hearing.\n\n(B)\n\nExcept as provided in Subsection (C), a zoning or rezoning application expires if\nthe council does not adopt an ordinance before the 361st day after council closes\nthe public hearing on the application.\n\n(C)\n\nAn applicant may request that the director of the Neighborhood Planning and Zoning\nDepartment or council extend an application that will expire under Subsection (B).\n\n(1)\n\nAn applicant's request for the director of the Neighborhood Planning and Zoning Department's\napproval must be in writing and filed before the application expires.\n\n(2)\n\nAn applicant may file one request for an extension from council. The request must\nstate good cause for the extension and may be for not more than 180 days.\n\nSource: Section 13-1-406(f) and Section 13-1-409; Ord. 990225-70; Ord. 010329-18;\nOrd. 010607-8; Ord. 031211-11.\n\n(A)\n\nFor 18 months from the date an applicant withdraws an application or the council denies\na zoning or rezoning application for a property, an applicant may not file an application\nto zone or rezone the property or a portion of the property to the same or a less\nrestrictive zoning district if the application that is withdrawn or denied:\n\n(1)\n\nis not recommended by the Land Use Commission as requested by the applicant and is\nwithdrawn by the applicant before council votes on the application;\n\n(2)\n\nis not recommended by the Land Use Commission as requested by the applicant and is\ndenied by the council;\n\n(3)\n\nis amended by the applicant before the Land Use Commission makes a recommendation\non the application and is withdrawn by the applicant before the council votes on the\napplication; or\n\n(4)\n\nis amended by the applicant before the Land Use Commission makes a recommendation\non the application and is denied by council.\n\n(B)\n\nFor 12 months from the date an applicant withdraws an application or the council denies\na zoning or rezoning application for a property, an applicant may not file an application\nto zone or rezone the property or portion of the property to the same or a less restrictive\nzoning district if the application that is withdrawn or denied:\n\n(1)\n\nis not recommended by the Land Use Commission as requested by the applicant and is\nwithdrawn by the applicant before the director of the Neighborhood Planning and Zoning\nDepartment forwards the application to council;\n\n(2)\n\nis recommended by the Land Use Commission as requested by the applicant and is withdrawn\nby the applicant before council votes on the application; or\n\n(3)\n\nis recommended by the Land Use Commission as requested by the applicant and is denied\nby the council.\n\nSource: Section 13-1-408; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nFor a zoning or rezoning application filed by the record owner, the director of the\nNeighborhood Planning and Zoning Department shall:\n\n(1)\n\ngive notice of the application under Section 25-1-133(A) (Notice Of Applications And Administrative Decisions); and\n\n(2)\n\npost signs on the affected property not later than the 14th day after the application\nis filed.\n\n(B)\n\nFor a zoning or rezoning initiated by the Historic Landmark Commission or a rezoning\ninitiated by the Land Use Commission or council, the director of the Neighborhood\nPlanning and Zoning Department shall:\n\n(1)\n\ngive notice under Section 25-1-133(A) (Notice Of Applications And Administrative Decisions); and\n\n(2)\n\nmail notice to the record owner of the affected property not later than the 14th day\nafter a motion initiating the zoning or rezoning is passed.\n\n(C)\n\nFor a zoning initiated by the Land Use Commission or council, the director of the\nNeighborhood Planning and Zoning Department shall give mailed notice to the notice\nowner of the property and to neighborhood organizations not later than the 14th day\nafter the motion initiating the zoning is passed.\n\nSource: Section 13-1-403; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11.\n\nThe director of the Neighborhood Planning and Zoning Department shall prepare for\nthe Land Use Commission and council a report on each zoning or rezoning application.\nThe report shall:\n\n(1)\n\ninclude a recommendation on each zoning or rezoning application; and\n\n(2)\n\nbe filed with the Land Use Commission not later than the 28th day after the applicable\nzoning cycle deadline.\n\nSource: Section 13-1-404; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nExcept as provided in this Subsection (B), the director of the Neighborhood Planning\nand Zoning Department may not schedule a zoning or rezoning application for public\nhearings before both the Land Use Commission and council in the same week.\n\n(B)\n\nThe director of the Neighborhood Planning and Zoning Department may schedule an application\nfor public hearings before both the Land Use Commission and council in the same week\nif the director of the Neighborhood Planning and Zoning Department receives written\nsupport of the application from the staff, the neighborhood organizations, and the\nzoning subcommittee of the Land Use Commission.\n\nSource: Section 13-1-410; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe Land Use Commission shall hold a public hearing on a zoning or rezoning application\nnot later than the 60th day after the date the application is filed. The director\nof the Neighborhood Planning and Zoning Department shall give notice under Section 25-1-132(A) (Notice Of Public Hearing) of the public hearing. If the application includes property located within the Waterfront\nOverlay (WO) combining district, the director shall request a recommendation from\nthe Small Area Planning Joint Committee of the Planning Commission and the Zoning\nand Platting Commission to be considered by the Land Use Commission at the public",
  "start_line": 11682,
  "end_line": 12165,
  "subsections": [
    "25-2-647-D",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-C",
    "25-2-647-D",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-C",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-C",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-C",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-C",
    "25-2-647-A",
    "25-2-647-B",
    "25-2-647-A"
  ]
}