{
  "id": "25-2-article-10",
  "title": "COMPATIBILITY STANDARDS",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 10. - COMPATIBILITY STANDARDS.\n\nFootnotes:\n\n--- (**3**) ---\n\n**Editor's note—**\nOrd. No. 20240516-004, Pt. 1, effective July 15, 2024, repealed the former Art. 10, §§ 25-2-1051, 25-2-1052,\n25-2-1061—25-2-1068, 25-2-1081, 25-2-1082, and enacted a new Art. 10 as set out herein.\nThe former Art. 10 pertained to similar subject matter and derived from Sections 13-2-25(2),\n13-2-731, 13-2-733—13-2-739; Ord. 990225-70; Ord. 000309-39; Ord. 000406-81; Ord.\n010329-18; Ord. 010607-8; Ord. 031211-11; Ord. 041202-16; Ord. 20050519-008; Ord.\n20060216-043; Ord. 20060309-058; Ord. 20060504-039; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20061130-064; Ord. 20080618-093; Ord. 20090212-070; Ord. 20101209-075; Ord. 20131017-046;\nOrd. No. 20160922-080, Pt. 1, 10-3-16; Ord. No. 20231019-052, Pt. 9, 10-30-23; Ord. No. 20231102-028, Pt. 22, 11-13-23.\n\nExcept as provided in Section 25-2-1052 (Exceptions) or another specific provision of this title, this article applies to a site that\nis:\n\n(1)\n\nzoned multi-family residence moderate-high density (MF-4) district or less restrictive\ndistrict; and\n\n(2)\n\nlocated within 75 feet of a triggering property.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\nThis article does not apply to:\n\n(1)\n\na structural alteration that does not increase the square footage, area, or height\nof a building;\n\n(2)\n\na site zoned central business district (CBD) or downtown mixed-use (DMU); or\n\n(3)\n\na site that is used for:\n\n(a)\n\nduplex use;\n\n(b)\n\nsingle-family attached residential use;\n\n(c)\n\nsingle-family residential use;\n\n(d)\n\nsmall lot single-family residential use;\n\n(e)\n\ntwo-unit residential use;\n\n(f)\n\nthree-unit residential use;\n\n(g)\n\nadult care services use (limited or general); or\n\n(h)\n\nchild care services use (limited or general).\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\nA triggering property is a site:\n\n(1)\n\nwith at least one dwelling unit but less than four dwelling units; and\n\n(2)\n\nzoned urban family residence (SF-5) district or more restrictive.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\n(A)\n\nExcept as provided in Subsection (B), council may grant site-specific amendments to\nheight and compatibility buffers if council determines that an amendment is appropriate\nand will not harm the surrounding area.\n\n(B)\n\nA site is not eligible for a site-specific amendment if the site is:\n\n(1)\n\nzoned:\n\n(a)\n\na special purpose base zoning district;\n\n(b)\n\ndensity bonus (DB) combining district; or\n\n(2)\n\nsubject to the university neighborhood overlay (UNO).\n\n(C)\n\nA site-specific amendment to this article is considered a rezoning of property and\nis subject to the same requirements and procedures established for a rezoning application\nthat changes the base district classification of a property.\n\n(D)\n\nA site-specific amendment may be initiated by:\n\n(1)\n\ncouncil;\n\n(2)\n\nthe Land Use Commission; or\n\n(3)\n\nthe record owner.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\n(A)\n\nIn this section, structure means a portion of a structure.\n\n(B)\n\nAny structure that is located 75 or more feet from any part of a triggering property\nshall comply with the height limits established by the site's zoning ordinance.\n\n(C)\n\nExcept as provided by a site-specific amendment to this section, any structure that\nis located:\n\n(1)\n\nat least 50 feet but less than 75 feet from any part of a triggering property may\nnot exceed 60 feet; and\n\n(2)\n\nless than 50 feet from any part of a triggering property may not exceed 40 feet.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\n(A)\n\nThis section does not apply to:\n\n(1)\n\ncondominium residential use; or\n\n(2)\n\ntownhouse residential use.\n\n(B)\n\nCompatibility Buffers.\n\n(1)\n\nExcept as provided in Subdivision (B)(2), a compatibility buffer is required along\na site's property line that is shared with a triggering property.\n\n(2)\n\nA compatibility buffer is not required if:\n\n(a)\n\nthe site includes only residential uses and the number of dwelling units is 16 or\nfewer dwelling units; or\n\n(b)\n\nthe site's zoning ordinance establishes a maximum height of 40 feet or less and the\nsite is zoned:\n\n(i)\n\nneighborhood office (NO) district;\n\n(ii)\n\nlimited office (LO) district; or\n\n(iii)\n\nneighborhood commercial (LR) district.\n\n(3)\n\nExcept as provided in Subdivision (B)(5), the minimum width of a compatibility buffer\nis 25 feet.\n\n(4)\n\nA compatibility buffer must comply with Section 25-8-700 (Minimum Requirements for Compatibility Buffers).\n\n(5)\n\nThe minimum width of a compatibility buffer is 15 feet for a site that is less than\n75 feet wide when measured from site's property line that is shared with a triggering\nproperty.\n\n(C)\n\nSetbacks.\n\n(1)\n\nThis subsection applies to a site's property line that is shared with a triggering\nproperty.\n\n(2)\n\nThe minimum rear yard setback is 10 feet if the site is zoned:\n\n(a)\n\nneighborhood office (NO) district;\n\n(b)\n\nlimited office (LO) district; or\n\n(c)\n\nneighborhood commercial (LR) district.\n\n(3)\n\nThe minimum interior side-yard setback is five feet if the site is zoned neighborhood\ncommercial (LR) district.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\n(A)\n\nExterior lighting must be hooded or shielded so that the light source is not visible\nfrom the site's property line or alleyway that is shared with a triggering property.\n\n(B)\n\nMechanical equipment may not produce sound in excess of 70 decibels measured at the\nsite's property line or alleyway that is shared with a triggering property.\n\n(C)\n\nA concrete slab used for a refuse receptacle may not be placed within 15 feet of triggering\nproperty.\n\n(D)\n\nExcept for a multi-use trail, an on-site amenity that is available only to residents\nand occupants of the site and their guests may not be located within 25 feet of a\ntriggering property.\n\n(E)\n\nScreening Requirements. Except when visible from or through a pedestrian or bicycle\naccess point, the following objects shall be screened and may not be visible at the\nsite's property line or alleyway that is shared with a triggering property:\n\n(1)\n\nvehicle lights from vehicles that use or are parked on a parking lot or in a parking\nstructure located on the site;\n\n(2)\n\nground floor and rooftop mechanical equipment;\n\n(3)\n\noutdoor storage;\n\n(4)\n\nrefuse receptacles and collection areas; and\n\n(5)\n\ncommon areas for amenities, including outdoor decks, patios, and pools.\n\n(F)\n\nThe screening required in Subsection (E) may not impede pedestrian or bicycle access\npoints.\n\n(G)\n\nRooftop mechanical equipment may be screened by a parapet.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n",
  "start_line": 30181,
  "end_line": 30499,
  "subsections": []
}