{
  "id": "25-2-531",
  "title": "HEIGHT LIMIT EXCEPTIONS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "delineating the corridor. The height limitation exceptions of Section 25-2-531 (Height Limitation Exceptions) do not apply to this subsection.\n\nSource: Section 13-2-710; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-043; Ord.\n20060309-058; Ord. 20060622-022; Ord. 20060928-022.\n\n(A)\n\nIn the Congress Avenue (CA), East Sixth/Pecan Street (PS), downtown parks (DP), and\ndowntown creeks (DC) combining districts:\n\n(1)\n\nglass used on the first floor of a structure must have a visible transmittance rating\nof 0.6 or higher; and\n\n(2)\n\nreflective surface building materials must not produce glare.\n\n(B)\n\nThis subsection applies to new development on Congress Avenue or East 6th Street,\non streets adjacent to a downtown park or Town Lake, and along a downtown creek.\n\n(1)\n\nSurface parking lots, curb cuts, and unscreened garage openings are prohibited.\n\n(2)\n\nThe Land Use Commission may waive the prohibition of this subsection after determining\nthat:\n\n(a)\n\ncompliance with the prohibition is impractical;\n\n(b)\n\nthe proposed project will not unreasonably impair pedestrian or vehicular movement;\nand\n\n(c)\n\nadequate precautions have been made for public safety, convenience, and the aesthetic\nvalues of the combining district.\n\n(C)\n\nThis section applies to the PS overlay district.\n\n(1)\n\nExcept as otherwise provided in this subsection, a structure may not exceed a height\nof 45 feet.\n\n(2)\n\nA structure located west of Brazos Street is subject to the height limit of the base\nzoning district.\n\n(3)\n\nAn exterior sign must comply with the standards adopted by the Landmark Commission\nfor the Sixth Street Historic District.\n\n(4)\n\nA structure may develop to a maximum height of 140 feet if:\n\n(a)\n\nlocated on the 500 block or 600 block of East Sixth Street between Neches Street and\nSabine Streets; and\n\n(b)\n\ncomplying with the design standards established in Ordinance No. 20230720-160, as determined by the Historic Landmark Commission.\n\n(D)\n\nIn the DP combining district:\n\n(1)\n\na structure may not exceed a height of 120 feet; and\n\n(2)\n\nat least one entrance to a new development must face the park unless the new development\nis located diagonally across an intersection from the park.\n\n(E)\n\nIn the DC combining district:\n\n(1)\n\na structure may not exceed a height of 60 feet; and\n\n(2)\n\nstorage, trash collection, loading, and associated facilities must be screened from\nview from a creek.\n\n(F)\n\nIn the Congress Avenue (CA) combining district:\n\n(1)\n\nOn the west side of Congress Avenue within 60 feet of Congress Avenue:\n\n(a)\n\nthe minimum structure height is 30 feet; and\n\n(b)\n\nthe maximum structure height is 90 feet.\n\n(2)\n\nOn the east side of Congress Avenue within 40 feet of Congress Avenue:\n\n(a)\n\nthe minimum structure height is 30 feet; and\n\n(b)\n\nthe maximum structure height is 90 feet.\n\nSource: Section 13-2-717; Ord. 990225-70; Ord. 010607-8; Ord. 030612-93; Ord. 031211-11;\nOrd. 20080618-097; Ord. No. 20141211-201, Pt. 1, 12-22-14; Ord. No. 20230720-160, Pt. 1, 7-31-23.\n\n(A)\n\nCommercial off-street parking is prohibited in the convention center (CC) combining\ndistrict east of IH-35.\n\n(B)\n\nThis subsection applies in the CC combining district to development for which an application\nfor approval of commercial off-street parking is filed after November 18, 1990.\n\n(1)\n\nA commercial off-street parking use must be contained entirely within a structure\nand be screened.\n\n(2)\n\nA commercial off-site parking use must be separated at ground level from an adjacent",
  "start_line": 18059,
  "end_line": 18212,
  "subsections": [
    "25-2-531-A",
    "25-2-531-B",
    "25-2-531-C",
    "25-2-531-D",
    "25-2-531-E",
    "25-2-531-F",
    "25-2-531-A",
    "25-2-531-B"
  ]
}