{
  "id": "25-2-101",
  "title": "DOWNTOWN MIXED USE (DMU) DISTRICT DESIGNATION",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "\nThis Article 4 is intended to provide for and encourage development and redevelopment\nthat contains a compatible mix of residential, commercial, and institutional uses\nwithin close proximity to each other, rather than separating uses. The mixed use provisions\ndefine the uses of land and the siting and character of the improvements and structures\nallowed on the land in a manner that encourages a balanced and sustainable mix of\nuses. They promote an efficient pedestrian-access network that connects the nonresidential\nand residential uses and transit facilities. Redevelopment of underutilized parcels\nand infill development of vacant parcels should foster pedestrian-oriented residential\nand mixed use development. (See Figure 45.)\n\n(See Figure 45 set forth in Exhibit A attached to Ord. 20130606-088; Examples of vertical mixed\nuse)\n\n|  |\n| --- |\n| COMMENTARY: MIXED USE DEVELOPMENT IN AUSTIN GENERALLY |\n| The City of Austin allows and encourages the development of mixed use projects. Mixed use development integrates two or more land uses, such as residential and commercial, with a strong pedestrian orientation. Requirements and standards for mixed use development appear in various places throughout the Austin City Code. |\n| Zoning Districts in which Mixed Use is Allowed and Encouraged |\n| The following districts are intended primarily for mixed use development and are described more fully in Section 4.2 below: |\n| • Mixed Use Combining District (Section 4.2.1.). |\n| • Vertical Mixed Use Overlay District (Section 4.2.2.). |\n| Mixed use development also is allowed in other Austin zoning districts. Some of these districts are listed below and are described more fully in the referenced sections of the Austin Code. This list is not exhaustive, but rather is intended to illustrate the range of districts in which mixed use development is allowed. |\n| • Central Business (CBD) (Section 25-2-100); |\n| • Central Urban Redevelopment (CURE) (Section 25-2-163); |\n| • Downtown Mixed Use (DMU) (Section 25-2-101); |\n| • Planned Development Area (PDA) (Section 25-2-174); |\n| • Planned Unit Development (Section 25-2-144); |\n| • Traditional Neighborhood Development (Section 25-2-146); |\n| • Transit Oriented Development (Section 25-2-147); |\n| • Waterfront Overlay (WO) (Section 25-2-175); and |\n| • University Neighborhood Overlay (UNO) (Section 25-2-178). |\n| Types of Mixed Use Development |\n| Within the districts that allow mixed use development, uses may be combined either vertically in the same building, or horizontally in multiple buildings, or through a combination of the two, depending on the standards of the district. |\n| Vertical mixed use is allowed in two building types: the Vertical Mixed Use (VMU) Building and the Neighborhood Mixed Use (NMU) Building. Standards for VMU buildings are in Section 4.3. below, and standards for NMU buildings are in Subchapter D, Article 6. |\n| Horizontal mixed use is the mixing of uses in a development project, though not necessarily in the same building. Horizontal mixed use is allowed and encouraged in Austin so long as each of the proposed uses is allowed within the applicable zoning district and the development meets all applicable requirements of the Austin Code. |\n\nSource: Ord. 20060831-068; Ord. 20130606-088.",
  "start_line": 37711,
  "end_line": 37748,
  "subsections": []
}