{
  "id": "25-2-subchapter-A",
  "title": "ZONING USES, DISTRICTS, AND MAP; DISTRICT DESIGNATIONS",
  "level": 1,
  "parent_id": null,
  "content": "## SUBCHAPTER A. - ZONING USES, DISTRICTS, AND MAP; DISTRICT DESIGNATIONS.\n\nThis article describes and classifies uses in the zoning jurisdiction. The major use\ncategories are residential, commercial, industrial, civic, and agricultural.\n\nSource: Sections 13-2-2 through 13-2-6; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe director of the Planning and Development Review Department shall determine the\nappropriate use classification for an existing or proposed use or activity.\n\n(B)\n\nIf a particular use is not classified within a zoning category or land use definition,\nthe director shall determine the appropriate use classification based on the characteristics\nof the proposed use and the similarities, if any, of the use to other classified uses.\n\n(C)\n\nIf a use requires a determination under Subsection (B) of this section, a person may\nrequest that the director issue a formal use determination stating how the use is\nclassified under existing use regulations. A use determination may be appealed to\nthe Board of Adjustment under Section 25-1-197 (Use Determinations).\n\n(D)\n\nThe director shall notify the Planning Commission and the Zoning and Platting Commission\nof the filing of an appeal within 30 days of the filing, and of the disposition of\nthe appeal within 30 days of disposition.\n\n(E)\n\nThe director shall maintain a list of determinations made under this section.\n\nSource: Section 13-2-7; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11;\nOrd. 20120426-122.\n\n(A)\n\nResidential uses include the occupancy of living accommodations on a nontransient\nbasis. Residential uses exclude institutional living arrangements providing 24-hour\nskilled nursing or medical care and those providing forced residence, including mental\nhospitals and prisons.\n\n(B)\n\nResidential use classifications are described as follows:\n\n(1)\n\nBED AND BREAKFAST RESIDENTIAL use is the use of a residential structure to provide\nrooms for temporary lodging for overnight guests on a paying basis.\n\n(2)\n\nCONDOMINIUM RESIDENTIAL use is the use of a site for attached or detached condominiums,\nas defined in the Texas Property Code.\n\n(3)\n\nCONSERVATION SINGLE FAMILY RESIDENTIAL use is the use of a site for multiple detached\ndwelling units with each dwelling unit located on an individual lot and the remainder\nof the site being jointly-owned and preserved as open space.\n\n(4)\n\nDUPLEX RESIDENTIAL use is the use of a site for two dwelling units within a single\nbuilding, other than a mobile home.\n\n(5)\n\nGROUP RESIDENTIAL use is the use of a site for occupancy by 16 or more adults and\na third party prepares or provides food for the occupants on a weekly or longer basis.\nThis use includes fraternity and sorority houses, dormitories, residence halls, and\nboarding houses.\n\n(6)\n\nMOBILE HOME RESIDENTIAL use is the use of a site for occupancy of mobile homes on\na weekly or longer basis. This use includes mobile home parks and mobile home subdivisions.\n\n(7)\n\nMULTIFAMILY RESIDENTIAL use is the use of a site for four or more dwelling units,\nwithin one or more buildings, and includes condominium residential use.\n\n(8)\n\nRETIREMENT HOUSING (LARGE SITE) use is the use of a site for more than 12 dwelling\nunits designed and marketed specifically for the elderly, the physically handicapped,\nor both.\n\n(9)\n\nRETIREMENT HOUSING (SMALL SITE) use is the use of a site for 3 to 12 dwelling units\ndesigned and marketed specifically for the elderly, the physically handicapped, or\nboth.\n\n(10)\n\nSHORT-TERM RENTAL use is the rental of a housing unit or a portion of a housing unit\nfor a period of less than 30 consecutive days. The use does not include an extension\nfor less than 30 consecutive days of a previously existing rental agreement of 30\nconsecutive days or more or a rental between the parties to the sale of that housing\nunit.\n\n(11)\n\nSINGLE-FAMILY ATTACHED RESIDENTIAL use is the use of a site for two dwelling units,\neach located on a separate lot, that are constructed with common or abutting walls\nor connected by a carport, garage, or other structural element.\n\n(12)\n\nSINGLE-FAMILY RESIDENTIAL use is the use of a site for only one dwelling unit, other\nthan a mobile home.\n\n(13)\n\nSMALL LOT SINGLE-FAMILY RESIDENTIAL use is the use of a small lot for only one dwelling\nunit, other than a mobile home.\n\n(14)\n\nTOWNHOUSE RESIDENTIAL use is the use of a site for townhouses.\n\n(15)\n\nTHREE-UNIT RESIDENTIAL use is the use of a lot for three dwelling units other than\na mobile home.\n\n(16)\n\nTWO-UNIT RESIDENTIAL use is the use of a lot for two dwelling units, each in a separate\nbuilding, other than a mobile home.\n\nSource: Section 13-2-2; Ord. 990225-70; Ord. 990520-38; Ord. 031211-11; Ord. 041118-57;\nOrd. 20100819-064; Ord. 20120802-122; Ord. No. 20231207-001, Pt. 2, 12-18-23; Ord. No. 20240516-006, Pt. 3, 5-27-24; Ord. No. 20250227-039, Pt. 4, 10-1-25.\n\n(A)\n\nCommercial uses include the sale, rental, servicing, and distribution of goods, and\nthe provision of services, other than those classified as industrial or civic uses.\n\n(B)\n\nCommercial use classifications are described as follows:\n\n(1)\n\nADMINISTRATIVE AND BUSINESS OFFICES use is the use of a site for the provision of\nexecutive, management, or administrative services. This use includes:\n\n(a)\n\nadministrative offices and services, including real estate, insurance, property management,\ninvestment, personnel, travel, secretarial, telephone answering, and photocopy and\nreproduction; and\n\n(b)\n\nbusiness offices for public utilities, organizations, associations, and other use\nclassifications if the service rendered is customarily associated with administrative\noffice services.\n\n(2)\n\nAGRICULTURAL SALES AND SERVICES use is the use of a site for the on-site sale of feed,\ngrain, fertilizers, pesticides and similar goods, or the provision of agricultural\nservices with incidental storage of goods off-site. This use includes hay, feed, and\ngrain stores and tree service firms.\n\n(3)\n\nALTERNATIVE FINANCIAL SERVICES BUSINESSES use is the use of a site for a check cashing\nbusiness, payday advance or loan business, money transfer business, motor vehicle\ntitle loan business, or a credit access business as defined in this section.\n\n(a)\n\nThis use excludes:\n\n(1)\n\na state or federally chartered bank, savings and loan association or credit union,\nor a pawnshop, and\n\n(2)\n\na convenience store, supermarket, or other retail establishment where consumer retail\nsales constitute at least 75% of the total gross revenue generated on site.\n\n(b)\n\nA check cashing business is an establishment that provides one or more of the following:\n\n(1)\n\nan amount of money that is equal to the face of a check or the amount specified in\na written authorization for an electronic transfer of money, less any fee charged\nfor the transaction;\n\n(2)\n\nan agreement not to cash a check or execute an electronic transfer of money for a\nspecified period of time; or\n\n(3)\n\nthe cashing of checks, warrants, drafts, money orders, or other commercial paper for\ncompensation by any other person or entity for a fee.\n\n(c)\n\nA payday advance or loan business is an establishment that makes small consumer loans\nof $2,500 or less, usually backed by postdated check or authorization to make an electronic\ndebit against an existing financial account, where the check or debit is held for\nan agreed-upon term or until a customer's next payday and then cashed unless the customer\nrepays the loan to reclaim the check or debit. Such establishments may charge a flat\nfee or other service charge and/or a fee or interest rate based on the size of the\nloan amount.\n\n(d)\n\nA motor title loan business is an establishment that makes small consumer loans of\n$2,500 or less that leverage the equity value of a car or other vehicle as collateral\nwhere the title to such vehicle is owned free and clear by the loan applicant and\nany existing liens on the vehicle cancel the application. Failure to repay the loan\nor make interest payments to extend the loan allows the lender to take possession\nof the vehicle.\n\n(e)\n\nA credit access business has the same meaning as defined in Section 393.601 of the\nTexas Finance Code.\n\n(4)\n\nART GALLERY use is the use of a site for the display or sale of art.\n\n(5)\n\nART WORKSHOP use is use of a site for the production of art or handcrafted goods,\nand it includes the incidental sale of the art produced.\n\n(6)\n\nAUTOMOTIVE RENTALS use is the use of a site for the rental of automobiles, noncommercial\ntrucks, trailers, or recreational vehicles, including incidental parking and servicing\nof vehicles. This use includes auto rental agencies, trailer rental agencies, and\ntaxicab parking and dispatching.\n\n(7)\n\nAUTOMOTIVE REPAIR SERVICES use is the use of a site for the repair of automobiles,\nnoncommercial trucks, motorcycles, motor-homes, recreational vehicles, or boats, including\nthe sale, installation, and servicing of equipment and parts. This use includes muffler\nshops, auto repair garages, tire sales and installation, wheel and brake shops, body\nand fender shops, and similar repair and service activities, but excludes dismantling\nor salvage.\n\n(8)\n\nAUTOMOTIVE SALES use is the use of a site for sale or rental of automobiles, noncommercial\ntrucks, motorcycles, motor-homes, recreational vehicles, or boats, including incidental\nstorage, maintenance, and servicing. This use includes new and used car dealerships,\nmotorcycle dealerships, and boat, trailer, and recreational vehicle dealerships.\n\n(9)\n\nAUTOMOTIVE WASHING use is the use of a site for washing and cleaning of passenger\nvehicles, recreational vehicles, or other light duty equipment.\n\n(10)\n\nBAIL BOND SERVICES use is the use of a site by a licensed bail bond surety to provide\nbail bond services regulated by Texas Occupations Code Chapter 1704. The use does\nnot include bail bond services that are provided by an attorney and that are exempt\nfrom the state licensure requirements under Texas Occupations Code Section 1704.163.\n\n(11)\n\nBUILDING MAINTENANCE SERVICES use is the use of a site for provision of maintenance\nand custodial services to firms rather than individuals. This use includes janitorial\nservice, landscape maintenance, and window cleaning services.\n\n(12)\n\nBUSINESS OR TRADE SCHOOL use is the use of a site for provision of education or training\nin business, commerce, language, or other similar activity or occupational pursuit\nthat is not otherwise described as a home occupation, college, university, or public\nor private educational facility.\n\n(13)\n\nBUSINESS SUPPORT SERVICES use is the use of a site for sale, rental, or repair of\nequipment or supplies used by office, professional, or service establishments, but\nexcludes automotive, construction, and farm equipment. This use includes office equipment\nand supply firms, small business machine repair shops, and hotel equipment and supply\nfirms.\n\n(14)\n\nCAMPGROUND use is the use of a site for provision of camping or parking areas and\nincidental services for travelers in recreational vehicles or tents. This use includes\nrecreation vehicle parks.\n\n(15)\n\nCARRIAGE STABLE use is the use of a site for housing of horses used solely to pull\ncarriages, but excludes uses permitted in the description of stable.\n\n(16)\n\nCOCKTAIL LOUNGE use is the use of a site for retail sale of alcoholic beverages for\nconsumption on the premises, including taverns, bars, and similar uses, other than\na restaurant use as that term is described in this section.\n\n(17)\n\nCOMMERCIAL BLOOD PLASMA CENTER use is the use of a site as a facility for the donation\nor sale by individual donors of blood plasma and other blood products, with the exception\nof whole blood. A \"blood bank\" as defined by Texas Health and Safety Code Section\n162.001 is not a commercial blood plasma center.\n\n(18)\n\nCOMMERCIAL OFF-STREET PARKING use is the use of a site for the parking of motor vehicles\non a temporary basis within a privately owned off-street parking facility. This use\nincludes commercial parking lots and garages and excludes parking as an accessory\nuse.\n\n(19)\n\nCOMMUNICATIONS SERVICES use is the use of a site for the provision of broadcasting\nor information relay services through electronic and telephonic mechanisms, but excludes\nmajor utility facilities. This use includes television, film, or sound recording studios,\ntelecommunication service centers, and telegraph service offices.\n\n(20)\n\nCONSTRUCTION SALES AND SERVICES use is a use involving construction activities, the\nincidental storage of materials on sites other than construction sites, and the on-site\nsale of materials used in the construction of buildings or other structures, other\nthan retail sale of paint, fixtures and hardware. This use includes building materials\nstores, tool and equipment rental or sales, and building contractor businesses, but\nexcludes automobile sales, automobile rentals, automobile washing, automotive repair\nservices, commercial off-street parking, equipment repair services, equipment sales,\nservice stations, and vehicle storage.\n\n(21)\n\nCONSUMER CONVENIENCE SERVICES use is the use of a site for the provision of convenient\nand limited services to individuals in access-controlled facilities that make twenty-four\nhour operation possible. This use includes the renting of private postal and safety\ndeposit boxes to individuals and automated banking machines.\n\n(22)\n\nCONSUMER REPAIR SERVICES use is the use of a site for the provision of repair services\nto individuals or households rather than firms. This use includes appliance repair\nshops, watch or jewelry repair shops, and musical instrument repair shops, and excludes\nautomotive repair services, equipment repair services, and service stations.\n\n(23)\n\nCONVENIENCE STORAGE use is storage services primarily for personal effects and household\ngoods within enclosed storage areas having individual access. This use includes mini-warehouses,\nand excludes workshops, hobby shops, manufacturing, and commercial activity.\n\n(24)\n\nDROP-OFF RECYCLING COLLECTION FACILITY use is a facility used for the collection and\ntransfer, but not the actual processing, of recyclable materials. Recyclable materials\ninclude glass, paper, plastic, cans, or other source-separated, nonputrescible materials,\nand excludes motor oil, chemicals, household appliances, tires, automobiles, automobile\nparts, and putrescible materials.\n\n(25)\n\nELECTRIC VEHICLE CHARGING use is the use of a site for the charging of an electric\nvehicle, including battery charging stations and rapid charging stations, each as\ndefined by the United States Department of Energy.\n\n(26)\n\nELECTRONIC PROTOTYPE ASSEMBLY use is the use of a site for the assembly of prototype\nelectrical and electronic components for computers, computer peripherals, scientific\nor medical measuring or analyzing instruments, radio, telephone, and similar equipment.\nThis use excludes the production of goods for sale to customers, and chip, wafer,\nor semiconductor prototype assembly.\n\n(27)\n\nELECTRONIC TESTING use is the use of a site for testing an electrical or electronic\ncomponent for a computer, computer peripheral, radio, telephone, scientific or medical\ninstrument, or similar equipment. The use excludes the manufacture or assembly of\na product.\n\n(28)\n\nEQUIPMENT REPAIR SERVICES use is the use of a site for the repair of trucks of one\nton or greater capacity, tractors, construction equipment, agricultural implements,\nor similar heavy equipment. This use includes truck repair garages, tractor and farm\nimplement repair services, and machine shops, but excludes dismantling and salvage\nactivity.\n\n(29)\n\nEQUIPMENT SALES use is the use of a site for the sale or rental of trucks of one ton\nor greater capacity, tractors, construction equipment, agricultural implements, mobile\nhomes, or similar heavy equipment, including incidental storage, maintenance, and\nservicing. This use includes truck dealerships, construction equipment dealerships,\nand mobile home sales establishments.\n\n(30)\n\nEXTERMINATING SERVICES use is the use of a site for the eradication or control of\nrodents, insects, or other pests with incidental storage on sites other than where\nthe service is rendered.\n\n(31)\n\nFINANCIAL SERVICES use is the use of a site for the provision of financial and banking\nservices. This use includes banks, savings and loan institutions, stock and bond brokers,\nloan and lending activities, and similar services. This use excludes alternative financial\nservices businesses uses as defined in this section.\n\n(32)\n\nFOOD PREPARATION use is the use of a site for the production of prepared food for\nwholesale distribution in a structure with not more than 5,000 square feet of gross\nfloor area. The use includes wholesale bakeries, commercial kitchens, and specialty\nfood processing or packaging shops, but excludes the on-site slaughter of animals\nand the commercial production of ice.\n\n(33)\n\nFOOD SALES use is the use of a site for the retail sale of food or household products\nfor home consumption. This use includes grocery stores, delicatessens, meat markets,\nretail bakeries, and candy shops.\n\n(34)\n\nFUNERAL SERVICES use is the use of a site for the preparation human dead for burial\nor arranging or managing funerals. This use includes funeral homes and mortuaries.\n\n(35)\n\nGENERAL RETAIL SALES (CONVENIENCE) use is the use of a site for the sale or rental\nof commonly used goods and merchandise for personal or household use, but excludes\nuses classified more specifically in this section. This use includes the provision\nof household cleaning and maintenance products, drugs, cards, stationery, notions,\nbooks, tobacco products, cosmetics, specialty items, apparel, jewelry, fabrics, cameras,\nphotography services, household electronic equipment, records, sporting equipment,\nkitchen utensils, small home appliances, art supplies and framing, arts and antiques,\npaint, interior decorating services, office supplies, and bicycles.\n\n(36)\n\nGENERAL RETAIL SALES (GENERAL) use is the use of a site for the sale or rental of\ncommonly used goods for personal or household use, but excludes uses classified more\nspecifically in this section. This use includes department stores, furniture stores,\nand establishments providing home furnishings, appliances, wallpaper, floor-covering,\nor automotive parts and accessories (excluding service and installation).\n\n(37)\n\nHOTEL-MOTEL use is the use of a site for the provision of rooms for temporary lodging.\nThis use includes hotels, motels, and transient boarding houses.\n\n(38)\n\nINDOOR ENTERTAINMENT use is a predominantly spectator use conducted within an enclosed\nbuilding. This use includes meeting halls and dance halls.\n\n(39)\n\nINDOOR SPORTS AND RECREATION use is a recreational use conducted within an enclosed\nbuilding. This use includes bowling alleys, billiard parlors, ice and roller skating\nrinks, penny arcades, electronic video arcades, and indoor racquetball courts.\n\n(40)\n\nKENNELS use is the use of a site for the boarding and care of dogs, cats, or similar\nsmall animals. This use includes boarding kennels, pet motels, and dog training centers.\n\n(41)\n\nLAUNDRY SERVICES use is the use of a site for the provision of laundering, dry cleaning,\nor dyeing services other than those classified as personal services. This use includes\nbulk laundry and cleaning plants, diaper services, and linen supply services.\n\n(42)\n\nLIQUOR SALES use is the use of a site for the retail sale of alcoholic beverages for\noff-premises consumption. This use includes liquor stores and bottle shops.\n\n(43)\n\nMARINA use is:\n\n(a)\n\nthe wet or dry storage or docking of seaworthy watercraft, including ramps and hoists\nfor boats, for profit; or\n\n(b)\n\nthe provision of docks, wharves, piers, floats, or similar structures for the anchoring,\nmooring, housing, or storing of more than three watercraft.\n\n(44)\n\nMEDICAL OFFICES use is the use of a site for the consultation, diagnosis, therapeutic,\npreventative, or corrective personal treatment by doctors, dentists, medical or dental\nlaboratories, or similar practitioners of medical and healing arts for humans, licensed\nfor practice by the state. The use includes a compounding pharmacy that does not exceed\n3,000 square feet of gross floor area. A compounding pharmacy may prepare and sell\nprescription drugs and also sell non-prescription drugs, medical supplies, and other\nhealth products. The sale of other merchandise is permitted only as an accessory use.\n\n(45)\n\nMONUMENT RETAIL SALES use is the use of a site primarily for the retail sale of monuments\nfor placement on graves. This use includes the sale, storage, and delivery of headstones,\nfootstones, markers, statues, obelisks, cornerstones, and ledgers.\n\n(46)\n\nOFF-SITE ACCESSORY PARKING use is the use of a site for the provision of parking spaces,\ntogether with driveways, aisles, turning and maneuvering areas, clearances, and similar\nfeatures, located on a different site from the principal use.\n\n(47)\n\nOUTDOOR ENTERTAINMENT use is a predominantly spectator use conducted in open, partially\nenclosed, or screened facilities. This use includes sports arenas, racing facilities,\nand amusement parks.\n\n(48)\n\nOUTDOOR SPORTS AND RECREATION use is a recreational use conducted in open, partially\nenclosed, or screened facilities. This use includes driving ranges, miniature golf\ncourses, golf courses, swimming pools, tennis courts, and outdoor racquetball courts.\n\n(49)\n\nPAWN SHOP SERVICES use is the use of a site for the lending of money on the security\nof property pledged in the keeping of the pawnbroker, and the incidental sale of the\nproperty.\n\n(50)\n\nPEDICAB STORAGE AND DISPATCH use is the use of a site for the staging, storage, and\ndispatch of non-motorized vehicles, including incidental parking and servicing of\nthese vehicles.\n\n(51)\n\nPERFORMANCE VENUE use is the use of a site for presentation of plays, motion pictures,\nor other performances that includes the retail sale of alcoholic beverages for consumption\non the premises. This use also includes live music performances.\n\n(52)\n\nPERSONAL IMPROVEMENT SERVICES use is the use of a site for the provision of informational,\ninstructional, personal improvement, and similar services. This use includes music\nstudios, martial arts studios, photography studios, driving schools, health or physical\nfitness studios, reducing salons, dance studios, and handicraft or hobby instruction.\n\n(53)\n\nPERSONAL SERVICES use is the use of a site for the provision of periodically needed\nservices of a personal nature. This use includes beauty or barber shops, seamstress\nor tailor services, shoe repair shops, and dry cleaning pick-up station services.\n\n(54)\n\nPET SERVICES use is the use of a site for the retail sale of small animals customarily\nused as household pets, or the provision of veterinary, grooming, or boarding services,\ntotally within a building. This use includes pet stores, small animal clinics, and\npet grooming shops, but excludes uses for livestock and large animals.\n\n(55)\n\nPLANT NURSERY use is the use of a site for sale of plants or related goods or services.\nThis use includes garden centers and tree service firms.\n\n(56)\n\nPRINTING AND PUBLISHING use is the use of a site for the bulk reproduction, printing,\ncutting, or binding of written or graphic material.\n\n(57)\n\nPROFESSIONAL OFFICE use is the use of a site for the provision of professional or\nconsulting services in the fields of law, architecture, design, engineering, accounting,\nor similar professions.\n\n(58)\n\nRECREATIONAL EQUIPMENT MAINTENANCE AND STORAGE use is the use of a site for the maintenance,\nservice, or storage of sports equipment, watercraft, watercraft motors, trailers,\nmotorcycles, or motor-homes.\n\n(59)\n\nRECREATIONAL EQUIPMENT SALES use is the use of a site for the sale or rental of sports\nequipment, watercraft, watercraft motors, trailers, motorcycles, or motor-homes, and\nincludes incidental storage, maintenance, and servicing.\n\n(60)\n\nRESEARCH ASSEMBLY SERVICES use is the use of a site for the assembly of products related\nto research services and used by the owners of the research establishment or affiliated\nentities in the delivery of services performed by the owner or affiliated entities.\nThis use excludes the mass production of products for general sale to customers.\n\n(61)\n\nRESEARCH SERVICES use is research of an industrial or scientific nature. This use\nincludes electronics research laboratories, space research or development firms, and\npharmaceutical research labs, and excludes product testing.\n\n(62)\n\nRESEARCH TESTING SERVICES use is research activity that may be permitted only with\nthe approval of the council within a planned development area district.\n\n(63)\n\nRESEARCH WAREHOUSING SERVICES use is the use of a site for enclosed or screened storage\nof materials or equipment related to research services, and excludes bulk warehousing\nor permanent storage of hazardous or toxic substances, except as authorized by a planned\ndevelopment area district ordinance.\n\n(64)\n\nRESTAURANT (GENERAL) use is the use of a site for the preparation and retail sale\nof food and beverages and includes the sale and on-premises consumption of alcoholic\nbeverages as an accessory use.\n\n(65)\n\nRESTAURANT (LIMITED) use is the use of a site for the preparation and retail sale\nof food and beverages and excludes the sale of alcoholic beverages for on-premises\nconsumption.\n\n(66)\n\nSCRAP AND SALVAGE SERVICES use is the use of a site for the storage, sale, dismantling\nor other processing of used or waste materials that are not intended for re-use in\ntheir original forms. This use includes automotive wrecking yards, junk yards, and\npaper salvage yards.\n\n(67)\n\nSERVICE STATION use is the use of a site for the provision of fuel, lubricants, parts\nand accessories, or incidental services to motor vehicles.\n\n(68)\n\nSOFTWARE DEVELOPMENT use is the use of a site for development or testing of computer\nsoftware packages including magnetic disks, tapes, and associated operating manuals.\nThis use excludes printing, distribution, and software manufacturing.\n\n(69)\n\nSPECIAL USE HISTORIC is a use that complies with the requirements of Section 25-2-807 (Special Use In Historic Districts).\n\n(70)\n\nSTABLE use is the use of a site for boarding, breeding or raising of horses not owned\nby the occupants of the premises, or the rental of horses for riding. This use includes\nboarding stables or public stables.\n\n(71)\n\nTHEATER use is the use of a site for presentation of plays, motion pictures, or other\nperformances within a building. This use also includes live music performances.\n\n(72)\n\nVEHICLE STORAGE use is the use of a site for long term storage for vehicles. This\nuse includes storage of vehicles towed from private parking areas and impound yards,\nbut excludes dismantling or salvage.\n\n(73)\n\nVETERINARY SERVICES use is the use of a site for provision of veterinary services\nand hospitals for animals. This use includes pet clinics, dog and cat hospitals, and\nveterinary hospitals for livestock and large animals.\n\nSource: Section 13-2-3; Ord. 000309-39; Ord. 010426-48; Ord. 020627-Z34; Ord. 031211-11;\nOrd. 031211-41; Ord. 040617-Z-1; Ord. 20060928-107; Ord. 20120426-139; Ord. 20121101-057;\nOrd. No. 20230914-097, Pt. 1, 9-25-23; Ord. No. 20240516-007, Pt. 1, 5-27-24.\n\n(A)\n\nIndustrial uses include the on-site extraction or production of goods by non-agricultural\nmethods, and the storage and distribution of products.\n\n(B)\n\nIndustrial use classifications are described as follows:\n\n(1)\n\nBASIC INDUSTRY use is the use of a site for:\n\n(a)\n\nthe basic processing and manufacturing of materials or products predominately from\nextracted or raw materials;\n\n(b)\n\nstorage or manufacturing processes that involve flammable or explosive materials;\nor\n\n(c)\n\nstorage or manufacturing processes that involve hazardous or commonly recognized offensive\nconditions, including poultry processing.\n\n(2)\n\nCUSTOM MANUFACTURING use is the use of a site for on-site production of goods by the\nuse of hand tools, domestic mechanical equipment not exceeding five horsepower, or\na single kiln not exceeding 12 kilowatts, and the incidental sale of those goods.\nThis use includes candle-making shops and custom jewelry manufacturing.\n\n(3)\n\nGENERAL WAREHOUSING AND DISTRIBUTION use is open-air storage, distribution, or handling\nof materials or equipment. This use includes monument or stone yards, grain elevators,\nand open storage yards.\n\n(4)\n\nLIGHT MANUFACTURING use is the use of a site for manufacture, predominantly from previously\nprepared materials, of finished products or parts, including processing, fabrication,\nassembly, treatment, and packaging of the products, and incidental storage, sales,\nand distribution of the products. This use excludes basic industrial processing.\n\n(5)\n\nLIMITED WAREHOUSING AND DISTRIBUTION use is the use of a site for provision of wholesaling,\nstorage, or warehousing services within an enclosed structure. This use includes wholesale\ndistributors, storage warehouses, and moving or storage firms.\n\n(6)\n\nRECYCLING CENTER use is the use of a site for collection, transfer, or processing\nof recyclable materials. Recyclable materials include glass, paper, plastic, cans,\nor other source-separated, nonputrescible materials. This use excludes bulk or single-feed\nreverse vending machines.\n\n(7)\n\nRESOURCE EXTRACTION use is the use of a site for on-site extraction of surface or\nsub-surface mineral products or natural resources. This use includes quarries, borrow\npits, sand or gravel operations, oil or gas extraction, and mining operations.\n\n(8)\n\nSTOCKYARDS use is the use of a site for temporary keeping of livestock for slaughter,\nmarket, or shipping. This use includes stockyards, animal sales, and auction yards.\n\nSource: Section 13-2-4; Ord. 990225-70; Ord. 031211-11; Ord. 040617-Z-1.\n\n(A)\n\nCivic uses include the performance of utility, educational, recreational, cultural,\nmedical, protective, and governmental functions, and other uses that are strongly\nvested with public or social importance.\n\n(B)\n\nCivic use classifications are described as follows:\n\n(1)\n\nADMINISTRATIVE SERVICES use is the use of a site for provision of offices or administrative,\nclerical, or public contact services, together with incidental storage and maintenance\nof necessary vehicles. This use includes offices and courthouses serving federal,\nstate, county, and city government.\n\n(2)\n\nADULT CARE SERVICES (GENERAL) use is the use of a site for the provision of care for\nless than 24 hours per day for more than 6 persons who are 18 years of age or older.\n\n(3)\n\nADULT CARE SERVICES (LIMITED) use is the use of a site for the provision of care for\nless than 24 hours per day for 6 or fewer persons who are 18 years of age or older.\n\n(4)\n\nAVIATION FACILITIES use is the use of a site for provision of landing fields, aircraft\nparking and service facilities, and related facilities for operation, service, fueling,\nrepair, storage, charter, sales, or rental of aircraft, including activities directly\nassociated with the operation and maintenance of airport facilities.\n\n(5)\n\nCAMP use is the use of a site for provision of indoor or outdoor activities for children,\nincluding sports, arts and crafts, entertainment, recreation, educational activities,\nswimming, fishing, horseback riding, and incidental food service. If incidental to\nthe camp use, camp facilities may be used to provide meeting, recreation, or social\nfacilities for a private association or group.\n\n(6)\n\nCEMETERY is the use of land that is dedicated for cemetery purposes for the burial\nof the dead, including columbariums, crematoriums, mausoleums, and mortuaries.\n\n(7)\n\nCHILD CARE SERVICES (GENERAL) use of a site for the provision of care for less than\n24 hours per day for more than 12 persons who are less than 18 years of age or are\neligible to utilize child care under federal or state laws. This use includes nursery\nschools, preschools, day care centers for children, and similar uses, and excludes\npublic and private primary or secondary educational facilities.\n\n(8)\n\nCHILD CARE SERVICES (LIMITED) use of a site for the provision of care for less than\n24 hours for 12 or fewer persons who are less than 18 years of age or are eligible\nto utilize child care under federal or state laws. This use includes nursery schools,\npreschools, day care centers for children, and similar uses, and excludes public and\nprivate primary or secondary educational facilities.\n\n(9)\n\nCLUB OR LODGE use is the use of a site for provision of meeting, recreational, or\nsocial facilities by a private or nonprofit association, primarily for use by members\nand guests. This use includes private social clubs and fraternal organizations.\n\n(10)\n\nCOLLEGE AND UNIVERSITY FACILITIES use is the use of a site as an educational institution\nof higher learning that offers a course of study designed to culminate in the issuance\nof a degree in accordance with the Texas Education Code.\n\n(11)\n\nCOMMUNICATION SERVICE FACILITIES use is the use of a site for the transmission, transfer,\nor distribution of telephone service and related activities.\n\n(12)\n\nCOMMUNITY EVENTS use is a use described in Local Government Code Chapter 334 as permitted\nfor an \"approved venue project\", except for a hotel, zoological park, museum, or aquarium.\nThe use includes the sale of alcoholic beverages.\n\n(13)\n\nCOMMUNITY RECREATION (PRIVATE) use is the use of a site for the provision of an indoor\nor outdoor recreational facility for use by residents or guests of a residential development,\nplanned unit development, church, private primary or secondary educational facility,\nclub or lodge, or non-profit organization.\n\n(14)\n\nCOMMUNITY RECREATION (PUBLIC) use is the use of a site for the provision of an indoor\nor outdoor recreational facility for use by the general public, but not for economic\ngain.\n\n(15)\n\nCONGREGATE LIVING use is the use of a site for the provision of 24 hour supervision\nand assisted living for more than 15 residents not needing regular medical attention.\nThis use includes personal care homes for the physically impaired, mentally retarded,\ndevelopmentally disabled, or persons 60 years of age or older, basic child care homes,\nmaternity homes, and emergency shelters for victims of crime, abuse, or neglect.\n\n(16)\n\nCONVALESCENT SERVICES use is the use of a site for the provision of bed care and in-patient\nservices for persons requiring regular medical attention. This use excludes the provision\nof surgical or emergency medical services and the provision of care for alcoholism,\ndrug addiction, mental disease, or communicable disease.\n\n(17)\n\nCONVENTION CENTER use is the use of a site for the provision of space or facilities\nowned or managed by the City for conventions, meetings, exhibitions, shows, gatherings,\npresentations, or celebrations, including related incidental facilities for office\nand administrative use, food and beverage preparation and service, and on-site and\noff-site parking facilities.\n\n(18)\n\nCOUNSELING SERVICES use is the use of a site for the provision of daytime counseling\nto neglected or abused children, 15 years of age or younger, or their managing conservators,\nwho are referred by a governmental entity or other counseling service providers.\n\n(19)\n\nCULTURAL SERVICES use is the use of a site for a library, museum, or similar facility.\n\n(20)\n\nDETENTION FACILITIES use is the use of a site for the provision by a public agency\nof housing and care for legally confined individuals.\n\n(21)\n\nEMPLOYEE RECREATION use is the use of a site for the provision of an indoor or outdoor\nrecreational facility for use by employees of a business engaged in basic industry,\ncommercial services, manufacturing, administrative activities, or research and development\nservices, that is located on property reserved by the business for future expansion.\n\n(22)\n\nGUIDANCE SERVICES use is the use of a site for the provision of daytime counseling,\nguidance, recuperative, or similar services to persons requiring rehabilitation assistance\nas a result of mental illness, alcoholism, detention, drug addiction, or similar condition.\n\n(23)\n\nHOSPITAL SERVICES (GENERAL) use is the use of a site for the provision of medical,\npsychiatric, or surgical services on an in-patient basis, and includes ancillary facilities\nfor out-patient and emergency treatment, diagnostic services, training, research,\nadministration, and services to patients, employees, and visitors.\n\n(24)\n\nHOSPITAL SERVICES (LIMITED) use is the use of a site for the provision of medical,\npsychiatric, or surgical services on an out-patient basis, and includes emergency\ntreatment, diagnostic services, training, administration, and services to out-patients,\nemployees, and visitors.\n\n(25)\n\nLOCAL UTILITY SERVICES use is the use of a site for the provision of services that\nare necessary to support the development in the area and involve only minor structures\nincluding lines and poles.\n\n(26)\n\nMAINTENANCE AND SERVICE FACILITIES use is the use of a site for the provision of maintenance,\nrepair, vehicular or equipment servicing, material storage, or similar activities,\nand includes equipment service centers and similar uses having characteristics of\ncommercial services, contracting, or industrial activities.\n\n(27)\n\nMAJOR UTILITY FACILITIES use is the use of a site for the provision of generating\nplants, electrical switching facilities or primary substations, refuse collection\nor disposal facilities, water or wastewater treatment plants, or similar facilities.\n\n(28)\n\nMILITARY INSTALLATIONS use is the use of a site for the provision of military facilities\nby the federal or state government.\n\n(29)\n\nPARKS AND RECREATION SERVICES (GENERAL) use is the use of a site for the provision\nof parks, playgrounds, recreation facilities, or open spaces available to the general\npublic and under the management or control of a public agency.\n\n(30)\n\nPARK AND RECREATION SERVICES (SPECIAL) use is the use of a site for the sale of beer\nor wine in a building that is located in a park or recreation facility under the management\nor control of a public agency.\n\n(31)\n\nPOSTAL FACILITIES use is the use of a site for the provision of postal services and\nincludes post offices, bulk mail processing, and sorting centers operated by the United\nStates Postal Service.\n\n(32)\n\nPRIVATE PRIMARY EDUCATIONAL FACILITIES use is the use of a site for a private or parochial\nschool offering instruction at the elementary school level in the branches of learning\nand study required to be taught in the public schools of the state.\n\n(33)\n\nPRIVATE SECONDARY EDUCATIONAL FACILITIES use is the use of a site for a private or\nparochial school offering instruction at the junior and senior high school levels\nin the branches of learning and study required to be taught in the public schools\nof the state.\n\n(34)\n\nPUBLIC PRIMARY EDUCATIONAL FACILITIES use is the use of a site for a public school\noffering instruction at the elementary school level in the branches of learning and\nstudy required to be taught in the public schools of the state. The term includes\nan open enrollment charter school as defined under the Texas Education Code.\n\n(35)\n\nPUBLIC SECONDARY EDUCATIONAL FACILITIES use is the use of a site for a public school\noffering instruction at the junior and senior high school levels in the branches of\nlearning and study required to be taught in the public schools of the state. The term\nincludes an open enrollment charter school as defined under the Texas Education Code.\n\n(36)\n\nQUALIFIED COMMUNITY GARDEN use is a garden that complies with the requirements of\nChapter 8-4 (Qualified Community Garden) of the City Code.\n\n(37)\n\nRAILROAD FACILITIES use is the use of a site for provision of railroad yards, equipment\nservicing facilities, or terminal facilities.\n\n(38)\n\nRELIGIOUS ASSEMBLY use is regular organized religious worship or religious education\nin a permanent or temporary building. The use excludes private primary or secondary\neducational facilities, community recreational facilities, day care facilities, and\nparking facilities. A property tax exemption is prima facie evidence of religious\nassembly use.\n\n(39)\n\nRESIDENTIAL TREATMENT use is 24 hour supervision, counseling, or treatment for more\nthan 15 residents not needing regular medical attention. This use includes alcohol\nand chemical dependency rehabilitation facilities, facilities to which persons convicted\nof alcohol or drug-related offenses are ordered to remain under custodial supervision\nas a condition of probation or parole, and residential care facilities and halfway\nhouses for the emotionally ill.\n\n(40)\n\nSAFETY SERVICES use is the use of a site for provision of public safety and emergency\nservices, and includes police and fire protection services and emergency medical and\nambulance services.\n\n(41)\n\nTELECOMMUNICATION TOWER use is the use of a site for provision of a structure built\nexclusively to support one or more antennae for receiving or transmitting electronic\ndata or telephone communications.\n\n(42)\n\nTRANSITIONAL HOUSING use is the use of a site for the supervision or detention of\nmore than 15 residents who are making the transition from institutional to community\nliving. This use includes pre-parole detention facilities and halfway houses for juvenile\ndelinquents and adult offenders, and overnight shelters for the homeless.\n\n(43)\n\nTRANSPORTATION TERMINAL use is the use of a site for the provision of a facility for\nthe loading, unloading, or interchange of passengers, baggage, or incidental freight\nor package express between modes of transportation, and includes bus terminals, railroad\nstations, airport terminals, and public transit facilities.\n\n(C)\n\nThis subsection applies to a provision of this code or other ordinance, resolution,\nor rule that was in effect before October 30, 2023.\n\n(1)\n\nDaycare services (commercial) use or daycare services (general) use has the same meaning\nas adult care services (general) use or child care services (general) use as defined\nin Subsection (B).\n\n(2)\n\nDaycare services (limited) use has the same meaning as adult care services (limited)\nuse or child care services (limited) use as defined in Subsection (B).\n\nSource: Section 13-2-5; Ord. 990225-70; Ord. 990902-57; Ord. 031211-11; Ord. No. 20160623-090, Pt. 1, 7-4-16; Ord. No. 20190207-050, Pt. 1, 2-18-19; Ord. No. 20231019-052, Pts. 1, 2, 10-30-23; Ord. No. 20231207-001, Pt. 3, 12-18-23.\n\n(A)\n\nAgricultural uses include the on-site production of plant and animal products by agricultural\nmethods.\n\n(B)\n\nAgricultural use classifications are described as follows:\n\n(1)\n\nANIMAL PRODUCTION use is the use of a site for the raising of animals or production\nof animal products including eggs and dairy products, on an agricultural or commercial\nbasis. This use includes grazing, ranching, dairy farming, and poultry farming.\n\n(2)\n\nAQUAPONIC SYSTEM is the symbiotic cultivation of fish and plants in a recirculation\nsystem.\n\n(3)\n\nCOMMUNITY GARDEN use is the use of a site for growing or harvesting food crops or\nornamental crops on an agricultural basis, by a group of individuals for personal\nor group use, consumption or donation.\n\n(4)\n\nCROP PRODUCTION use is the use of a site for the raising and harvesting of tree crops,\nrow crops, or field crops on an agricultural or commercial basis, including packing\nand processing.\n\n(5)\n\nHORTICULTURE use is the use of a site for the growing of horticultural or flora cultural\nspecialties, including flowers, shrubs, and trees intended for ornamental or landscaping\npurposes, but excluding retail sales. This use includes wholesale plant nurseries\nand greenhouses.\n\n(6)\n\nSUPPORT HOUSING use is the use of a site for living accommodations by agricultural\nemployees or their families.\n\n(7)\n\nURBAN FARM use is the use of a site that can consist of multiple contiguous parcels\nthat is at least one acre in size cultivated primarily for the sustainable production\nof agricultural products to be sold for profit and may provide agricultural education\nactivities. Agricultural education activities include volunteer programs, farm tours,\nyouth programs and farming classes.\n\n(8)\n\nMARKET GARDEN use is the use of a site that is less than one acre in size cultivated\nprimarily for the sustainable production of agricultural products to be sold for profit\nand may provide agricultural education activities. Agricultural education activities\ninclude volunteer programs, farm tours, youth programs and farming classes.\n\n(9)\n\nINDOOR CROP PRODUCTION use is the use of a site for the raising and harvesting indoors\nof tree crops, row crops, or field crops on an agricultural or commercial basis, including\npacking and processing.\n\nSource: Section 13-2-6; Ord. 990225-70; Ord. 000406-86; Ord. 031211-11; Ord. 20110210-018;\nOrd. 20131121-105, Pt. 1, 3-21-14.\n\nThe zoning districts described in this chapter establish site development regulations\nand performance standards that are intended to promote compatible land use patterns.\n\nSource: Section 13-2-20; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section provides the City's zoning districts and the corresponding zoning map\ncodes. A zoning district may be referred to by its map code.\n\n(B)\n\nResidential base districts and map codes are as follows:\n\n(1)\n\nLake Austin residence .....LA\n\n(2)\n\nrural residence .....RR\n\n(3)\n\nsingle-family residence large lot .....SF-1\n\n(4)\n\nsingle-family residence standard lot .....SF-2\n\n(5)\n\nfamily residence .....SF-3\n\n(6)\n\nsingle-family residence small lot .....SF-4A\n\n(7)\n\nsingle-family residence condominium site .....SF-4B\n\n(8)\n\nurban family residence .....SF-5\n\n(9)\n\ntownhouse and condominium residence .....SF-6\n\n(10)\n\nmultifamily residence limited density .....MF-1\n\n(11)\n\nmultifamily residence low density .....MF-2\n\n(12)\n\nmultifamily residence medium density .....MF-3\n\n(13)\n\nmultifamily residence moderate-high density .....MF-4\n\n(14)\n\nmultifamily residence high density .....MF-5\n\n(15)\n\nmultifamily residence highest density .....MF-6\n\n(16)\n\nmobile home residence .....MH\n\n(C)\n\nCommercial base districts and map codes are as follows:\n\n(1)\n\nneighborhood office .....NO\n\n(2)\n\nlimited office .....LO\n\n(3)\n\ngeneral office .....GO\n\n(4)\n\ncommercial recreation .....CR\n\n(5)\n\nneighborhood commercial .....LR\n\n(6)\n\ncommunity commercial .....GR\n\n(7)\n\nlake commercial .....L\n\n(8)\n\ncentral business .....CBD\n\n(9)\n\ndowntown mixed use .....DMU\n\n(10)\n\nwarehouse limited office .....W/LO\n\n(11)\n\ngeneral commercial services .....CS\n\n(12)\n\ncommercial-liquor sales .....CS-1\n\n(13)\n\ncommercial highway services .....CH\n\n(D)\n\nIndustrial base districts and map codes are as follows:\n\n(1)\n\nindustrial park .....IP\n\n(2)\n\nmajor industry .....MI\n\n(3)\n\nlimited industrial services .....LI\n\n(4)\n\nresearch and development .....R&D\n\n(E)\n\nSpecial purpose base districts and map codes are as follows:\n\n(1)\n\ndevelopment reserve .....DR\n\n(2)\n\naviation services .....AV\n\n(3)\n\nagricultural .....AG\n\n(4)\n\nplanned unit development .....PUD\n\n(5)\n\npublic .....P\n\n(6)\n\ntraditional neighborhood .....TN\n\n(7)\n\ntransit oriented development .....TOD\n\n(8)\n\nNorth Burnet/Gateway .....NBG\n\n(9)\n\nEast Riverside Corridor .....ERC\n\n(F)\n\nCombining districts and map codes are as follows:\n\n(1)\n\nhistoric landmark .....H\n\n(2)\n\nhistoric area .....HD\n\n(3)\n\nconditional overlay .....CO\n\n(4)\n\nneighborhood conservation .....NC\n\n(5)\n\nplanned development area .....PDA\n\n(6)\n\nwaterfront overlay .....WO\n\n(7)\n\nmixed use .....MU\n\n(8)\n\nvertical mixed use .....VMU\n\n(9)\n\nvertical mixed use building .....V\n\n(10)\n\nCapitol view corridor .....CVC\n\n(11)\n\nCapitol dominance .....CD\n\n(12)\n\nCongress Avenue CA .....\n\n(13)\n\nEast Sixth/Pecan Street .....PS\n\n(14)\n\ndowntown parks .....DP\n\n(15)\n\ndowntown creeks .....DC\n\n(16)\n\nconvention center .....CC\n\n(17)\n\ncentral urban redevelopment .....CURE\n\n(18)\n\nEast Austin .....EA\n\n(19)\n\nneighborhood plan .....NP\n\n(20)\n\nuniversity neighborhood overlay .....UNO\n\n(21)\n\ndensity bonus 90 .....DB90\n\n(22)\n\nequitable transit-oriented development .....ETOD\n\n(23)\n\ndensity bonus ETOD .....DBETOD\n\n(24)\n\ndensity bonus creative spaces .....DBCS\n\nSource: Section 13-2-21; Ord. 990225-70; Ord. 000309-39; Ord. 000406-81; Ord. 031211-11;\nOrd. 040902-58; Ord. 041202-16; Ord. 20050519-008; Ord. 20060831-068; Ord. 20071101-052;\nOrd. 20071129-098; Ord. 20090312-035; Ord. 20130509-039; Ord. No. 20221201-056, Pt. 1, 12-12-22; Ord. No. 20240229-070, Pt. 1, 3-11-24Ord. No. 20240229-073, Pt. 1, 3-11-24; Ord. No. 20240516-005, Pt. 1, 7-15-24; Ord. No. 20241010-034, Pt. 1, 10-21-24.\n\n(A)\n\nThe residential, commercial, and industrial base districts in Subsections (B), (C),\nand (D) of Section 25-2-32 (Zoning Districts And Map Codes) are arranged in a hierarchy that begins with the LA base district as the most restrictive\ndistrict and ends with the LI base district as the least restrictive district.\n\n(B)\n\nA combining district is classified in the hierarchy of zoning districts according\nto the base district with which the combining district is combined.\n\n(C)\n\nSpecial purpose base districts are not included in the hierarchy described in this\nsection.\n\nSource: Section 13-2-25; Ord. 990225-70; Ord. 031211-11.\n\nThe purposes of the residential district designations are to:\n\n(1)\n\nreserve areas for residential occupancy and provide for a broad range of residential\ndensities and variety of housing types consistent with the Comprehensive Plan and\nstandards of public health, safety, and welfare;\n\n(2)\n\nensure adequate light, air, privacy, and open space for each dwelling;\n\n(3)\n\nencourage compatibility between residential uses and other land uses;\n\n(4)\n\nfacilitate the planning for and provision of infrastructure improvements to serve\nanticipated population, dwelling unit density, traffic generation, and public service\nrequirements; and\n\n(5)\n\npromote energy conservation.\n\nSource: Section 13-2-40; Ord. 990225-70; Ord. 031211-11.\n\nThere are 16 residential district designations. The designation established for a\nproposed use is based on:\n\n(1)\n\ndensity;\n\n(2)\n\nlot size;\n\n(3)\n\nterrain;\n\n(4)\n\nenvironmental conditions;\n\n(5)\n\nlocation;\n\n(6)\n\nsurrounding uses;\n\n(7)\n\npublic infrastructure; and\n\n(8)\n\nother factors determined to be relevant by the council.\n\nSource: Sections 13-2-40 through 13-2-56; Ord. 990225-70; Ord. 031211-11.\n\nLake Austin residence (LA) district is the designation for a low density single-family\nresidential use on a lot that is a minimum of one acre and that is located 1,000 feet\nor less, measured horizontally, from the 492.8 foot topographic contour line on either\nside of Lake Austin.\n\nSource: Section 13-2-41; Ord. 990225-70; Ord. 031211-11.\n\nRural residence (RR) district is the designation for a low density residential use\non a lot that is a minimum of one acre. An RR district designation may be applied\nto a use in an area for which rural characteristics are desired or an area whose terrain\nor public service capacity require low density.\n\nSource: Section 13-2-42; Ord. 990225-70; Ord. 031211-11.\n\nSingle-family residence large lot (SF-1) district is the designation for a low density\nsingle-family residential use on a lot that is a minimum of 10,000 square feet. An\nSF-1 district designation may be applied to a use on land with sloping terrain or\nenvironmental limitations that preclude standard lot size or to a use in an existing\nresidential development on a lot that is 10,000 square feet or more.\n\nSource: Section 13-2-43; Ord. 990225-70; Ord. 031211-11.\n\nSingle-family residence standard lot (SF-2) district is the designation for a moderate\ndensity single-family residential use on a lot that is a minimum of 5,750 square feet.\nAn SF-2 district designation may be applied to a use in an existing single-family\nneighborhood that has moderate sized lots or to new development of single-family housing\non lots that are 5,750 square feet or more.\n\nSource: Section 13-2-44; Ord. 990225-70; Ord. 031211-11.\n\nFamily residence (SF-3) district is the designation for a moderate density single-family\nresidential use and a duplex use on a lot that is a minimum of 5,750 square feet.\nAn SF-3 district designation may be applied to a use in an existing single-family\nneighborhood with moderate sized lots or to new development of family housing on lots\nthat are 5,750 square feet or more. A duplex use that is designated as an SF-3 district\nis subject to development standards that maintain single-family neighborhood characteristics.\n\nSource: Section 13-2-45; Ord. 990225-70; Ord. 031211-11.\n\nSingle-family residence small lot (SF-4A) district is the designation for a moderate\ndensity single-family residential use on a lot that is a minimum of 3,600 square feet.\nAn SF-4A district use is subject to development standards that maintain single family\nneighborhood characteristics.\n\nSource: Section 13-2-46; Ord. 990225-70; Ord. 031211-11.\n\nSingle-family residence condominium site (SF-4B) district is the designation for a\nmoderate density single-family residential use on a site surrounded by existing structures,\nmost of which are single-family residences. An SF-4B district use is subject to development\nstandards that maintain single family neighborhood characteristics. An SF-4B district\ndesignation may only be applied to a use at a proposed location if the existing use\nat the location is designated as an urban family (SF-5) or less restrictive district.\n\nSource: Section 13-2-47; Ord. 990225-70; Ord. 031211-11.\n\nUrban family residence (SF-5) district is the designation for a moderate density single-family\nresidential use on a lot that is a minimum of 5,750 square feet. A duplex, two-family,\ntownhouse, or condominium residential use is permitted in an SF-5 district under development\nstandards that maintain single family neighborhood characteristics. An SF-5 district\ndesignation may be applied to a use in an existing family residential neighborhood\nin a centrally located area of the City. An SF-5 district may be used as a transition\nbetween a single family and multifamily residential use or to facilitate the implementation\nof City affordable housing programs.\n\nSource: Section 13-2-48; Ord. 990225-70; Ord. 031211-11.\n\nTownhouse and condominium residence (SF-6) district is the designation for a moderate\ndensity single family, duplex, two-family, townhouse, and condominium use that is\nnot subject to the spacing and location requirements for townhouse and condominium\nuse in an SF-5 district. An SF-6 district designation may be applied to a use in an\narea with large lots that have access to streets other than minor residential streets.\nAn SF-6 district may be used as a transition between a single family and multifamily\nresidential use.\n\nSource: Section 13-2-49; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence limited density (MF-1) district is the designation for a multifamily\nuse with a maximum density of up to 17 units per acre, depending on unit size. An\nMF-1 district designation may be applied to a use in a residential neighborhood that\ncontains a mixture of single family and multifamily uses or in an area for which limited\ndensity multifamily use is desired. An MF-1 district may be used as a transition between\na single family and higher intensity uses.\n\nSource: Section 13-2-50; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence low density (MF-2) district is the designation for a multifamily\nuse with a maximum density of up to 23 units per acre, depending on unit size. An\nMF-2 district designation may be applied to a use in a multifamily residential area\nlocated near single family neighborhoods or in an area for which low density multifamily\nuse is desired.\n\nSource: Section 13-2-51; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence medium density (MF-3) district is the designation for multifamily\nuse with a maximum density of up to 36 units per acre, depending on unit size. An\nMF-3 district designation may be applied to a use in a multifamily residential area\nlocated near supporting transportation and commercial facilities in a centrally located\narea or in an area for which medium density multifamily use is desired.\n\nSource: Section 13-2-52; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence moderate - high density (MF-4) district is the designation for\nmultifamily and group residential use with a maximum density of 36 to 54 units per\nacre, depending on unit size. An MF-4 district designation may be applied to high\ndensity housing in a centrally located area near supporting transportation and commercial\nfacilities, in an area adjacent to the central business district or a major institutional\nor employment center, or in an area for which moderate to high density multifamily\nuse is desired.\n\nSource: Section 13-2-53; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence high density (MF-5) district is the designation for multifamily\nand group residential use with a maximum density of up to 54 units per acre, depending\non unit size. An MF-5 district designation may be applied to a use in a centrally\nlocated area near supporting transportation and commercial facilities, an area adjacent\nto the central business district or a major institutional or employment center, or\nan area for which high density multifamily use is desired.\n\nSource: Section 13-2-54; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence highest density (MF-6) district is the designation for multifamily\nand group residential use. An MF-6 district designation may be applied to a use in\na centrally located area near supporting transportation and commercial facilities,\nan area adjacent to the central business district or a major institutional or employment\ncenter, or an area for which the high density multifamily use is desired.\n\nSource: Section 13-2-55; Ord. 990225-70; Ord. 031211-11.\n\nMobile home residence (MH) district is the designation for a mobile home residence\npark and mobile home subdivision use. An MH use is subject to standards that promote\na residential environment and compatibility with adjoining family residence neighborhoods.\n\nSource: Section 13-2-56; Ord. 990225-70; Ord. 031211-11.\n\nThe purposes of the commercial district designations are to:\n\n(1)\n\nreserve areas for offices, retail stores, and service establishments that provide\na broad range of goods and services to residents of Austin and the surrounding area;\n\n(2)\n\npromote the grouping of office and commercial uses that are convenient for the public\nand that benefit the uses in a district;\n\n(3)\n\nensure adequate access and off-street loading for office and commercial uses and minimize\ntraffic congestion and other adverse effects on nearby land uses;\n\n(4)\n\nencourage high standards of site planning, architecture, and landscape design for\noffice and commercial development in the City;\n\n(5)\n\nfacilitate the planning for and provision of infrastructure improvements to meet traffic,\ncommercial, and public service needs generated by the residents of Austin; and\n\n(6)\n\npromote energy conservation.\n\nSource: Section 13-2-60; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 2, 11-13-23.\n\nThere are 13 commercial district designations. The designation established for a proposed\ncommercial use is based on:\n\n(1)\n\ntype of use;\n\n(2)\n\ncustomer base;\n\n(3)\n\nlocation;\n\n(4)\n\nsurrounding uses;\n\n(5)\n\ntraffic generation; and\n\n(6)\n\nother factors determined to be relevant by the council.\n\nSource: Sections 13-2-60 through 13-2-73; Ord. 990225-70; Ord. 031211-11.\n\nNeighborhood office (NO) district is the designation for a small office use that serves\nneighborhood or community needs, is located in or adjacent to a residential neighborhood\nand on a collector street that has a width of 40 feet or more, and does not unreasonably\naffect traffic. An office in an NO district may contain not more than one use. Site\ndevelopment regulations applicable to an NO district use are designed to preserve\ncompatibility with existing neighborhoods through renovation and modernization of\nexisting structures.\n\nSource: Section 13-2-61; Ord. 990225-70; Ord. 031211-11.\n\nLimited office (LO) district is the designation for an office use that serves neighborhood\nor community needs and that is located in or adjacent to residential neighborhoods.\nAn office in an LO district may contain one or more different uses. Site development\nregulations and performance standards applicable to an LO district use are designed\nto ensure that the use is compatible and complementary in scale and appearance with\nthe residential environment.\n\nSource: Section 13-2-62; Ord. 990225-70; Ord. 031211-11.\n\nGeneral office (GO) district is the designation for an office or commercial use that\nserves community and city-wide needs. A building in a GO district may contain one\nor more different uses.\n\nSource: Section 13-2-63; Ord. 990225-70; Ord. 031211-11.\n\nCommercial recreation (CR) district is the designation for a commercial or recreation\nuse that serves visitors to major recreational areas, including Lake Travis and Lake\nAustin. Site development regulations applicable to a CR district use are designed\nto minimize visual and environmental disruptions of scenic views.\n\nSource: Section 13-2-64; Ord. 990225-70; Ord. 031211-11.\n\nNeighborhood commercial (LR) district is the designation for a commercial use that\nprovides business service and office facilities for the residents of a neighborhood.\nSite development regulations and performance standards applicable to a LR district\nuse are designed to ensure that the use is compatible and complementary in scale and\nappearance with the residential environment.\n\nSource: Section 13-2-65; Ord. 990225-70; Ord. 031211-11.\n\nCommunity commercial (GR) district is the designation for an office or other commercial\nuse that serves neighborhood and community needs and that generally is accessible\nfrom major traffic ways.\n\nSource: Section 13-2-66; Ord. 990225-70; Ord. 031211-11.\n\nLake commercial (L) district is the designation for a use located near Town Lake.\nAn L district designation may be applied to a development that includes any combination\nof office retail, commercial, and residential uses. Use and site development regulations\napplicable to an L district use are designed to ensure that the use is compatible\nand complementary with the Town Lake environment.\n\nSource: Section 13-2-67; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nCentral business district (CBD) is the designation for an office, commercial, residential,\nor civic use located in the downtown area.\n\n(B)\n\nSite development regulations applicable to a CBD district use are designed to:\n\n(1)\n\nensure that a CBD use is compatible with the commercial, cultural, historical, and\ngovernmental significance of downtown and preserves selected views of the Capitol;\n\n(2)\n\npromote the downtown area as a vital commercial retail area;\n\n(3)\n\ncreate a network of pleasant public spaces and pedestrian amenities in the downtown\narea;\n\n(4)\n\nenhance existing structures, historic features, and circulation patterns in the downtown\narea; and\n\n(5)\n\nconsider significant natural features and topography in the downtown area.\n\nSource: Section 13-2-68; Ord. 990225-70; Ord. 031211-11.\n\nDowntown mixed use (DMU) district is the designation for a use located on the periphery\nof an area that has a CBD designation. A DMU district designation may be applied to\na development that includes any combination of office retail, commercial, and residential\nuses and that is compatible with the downtown area. A DMU district use with an intermediate\ndensity may be used as a transition between the downtown area and surrounding districts.\nA DMU district is suitable for an area to which the central business district may\nexpand.\n\nSource: Section 13-2-69; Ord. 990225-70; Ord. 031211-11.\n\nWarehouse/limited office (W/LO) district is the designation for an office or warehouse\nuse for a building trade or other business that does not require a highly visible\nlocation or generate substantial volumes of heavy truck traffic, that generates low\nor moderate vehicular trips, and that requires less access than a retail use. A W/LO\ndistrict use may require special measures to be compatible with adjacent uses. A W/LO\ndistrict use may be located on a site that is adjacent to or near an arterial or major\nnonresidential collector street, adjacent to a rail line, or near existing or proposed\nemployment uses. A W/LO district use may also be located on a site that functions\nas a transition between commercial and industrial uses. A W/LO district use may be\nlocated adjacent to a residential use only if the density of the residential development\nis higher than a typical single-family density or if the physical conditions of the\nsite allow for buffering and project design to mitigate potential adverse effects.\n\nSource: Section 13-2-70; Ord. 990225-70; Ord. 031211-11.\n\nGeneral commercial services (CS) district is the designation for a commercial or industrial\nuse of a service nature that has operating characteristics or traffic service requirements\nthat are incompatible with residential environments.\n\nSource: Section 13-2-71; Ord. 990225-70; Ord. 031211-11.\n\nCommercial-liquor sales (CS-1) district is the designation for a commercial or industrial\nuse of a service nature that has operating characteristics or traffic service requirements\nthat are incompatible with residential environments. Liquor sales is one of the permitted\nuses in a CS-1 district.\n\nSource: Section 13-2-72; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nCommercial highway services (CH) district is the designation for a use that has operating\nand traffic generation characteristics that require that the use be located at the\nintersection of state maintained highways other than scenic arterial roadways. A CH\ndistrict designation may be applied to a single major mixed use development of a service\nnature that includes any combination of office, retail, commercial, and residential\nuses. A CH district may include a high density residential use. Site development regulations\nand performance standards applicable to a CH district are designed to ensure adequate\naccess to and from all uses.\n\n(B)\n\nA CH district may be located along the following highway corridors:\n\n(1)\n\nIH-35;\n\n(2)\n\nUS-183;\n\n(3)\n\nUS-290 (including Ben White Boulevard);\n\n(4)\n\nSH-71;\n\n(5)\n\nFM-1325 north of US-183; and\n\n(6)\n\nLoop 1, at least 400 feet north of the northernmost right-of-way line of US 183.\n\nSource: Section 13-2-73; Ord. 990225-70; Ord. 031211-11.\n\nThe purposes of the industrial district designation are to:\n\n(1)\n\nreserve areas for industrial use and protect the uses from intrusion by dwellings\nand other incompatible uses;\n\n(2)\n\nprotect residential, commercial, and nuisance-free nonhazardous industrial uses from\nthe adverse effects of certain industrial uses;\n\n(3)\n\nensure adequate access and off-street loading and minimize traffic congestion and\nother adverse effects on nearby land uses; and\n\n(4)\n\nfacilitate the planning for and provision of infrastructure improvements to meet traffic,\ncommercial, and public service needs generated by the residents of the City.\n\nSource: Section 13-2-80; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 3, 11-13-23.\n\nThere are four industrial district designations. The designation established for a\nproposed use is based on:\n\n(1)\n\nproposed use;\n\n(2)\n\nlocation;\n\n(3)\n\nsite size; and\n\n(4)\n\nother factors determined to be relevant by the council.\n\nSource: Sections 13-2-80 through 13-2-84; Ord. 990225-70; Ord. 031211-11.\n\nIndustrial park (IP) district is the designation for a limited commercial service\nuse, research and development use, administrative use, or manufacturing use that meets\nstrict development and performance standards and is generally located on a large site\nor in a planned industrial center.\n\nSource: Section 13-2-81; Ord. 990225-70; Ord. 031211-11.\n\nMajor industry (MI) district is the designation for a commercial service use, research\nand development use, administrative use, or manufacturing use generally located on\na large site planned for major industrial development.\n\nSource: Section 13-2-82; Ord. 990225-70; Ord. 031211-11.\n\nLimited industrial service (LI) district is the designation for a commercial service\nuse or limited manufacturing use generally located on a moderately-sized site.\n\nSource: Section 13-2-83; Ord. 990225-70; Ord. 031211-11.\n\nResearch and development (R&D) district is the designation for a research use located\non a site with a campus-style design. An R&D district designation may be applied to\ntesting services, research warehousing services, or research assembly services. An\nR&D district use may not include fabrication, processing, manufacturing, refining,\nor resource extraction.\n\nSource: Section 13-2-84; Ord. 990225-70; Ord. 031211-11.\n\nAgricultural (AG) district is the designation for an agriculture use or an agriculture-related\nuse. The purpose of the AG district designation is to preserve areas of prime agricultural\nsoils, concentrate urban development in and around growth centers, promote compact\nurban development, and preserve the environment and open spaces.\n\nSource: Section 13-2-92; Ord. 990225-70; Ord. 031211-11.\n\nAviation services (AV) district is the designation for an airport-related use that\nrequires direct access to airport facilities or that is compatible with or supports\nairport operations and services. An AV district designation may be applied to major\npublic airport facilities, including airport-related uses on public lands and on private\nlands adjoining airport facilities.\n\nSource: Section 13-2-91; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDevelopment reserve (DR) district is a designation for a temporary use or a use that\nwill not commit land to a particular use pattern or intensity.\n\n(B)\n\nA DR district designation may be applied to a use located on land for which:\n\n(1)\n\nadequate public services or facilities are not available;\n\n(2)\n\neconomic, demographic, and geographic data is not available; or\n\n(3)\n\nland use and urban development policies have not been completed.\n\nSource: Section 13-2-90; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nPlanned unit development (PUD) district is the designation for a large or complex\nsingle or multi-use development that is planned as a single contiguous project and\nthat is under unified control.\n\n(B)\n\nThe purpose of a PUD district designation is to preserve the natural environment,\nencourage high quality development and innovative design, and ensure adequate public\nfacilities and services for development within a PUD.\n\n(C)\n\nA PUD district designation provides greater design flexibility by permitting modifications\nof site development regulations. Development under the site development regulations\napplicable to a PUD must be superior to the development that would occur under conventional\nzoning and subdivision regulations.\n\n(D)\n\nA PUD district must include at least 10 acres of land, unless the property is characterized\nby special circumstances, including unique topographic constraints.\n\nSource: Section 13-2-93; Ord. 990225-70; Ord. 031211-11.\n\nPublic (P) district is the designation for a governmental, civic, public service,\nor public institution use. A P district designation may be applied to a use located\non property used or reserved for a civic or public institutional purpose or for a\nmajor public facility, regardless of ownership of the land on which the use is located.\nA P district designation may not be applied to government-owned property that is leased\nto a nongovernmental agency for a use other than a governmental service or for a use\nthat supports a primary civic or public institutional use.\n\nSource: Section 13-2-94; Ord. 990225-70; Ord. 031211-11.\n\nTraditional neighborhood (TN) district is the designation for a compact, mixed-use\ndevelopment that reflects the urban design practices that existed in the United States\nfrom colonial times until the 1940's. The TN district is governed by Chapter 25-3 (Traditional Neighborhood District).\n\nSource: Section 13-2-95; Ord. 990225-70; Ord. 031211-11.\n\nTransit oriented development (TOD) district is the designation for an identified transit\nstation and the area around it. The district provides for development that is compatible\nwith and supportive of public transit and a pedestrian-oriented environment.\n\nSource: Ord. 20050519-008.\n\n(A)\n\nNorth Burnet/Gateway (NBG) district is the designation for an identified area of existing\nlow density, auto-oriented commercial, warehouse, and industrial uses that is the\nsubject of an approved master plan for redevelopment of the area into a higher density\nurban mixed-use neighborhood that is more pedestrian friendly and takes advantage\nof the links to commuter rail transit and the area's key position in the urban core.\n\n(B)\n\nAn NBG designation may be applied only within the North Burnet/Gateway neighborhood\nplan area.\n\nSource: Ord. 20090312-035.\n\n(A)\n\nEast Riverside Corridor (ERC) district is the designation for an identified area of\nexisting auto-oriented commercial and multifamily uses that is the subject of an approved\nmaster plan for redevelopment of the area into an urban mixed-use neighborhood that\nis more pedestrian friendly and takes advantage of access to existing and future transit\noptions and the area's key position in the urban core.\n\n(B)\n\nAn ERC designation may be applied only within the boundaries identified in the East\nRiverside Corridor Regulating Plan.\n\nSource: Ord. 20130509-039.\n\n(A)\n\nThe purpose of the Capitol dominance (CD) overlay district is to protect the visual\nand symbolic significance of the State Capitol by keeping buildings in close proximity\nto the Capitol from dominating the structure.\n\n(B)\n\nThe CD overlay district applies to all property in a one-quarter mile radius of the\nState Capitol dome.\n\nSource: Section 13-2-171; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the Capitol view corridor (CVC) overlay district is to preserve the\nview of the State Capitol Building by limiting the height of structures located in\nthe capitol view corridors.\n\n(B)\n\nThe CVC overlay district applies to all property in the capital view corridors described\nin Appendix A of this chapter.\n\nSource: Section 13-2-145 (a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of a central urban redevelopment (CURE) combining district is to promote\nthe stability of neighborhoods in the central urban area.\n\n(B)\n\nA CURE combining district may be used:\n\n(1)\n\nfor sustainable redevelopment of homes, multifamily housing, and small businesses;\n\n(2)\n\nto accommodate high priority projects that enhance the stability of urban neighborhoods\nincluding the development of affordable housing and small businesses along principal\ntransportation routes that serve a neighborhood;\n\n(3)\n\nto improve the natural environment; and\n\n(4)\n\nto encourage high quality development with architectural design and proportion compatible\nwith the neighborhood.\n\nSource: Section 13-2-180; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of a conditional overlay (CO) combining district is to modify use and\nsite development regulations to address the specific circumstances presented by a\nsite.\n\n(B)\n\nA CO combining district may be used to:\n\n(1)\n\npromote compatibility between competing or potentially incompatible uses;\n\n(2)\n\nease the transition from one base district to another;\n\n(3)\n\naddress land uses or sites with special requirements; and\n\n(4)\n\nguide development in unique circumstances.\n\nSource: Section 13-2-120; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the Congress Avenue (CA) overlay district is to protect the historic\ncharacter and symbolic significance of Congress Avenue and to enhance the pedestrian\nenvironment of the area.\n\n(B)\n\nThe CA overlay district applies to all property zoned CBD or DMU that is between the\nalleys on each side of and parallel to Congress Avenue from First Street to Eleventh\nStreet.\n\nSource: Section 13-2-172; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the Convention Center overlay district is to protect and enhance the\nhealth, safety, and welfare of the public, to promote pedestrian activity and vitality\nin the Convention Center area, and to protect the existing character of the area.\n\n(B)\n\nExcept as otherwise provided in Subsection (C), the Convention Center overlay district\napplies to the land bounded on the west by the boundary line for the Congress Avenue\ncombining district; on the north by the boundary line for the East Sixth/Pecan Street\ncombining district and extending eastward across IH-35 to Waller Street; on the east\nby Waller Street and an imaginary centerline of Waller Street, if that street were\nextended in a straight line south to intersect the shoreline of Town Lake; and on\nthe south by the north Town Lake shoreline.\n\n(C)\n\nProperty in the following areas is excluded from the Convention Center overlay district\nif the property was owned by a governmental entity on February 20, 1994 or is owned\nby a governmental entity at the time an application for a development permit is filed\nand if the property is used for a governmental tax-exempt purpose:\n\n(1)\n\nthe land bounded by East 4th Street on the north, East 3rd Street on the south, Trinity\nStreet on the west, and Red River Street on the east;\n\n(2)\n\nthe land bounded by East 5th Street on the north, East 4th Street on the south, IH-35\non the west, and Waller Street on the east; and\n\n(3)\n\nthe area bounded by East 2nd Street on the north, East 1st Street on the south, Red\nRiver Street on the west, and Sabine Street on the east.\n\nSource: Section 13-2-176; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the downtown creeks (DC) overlay district is to promote public accessibility\nto the creeks, to promote pedestrian use of the creeks, and to protect and enhance\nthe scenic character of the creek corridors.\n\n(B)\n\nThe DC overlay district applies to property within 60 feet of the centerline of creeks\nthat is located within the CBD or DMU base districts.\n\nSource: Section 13-2-175; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the downtown parks (DP) overlay district is to enhance the pedestrian\nuse and vitality of downtown parks and to establish a unique urban design identity\nassociated with the public open spaces.\n\n(B)\n\nThe DP overlay district applies to property zoned CBD or DMU that is within:\n\n(1)\n\n60 feet of the public right-of-way surrounding Republic Square;\n\n(2)\n\n60 feet of the public right-of-way surrounding Brush Square; or\n\n(3)\n\n60 feet of the public right-of-way surrounding Wooldridge Square.\n\nSource: Section 13-2-174; Ord. 990225-70; Ord. 030612-93; Ord. 031211-11.\n\n(A)\n\nThe purpose of the East Austin (EA) overlay district is to reduce the concentration\nof intensive commercial and industrial uses in close proximity to residential areas\nin East Austin and to mitigate the effect of commercial and industrial uses on nearby\nresidential uses.\n\n(B)\n\nExcept as provided in Subsection (C), the EA overlay district applies to property\nlocated in the area bounded by Interregional Highway 35, Airport Boulevard, and Town\nLake.\n\n(C)\n\nThe EA overlay district does not apply to land included in a neighborhood plan combining\ndistrict.\n\nSource: Section 13-2-190; Ord. 990225-70; Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nThe purpose of the East Sixth/Pecan Street (PS) overlay district is to protect the\nhistoric character of East Sixth/Pecan Street and to enhance the pedestrian environment\nof the area.\n\n(B)\n\nThe PS overlay district applies to all property zoned CBD or DMU that is located between\nthe alleys and the extension of alley lines on each side of and parallel to East Sixth\nStreet from IH-35 to the first alley east of and parallel to Congress Avenue.\n\nSource: Section 13-2-173; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of a historic landmark (H) combining district is to protect, enhance,\nand preserve individual structures or sites that are of architectural, historical,\narchaeological, or cultural significance.\n\n(B)\n\nThe purpose of a historic area (HD) combining district is to protect, enhance, and\npreserve areas that include structures or sites that are of architectural, historical,\narchaeological, or cultural significance.\n\nSource: Section 13-2-1 and 13-2-100; Ord. 990225-70; Ord. 031211-11; Ord. 041202-16.\n\nMixed use (MU) combining districts and vertical mixed use (VMU) overlay districts\nare described and governed by Subchapter E, Article 4 (Mixed Use).\n\nSource: Sections 13-2-165; Ord. 990225-70; Ord. 031211-11; Ord. 20060831-068.\n\nThe purpose of a neighborhood conservation (NC) combining district is to preserve\nneighborhoods with distinctive architectural styles that were substantially built\nout at least 30 years before the date an application for an NC combining district\nclassification is filed.\n\nSource: Section 13-2-130; Ord. 990225-70; Ord. 031211-11.\n\nThe purpose of a planned development area (PDA) combining district is to:\n\n(1)\n\nprovide for industrial and commercial uses in certain commercial and industrial base\ndistricts; or\n\n(2)\n\nincorporate the terms of a planned development area agreement into a zoning ordinance\nfollowing annexation of a property that is subject to a planned development area agreement.\n\nSource: Section 13-2-150; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the waterfront overlay (WO) district is to promote the harmonious interaction\nand transition between urban development and the park land and shoreline of Town Lake\nand the Colorado River.\n\n(B)\n\nThe WO district applies to all property in its boundaries.\n\n(C)\n\nThe boundaries of the WO district are identified in Appendix B of this chapter.\n\nSource: Section 13-2-160(a); Ord. 990225-70; Ord. 031211-11.\n\nThe purpose of a neighborhood plan (NP) combining district is to allow infill development\nby implementing a neighborhood plan that has been adopted by the council as an amendment\nto the comprehensive plan.\n\nSource: Ord. 000406-81; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the criminal justice center (CJC) overlay district is to mitigate the\neffects of the criminal justice center on the surrounding neighborhood by restricting\ncertain land uses.\n\n(B)\n\nThe CJC overlay district applies to the area generally bounded on the north by 13th\nStreet, on the east by Guadalupe Street, on the south by 7th Street, and on the west\nby Shoal Creek Boulevard. The official map of the district is on file with the director\nof the Neighborhood Planning and Zoning Department, who shall resolve uncertainty\nregarding the boundary of the district.\n\nSource: Ord. 010426-48; Ord. 031211-11.\n\n(A)\n\nThe purpose of the Barton Springs Zone (BSZ) overlay district is to preserve the natural\nbeauty of the Hill Country, protect the image and character of the neighborhoods in\nthe district, and reduce the negative effects of urbanization by restricting the scale\nand intensity of retail development.\n\n(B)\n\nThe BSZ overlay district applies to the portion of the Barton Springs Zone, as described\nin Section 25-8-2 (Descriptions of Regulated Areas), that is within the city's zoning jurisdiction.\n\nSource: Ord. 031204-57; Ord. 031211-11.\n\n(A)\n\nThe purpose of the university neighborhood overlay (UNO) district is to promote high\ndensity redevelopment in the area generally west of the University of Texas campus,\nprovide a mechanism for the creation of a densely populated but livable and pedestrian\nfriendly environment, and protect the character of the predominantly single-family\nresidential neighborhoods adjacent to the district.\n\n(B)\n\nThe UNO district consists of the following subdistricts:\n\n(1)\n\ninner west campus subdistrict;\n\n(2)\n\nouter west campus subdistrict;\n\n(3)\n\nGuadalupe subdistrict; and\n\n(4)\n\nDobie subdistrict.\n\n(C)\n\nThe boundaries of the UNO district and each subdistrict are identified in Appendix\nC (University Neighborhood Overlay District Boundaries, Subdistrict Boundaries, And Height\nLimits) of this chapter.\n\nSource: Ord. 040902-58.\n\n(A)\n\nThe purpose of the Lake Austin (LA) overlay district is to protect the scenic, recreational,\nand environmental benefits of Lake Austin by restricting the scale and intensity of\ndevelopment near the lake.\n\n(B)\n\nThe boundaries of the Lake Austin (LA) overlay district include land that is located\nwithin 1,000 feet of the shoreline of Lake Austin, as defined under Section 25-2-551 (Lake Austin (LA) District Regulations) and is:\n\n(1)\n\nlocated within the Lake Austin (LA), Interim Lake Austin (I-LA), Development Reserve\n(DR), Planned Unit Development (PUD), Rural Residential (RR), or Interim Rural Residential\n(I-RR) base zoning district on or after June 24, 2014; or\n\n(2)\n\nlocated on a site of one acre or more that is:\n\n(i)\n\ncomprised of two or more lots aggregated on or after June 24, 2014; and\n\n(ii)\n\nzoned or rezoned single family residence large lot (SF-1), single family residence\nstandard lot (SF-2), family residence (SF-3), single family residence small lot (SF-4A),\nsingle family residence condominium site (SF-4A), urban family residence (SF-5), or\ntownhouse and condominium residence (SF-6) base zoning district.\n\n(C)\n\nIn the event of a conflict, the regulations applicable to a Planned Unit Development\n(PUD) zoning district control over the regulations prescribed in Section 25-2-647.\n\n(D)\n\nThe official map of the Lake Austin Overlay district is on file with the Planning\nand Development Review Department, which shall resolve any uncertainty regarding the\nboundary of the district.\n\nSource: Ord. No. 20140626-114, Pt. 1, 7-7-14.\n\n(A)\n\nDensity bonus (DB) combining districts authorize a particular property to participate\nin a voluntary density bonus or incentive program that provides modifications to development\nregulations or other regulatory-related benefits in exchange for community benefits.\n\n(B)\n\nDB 90 Combining District allows residential uses on sites with certain commercial\nbase zoning districts, modifies compatibility requirements, and grants additional\nheight in exchange for income-restricted housing.\n\n(C)\n\nDBETOD Combining District allows residential uses, preserves certain existing residential\nand non-residential uses, modifies compatibility standards and site development regulations,\nand grants additional building height in exchange for income-restricted housing.\n\n(D)\n\nDBCS Combining District allows for resiliency and posterity for centers of art and\nlive music while encouraging affordable creative spaces in new developments.\n\nSource: 20240229-073, Pt. 2, 3-11-24; Ord. No. 20240516-005, Pt. 4, 7-15-24; Ord. No. 20241010-034, Pt. 2, 10-21-24.\n\n**Editor's note**\nOrd. No. 20240229-070, Pt. 1, effective March 11, 2024, repealed  25-2-181, which pertained to Corridor\nOverlay (COR) District Purpose And Boundaries and derived from Ord. No. 20221201-056, Pt. 2, 12-12-22; Ord. No. 20231102-028, Pt. 4, 11-13-23.\n\n(A)\n\nThe purpose of the equitable transit-oriented development (ETOD) combining district\nis to enhance transit-supportive uses, encourage more intentional and equitable land\nstewardship with increased bicycle, pedestrian, and transit connectivity, housing\noptions and opportunities, public realm activation, and new economic opportunities\nnear public transit.\n\n(B)\n\nThe boundaries of the ETOD district are identified in Appendix G (ETOD Boundaries) of this chapter.\n\nSource: Ord. No. 20240516-005, Pt. 2, 7-15-24.\n\n(A)\n\nThe boundaries of all zoning districts are depicted on the zoning map. The zoning\nmap is incorporated by reference into this section.\n\n(B)\n\nThe city clerk shall maintain in the City's files the original zoning map and all\nzoning map amendments. The director of the Neighborhood Planning and Zoning Department\nand the building official shall retain a copy of the current zoning map.\n\n(C)\n\nThe zoning map may be divided into sections or include a supplemental map.\n\nSource: Section 13-2-22; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nIf a site is divided by a zoning district boundary, the regulations of each zoning\ndistrict apply to the portion of the site located in that zoning district.\n\n(B)\n\nThe boundary of a zoning district shown on the zoning map is determined in accordance\nwith this subsection.\n\n(1)\n\nIf a zoning district boundary is shown as approximately following a street, alley,\nor property boundary, the zoning district boundary coincides with the street, alley,\nor property boundary.\n\n(2)\n\nIf a zoning district boundary is shown to be within a street, alley, right-of-way,\nor creek, the center line of the street, alley, right-of-way, or creek is the zoning\ndistrict boundary.\n\n(3)\n\nIf a zoning district boundary divides a parcel, the location of the zoning district\nboundary shall be determined:\n\n(a)\n\nby the dimensions shown on the zoning map; or\n\n(b)\n\nif the dimensions are not shown, by use of the scale appearing on the zoning map.\n\n(4)\n\nIf a public street, alley, or right-of-way is vacated or abandoned, the zoning regulations\napplicable to the abutting property apply out to the centerline of the vacated or\nabandoned street, alley, or right-of-way.\n\n(5)\n\nThe director of the Neighborhood Planning and Zoning Department shall determine the\nlocation or meaning of a boundary or other feature on the zoning map.\n\nSource: Section 13-2-23; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n",
  "start_line": 9234,
  "end_line": 11799,
  "subsections": []
}