{
  "id": "25-2-subchapter-E",
  "title": ": - DESIGN STANDARDS AND MIXED USE",
  "level": 1,
  "parent_id": null,
  "content": "## SUBCHAPTER E: - DESIGN STANDARDS AND MIXED USE.\n\nEditor's note:\n\nBackground: On February 26, 2004, the Austin City Council directed the City Manager\nby resolution \"… to prepare recommendations for citywide design standards for commercial\nand retail development. These recommended citywide design standards shall constitute\nthe best practices of the standards adopted by communities around the nation and shall\nrequire design standards that reflect Austin's unique historic, landscape and architectural\ncharacter…\"\n\nIn order to implement the Council's direction, a specially appointed Task Force met\nover several months to consider research and input from the public, various stakeholder\ngroups, and individuals. The Task Force sought to understand the preferences of Austin\ncitizens and the design regulations of other cities prior to developing a recommendation.\n\nThe Task Force produced, and in May 2005 the City Council adopted, a policy report\nentitled \"Raising the Design Standards in Austin, Texas.\" The Task Force report identified\na number of areas where regulatory improvements are necessary in order to raise the\nbar of development quality in Austin. The general intent was to develop regulations\nthat will foster a built environment of aesthetic and sustainable value, enhance economic\ndevelopment efforts, promote Austin's unique character and natural environment, and\nensure an efficient development review process.\n\nThe proposals for new standards were intended to raise the level of quality for all\nnon-residential and mixed-use development, but within a regulatory structure offering\noptions and flexibility, not strict requirements. New development would be subject\nto a set of minimum site and building design standards, recognizing that all new development,\nregardless of size, should be subject to minimum standards. The following topics were\naddressed in the Task Force report: Development orientation; Parking; Land use; Signs;\nStormwater management; Connectivity; Exterior lighting; Screening and compatibility;\nand Building design.\n\nIn each of these topic areas, the Task Force report discussed the key issue generally\nand proposed regulatory language to address the issue. In a few areas, specific ordinance\nlanguage was proposed, but in most areas the proposed language recommended general\napproaches rather than actual ordinance language. In some areas, the proposed new\nstandards would be new for Austin, while in other areas the proposed standards would\nrequire amendments to the Austin Code.\n\nThis Subchapter is intended to implement the Task Force report by establishing a clear,\nuser-friendly, and legally enforceable ordinance that will result in improved development\nquality in Austin. This Subchapter is officially known as Subchapter E of Chapter 25-2 of the City Code. This Subchapter was adopted on August 31, 2006, and will become\neffective on January 13, 2007. The Task Force recommends reviewing this Subchapter\nonce it has been in place for one year.\n\nHow to use this Subchapter:\n\nApplicability is Based on Adjacent Roadway and Type of Development: This Subchapter\nrecognizes that development should reflect and respond to its location within the\ncity. For example, a commercial development in a suburban location can (and often\nshould) look and function differently than a commercial development in downtown Austin.\nBecause roadways provide both access to a site and define the urban design framework\nof the city, roadway types have been used as an organizing tool to establish many\nof the new development standards in this Subchapter. This approach is intended to\nhelp ensure a cohesive development pattern along Austin's streets and remove some\nof the inconsistency that arises from having a variety of zoning districts fronting\na single roadway.\n\nBecause many of the standards in this Subchapter are defined based on roadway type(s)\nnear the property, an important first step in the development process is to determine\nthe roadway types that are adjacent to a site. The size of the site and the type of\ndevelopment (residential, commercial, mixed use, etc.) also need to be considered,\nsince different standards may apply. The applicability chart in Article 1 summarizes\nthe applicability of all the standards in this Subchapter, based on type of adjacent\nroadways and development activity.\n\nThe following different types of roadways are identified in this Subchapter:\n\nCore Transit Corridors include roadways that have or will have a sufficient population\ndensity, mix of uses, and transit facilities to encourage and support transit use.\nExisting Core Transit Corridors have been designated and are defined in Article 5\nand shown on Figure 1. Examples include South Congress Avenue (north of Stassney Lane)\nand Anderson Lane (between Burnet Road and Mopac). Additional Core Transit Corridors\nmay be designated in the future through neighborhood planning processes.\n\nHill Country Roadways are those roadways identified in Section 25-2-1103, such as RM 2222 and Southwest Parkway. Standards in this Subchapter that reference\nthe Hill County Roadway designation apply to all properties within 1000 feet of these\nroadways.\n\nHighways include all freeways, parkways, expressways, and frontage roads identified\nin the Austin Area Metropolitan Transportation Plan, except for Core Transit Corridors.\n\nInternal Circulation Routes are public streets or private drives edged by a curb within\na development.\n\nSuburban Roadways are roads outside the Urban Roadway Boundary, defined below and\nshown on Figure 2, that are not Core Transit, Hill Country, or Highway Roadways.\n\nUrban Roadways are roads other than those designated as Core Transit Corridors and\nHighways located within the following boundaries, as shown on Figure 2:\n\n183 from Burnet to Hwy 71\n\nHwy 71 from 183 to Loop 1\n\nLoop 1 from Hwy 71 to Lake Austin\n\nLake Austin from Loop 1 to Exposition\n\nExposition from Lake Austin to 35th\n\n35th from Exposition to Loop 1\n\nLoop 1 from 38th to RM 2222\n\nRM 2222 from Loop 1 to Mesa\n\nMesa from RM 2222 to Spicewood Springs Road\n\nSpicewood Springs Road from Mesa to 360\n\n360 from Spicewood Springs Road to Great Hills Trail\n\nGreat Hills Trail from 360 to 183\n\n183 from Great Hills Trail to Braker\n\nBraker from 183 to Burnet\n\nBurnet from Braker to 183\n\n![Figure 1: Core Transit Corridors (CTC) and Future Core Transit Corridors Map (May 10, 2010)](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubchE-Fig1.png)\n\nFigure 1: Core Transit Corridors (CTC) and Future Core Transit Corridors Map (May\n10, 2010)\n\n![Figure 2: Urban/Suburban Roadways Map](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubchE-Fig2.png)\n\nFigure 2: Urban/Suburban Roadways Map\n\nHow this Subchapter is organized:\n\nThis Subchapter is divided into five Articles.\n\nArticle 1 includes General Provisions that should be reviewed for all development\nand redevelopment projects. Most importantly, a chart summarizes the applicability\nof the various standards based on roadway types and development types.\n\nTo allow flexibility in administering this Subchapter, this Article includes a \"minor\nmodification\" provision that allows for City staff to approve small deviations from\notherwise applicable standards in order to protect natural or historic features or\nto address unique site conditions.\n\nThe Article also encourages creativity and innovative design by allowing an applicant\nto propose an alternative approach to meeting the standards of the Subchapter through\nthe \"alternative equivalent compliance\" provision.\n\nArticle 2 includes Site Development Standards intended to ensure that buildings relate\nappropriately to surrounding developments and streets, promote efficient pedestrian\nand vehicle circulation, and provide parking in safe and appropriate locations, while\ncreating a unique and identifiable image for development in Austin. In particular,\nstandards in this Article address the following:\n\nRelationship of buildings to streets and walkways (based on roadway type);\n\nConnectivity (based on roadway type);\n\nExterior lighting;\n\nScreening of equipment and utilities; and\n\nPrivate common open space and pedestrian amenities.\n\nArticle 3 includes Building Design Standards intended to address the physical appearance\nof buildings subject to this Subchapter. Included are:\n\nGeneral requirements for glazing and shading to ensure that building façades are pedestrian-friendly;\nand\n\nAdditional options to improve building design. An applicant may choose which of these\noptions to meet from a flexible, point-based menu. All buildings subject to this section\nmust reach a minimum number of points, with additional points required for certain\nbuilding types (e.g., buildings with trademarked design features, large buildings\nor long façades, and buildings using a large percentage of certain building materials.)\n\nArticle 4 includes standards and incentives for Mixed Use development. This Article\nincludes descriptions and standards for the Mixed Use Combining District and the Vertical\nMixed Use Overlay District. This Article also includes standards and incentives for\nthe development of Vertical Mixed Use (VMU) buildings.\n\nArticle 5 includes Definitions for terms used in this Subchapter.\n\nSource: Ord. No. 20231102-028, Pt. 27, 11-13-23.\n\nThis Subchapter generally addresses the physical relationship between commercial and\nother nonresidential development and adjacent properties, public streets, neighborhoods,\nand the natural environment, in order to implement the City Council's vision for a\nmore attractive, efficient, and livable community. The general purposes of this Subchapter\ninclude:\n\n1.1.1.\n\nTo provide appropriate standards to ensure a high quality appearance for Austin and\npromote pedestrian-friendly design while also allowing flexibility, individuality,\ncreativity, and artistic expression;\n\n1.1.2.\n\nTo strengthen and protect the image, identity, and unique character of Austin and\nthereby to enhance its business economy;\n\n1.1.3.\n\nTo protect and enhance residential neighborhoods, commercial districts, and other\nareas by encouraging physical development that is of high quality and is compatible\nwith the character, scale, and function of its surrounding area;\n\n1.1.4.\n\nTo encourage developments that relate well to adjoining public streets, open spaces,\nand neighborhoods; and\n\n1.1.5.\n\nTo provide for and encourage development and redevelopment that contains a compatible\nmix of residential and nonresidential uses within close proximity to each other, rather\nthan separating uses.\n\nSource: Ord. 20060831-068; Ord. 20130606-088.\n\n1.2.1.\n  General Applicability.\n\nThe applicability of this Subchapter varies by section and is dependent on the type\nof principal street that the subject lot or site faces and on the type of development\nactivity proposed. Table A summarizes the applicability of each section of this Subchapter.\nOnly those sites and projects that meet both the principal street and development\ntype thresholds in the table are subject to the particular standard. General exemptions\nfrom the requirements of this Subchapter are listed in Subsection 1.2.4., and additional\nexemptions from specific standards are listed in subsequent sections of this Subchapter.\n\n|  |  |  |  |\n| --- | --- | --- | --- |\n| TABLE A. GENERAL APPLICABILITY | | | |\n| Section | Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| ARTICLE 2: SITE DEVELOPMENT STANDARDS | | | |\n| 2.2: Relationship of Buildings to Streets and Walkways | 2.2.2. Core Transit Corridors: Sidewalks and Building Placement | Core Transit Corridor | - All zoning districts   - Single-family residential uses are exempt, in addition to the general exemptions in Section 1.2.4. |\n| 2.2.3. Urban Roadways: Sidewalks and Building Placement | Urban Roadway | All non-residential zoning districts |\n| 2.2.4. Suburban Roadways: Sidewalks and Building Placement | Suburban Roadway | All non-residential zoning districts |\n|  | Development of a site five acres or larger with frontage on a Core Transit Corridor or Urban Roadway | - All zoning districts   - See additional exemptions in Subsection C of this section |\n| 2.2.5. Internal Circulation Routes: Sidewalks and Building Placement Requirements for Large Sites | Development of a site five acres or larger with frontage on a Suburban Roadway, Highway, or Hill Country Roadway | - All non-residential zoning districts   - See additional exemptions in subsection C of this section |\n| 2.3: Connectivity | 2.3.1. Improvements to Encourage Pedestrian, Bicycle, and Vehicular Connectivity | All roadway types | - Projects with a net site area of three acres or more in all non-residential zoning districts   - Projects with a net site area of less than three acres that have parking between the building and the principal street in all zoning districts |\n| 2.4: Building Entryways | All standards | Core Transit Corridor | All zoning districts |\n| - Urban Roadway   - Suburban Roadway   - Internal Circulation Route   - Highway   - Hill Country Roadway | All non-residential zoning districts |\n| 2.5: Exterior Lighting | All standards | All roadway types | All zoning districts |\n| 2.6: Screening of Equipment and Utilities | All standards | All roadway types | - All non-residential zoning districts   - The following uses are exempt, in addition to the general exemptions of Section 1.2.4.: local utilities services use, electric service transformers within the right-of-way, telecommunication tower |\n| 2.7: Private Common Open Space and Pedestrian Amenities | All standards | All roadway types | All site plans two acres in size or larger, and all multifamily and condominium uses except as provided in 25-2-776 and 25-2-780 of the LDC |\n| 2.8: Shade and Shelter | All standards | All roadway types | - Development of any non-residential land use except for congregate care facilities zoned MF for which the principal street is not a Core Transit Corridor   - This section applies to any building frontage. Building façades facing loading areas, rear service areas, or façades adjoining other buildings (attached to more than 50 percent of the sidewall) are exempt. |\n| ARTICLE 3: BUILDING DESIGN STANDARDS | | | |\n| 3.2: Glazing and Façade Relief Requirements | All standards | All roadway types | - Development of any non-residential land use, except for congregate care facilities zoned MF for which the principal street is not a Core Transit Corridor   - Religious Assembly use shall be exempt from glazing requirements. |\n| 3.3: Options to Improve Building Design | All standards | All roadway types | - Development of any commercial use of 10,000 square feet or more that requires a building permit   - Development of any commercial use of less than 10,000 square feet that contains any exterior trademarked design features   - Any building zoned for industrial use or warehouse use at the point its use is converted to commercial   - VMU buildings with external trademarked design features (not including signs)   - Office development is exempt from this section |\n| ARTICLE 4: MIXED USE | | | |\n| 4.3: Vertical Mixed Use Building | All standards | Core Transit Corridor, Future Core Transit Corridor | - Mixed Use Combining District   - Vertical Mixed Use Overlay District   - Properties that opt in to VMU pursuant to 4.3.5.C.3. |\n| Highway, Hill Country Roadway, Suburban Roadway, or Urban Roadway | - Mixed Use Combining District   - Sites of three acres or more, subject to 4.3.2.B.   - Properties that opt in to VMU pursuant to 4.3.5.C.3. |\n\n1.2.2.\n  Full Compliance.\n\nUnless exempted in Section 1.2.3 (Partial Compliance) or Section 1.2.4 (Exemptions), the following activity is subject to full compliance with this Subchapter:\n\nA.\n\nNew construction on previously undeveloped land; and\n\nB.\n\nNew construction or site development where the Director determines that all buildings\non the site have been or will be demolished.\n\n1.2.3.\n  Partial Compliance.\n\nFor a project that is not subject to Sections 1.2.2 (Full Compliance) or 1.2.4 (Exemptions), the Director shall determine which standards of this Subchapter apply to the project\nor a portion of the project in accordance with the following requirements:\n\nA.\n\nA new building, or building addition as defined by the adopted Existing Building Code\nmust comply with:\n\n1.\n\nArticle 2 unless compliance cannot be achieved due to:\n\na.\n\nThe location of existing buildings or other improvements retained on the site;\n\nb.\n\nThe size or nature of the proposed building limits placement on the site;\n\nc.\n\nTopography, protected trees, or critical environmental features;\n\nd.\n\nThe location of water quality or detention facilities; or\n\ne.\n\nA waiver from the requirements of Article 2 shall be to the minimum extent required\nbased on the criteria of this subsection; and\n\n2.\n\nArticle 3.\n\nB.\n\nA remodeled building or façade must comply with:\n\n1.\n\nSection 2.5 (Exterior Lighting); and\n\n2.\n\nArticle 3 where the remodeled building is considered a \"Level 3\" Alteration or Addition\nas defined by the adopted Existing Building Code such that the work area exceeds 50\npercent of the aggregate area of the building and the principal street façade.\n\n1.2.4.\n  Exemptions.\n\nA.\n\nGeneral Exemptions. Except as otherwise provided in this Subchapter, the following\ntypes of development are exempt from the requirements of this Subchapter:\n\n1.\n\nDevelopment that does not require a site plan under Chapter 25-5, except that Section 2.5 (Exterior Lighting) shall apply;\n\n2.\n\nDevelopment in the following zoning districts:\n\na.\n\nAgricultural (AG) district;\n\nb.\n\nAviation (AV) district; and\n\nc.\n\nTraditional neighborhood (TN) district;\n\n3.\n\nDevelopment built pursuant to the overlay district provisions of the University Neighborhood\nOverlay (UNO) district;\n\n4.\n\nDevelopment of a public primary or secondary educational facility;\n\n5.\n\nDevelopment built pursuant to the Robert Mueller Municipal Airport Redevelopment Plan;\n\n6.\n\nDevelopment of an industrial use or unmanned communication services, construction\nsales and service, drop-off recycling collection facility, equipment repair or scrap\nand salvage services use that is not located on a Core Transit Corridor;\n\n7.\n\nInterior remodeling of a building;\n\n8.\n\nDevelopment for which public access is prohibited due to health, safety and welfare\nreasons;\n\n9.\n\nDevelopment of a warehouse if less than 25 percent of the gross floor area is used\nfor a non-industrial use;\n\n10.\n\nSidewalk, shared use and urban trail projects managed by the City of Austin and processed\nunder the City's General Permit program which are undertaken for the purpose of bringing\nexisting facilities into compliance with the Americans With Disabilities Act;\n\n11.\n\nA public mobility project in the right-of-way; and\n\n12.\n\nDevelopment built pursuant to any of the following adopted regulating plans:\n\na.\n\nTransit-Oriented District Station Area Plan;\n\nb.\n\nNorth Burnet/Gateway (NBG) District;\n\nc.\n\nEast Riverside Corridor;\n\nd.\n\nWaller Creek District;\n\ne.\n\nDowntown Austin Plan; or\n\nf.\n\nAirport Boulevard Corridor Plan.\n\nSource: Ord. No. 20160623-090, Pt. 5, 7-4-16; Ord. No. 20220519-094, Pt. 3, 5-30-22.\n\n1.2.5.\n  Conflicting Provisions.\n\nA.\n\nIf the provisions of this Subchapter are inconsistent with provisions found in other\nadopted codes, ordinances, or regulations of the City of Austin not listed in Subsection\nB. below, this Subchapter shall control unless otherwise expressly provided.\n\nB.\n\nThe following provisions supersede the requirements of this Subchapter to the extent\nof conflict:\n\n1.\n\nThe following provisions of Chapter 25-2:\n\na.\n\nSubchapter C, Article 3 (Additional Requirements for Certain Districts);\n\nb.\n\nSubchapter C, Article 4 (Additional Requirements for Certain Uses);\n\nc.\n\nSubchapter C, Article 10 (Compatibility Standards);\n\nd.\n\nProvisions applicable to the Hill Country Roadways; and\n\n2.\n\nRegulations applicable to a:\n\na.\n\nBarton Springs Zone overlay district;\n\nb.\n\nConditional overlay (CO) combining district;\n\nc.\n\nCentral urban redevelopment (CURE) combining district;\n\nd.\n\nNeighborhood conservation (NC) combining district;\n\ne.\n\nNeighborhood plan (NP) combining district;\n\nf.\n\nPlanned development area (PDA) combining district;\n\ng.\n\nPlanned unit development (PUD) district; or\n\nh.\n\nWaterfront overlay (WO) district.\n\n1.2.6.\n  Accessibility.\n\nAccessibility, integration and inclusion of people with disabilities are fundamental\ncomponents of our vision for the future of the City of Austin. This Subchapter is\nnot intended to supersede any applicable state or federal accessibility statutes and\nregulations. Administration and enforcement of this Subchapter shall comply with all\nsuch statutes and regulations.\n\nAll pedestrian routes constructed within the public right-of-way shall be constructed\nso as to provide legally accessible transitions to pedestrian routes on adjacent properties.\n\n1.2.7.\n  State and Federal Facilities.\n\nCompliance with the standards of this Subchapter at all state and federal facilities\nis encouraged.\n\nSource: Ord. 20060831-068; Ord. 20071101-052; Ord. 20090312-035; Ord. 20090611-074;\nOrd. 20100408-049; Ord. 20130509-039; Ord. 20130606-088.\n\n1.3.1.\n  Standards Applicable During Site Plan Review.\n\nThe standards contained in the following sections of this Subchapter shall be applied\nin the normal review process for site plans as set forth in Chapter 25-5 of the Austin Code:\n\nA.\n\nSection 2.2, Relationship of Buildings to Streets and Walkways,\n\nB.\n\nSection 2.3, Connectivity Between Sites,\n\nC.\n\nSection 2.4, Building Entryways,\n\nD.\n\nSection 2.5, Exterior Lighting,\n\nE.\n\nSection 2.6, Screening of Equipment and Utilities,\n\nF.\n\nSection 2.7, Private Common Open Space and Pedestrian Amenities,\n\nG.\n\nShade and Shelter, and\n\nH.\n\nArticle 4, Mixed Use.\n\nIn addition to meeting the review criteria specified in Chapter 25-5, each site plan application shall evidence compliance with the standards listed above.\n\n1.3.2.\n  Standards Applicable During Building Permit Review.\n\nThe standards contained in the following sections of this Subchapter shall be applied\nin the normal review process for building permits as set forth in Chapter 25-11 of the Land Development Code:\n\nA.\n\nSection 2.5, Exterior Lighting,\n\nB.\n\nSection 2.6, Screening of Equipment and Utilities, and\n\nC.\n\nArticle 3, Building Design Standards.\n\nIn addition to meeting the review criteria specified in Chapter 25-11, each building permit application shall evidence compliance with the standards listed\nabove.\n\nSource: Ord. 20060831-068; Ord. 20130606-088.\n\n1.4.1.\n  Purpose and Scope.\n\n\"Minor modifications\" are small deviations from otherwise applicable standards of\nthis Subchapter that may be approved by the Director in order to protect natural or\nhistoric features or to address unusual site conditions. Minor modifications are to\nbe used when the limited nature of the modification requested, and the unlikelihood\nof any adverse effects on nearby properties or the neighborhood, make it unnecessary\nto complete a formal variance process.\n\n1.4.2.\n  Applicability.\n\nThe Director may approve minor modifications of any numeric development standard in\nthis Subchapter up to a maximum of ten percent (or up to a maximum of 20 percent to\nprotect an existing natural site feature), provided that the applicable criteria in\nSection 1.4.4 (Approval Criteria) are met.\n\nFor a Heritage Tree, the Director may approve modification of any numeric development\nstandard in this Subchapter to the minimum extent required to preserve the Heritage\nTree.\n\nA modified development standard is calculated by applying the percentage of modification\nallowed by the Director to the numeric requirement that would otherwise apply if the\ndevelopment standard was not modified. For example, if a building façade is required\nto have 40% glazing, which would equal 400 square feet glazing on a 1000-square foot\nfaçade, then a 10% minor modification would decrease the amount of required glazing\nby 40 square feet for a total of 360 square feet of required glazing. The minor modification\nprocess may be used only to authorize a less restrictive standard and may not be used\nto impose a standard on the subject property than is higher than otherwise provided\nin this Subchapter. In no circumstance shall the Director approve a minor modification\nthat results in:\n\nA.\n\nAn increase in overall project intensity, density, or impervious cover;\n\nB.\n\nA change in permitted uses or mix of uses;\n\nC.\n\nA change in the requirements of any of the following provisions:\n\n1.\n\nSubchapter C, Article 3 (Additional Requirements for Certain Districts);\n\n2.\n\nSubchapter C, Article 4 (Additional Requirements for Certain Uses);\n\n3.\n\nSubchapter C, Article 10 (Compatibility Standards); or\n\nD.\n\nA change in conditions attached to a subdivision plan, site plan, special use permit,\nor restrictive covenant approved by the City.\n\n1.4.3.\n  Procedure.\n\nThe Director may initiate or approve a minor modification allowed under this section\nat any time prior to submittal of the staff report on the application to another decision-making\nbody or prior to final decision if the Director is the final decision-maker. The Director\nshall specify any approved minor modifications and the justifications for such modifications\non the pending development application for which the modifications were sought.\n\n1.4.4.\n  Approval Criteria.\n\nThe Director may approve a minor modification from the terms of this Subchapter only\nupon finding that the modification meets all of the criteria below:\n\nA.\n\nThe requested modification is in general conformity with the stated purposes of this\nSubchapter;\n\nB.\n\nThe requested modification meets all other applicable zoning, building, drainage,\nwater quality, and safety code requirements;\n\nC.\n\nThe requested modification will have no significant adverse impact on the health,\nsafety, or general welfare of surrounding property owners or the general public, or\nsuch impacts will be substantially mitigated; and\n\nD.\n\nThe requested modification is necessary to compensate for some practical difficulty\nor some unusual aspect of the site of the proposed development not shared by landowners\nin general.\n\nSource: Ord. 20060831-068; Ord. 20100408-049; Ord. 20130606-088.\n\n1.5.1.\n  Purpose and Scope.\n\nTo encourage creative and original design, and to accommodate projects where the particular\nsite conditions or the proposed use prevent strict compliance with this Subchapter,\nalternative equivalent compliance allows development to occur in a manner that meets\nthe intent of this Subchapter, yet through an alternative design that does not strictly\nadhere to the Subchapter's standards. The procedure is not a general waiver of regulations.\nAlternative equivalent compliance shall not be used when the desired departure from\nthe standards of this Subchapter could be achieved using the minor modification process\nin Section 1.4.\n\n1.5.2.\n  Applicability.\n\nThe alternative equivalent compliance procedure shall be available only for the following\nsections of this Subchapter:\n\nA.\n\nSection 2.2, Relationship of Buildings to Streets and Walkways;\n\nB.\n\nSection 2.3, Connectivity Between Sites;\n\nC.\n\nSection 2.5, Exterior Lighting;\n\nD.\n\nSection 2.7, Private Common Open Space and Pedestrian Amenities;\n\nE.\n\nSection 2.8, Shade and Shelter; and\n\nF.\n\nArticle 3, Building Design Standards.\n\n1.5.3.\n  Procedure.\n\nThe applicant may select at his or her discretion whether to seek an informal recommendation\nor a formal approval on a proposal for alternative compliance.\n\nA.\n\nOption One: Informal Recommendation.\n\n1.\n\nPre-Application Conference Required. If an applicant desires only an informal response and recommendation as to a proposal\nfor alternative compliance, he or she shall request and attend a pre-application conference\nprior to submitting the site plan and/or building permit application for the development.\nAt the conference, the applicant shall provide a written summary of the project and\nthe proposed alternative compliance, and the Director shall offer an informal, non-binding\nresponse and recommendation regarding the appropriateness of the proposed alternative.\nBased on that response, the applicant may prepare a site plan and/or building permit\napplication that proposes alternative compliance, and such application shall include\nsufficient explanation and justification, in both written and graphic form, for the\nalternative compliance requested.\n\n2.\n\nDecision-Making Responsibility. Final approval of any alternative compliance proposed under this section shall be\nthe responsibility of the decision-making body responsible for deciding upon the application.\nThe final decision-making body for site plans is either the Director or the appropriate\nLand Use Commission, as specified in Chapter 25-5, and the building official for building permits.\n\n3.\n\nDecision by Director. If an Alternative Equivalent Compliance proposal is submitted under this subsection\nthe Director shall review the concept plan for compliance with the criteria in Section\n1.5.4. and shall approve, approve with conditions, or deny the concept plan in writing.\n\nB.\n\nOption Two: Formal Decision.\n\n1.\n\nPre-Application Conference. If an applicant desires formal approval of a proposal for alternative compliance,\nhe or she shall request and attend a pre-application conference prior to submitting\nthe site plan and/or building permit application for the development.\n\n2.\n\nAlternative Compliance Concept Plan Required. At least ten days prior to the pre-application conference, the applicant shall submit\nan alternative compliance concept plan application to the Director, which shall include:\n\na.\n\nA written description of and justification for the proposed alternative method of\ncompliance, specifically addressing the criteria in Section 1.5.4.; and\n\nb.\n\nA concept plan that describes and illustrates, in written and graphic format, the\nintended locations and quantities of proposed buildings on the site, the layout of\nproposed vehicle and pedestrian access and circulation systems, and areas designated\nto meet requirements for open space, parking, on-site amenities, utilities, and landscape.\nThe concept plan shall describe the site's topography and shall provide a general\ndescription of environmental characteristics to assist in determining compliance with\nthis Subchapter. If alternative compliance is requested from the standards of Article\n3, Building Design, the concept plan also shall include descriptions and illustrations\nof the proposed building design elements that would not comply with the standards\nof this Subchapter.\n\n3.\n\nDecision by Director. If an Alternative Equivalent Compliance proposal is submitted under this subsection\nthe Director shall review the concept plan for compliance with the criteria in Section\n1.5.4. and shall approve, approve with conditions, or deny the concept plan in writing.\n\n4.\n\nExpiration of Alternative Compliance Concept Plans.\n\na.\n\nAn approved alternative compliance concept plan shall expire if three years pass following\nits approval and no building permit that implements the concept plan has been issued.\n\nb.\n\nOne, one-year extension may be issued by the Director provided that a written request\nhas been received prior to the expiration of the concept plan, and the Director has\ndetermined that no major changes in the city's development standards, or changes in\nthe development pattern of the surrounding properties, have occurred.\n\n5.\n\nEffect of Approval. Written approval of an alternative compliance concept plan does not authorize any\ndevelopment activity, but rather authorizes the applicant to prepare a site plan and/or\nbuilding permit application that incorporates the approved alternative compliance,\nand authorizes the decision-making body (either the Land Use Commission or the Director\nfor site plans, and the building official for building permits) to review the site\nplan and/or building permit application for compliance with the alternative compliance\nconcept plan, in addition to all other applicable requirements. The site plan and/or\nbuilding permit application shall include a copy of the approved alternative compliance\nconcept plan.\n\n6.\n\nAmendments to Alternative Compliance Concept Plans.\n\na.\n\nMinor amendments to any approved alternative compliance concept plan may be approved,\napproved with conditions, or denied administratively by the Director. For purposes\nof this provision, minor amendments are those that do not result in:\n\n(i)\n\nAn increase of 10 percent or more in the amount of square footage of a land use or\nstructure;\n\n(ii)\n\nA change in the types of uses in the project;\n\n(iii)\n\nAn increase or decrease of 20 percent or more in the number of dwelling units in the\nproject; or\n\n(iv)\n\nA change that would bring the project out of compliance with any requirement or regulation\nset forth in the City Code outside this Subchapter unless a variance to or waiver\nfrom such requirement or regulation is obtained.\n\nb.\n\nAmendments that are not determined by the Director to be minor amendments under subsection\na. above shall be deemed major amendments. The applicant may seek approval of a major\namendment by re-submitting the original approved plan along with the proposed amendment\nto the Director for review in the same manner prescribed in subsection B.2. above.\n\nc.\n\nIf any site plan and/or building permit application includes a major amendment from\nthe terms of the approved concept plan that has not been approved by the Director,\nthe concept plan shall be void and the application shall be reviewed for compliance\nwith the standards of this Subchapter and all other applicable requirements.\n\n1.5.4.\n  Criteria.\n\nAlternative equivalent compliance may be approved only if the applicant demonstrates\nthat the following criteria have been met:\n\nA.\n\nThe proposed alternative achieves the intent of the subject Article of this Subchapter\nfrom which the alternative is sought; or\n\nB.\n\nThe proposed alternative achieves the intent of the subject Article of this Subchapter\nfrom which the alternative is sought to the maximum extent practicable and is necessary\nbecause:\n\n1.\n\nPhysical characteristics unique to the subject site (such as, but not limited to,\nslopes, size, shape, and vegetation) make strict compliance with the subject standard\nimpracticable or unreasonable;\n\n2.\n\nPhysical design characteristics unique to the proposed use or type of use make strict\ncompliance with the subject standard impracticable or unreasonable; or\n\n3.\n\nAn undue financial hardship would be created for a development less than 10,000 square\nfeet without any exterior trademark design feature.\n\n1.5.5.\n  Effect of Approval.\n\nAlternative compliance shall apply only to the specific site for which it is requested\nand shall not establish a precedent for approval of other requests.\n\nSource: Ord. 20060831-068; Ord. 20130606-088.\n\nThe adoption date of this Subchapter is August 31, 2006. The effective date of this\nSubchapter is January 13, 2007.\n\nSource: Ord. 20060831-068; Ord. 20130606-088.\n\nThe standards of Article 2 are intended to use site planning and building orientation\nin order to:\n\n2.1.1.\n\nEnsure that buildings relate appropriately to surrounding developments and streets\nand create a cohesive visual identity and attractive street scene;\n\n2.1.2.\n\nEnsure that site design promotes efficient pedestrian, bicycle and vehicle circulation\npatterns;\n\n2.1.3.\n\nEnsure the creation of a high-quality street and sidewalk environment that is supportive\nof pedestrian, bicycle and transit mobility and that is appropriate to the roadway\ncontext;\n\n2.1.4.\n\nEnsure that trees, sidewalks, and buildings - three of the major elements that make\nup a streetscape - are arranged in a manner that supports the creation of a safe,\nhuman-scaled, and well-defined roadway environment;\n\n2.1.5.\n\nEnsure that trees or man-made shading devices are used to create a pedestrian- and\nbicycle-friendly environment both alongside roadways and connecting roadside sidewalks\nto businesses;\n\n2.1.6.\n\nEnsure that buildings relate appropriately to their roadway context, allowing for\neasy pedestrian access to buildings and providing well-defined edges to the roadway\nenvironment;\n\n2.1.7.\n\nEnsure that building entranceways are convenient to and easily accessible from the\nroadside pedestrian and bicycle system;\n\n2.1.8.\n\nProvide opportunities for roadside uses that enliven and enrich the roadway, bicycle\nand pedestrian environment, such as outdoor dining, porches, patios, and landscape\nfeatures;\n\n2.1.9\n\nEnsure that motor vehicle and bicycle parking is accommodated in a manner that enriches\nand supports, rather than diminishes, the roadside pedestrian and bicycle environment,\nthat does not create a barrier between the roadside environment and the roadside buildings\nand that encourages bicycle use by locating bicycle parking in a visible area; and\n\n2.1.10\n\nEnsure that large sites are developed in a manner that supports and encourages connectivity\nand creates a cohesive visual identity and attractive street scene.\n\nSource: Ord. 20060831-068; Ord. 20130606-088.\n\n2.2.1.\n  Overview of Roadway Types.\n\nA.\n\nPurpose. In this Subchapter, roadway types are used as an organizing tool for certain development\nstandards. In this Section 2.2., sidewalk, building placement, and streetscape standards\nand building entryway location are determined by the roadway type that is adjacent\nto the site. The following five roadway types are listed from highest to lowest priority\nfor purposes of this Subchapter (See Figures 3 - 5 set forth in Exhibit A attached\nto Ord. 20130606-088):\n\n1.\n\nCore Transit Corridor;\n\n2.\n\nInternal Circulation Route;\n\n3.\n\nUrban Roadway;\n\n4.\n\nSuburban Roadway; and\n\n5.\n\nHighway or Hill Country Roadway.\n\nB.\n\nApplicability. The roadway with the highest level of priority adjacent to the lot or site is considered\nthe \"principal street\" for purposes of this Subchapter. For a lot or site that is\nadjacent to more than one roadway of equal priority, the development shall be subject\nto the standards associated with the roadway with the highest level of transit service,\nas determined by the Director, or if the roadways do not have transit service or the\nlevel of transit service is equal, the roadway designated by the lot owner.\n\nFor large sites subject to Section 2.2.5. or for sites abutting more than one roadway\ntype, the Sidewalk and Supplemental Zone requirements (but not the Building Placement\nand Parking requirements) shall apply along all abutting streets or Internal Circulation\nRoute frontages, with the applicable requirements determined by the roadway type.\n\n2.2.2.\n  Core Transit Corridors: Sidewalks and Building Placement.\n\nA.\n\nApplicability. The following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 2.2.2. Core Transit Corridors: Sidewalks and Building Placement | Core Transit Corridor | - All zoning districts   - Single-family residential uses are exempt, in addition to the general exemptions in Section 1.2.4. |\n\n(See Figure 3 set forth in Exhibit A attached to Ord. 20130606-088; Example of a Core Transit Corridor\n(South Congress)\n\n(See Figure 4 set forth in Exhibit A attached to Ord. 20130606-088; Example of an Internal Circulation\nRoute (Midtown Commons)\n\n(See Figure 5 set forth in Exhibit A attached to Ord. 20130606-088; Example of Highway (1-35)\n\nB.\n\nSidewalks. In order to create an environment that is supportive of pedestrian and transit mobility,\npublic sidewalks shall be located along both sides of all Core Transit Corridors in\naccordance with the requirements of this section. Compliance with this section is\nrequired for all sites with frontage along a Core Transit Corridor regardless of principal\nstreet designation or building placement requirements, but a development located on\none side of a street or right-of-way is not required to provide sidewalks on the opposite\nside of the street or right-of-way. A development that complies with the Great Streets\nstandards adopted by Resolution No. 040205-14, as now or hereafter amended, is exempt\nfrom the requirements of this section and may seek any reimbursements available under\nthe Great Streets Development program.\n\nFor development that is subject to the requirements of this section, no sidewalk shall\nbe less than 15 feet in width, unless otherwise approved as part of the Alternative\nEquivalent Compliance process. The 15-foot minimum requirement shall apply regardless\nof the available right-of-way. Where required, the sidewalk shall extend onto private\nproperty to fulfill the 15-foot minimum requirement, with a sidewalk easement provided.\n\nSidewalks shall consist of two zones: a planting zone located adjacent to the curb,\nand a clear zone. (See Figures 6 - 9.) The following standards shall apply to these\nzones:\n\n(See Figure 6 set forth in Exhibit A attached to Ord. 20130606-088; Core transit corridor sidewalk\nrequirements. Street trees are required along core transit corridors with an average\nspacing not greater than 30 feet on center.)\n\n(See Figure 7 set forth in Exhibit A attached to Ord. 20130606-088; Core transit corridor with\nunderground utilities)\n\n(See Figure 8 set forth in Exhibit A attached to Ord. 20130606-088; Core transit corridor with\noverhead utility zone)\n\n(See Figure 9 set forth in Exhibit A attached to Ord. 20130606-088; Core transit corridor with\noverhead utility zone at curb)\n\n1.\n\nPlanting Zone.\n\na.\n\nThe planting zone shall have a minimum width of eight feet (from face of curb) and\nshall be continuous and located adjacent to the curb.\n\nb.\n\nThe zone shall be planted with street trees at an average spacing not greater than\n30 feet on center. The director shall adopt a list of acceptable street trees for\npurposes of this section. The list shall emphasize shade trees; however, alternative\ntrees may only be approved (pursuant to Section 2.2.2.B.3. below) where conflicts\nmay arise because of overhead utility lines.\n\nc.\n\nIn addition, the zone is intended for the placement of street furniture including\nseating, street lights, waste receptacles, fire hydrants, traffic signs, newspaper\nvending boxes, bus shelters, bicycle racks, public utility equipment such as electric\ntransformers and water meters, and similar elements in a manner that does not obstruct\npedestrian access or motorist visibility.\n\n2.\n\nClear Zone. The clear zone shall be a minimum width of seven feet, shall be hardscaped, shall\nbe located adjacent to the planting zone, and shall comply with ADA and Texas Accessibility\nStandards. The clear zone shall be unobstructed by any permanent or nonpermanent element\nfor a minimum width of seven feet and a minimum height of eight feet.\n\n3.\n\nUtilities.\n\na.\n\nAll utility lines shall be underground from the building to the property line. Utility\nlines within the right-of-way shall be placed underground or relocated to the rear\nof the site to the maximum extent practicable.\n\nb.\n\nWhere electric utilities remain overhead and are located behind the curb, an overhead\nutility zone shall be provided so that no portion of the building is located within\na 10-foot radius of the energized conductor. This overhead utility zone shall be in\naddition to the minimum planting zone, clear zone, and supplemental zone (if provided).\nOptions for street tree planting and sidewalk placement in combination with overhead\nutilities are illustrated in Figures 8 and 9.\n\n(See Figures 8 and 9 set forth in Exhibit A attached to Ord. 20130606-088)\n\nc.\n\nOn lots with a depth of 120 feet or less and where electric utilities remain overhead\nand are located behind the curb, alternative trees from the list identified in Section\n2.2.2.B.1.b. above may be used so that the trees can be located beneath, rather than\noffset from, the overhead electric utilities.\n\n4.\n\nAlternative Requirements For Shallow Lots. On lots with a depth of 150 feet or less, the total sidewalk may be reduced to 12\nfeet, consisting of a seven-foot minimum planting zone and a five-foot clear zone.\n\nC.\n\nSupplemental Zone (Optional). A supplemental zone may be provided at the option of the applicant between the street-facing\nfaçade line and the required clear zone. (See Figures 10 - 11.) The following standards\napply to supplemental zones:\n\n(See Figures 10 and 11 set forth in Exhibit A attached to Ord. 20130606-088; Optional supplemental zone\nmay be expanded to 30 feet for a maximum of 30 percent of the frontage.)\n\n1.\n\nIf a supplemental zone is provided, up to 30 percent of the linear frontage of the\nsupplemental zone may be a maximum of 30 feet wide, and the remainder of the supplemental\nzone shall be a maximum of 20 feet wide. (See Figures 10 - 11.)\n\n2.\n\nElements that support active public uses can and should be located Within the supplemental\nzone, including one or more of the following:\n\na.\n\nAccessory outdoor dining, provided that the dining area may be separated from the\nsidewalk only with planters, shrubs, or fencing with a maximum height of 42 inches\n(See Figure 12.);\n\n(See Figure 12 set forth in Exhibit A attached to Ord. 20130606-088; Example of supplemental zone\nwith outdoor dining.)\n\nb.\n\nBalconies, pedestrian walkways, porches, handicap ramps, and stoops; provided, however,\nthat no such feature shall extend beyond the supplemental zone without a license agreement;\n\nc.\n\nTerraces, provided that they have a maximum finished floor height of 24 inches above\nthe sidewalk elevation and shall be surrounded by a guardrail that meets city specifications;\n\nd.\n\nLandscape and water features;\n\ne.\n\nPlazas; and\n\nf.\n\nIncidental display and sales.\n\n3.\n\nOther improvements that support active uses as approved by the Director.\n\n4.\n\nAny features in the supplemental zone must not obstruct the open pedestrian connection\nbetween the building's primary entrance and the clear zone.\n\n5.\n\nA Transit Plaza adjacent to a Capital Metro, MetroRapid Station.\n\nD.\n\nBuilding Placement.\n\n1.\n\nGeneral Building Placement Standard. Notwithstanding the minimum setback requirements of the base zoning districts, at\nleast 75 percent of the net frontage length of the property along the Core Transit\nCorridor must consist of continuous building façade built up to the clear zone, or\nthe supplemental zone if one is provided. (See Figure 13.) For purposes of this Subchapter,\n\"net frontage length\" is defined in Article 5. This minimum net frontage length requirement\nshall not apply if the site qualifies for one of the exceptions in this subsection.\n\n(See Figure 13 set forth in Exhibit A attached to Ord. 20130606-088; Examples of permitted building\nplacement along Core Transit Corridors. Parking is not permitted in the hatched area\nbetween the street-facing façade and the sidewalk.)\n\n2.\n\nException: Civic Buildings. In order to provide greater flexibility to create a distinctive architectural statement,\ncivic buildings, as defined in Article 5, do not have to be built up to the clear\nzone (or supplemental zone if one is provided), so long as parking is not located\nbetween the building frontage facing the principal street and the street. (See Figure\n14.)\n\n(See Figure 14 set forth in Exhibit A attached to Ord. 20130606-088; The Austin City Hall is set\nback from the street in some areas, while other non civic buildings meet the street.\nThis is a traditional urban design technique intended to emphasize the importance\nof civic uses.)\n\n3.\n\nException: Pad-site Building with Drive-In or Drive-Through. A lot or site containing a drive-in\nor drive-through building may include a circulation lane of up to 20 feet in width\nbetween the building and the curb if the site has only one point of access to a public\nroadway. The drive-in or drive-through building located behind the circulation lane\nneed not be built up to the clear zone, but the circulation lane may not have parking\nand must contain an accessible and clearly marked walkway that crosses the circulation\naisle and connects the clear zone to the building's principal entrance. (See Figure\n15.)\n\n(See Figure 15 set forth in Exhibit A attached to Ord. 20130606-088; Drive-through uses serviced\nby a single curb cut do not have to meet the building placement standards in order\nto allow for a circulation lane.)\n\n4.\n\nException: Alternative Equivalent Compliance. If the applicant applies for a modification of\nthis building placement standard through the alternative equivalent compliance procedure\nin Section 1.5 because there will not be enough building frontage to meet the 75 percent\nnet frontage length requirement, the Director may approve an alternative design provided\none of the following is met, in addition to the criteria in Section 1.5.4.:\n\na.\n\nOn a site with a single principal building:\n\n(i)\n\nThe longer side of the building must be built up to the clear zone (or supplemental\nzone if provided) (See Figure 16.), or\n\n(ii)\n\nAt least one side of the building must be built up to the clear zone (or supplemental\nzone if provided) and the majority of the tenant spaces must have principal entrances\nfacing the principal street (See Figure 17.)\n\n(See Figures 16 and 17 set forth in Exhibit A attached to Ord. 20130606-088; Alternative building placement\noptions.)\n\nb.\n\nOn a site with more than one principal building, at least one building must be built\nto the clear zone (or supplemental zone), and:\n\n(i)\n\nThe longer side of any building, any portion of which is within 100 feet of the principal\nstreet, must be built up to the clear zone (or supplemental zone if provided), or\n\n(ii)\n\nAt least one side of any building, any portion of which is within 100 feet of the\nprincipal street, must be built up to the clear zone (or supplemental zone if provided)\nand the majority of tenant spaces in any such building must have principal entrances\nfacing the principal street.\n\n5.\n\nExemption for Restaurant or Service Station Redevelopment. The building placement standards in this subsection do not apply to the redevelopment\nof an existing pad site restaurant or service station use by the owner or buyer if:\n\na.\n\nthe use proposed is a restaurant or service station;\n\nb.\n\nthe redevelopment occurs within the existing site configuration:\n\nc.\n\nsidewalks are provided in compliance with this section.\n\n6.\n\nException: Small Interior Lots. Development on interior lots with 65 feet or less of frontage on the principal street\nand with vehicular access only from the principal street is exempt from the building\nplacement standards of this subsection.\n\nE.\n\nOff-Street Parking.\n\n1.\n\nOff-street parking is prohibited between the Core Transit Corridor and the corresponding\nstreet-facing façade line. (See Figure 18.)\n\n(See Figure 18 set forth in Exhibit A attached to Ord. 20130606-088; Parking to the side of a building\nis permitted but screening is required between the parking and the sidewalk. No parking\nis permitted between the building and the sidewalk on a Core Transit Corridor.)\n\n2.\n\nAny off-street surface parking along a Core Transit Corridor shall have landscape\nbuffering in accord with Section 25-2-1006 of the LDC between the clear zone (or the supplemental zone if provided) and the\nparking area. The buffering method chosen must include shade trees.\n\n2.2.3.\n  Urban Roadways:\n\nSidewalks and Building Placement.\n\nA.\n\nApplicability. The following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 2.2.3. Urban Roadways: Sidewalks and Building Placement | Urban Roadway | All non-residential zoning districts |\n\nB.\n\nPublic sidewalks shall be located along both sides of all Urban Roadways in accordance\nwith the requirements of this section. Compliance with this section is required for\nall sites with frontage along an Urban Roadway regardless of principal street designation\nor building placement requirements, but a development located on one side of a street\nor right-of-way is not required to provide sidewalks on the opposite side of the street\nor right-of-way. A development that complies with the Great Streets standards adopted\nby Resolution No. 040205-14, as now or hereafter amended, is exempt from the requirements\nof this section and may seek any reimbursements available under the Great Streets\nDevelopment program.\n\nFor development that is subject to the requirements of this section, sidewalks shall\nbe no less than 12 feet in width, unless otherwise approved as part of the Alternative\nEquivalent Compliance process. (See Figure 19.) The 12-foot minimum requirement shall\napply regardless of the available right-of-way. Where required, the sidewalk shall\nextend onto private property to fulfill the 12-foot minimum requirement, with a sidewalk\neasement provided.\n\n(See Figure 19 set forth in Exhibit A attached to Ord. 20130606-088; Urban roadway sidewalk width\nrequirements. Note that street trees are optional on urban roadways.)\n\nSidewalks shall consist of two zones: a planting zone located adjacent to the curb,\nand a clear zone. The following standards apply:\n\n1.\n\nPlanting Zone. The planting zone shall have a minimum width of seven feet and shall be continuous\nand located adjacent to the curb. In addition, the planting zone is intended for the\nplacement of street furniture including seating, street lights, waste receptacles,\nfire hydrants, traffic signs, newspaper vending boxes, bus shelters, bicycle racks,\npublic utility equipment such as electric transformers and water meters, and similar\nelements in a manner that does not obstruct pedestrian access or motorist visibility.\n\n2.\n\nClear Zone. The clear zone shall be a minimum width of five feet, shall be hardscaped, shall\nbe located adjacent to the planting zone, and shall comply with ADA and Texas Accessibility\nStandards. The clear zone shall be unobstructed for a minimum width of five feet and\na minimum height of eight feet.\n\n3.\n\nUtilities. The standards for utility placement along core transit corridors shall also apply\nto utility placement along urban roadways. See Section 2.2.2.B.3. (See Figures 20\n- 22.)\n\n(See Figure 20 set forth in Exhibit A attached to Ord. 20130606-088; Underground utilities on an\nUrban Roadway.)\n\n(See Figure 21 set forth in Exhibit A attached to Ord. 20130606-088; Above ground utilities at curb\non an Urban Roadway.)\n\n(See Figure 22 set forth in Exhibit A attached to Ord. 20130606-088; Above ground utilities on an\nUrban Roadway.)\n\nC.\n\nSupplemental Zone (Optional). A supplemental zone may be provided, at the applicant's option, between the street-facing\nfaçade line and the required clear zone. If provided, the supplemental zone shall\nbe a maximum of 20 feet wide and shall comply with the standards above in Section\n2.2.2.C. (See Figure 23.)\n\n(See Figure 23 set forth in Exhibit A attached to Ord. 20130606-088; Urban Roadway with optional\nsupplemental zone.)\n\nD.\n\nBuilding Placement.\n\n1.\n\nNotwithstanding the minimum setback requirements of the base zoning districts, at\nleast 40 percent of the net frontage length along the Urban Roadway must consist of\ncontinuous building façade built up to the clear zone (or supplemental zone if provided).\n(See Figure 24.) Net frontage length is defined in Article 5.\n\n(See Figure 24 set forth in Exhibit A attached to Ord. 20130606-088; Example of building placement\non Urban Roadways. Parking is generally not permitted in the hatched area between\nthe building façade and the sidewalk, except for shallow lots, as described in paragraph\nD.)\n\n2.\n\nException: Pad-site Building with Drive-In or Drive-Through. A lot or site containing a drive-in or drive-through building may include a circulation\nlane of up to 20 feet in width between the building and the curb if the site has only\none point of access to a public roadway. The drive-in or drive-through building located\nbehind the circulation lane need not be built up to the clear zone, but the circulation\nlane may not have parking and must contain an accessible and clearly marked walkway\nthat crosses the circulation aisle and connects to the clear zone to the building's\nprincipal entrance. (See Figure 15.)\n\n(See Figure 15 set forth in Exhibit A attached to Ord. 20130606-088; Drive-through uses serviced\nby a single curb cut do not have to meet the building placement standards in order\nto allow for a circulation lane.)\n\n3.\n\nException: Alternative Equivalent Compliance. If the applicant applies for a modification of this building placement standard through\nthe alternative equivalent compliance procedure in Section 1.5 because there will\nnot be enough building frontage to meet the 40 percent net frontage length requirement,\nthe Director may approve an alternative design provided one of the standards in Section\n2.2.2.D.4. is met, in addition to the criteria in Section 1.5.4.\n\n4.\n\nException: Restaurant or Service Station Redevelopment. The building placement standards in this subsection do not apply to the redevelopment\nof an existing pad site restaurant or service station use by the owner if:\n\na.\n\nthe use proposed is a restaurant or service station;\n\nb.\n\nthe redevelopment occurs within the existing site configuration;\n\nc.\n\nthe sidewalks are provided in compliance with this section.\n\n5.\n\nException: Small Interior Lots. Development on interior lots with 65 feet or less of frontage on the principal street\nand with vehicular access only from the principal street is exempt from the building\nplacement standards of this subsection.\n\nE.\n\nParking. Parking is prohibited between the building(s) and the property line adjacent to the\nUrban Roadway. However, on sites 400 feet deep or less, parking may be located between\nthe street-facing façade line and the Urban Roadway if:\n\n1.\n\nAt least 60 percent of the property's net frontage length along the Urban Roadway\nconsists of continuous building façade (divided into no more than two buildings) (see\nFigure 25), or 40 percent of the net frontage length consists of continuous vertical\nmixed use building façade (divided into no more than two buildings), built up to the\nclear zone (or supplemental zone if provided); and\n\n(See Figure 25 set forth in Exhibit A attached to Ord. 20130606-088; Parking is permitted between\nthe building and the roadway on shallow lots less than 400 feet deep, when certain\nconditions are met.)\n\n2.\n\nAny surface parking along an Urban Roadway shall have landscape buffering in accord\nwith Section 252-1006 of the LDC between the clear zone (or the supplemental zone\nif provided) and the parking area; and\n\n3.\n\nA sidewalk, 4 minimum width, planted with trees at an average spacing not greater\nthan 30 on center or 4 awning, leads to the main customer entrance from the clear\nzone (or supplemental zone if provided). No more than one drive aisle can cross the\nsidewalk. For multi-tenant developments, there must be a shaded sidewalk to the street-facing\nbuilding façade at least every 330 feet of Urban Roadway frontage. (See Figure 26.)\n\n(See Figure 26 set forth in Exhibit A attached to Ord. 20130606-088; Examples of shaded sidewalks.)\n\nF.\n\nCorner Sites. All sites located on a corner and adjacent to at least one Urban Roadway shall comply\nwith the corner-site standards in Section 2.2.4.E.\n\n2.2.4.\n  Suburban Roadways: Sidewalks and Building Placement.\n\nA.\n\nApplicability. The following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 2.2.4. Suburban Roadways: Sidewalks and Building Placement | Suburban Roadway | All non-residential zoning districts (development of any site subject to the internal circulation system requirements in Section 2.2.5.) |\n\nB.\n\nSidewalks. Public sidewalks shall be located along both sides of all Suburban Roadways\nin accordance with the requirements of this section. Compliance with this section\nis required for all sites with frontage along an Suburban Roadway regardless of principal\nstreet designation or building placement requirements, but a development located on\none side of a street or right-of-way is not required to provide sidewalks on the opposite\nside of the street or right-of-way. Sidewalks and supplemental zones shall comply\nwith the standards for sidewalks along Urban Roadways in Section 2.2.3. above.\n\nC.\n\nBuilding Placement.\n\n1.\n\nOn Suburban Roadways, parking is discouraged between the building and the street.\n(See Figure 27.) If the property meets the building placement requirements for Urban\nRoadways as set forth in Section 2.2.3.D. above and no parking is located between\nthe principal street and any street-facing building elevation, the project is exempt\nfrom the connectivity requirements in Section 2.3.1.\n\n(See Figure 27 set forth in Exhibit A attached to Ord. 20130606-088; Parking is discouraged between\nthe building and the street on Suburban Roadways.)\n\n2.\n\nException: Pad-site Building with Drive-In or Drive-Through. A lot or site containing a drive-in or drive-through building may include a circulation\nlane of up to 20 feet in width between the building and the curb if the site has only\none point of access to a public roadway. The drive-in or drive-through building located\nbehind the circulation lane need not be built up to the clear zone, but the circulation\nlane may not have parking and must contain an accessible and clearly marked walkway\nthat crosses the circulation aisle and connects the clear zone to the building's principal\nentrance. (See Figure 15.)\n\n(See Figure 15 set forth in Exhibit A attached to Ord. 20130606-088; Drive-through uses serviced\nby a single curb cut do not have to meet the building placement standards in order\nto allow for a circulation lane.)\n\nD.\n\nParking. Parking along the street frontage must have:\n\n1.\n\nLandscape buffering in accordance with Section 25-2-1006 of the LDC; and\n\n2.\n\nA sidewalk, planted with trees at an average spacing not greater than 30 on center,\nleading to the main customer entrance from the property line. No more than two drive\naisles may cross the sidewalk. For multi-tenant developments, there must be a shaded\nsidewalk for at least every 330 feet of frontage along the suburban roadway frontage.\n\nE.\n\nCorner Sites. For sites located on a corner on Suburban Roadways:\n\n1.\n\nSurface parking is prohibited within the rectangular area formed by the setback lines\nas measured 100 feet back from the curb line corners (or the intersection of the curb\nline tangents), unless (See Figure 28.):\n\n(See Figure 28 set forth in Exhibit A attached to Ord. 20130606-088; Corner Site on a Suburban Roadway\n(shown as \"principal street\"))\n\na.\n\nLandscape buffering between the parking area and the sidewalk is provided in accordance\nwith Section 25-2-1006 of the LDC; and\n\nb.\n\nOne hundred percent of the building frontage that faces the principal street shall\nbe built to the clear zone (or supplemental zone if provided).\n\n2.\n\nThe development may not contain an auto-oriented use unless it meets option a. or\nb. in 2.2.4.E.1. above. For purposes of this provision, auto-oriented uses shall consist\nof the following: any use with a drive-through service facility; automotive rentals;\nautomotive repair services; automotive sales; automotive washing; commercial off-street\nparking; equipment sales; off-site accessory parking; service station; and vehicle\nstorage.\n\n2.2.5.\n  Internal Circulation Routes: Sidewalks and Building Placement Requirements for Large\nSites.\n\nA.\n\nApplicability. The following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 2.2.5. Internal Circulation Routes: Sidewalks and Building Placement Requirements for Large Sites | Development of a site five acres or larger with frontage on a Core Transit Corridor or Urban Roadway | - All zoning districts   - See additional exemptions in Subsection C of this section. |\n| Development of a site five acres or larger with frontage on a Suburban Roadway, Highway, or Hill Country Roadway | - All non- residential zoning districts   - See additional exemptions in subsection C and I of this section |\n\nB.\n\nInternal Circulation Route. An Internal Circulation Route that establishes blocks and forms an interconnected,\ngrid-like transportation system must be provided for development subject to this section.\n(See Figure 29.) An Internal Circulation Route must comply with the requirements of\nthis subsection and should provide a safe and enjoyable walking environment overlooked\nby buildings that offer natural surveillance and contact from their occupants/users.\n\n(See Figure 29 set forth in Exhibit A attached to Ord. 20130606-088; Example Internal Circulation\nRoute system, blocks must not exceed 5 acres.)\n\nC.\n\nBlock Standards.\n\n1.\n\nMaximum Block Size. Unless exempted by this subsection, a site shall be divided into internal blocks\nno larger than 5 acres. The maximum length of any block face, as measured from intersection\nto intersection, shall be 800 feet.\n\n2.\n\nExemptions from Maximum Block Size.\n\na.\n\nSites Over 15 Acres. On sites 15 acres or larger, the site may contain one block with a maximum area of\n10 acres for each 30 acres (i.e., one 10-acre block on a site of between 15 to 30\nacres, two 10-acre blocks on a site of between 30 to 60 acres, etc.). The maximum\nlength of any block face, as measured from intersection to intersection shall be 800\nfeet.\n\nb.\n\nOffice Sites in Drinking Water Protection Zone or Water Supply Watershed. The maximum block length standard does not apply to any site in the Drinking Water\nProtection Zone or a Water Supply Watershed designated as a neighborhood office (NO),\nlimited office (LP), or general office (GO) district.\n\nc.\n\nSites on a Hill Country Roadway. Compliance with this Subsection is not required for the block front adjacent to a\nHill Country Roadway to be divided in a manner inconsistent with Chapter 25-6, Article 6, Division 2 (Access to Hill Country Roadways) or state highway access spacing requirements.\n\n3.\n\nSubdivision of Internal Blocks. Internal blocks abutting Internal Circulation Routes may be subdivided to allow for\nthe sale and development of individual blocks without frontage on a public street\nif the Director determines that the Internal Circulation Routes are equivalent to\na public street in terms of utilities, pavement design, and vehicle access requirements.\nFor the purpose of compliance with setback and minimum lot frontage requirements,\nan Internal Circulation Route is considered equivalent to a public street.\n\nD.\n\nProject Circulation Plan.\n\n1.\n\nPlan Requirements.\n\na.\n\nA Project Circulation Plan depicting Internal Circulation Routes required by this\nsection must be submitted with a site plan application for an area of 5 acres or larger.\n\nb.\n\nThe Project Circulation Plan must demonstrate that the project:\n\n(i)\n\nmeets the applicable requirements of this section and Section 2.3 (Connectivity) of this Subchapter;\n\n(ii)\n\nintegrates with existing and planned streets, bicycle and pedestrian facilities, and\ntrails in the surrounding area; and\n\n(iii)\n\nis consistent with area mobility goals, as contained in the Transportation Plan or\nan approved collector plan.\n\n2.\n\nDirector Approval.\n\na.\n\nA Project Circulation Plan must be reviewed and approved by the director under the\nrequirements of this section.\n\nb.\n\nThe Director may approve a Project Circulation Plan containing blocks bounded by railroad\nright-of-way, subdivision boundary lines, or natural features if no reasonable alternatives\nare available.\n\nc.\n\nRevisions to the Project Circulation Plan may be approved by the Director after considering\nthe circulation characteristics of a proposed development plan, the need for access\nto adjoining properties, and the compatibility of surrounding development.\n\nd.\n\nThe Director may waive the requirement for a Project Circulation Plan if the Director\nfinds that a plan is not necessary due to the nature of the proposed development on\nthe site, the existence of surrounding incompatible development, or other factors\nunique to the property which make strict compliance infeasible.\n\nE.\n\nSidewalks.\n\n1.\n\nSidewalk Requirements.\n\na.\n\nPublicly accessible sidewalks shall be provided along both sides of all Internal Circulation\nRoutes (whether built as public streets or as private drives) unless:\n\n(i)\n\nno buildable area exists on one side.\n\nb.\n\nOn portions of the Internal Circulation Route with building frontage the sidewalks\nand supplemental zones shall:\n\n(i)\n\ncomply with the applicable standards for Urban Roadways, as provided in Section 2.2.3\n(Urban Roadways: Sidewalk and Building Placement), and\n\n(ii)\n\nThe planting zone shall be planted with street trees at an average spacing not greater\nthan 30 feet on center. (See Figure 30.)\n\nc.\n\nOn portions of the Internal Circulation Route that do not contain building frontage\na five-foot unobstructed sidewalk shall be provided, all of which shall be located\nwithin 12 feet of the curb. (See Figure 30.)\n\n(See Figure 30 set forth in Exhibit A attached to Ord. 20130606-088; Required sidewalks on Internal\nCirculation Routes)\n\n2.\n\nImpervious Cover Credit.\n\na.\n\nA project subject to the requirements of this section that is located outside the\nBarton Springs Zone may exceed watershed impervious cover limits by up to five percent\nif the excess impervious cover is attributable to sidewalks.\n\nb.\n\nSidewalks or curbs that cause a project to exceed watershed impervious cover limits\nas allowed under this subsection may not exceed 15 feet in width and must be treated\nin accordance with current water quality standards and constructed with porous concrete\nor other materials approved by the Director under Section 2.2.2. (Core Transit Corridors: Sidewalks and Building Placement).\n\nF.\n\nBuilding Placement.\n\n1.\n\nOrientation of Building Frontage. Except as otherwise provided in this Section each building must be oriented along\neither an Internal Circulation Route or the adjacent public roadway of the highest\npriority. Each building must meet the building placement standards of the roadway\nto which it is oriented.\n\n2.\n\nBuilding Placement Along an Internal Circulation Route. The following standards apply where required building frontage is provided along\nan Internal Circulation Route:\n\na.\n\nOn a site with a single principal building:\n\n(i)\n\nThe longer side of the building must be built up to the clear zone (or supplemental\nzone if provided), or\n\n(ii)\n\nAt least one side of the building must be built up to the clear zone (or supplemental\nzone if provided) and the majority of the tenant spaces must have principal entrances\nfacing the Internal Circulation Route.\n\nb.\n\nOn a site with more than one principal building:\n\n(i)\n\nThe longer side of any building, any portion of which is within 100 feet of the Internal\nCirculation Route, must be built up to the clear zone (or supplemental zone if provided),\nor\n\n(ii)\n\nAt least one side of any building, any portion of which is within 100 feet of the\nInternal Circulation Route, must be built up to the clear zone (or supplemental zone\nif provided) and the majority of tenant spaces in any such building must have principal\nentrances facing the Internal Circulation Route.\n\nG.\n\nParking.\n\n1.\n\nOff-street parking is prohibited between the Internal Circulation Route and the corresponding\nstreet-facing façade line.\n\n2.\n\nOn-street parallel, head-in angle, and reverse angle parking are allowed on an Internal\nCirculation Route, subject to compliance with fire access standards, and, if the Internal\nCirculation Route is a public street, subject to approval of the Director of Public\nWorks based on administrative criteria to be adopted. If the Internal Circulation\nRoute is intended to accommodate bicycles, head-in and angle parking is not permitted.\n\nH.\n\nJoint Access. If necessary to ensure access to the Internal Circulation Route by the general public\nand transit vehicles, the director may require joint use driveways within the site\nto adjacent properties.\n\nI.\n\nOn a suburban roadway, a residential only use on a site over 5 acres is exempt from\nSections 2.2.5.A-G and must comply with the following:\n\n1.\n\nSidewalks or pedestrian paths are required to connect all buildings and all amenities;\nand\n\n2.\n\nInternal circulation for vehicular connectivity is required. No internal block shall\nexceed a perimeter measurement of 2,700 linear feet.\n\nSource: Ord. 20060831-068; Ord. 20100408-049; Ord. 20121018-024; Ord. 20130606-088.\n\n2.3.1.\n  Improvements to Encourage Pedestrian, Bicycle, and Vehicular Connectivity.\n\nA.\n\nApplicability. The following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 2.3.1. Improvements to Encourage Pedestrian, Bicycle, and Vehicular Connectivity | All roadway types | - Projects with a net site area of three acres or more in all nonresidential zoning districts   - Projects with a net site area of less than three acres that have parking between the building and the principal street in all zoning districts |\n\nB.\n\nStandards.\n\n1.\n\nVehicular and Pedestrian Connections Between Sites. All sites or developments subject to this section shall:\n\na.\n\nProvide private drive or public street connections to existing private drives or public\nstreets on adjacent sites, or stub-outs if connections are not feasible; and\n\nb.\n\nWhere a public street is adjacent to the property line, provide direct pedestrian\nand bicycle access from that street to a customer entrance. The pedestrian and bicycle\naccess points must be fully accessible during operating hours. (See Figure 31.)\n\n(See Figure 31 set forth in Exhibit A attached to Ord. 20130606-088; Example of a pedestrian/bicycle\nconnection from sidewalk to building entrance.)\n\n2.\n\nAdditional Measures to Improve Connectivity. All sites or developments subject to this section shall select and comply with at\nleast two of the options in Table B below. However, if a site or development provides\nsurface parking that amounts to more than 125 percent of the parking previously required\nin Appendix A (Tables of Off-Street Loading Requirements and Former Off-Street Parking Requirements) to Chapter 25-6 (Transportation), the site or development must select and comply with at least three of the options\nin Table B below.\n\n| TABLE B: ADDITIONAL MEASURES TO IMPROVE CONNECTIVITY | |\n| --- | --- |\n| Option | Description/Comments |\n| Provide additional pedestrian connections from on-site buildings to adjacent streets. | Pedestrian connections must be edged by curb, except where connections cross drive aisles, and should be evenly spaced. One point per pedestrian connection. |\n| Provide pedestrian and bicycle connections from adjacent parkland. | Where public parkland is adjacent to the property line, provide pedestrian and bicycle access from the trail or walkway system on that parkland to the building entrance. The pedestrian and bicycle access points must be fully accessible during operating hours and shall meet city standards for pedestrian and bike ways. |\n| Provide solar power shading devices in parking lots. | Devices shall comply with requirements of administrative rules on this subject. |\n| Provide pedestrian and bicycle connection to adjacent residential development. | If there is a residential development adjacent to the site, provide a pedestrian and bicycle connection to the property line, and to an existing pathway if one is present on the adjacent site. Compliance with this option also may include providing a sidewalk that connects the project site to an adjacent residential development and that runs along a public roadway where no sidewalk currently exists or where the existing sidewalk does not meet the width standards in this Subchapter. |\n| Exceed applicable sidewalk standards by constructing a sidewalk along a public street frontage to Core Transit Corridor standards. | Sidewalks along an ICR may not be used to satisfy this standard. |\n| Provide a public access easement for the construction of a multi-use trail connecting to or proposed in the City of Austin Trails Master Plan, Austin Parks and Recreation Lone-Range Plan, Sidewalk Master Plan or Bicycle Path. | Requires approval of the Director of Public Works. |\n| Incorporate a transit stop into the project. | Review and approval of Capital Metro, or transit provider required. |\n| Internal utility lines should be located in drive aisles or Internal Circulation Routes, rather than under parking areas. | Do not locate utility lines beneath surface parking areas. |\n| Limit curb cuts. | Connections between site and adjacent arterials and highways occur no more frequently than every 330 feet. |\n| At least 10% of the provided parking is underground or within a parking structure. |  |\n| Enhance physical fitness opportunities and multi-modal connectivity by providing shower and locker facilities for employees and increase required bicycle parking by 10%. | To comply with this option, the site must meet the shower requirements of LDC Subsection 25-6-477(H). |\n| Provide secure indoor bicycle storage in building or parking structure. |  |\n| For sites with a single building, provide shaded sidewalks along 100% of building facing the principal street. |  |\n| Provide shaded sidewalks along 100% of all publicly visible building façades. |  |\n| Other options as approved by the Director. |  |\n\nSource: Ord. 20060831-068; Ord. 20130606-088; Ord. 20131017-046; Ord. No. 20231102-028, Pt. 28, 11-13-23; Ord. No. 20240201-035, Pt. 1, 2-12-24.\n\nA.\n\nApplicability. The following table summarizes the applicability of this section:\n\n|  |  |  |\n| --- | --- | --- |\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| 2.4.: Building Entryways | Core Transit Corridor | All zoning districts |\n| - Urban Roadway   - Suburban Roadway   - Internal Circulation Route   - Highway   - Hill Country Roadway districts | All non-residential zoning |\n\nB.\n\nStandards.\n\n1.\n\nAt least one customer entrance must face and connect directly to the roadway or Internal\nCirculation Route where building frontage is provided consistent with the requirements\nof this Subchapter. A building entrance is not required under this subsection if the\nfollowing requirements are met (See Figure 32.):\n\n(See Figure 32 set forth in Exhibit A attached to Ord. 20130606-088; Requirements for a principal\nentrance that does not face the principal street.)\n\na.\n\nAt least 80 percent of the net frontage length along the principal street must consist\nof continuous building façade that is built up to the clear zone (or supplemental\nzone if provided) regardless of the applicable building frontage requirements of Sections\n2.2.2 through 2.2.5;\n\nb.\n\nThe building must have a continuous shaded sidewalk linking the principal street and\nthe building's principal entrance;\n\nc.\n\nThe entrance must be less than 100 feet from the street-facing façade line of the\nbuilding; and\n\nd.\n\nA row of shade trees between the building and the parking area must be provided at\nan average spacing not greater than 30 feet on center.\n\n2.\n\nBuilding entrances should be located at intervals of no more than 75 feet along the\nelevation facing the principal street. If building entrances are located more than\n75 feet apart (or there is a single entrance point on a façade greater than 150 feet\nin length), the areas between the entrances (or from pedestrian-friendliness of the\nbuilding along the principal street. (See Figure 33.)\n\n(See Figure 33 set forth in Exhibit A attached to Ord. 20130606-088)\n\n3.\n\nIn no case shall this section require orienting building entryway toward a street\nwith zoning of SF6 or lesser density.\n\nSource: Ord. 20130606-088.\n\n2.5.1.\n  Applicability.\n\nThe following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 2.5: Exterior Lighting | All roadway types | All zoning districts |\n\n2.5.2.\n  Standards.\n\nA.\n\nSubmission of Plans and Evidence of Compliance. Building plan applications shall include a description of all lighting fixtures,\nboth proposed and those that will remain on the site, as well as any existing or proposed\nfixtures to be located in adjacent right-of-ways after completion of the project.\nFor new fixtures, the description may include, but is not limited to, catalog cuts\nand illustrations by manufacturers (including sections where required), that demonstrate\ncompliance with the standards of this Subchapter.\n\nB.\n\nFully Shielded or Full Cut-off Light Fixtures Required. The following outdoor lighting applications shall be illuminated by fixtures that\nare either fully-shielded or full cut-off: (See Figure 34.)\n\n(See Figure 34 set forth in Exhibit A attached to Ord. 20130606-088; Examples of fully-shielded\nlight fixtures.)\n\n1.\n\nPublic street and pedestrian lighting;\n\n2.\n\nParking lots;\n\n3.\n\nPathways;\n\n4.\n\nRecreational areas;\n\n5.\n\nBillboards;\n\n6.\n\nProduct display area lighting; and\n\n7.\n\nBuilding overhangs and open canopies.\n\nC.\n\nLighting of Building Façades.\n\n1.\n\nBuildings and structures shall be illuminated by fixtures that are either fully-shielded\nor full cut-off and may only be used to highlight specific architectural features.\nHowever, existing building mounted fixtures that are not fully-shielded or full cut-off\nmay be replaced with lighting that is fully-shielded or full cut-off. This provision\nshall not apply to buildings in the downtown that are at least 120 feet tall, so long\nas such buildings contain no trademarked design features (not including signage) located\nover 120 feet above ground level.\n\nD.\n\nDirectional Luminaires. Directional luminaires that are not fully-shielded or full cut-off may be used to\nilluminate signs and flagpoles. Such luminaires shall be installed and aimed so that\nthey illuminate only the specific object or area and do not shine directly onto neighboring\nproperties, roadways, or distribute excessive light skyward.\n\nE.\n\nLamp or Fixture Substitution. Should any outdoor light fixture or the type of light source therein be changed after\nsite plan or building plan approval has been granted, a change request must be submitted\nto the Director for approval, together with adequate information to assure compliance\nwith this Subchapter, which must be received prior to substitution.\n\nSource: Ord. 20060831-068; Ord. 20130606-088.\n\n2.6.1.\n  Applicability.\n\nThe following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 2.6. Screening of Equipment and Utilities | All roadway types | - All non-residential zoning districts - The following uses are exempt, in addition to the general exemptions of Section 1.2.4.: local utilities services use, electric service transformers within the right-of-way, telecommunication towers |\n\n2.6.2.\n  Standards.\n\nAll development subject to this section shall comply with the following requirements:\n\nA.\n\nSolid waste collection areas and mechanical equipment, including equipment located\non a rooftop but not including solar panels, shall be screened from the view of a\nperson standing on the property line on the far side of an adjacent public street.\n(See Figure 35.)\n\n(See Figure 35 set forth in Exhibit A attached to Ord. 20130606-088; Screening of mechanical equipment.)\n\nB.\n\nLoading docks, truck parking, outdoor storage, trash collection, trash compaction,\nand other service functions shall be incorporated into the overall design of the building\nand landscape so that the visual impacts of these functions are fully contained and\nout of view from adjacent properties and public streets. Screening materials for solid\nwaste collection and loading areas shall be the same as, or of equal quality to, the\nmaterials used for the principal building. In the downtown, loading docks, truck parking,\noutdoor storage, trash collection, trash compaction, and other service functions may\nbe placed alongside public alleys without the necessity of screening.\n\nSource: Ord. 20060831-068; Ord. 20130606-088.\n\n2.7.1.\n  Purpose.\n\nOpen air and semi-enclosed public gathering spaces can act as central organizing elements\nin a large development. They can also help to shape the relationship between different\nland uses and provide focal points and anchors for pedestrian activity. Goals and\nrequirements for common open space and pedestrian amenities complement the Austin\nCode's requirements for dedicated public open space and parks, and serve similar purposes.\n\n2.7.2.\n  Applicability.\n\nThe following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 2.7. Private Common Open Space and Pedestrian Amenities | All roadway types | All site plans two acres in size or larger, and all multifamily and condominium uses except as provided in 25-2-776 and 25-2-780 |\n\n2.7.3.\n  Standards.\n\nA.\n\nAmenity Required. All development subject to this section shall devote a minimum of five percent of\nthe gross site area to one or more of the following types of private common open space\nor pedestrian amenities:\n\n1.\n\nA natural and undeveloped private common open space, for use of the residents, employees,\nand visitors to the development.\n\n2.\n\nA landscape area other than one required by Subchapter C, Article 9 (Landscaping),\nprovided such landscaped area has a minimum depth and width of 20 feet and a minimum\ntotal area of 650 square feet. The area shall include pedestrian amenities.\n\n3.\n\nA patio or plaza with outdoor seating areas, provided the patio or plaza has a minimum\ndepth and width of 20 feet and a minimum total area of 650 square feet. The area shall\ninclude pedestrian amenities including fully or partially shaded spaces with flexible\nor permanent seating to support these places as gathering areas.\n\n4.\n\nA play area with amenities or equipment suitable for children under nine years of\nage, provided the play area has a minimum depth and width of 20 feet and a minimum\ntotal area of 650 square feet. Play areas shall comply with the most current Consumer\nProduct Safety Commission guidelines for playgrounds as well as ASTM International\nstandards as applicable and shall have impediments between the activity area and any\nnearby vehicular drives or parking areas to minimize the opportunities for young children\nto wander into traffic. Such impediments may include berms, fencing, landscaping or\nother barriers as appropriate to the site and which meet safety standards. Play areas\nshall include partially-shaded areas with flexible or permanent seating for adult\nsupervision. A project which chooses this option may reduce the total amount of open\nspace required by 10 percent.\n\n5.\n\nSpaces that provide educational, historic, or cultural features, or sensory experiences,\nsuch as culinary, therapeutic or sculptural gardens; soundscapes, and interactive\nwater features.\n\n6.\n\nSwimming pools, wading pools, or splash pads.\n\n7.\n\nWater quality and storm water detention ponds designed as an amenity and approved\nby the Director.\n\n8.\n\nA multi-use trail connecting to or proposed in the City of Austin Trails Master Plan,\nAustin Parks and Recreation Long-Range Plan, Sidewalk Master Plan, or Bicycle Plan,\nor other trail connections as approved by the Director.\n\n9.\n\nBasketball, tennis, volleyball, or other sport courts or playing fields.\n\n10.\n\nA transit plaza, on private property, that is adjacent to a Capital Metro MetroRapid\nstop or station.\n\n11.\n\nA combination of the above-listed amenities. (See Figure 36.)\n\n(See Figure 36 set forth in Exhibit A attached to Ord. 20130606-088; Examples of open space amenities.)\n\nB.\n\nLocation Criteria. To the maximum extent feasible, where significant natural and scenic resource assets\nexist on a property, the developer shall give priority to their preservation as private\ncommon open space. In reviewing the proposed location of private common open space\nareas, the Director shall use all applicable plans, maps, and reports to determine\nwhether significant resources exist on a proposed site that should be protected, with\npriority being given to the following areas (which are not listed in a particular\norder):\n\n1.\n\nWetlands;\n\n2.\n\nFlood hazard areas;\n\n3.\n\nLakes, rivers, and stream/riparian corridors;\n\n4.\n\nTree preservation areas (See Figure 37.);\n\n(See Figure 37 set forth in Exhibit A attached to Ord. 20130606-088; Example of tree preservation\nduring construction.)\n\n5.\n\nKarst areas;\n\n6.\n\nCultural or historically significant structures, landscapes, features, and/or places;\nand\n\n7.\n\nAgricultural lands used for cultivation of local produce.\n\nWhere private common open space areas, trails, parks, or other public spaces exist\nor are proposed in the City of Austin Trails Master Plan, Austin Parks and Recreation\nLong-Range Plan, Sidewalk Master Plan, or Bicycle Plan within or adjacent to the tract\nto be subdivided or developed, the private common open space or pedestrian amenity\nshall, to the maximum extent feasible, be located to adjoin, extend, and enlarge the\npresently existing or proposed trail, park, or other open area land. Public access\neasements may be required in order to guarantee public access to these facilities.\n\nWhere there is a BRT station adjacent to the tract to be developed, a portion of the\nprivate common open space or pedestrian amenity shall, to the maximum extent feasible,\nbe located to adjoin, extend, and enlarge the presently existing or permitted station.\nFor sites greater than one acre, the open space should be a minimum of 150 s.f. plus\nan additional 100 s.f. per acre over one, not to exceed 1,000 s.f. This will apply\nonly outside the Central Business District (CBD) and downtown-mixed-use (DMU) zoning.\n\nC.\n\nAreas Not Credited. Lands within the following areas shall not be counted towards private common open\nspace or pedestrian amenities required by this section:\n\n1.\n\nOpen space in a required street yard;\n\n2.\n\nPublic or private streets or rights of way;\n\n3.\n\nOff-street parking, loading areas, driveways, and service areas; and\n\n4.\n\nWater quality and storm water detention ponds, unless designed as an accessible amenity\nand approved by the Director.\n\nD.\n\nDesign Criteria. Land set aside for private common open space or pedestrian amenities pursuant to\nthis section shall meet the following design criteria, as relevant:\n\n1.\n\nCommon open space areas shall be located so as to be readily accessible and useable\nby residents or visitors in various locations of the development, unless the lands\nare sensitive natural resources and access should be restricted.\n\n2.\n\nOpen space areas shall be compact and contiguous unless the open space is used as\na continuation of an existing trail, or specific or unique topographic features that\nare adjacent or adjoining require a different configuration. An example of such topographic\nfeatures would be the provision of a trail or private open area along a riparian corridor.\n\n3.\n\nThe surface of a required open space must be suitable for outdoor activities. A surface\nmust consist of lawn, garden, flagstone, wood planking, concrete, or other serviceable,\ndust free material. Asphalt or similar surfacing may be used for designated recreation\nareas such as multi-purpose trails, tennis courts, and basketball courts. Decomposed\ngranite may be used if approved by the Director and if accessibility requirements\nare met. A combination of different materials is encouraged.\n\n4.\n\nExcept as provided in this subsection, not more than 30 percent of the required open\nspace may be located on a roof, balcony, or other area above ground level. In determining\nthe amount of open space on a roof, an area occupied by a vent, mechanical equipment\nor structure that does not enhance the usability of the space is excluded.\n\n5.\n\nUp to 50 percent of the required private common open space may be located on a roof,\nbalcony, or other area above ground level if at least 50 percent of the open space\nabove ground level is designed as a Vegetated or Green Roof. For the purpose of this\nsection, a Vegetated or Green Roof is an assembly or system, over an occupied space,\nthat supports an area of planted bed(s), built up on a waterproofed surface at any\nlevel that is contained separately from the natural ground by a human-made structure.\nA Vegetated or Green Roof must comply with the performance standards adopted by rule.\n\n6.\n\nPrivate common open space on a roof, balcony, or other area above ground level must\nbe screened from the view of adjacent property that is in an urban residence (SF-5)\nor more restrictive zoning district, in accordance with the standards in Section 25-2-1066\n(Screening Requirements).\n\n7.\n\nA project which allows public access during normal business hours to a private common\nopen space above ground level may reduce the total amount of open space required by\n10 percent.\n\n8.\n\nThis subsection provides for the covering of a required open space.\n\n(a.)\n\nNot more than 50 percent of ground level open space may be covered by a fixed manmade\nobstruction, including a roof, balcony, or building projection. Roof gardens and sculptural\nelements that are accessible to the public are not to be considered manmade obstructions.\n\n(b.)\n\nOpen space above ground level may be covered, but must have at least one exterior\nside open and unobstructed, except for railings or balustrades.\n\n9.\n\nIn VMU and V zoning districts, streetscape improvements within the public right-of-way\nmay be included in the calculation of open space except for the area within the Clear\nZone as defined in this Subchapter. This provision does not apply to streetscape projects\nfor which the City participates in the cost of the improvements or which are required\nto be constructed as a condition of CURE zoning.\n\nE.\n\nMaintenance. All private common open space or pedestrian amenity areas shall be permanently maintained\nby the owners of the development.\n\nF.\n\nFee In Lieu.\n\n1.\n\nInstead of providing private common open space or pedestrian amenities as required\nin this section, the developer of a property located within the urban roadways boundary\n(as defined in Article 5 of this Subchapter) may request approval to deposit with\nthe city a nonrefundable cash payment to be used for the acquisition or improvement\nof open space that will serve residents of the development.\n\n2.\n\nThe criteria for approving payment of a fee and the formula for calculating the fee\namount shall be adopted by the city council, with a recommendation from the Director.\n\n3.\n\nThe Director shall review a request for payment of a fee based on the adopted criteria\nand accept or deny the request no later than 15 days following its receipt.\n\nSource: Ord. 20060831-068; Ord. 20111215-096; Ord. 20130606-088.\n\n2.8.1.\n  Purpose.\n\nAustin's climate requires shade and shelter amenities in order to accommodate and\npromote pedestrian activity. These amenities will provide greater connectivity between\nsites and allow for a more continuous and walkable network of buildings.\n\n2.8.2.\n  Applicability.\n\nThe following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 2.8. Shade and Shelter | All roadway types | - Development of any nonresidential land use except for congregate care facilities zoned MF for which the principle street is not a Core Transit Corridor   - This section applies to any building frontage. Building façades facing loading areas, rear service areas, or façades adjoining other buildings (attached to more than 50 percent of the sidewall) are exempt. |\n\nA.\n\nStandards. Projects subject to this section shall meet the following shade and shelter\nrequirements:\n\n1.\n\nA shaded sidewalk must be provided alongside at least 50 percent of:\n\na.\n\nthe roadway or Internal Circulation Route where building frontage is provided under\nthe requirements of this Subchapter; and\n\nb.\n\nany parking adjacent to the building.\n\n2.\n\nWhen adjacent to parking, the shaded sidewalk shall be raised above the level of the\nparking by way of a defined edge. ADA ramps alongside the building must also be shaded.\n(See Figure 38.)\n\n(See Figure 38 set forth in Exhibit A attached to Ord. 20130606-088; Example of an ADA ramp with\nshade structure.)\n\n3.\n\nA shaded sidewalk must meet the following requirements:\n\na.\n\nAlong a roadway or Internal Circulation Route where building frontage is provided\na shaded sidewalk shall comply with the applicable sidewalk standards for that roadway\ntype. If not otherwise required, the shaded sidewalk shall provide trees planted no\nmore than 30 feet on center or a 4′ awning.\n\nb.\n\nAlong any parking adjacent to the building the shaded sidewalk shall consist of a\nminimum 5 foot clear zone and 5 foot planting zone, planted with trees no more than\n30 feet on center, or a 5 foot clear zone with a minimum 5 foot wide weather protection.\n\n4.\n\nBuilding entrances and exits, other than those used solely for emergency purposes\nor for deliveries, shall be located under a shade device such as an awning or portico.\n\nSource: Ord. 20130606-088.\n\nThese building design standards are intended to:\n\n3.1.1.\n\nStrengthen Austin's unique character and help buildings to better function in Austin's\nenvironment;\n\n3.1.2.\n\nCreate buildings with appropriate human scale;\n\n3.1.3.\n\nEnsure that buildings contribute to the creation of a pedestrian-friendly environment\nthrough the provision of glazing, shading, and shelter at the pedestrian level;\n\n3.1.4.\n\nLessen the impact of branded architecture that does not speak to the city's unique\ncharacter and conditions; and\n\n3.1.5.\n\nIncrease the quality, adaptability, and sustainability in Austin's building stock.\n\nSource: Ord. 20060831-068; Ord. 20130606-088.\n\n3.2.1.\n  Applicability.\n\nThe following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 3.2. Glazing and Façade Relief Requirements | All roadway types | - Development of any non-residential land use, except for congregate care facilities zoned MF for which the principal street is not a Core Transit Corridor   - Religious Assembly use shall be exempt from glazing requirements. |\n\n3.2.2.\n  Glazing and Façade Relief on Building Façades.\n\nGlazing provides interest for pedestrians, connects the building exterior and interior,\nputs eyes on the street, promotes reusability, and provides a human-scale element\non building façades. Projects subject to this section shall meet the following minimum\nrequirements, but may provide additional glazing and façade relief beyond what is\nrequired under this section. Refer to Article 5 for definitions of Glazing and Façade\nRelief.\n\nA.\n\nOn the façade facing the roadway or Internal Circulation Route where building frontage\nis provided under the requirements of this Subchapter:\n\n1.\n\n40 percent of the wall area below ten feet as measured from the finish floor level\nof this façade's entry shall consist of glazing unless topography, distance or other\nphysical characteristics remove the façade from a close physical connection to the\nroadway or Internal Circulation Route (See Figure 39.); and\n\n(See Figure 39 set forth in Exhibit A attached to Ord. 20130606-088; Glazing and façade relief requirements)\n\n2.\n\n25 percent of the wall area between ten feet and thirty feet as measured from the\nfinish floor level of this façade's entry shall consist of glazing. (See Figure 39.)\n\nB.\n\nOne façade shall be exempt from glazing and façade relief requirements. The exempt\nfaçade cannot face a public street or Internal Circulation Route.\n\nC.\n\nOn all other façades, at least 25 percent of the wall area between two and ten feet\nas measured from the finish floor level of this façade's entry must consist of glazing\nor façade relief unless vegetative screening, which must be evergreen, is allowed\nif approved by the Director, and may not be used as glazing option on front-facing\nfaçade.\n\nD.\n\nAny façade that is built up to an interior mid-block property line is not required\nto have glazing on that façade if no prohibitions and no contractual or legal impediments\nexist that would prevent a building being constructed on the adjacent property up\nto the wall of the façade.\n\nE.\n\nAt least one-half of the total area of all glazing on façades that face the principal\nstreet shall have a Visible Transmittance (VT) of 0.6 or higher.\n\nF.\n\nThe requirements in this section may be reduced to the extent that the required level\nor location of glazing conflicts with the standards of the Adopted Energy Code, Building\nCode, LEED, or the Green Building Program.\n\nSource: Ord. 20060831-068; Ord. 20100408-049; Ord. 20121018-024; Ord. 20130606-088.\n\n3.3.1.\n  Applicability.\n\nThe following table summarizes the applicability of this section:\n\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| --- | --- | --- |\n| 3.3. Options to Improve Building Design | All roadway types | - Development of any commercial use of 10,000 square feet or more that requires a building permit   - Development of any commercial use of less than 10,000 square feet that contains any exterior trademarked design feature   - Any building zoned for industrial use or warehouse use at the point its use is converted to commercial   - VMU buildings with external trademarked design features (not including signs)   - Office development is exempt from this section |\n\n3.3.2.\n  Building Design Options.\n\nA.\n\nGeneral Requirement.\n\n1.\n\nEach building subject to this section must earn one base point from Table C below,\nand may be required to earn additional points if certain design features are present.\n\n2.\n\nDevelopments with multiple buildings are required to earn the applicable number of\npoints for each building. Points may be aggregated among buildings only if the development\ncontains at least 100 lineal feet of VMU building frontage along the principal street.\n\nB.\n\nAdditional Requirements for Certain Types of Development. The following shall earn points as specified below, in addition to the base point\nrequired in this section. Points in this section shall be earned cumulatively.\n\n1.\n\nA building with exterior trademarked design features shall earn additional points\nas follows:\n\na.\n\nThree additional points from Table C if such features are located 12 feet or less\nabove finished grade and there is no prototypical roof or parapet design;\n\nb.\n\nFive additional points from Table C, two of which must come from Group B, if such\nfeatures are located more than 12 feet above finished grade.\n\n2.\n\nIf the building plan depicts any of the design features listed below, one additional\npoint must be earned for each design feature (except as noted):\n\na.\n\nBuilding is one story and greater than 20 feet tall, floor to bottom of roof structure.\n\nb.\n\nBuilding façade exceeds 200 feet in width without entrances every 75 feet.\n\nc.\n\nIndividual use is greater than 100,000 square feet.\n\nd.\n\nFalse fronts or shaped parapets are created to increase the apparent size of the building\nor house corporate signage or logos. If used, building parapets must not be greater\nthan 50 percent higher than the distance of the building from grade to roof. (For\nexample, a building that is 20 feet tall from the grade to the roof cannot have a\nparapet greater than 10 feet tall from roof to top of parapet.) (See Figure 40.)\n\n(See Figure 40 set forth in Exhibit A attached to Ord. 20130606-088; Standards for height of false\nfronts or parapets.)\n\ne.\n\nConcrete block (not including split-faced concrete block) is used on more than 25\npercent of a façade visible to the public.\n\nf.\n\nConcrete block (not including split-faced concrete block) is used on more than 75\npercent of a façade visible to the public (must earn two additional points).\n\ng.\n\nEIFS is used as a material on the ground floor (below 10 feet).\n\nh.\n\nPad building with drive-in or drive-through (on a site with a Core Transit Corridor\nas the principal street).\n\nC.\n\nTable of Design Options.\n\n| Option | Description/Comments |\n| --- | --- |\n| Group A: Each option worth 1 point | |\n| Achieve star rating under the City of Austin Green Building program. | Each star of the rating qualifies for one point. No double credit for Green Building points from Group B. |\n| Provide for liner stores in building façade. (1 point for each liner store) | See Article 5, Definitions |\n| Provide façade articulation. | See definition D.1. below. |\n| Provide primary entrance design. | See definition D.2. below. |\n| Provide roof design. | See definition D.3. below. |\n| Provide building materials meeting the standards of this section. | See definition D.5. below. |\n| Improve storefronts to new regulatory standard of Section 3.2.2. for glazing type/size and shading. | Applies only for buildings existing at the effective date of this Subchapter. |\n| 100% of glazing on ground-floor façades that face any street or parking lot have a Visible Transmittance (VT) of 0.6 or higher. |  |\n| Complies with neighborhood design guidelines | Group B: Each option worth 2 points |\n| Design building so that at least 75% of the façade facing the principal street consists of storefronts with at least two separate entrances facing the principal street |  |\n| Provide sustainable roof. | See definition D.4. below. |\n| Integrate solar power generation into building design. | The specific features and design shall be approved by the Director. Examples may include, but are not limited to, rooftop solar panels or Building Integrated Photovoltaics. |\n| Achieve Green Building rating of 2 stars. | Group C: Option worth 3 points |\n| Develop VMU building | While VMU buildings are exempted from the requirements of this section, points are assigned for the purpose of aggregating point values for the mixed use development bonuses described in Article 4. In addition to the three base points associated with the VMU development, one additional point is added if the gross square footage of the VMU building contains a combination of at least 25% residential and 25% office or retail uses. However, no points may be earned for a building that contains external trademarked design features (not including signs). |\n\nD.\n\nDefinitions of Options.\n\n1.\n\nFaçade Articulation. For purposes of satisfying the requirements in subsections A. and B. above, \"façade\narticulation\" shall consist of one of the following design features, none of which\ncan be trademarked design features (See Figures 41 and 42.):\n\n(See Figure 41 and Figure 42 set forth in Exhibit A attached to Ord. 20130606-088; Examples of façade articulation)\n\na.\n\nChanges in plane with a depth of at least 24 inches, either horizontally or vertically,\nat intervals of not less than 20 feet and not more than 100 feet; or\n\nb.\n\nChanges of color, texture, or material, either horizontally or vertically, at intervals\nof not less than 20 feet and not more than 100 feet; or\n\nc.\n\nA repeating pattern of wall recesses and projections, such as bays, offsets, reveals\nor projecting ribs, that has a relief of at least eight inches.\n\n2.\n\nPrimary Entrance Design. For purposes of satisfying the requirements in subsections A. and B. above, \"primary\nentrance design\" shall consist of at least three of the following design elements\nat the primary entrance (none of which can be trademarked design features), so that\nthe primary entrance is architecturally prominent and clearly visible from the abutting\nstreet:\n\na.\n\nArchitectural details such as arches, friezes, tilework, murals, or moldings.\n\nb.\n\nIntegral planters or wing walls that incorporate landscape or seating.\n\nc.\n\nEnhanced exterior light fixtures such as wall sconces, light coves with concealed\nlight sources, ground-mounted accent lights, or decorative pedestal lights.\n\nd.\n\nProminent three-dimensional features, such as belfries, chimneys, clock towers, domes,\nspires, steeples, towers, or turrets.\n\ne.\n\nA repeating pattern of pilasters projecting from the façade wall by a minimum of eight\ninches or architectural or decorative columns.\n\n3.\n\nRoof Design. For purposes of satisfying the requirements in subsections A. and B. above, \"roof\ndesign\" shall consist of at least one of the following design elements, none of which\ncan be trademarked design features:\n\na.\n\nParapets with horizontal tops having height changes of at least one foot occurring\nhorizontally no less than every 100 feet. (See Figure 43.)\n\n(See Figure 43 set forth in Exhibit A attached to Ord. 20130606-088; Examples of roof design)\n\n(i)\n\nParapets that do not have horizontal tops must have pitched or rounded tops with a\npattern that repeats or varies no less than every 100 feet.\n\n(ii)\n\nAll parapets must have detailing such as cornices, moldings, trim, or variations in\nbrick coursing.\n\nb.\n\nSloping roofs with at least two of the following design elements:\n\n(i)\n\nSlope of at least 5:12.\n\n(ii)\n\nTwo or more slope planes.\n\n(iii)\n\nOverhanging eaves extending at least three feet beyond the supporting wall.\n\n4.\n\nSustainable Roof. For purposes of satisfying the requirements in subsections A. and B. above, a \"sustainable\nroof\" is roofing that has one of the following:\n\na.\n\nFor a minimum of 75 percent of the total roof surface, a Solar Reflectance Index (SRI)\nof 78 or higher for a roof with a slope of 2:12 or less, or 29 or higher for a roof\nwith a slope greater than 2:12; or\n\nb.\n\nFor a minimum of 50 percent of the total roof surface, a vegetated roof;\n\nc.\n\nFor a minimum of 50 percent of the total roof surface, rainwater collection system;\nor\n\nd.\n\nFor a minimum of 75 percent of the total roof surface, a combination of a vegetated\nroof with rainwater collection system and SRI- compliant roof meeting the SRI standards\nin subsection 4.a. above. (See Figure 44.)\n\n(See Figure 44 set forth in Exhibit A attached to Ord. 20130606-088; Example of a sustainable roof)\n\n5.\n\nBuilding Materials. For purposes of satisfying the requirements in subsection 1, above, \"building materials\"\nare defined as limestone or brick. However, the brick color shall not be a trademarked\ndesign feature.\n\n3.3.3.\n  Alternatives to Section 3.3.2.\n\nA.\n\nLarge Single-Story Buildings. Instead of complying with Section 3.3.2. above, a single-story commercial building\nthat is 100,000 square feet or more in size may elect as a matter of right to comply\nwith the following standards:\n\n1.\n\nThe building façade shall consist of 75 percent masonry (not including concrete blocks),\nexcluding the window area and rear service area on sides visible to the public;\n\n2.\n\nThe use of trademarked design features above 12 feet and the use of trademarked roof\nand parapet design features is prohibited;\n\n3.\n\nThe building meets the \"façade articulation\" requirements as defined in this section;\n\n4.\n\nThe building has 40 percent glazing on the front façade and 25 percent glazing and\ncutouts on each side visible to the public with a Visible Transmittance (VT) of 0.6\nor higher; and\n\n5.\n\nThe building has a Green Building rating of at least 2 stars.\n\nB.\n\nPad-site Buildings with Drive-In and/or Drive-Through Services. Instead of complying with Section 3.3.2. above, a pad-site building with a drive-in\nand/or drive-through services, or a single-use drive-in use not located on a Core\nTransit Corridor, may comply with the following standards:\n\n1.\n\nThe use of trademarked design features (not including signs or paint colors) above\n12 feet is prohibited; and\n\n2.\n\nThe portion of the building below 12 feet consists of one of the following;\n\na.\n\nLimestone; or\n\nb.\n\nBrick that has a different color than the trademarked brick color; or\n\nc.\n\nFor a building that occupies a pad or portion of a building within a planned project\nor shopping center, the building has similar design characteristics as the rest of\nthe shopping center. This includes use of similar materials, patterns, rhythms, and\nproportions to the rest of the center.\n\n3.\n\nPad sites shall not have any parking located between the building and the street on\nCore Transit Corridors, Urban Roadways and Suburban Roadways.\n\nSource: Ord. 20060831-068; Ord. 20130606-088.\n\nThis Article 4 is intended to provide for and encourage development and redevelopment\nthat contains a compatible mix of residential, commercial, and institutional uses\nwithin close proximity to each other, rather than separating uses. The mixed use provisions\ndefine the uses of land and the siting and character of the improvements and structures\nallowed on the land in a manner that encourages a balanced and sustainable mix of\nuses. They promote an efficient pedestrian-access network that connects the nonresidential\nand residential uses and transit facilities. Redevelopment of underutilized parcels\nand infill development of vacant parcels should foster pedestrian-oriented residential\nand mixed use development. (See Figure 45.)\n\n(See Figure 45 set forth in Exhibit A attached to Ord. 20130606-088; Examples of vertical mixed\nuse)\n\n|  |\n| --- |\n| COMMENTARY: MIXED USE DEVELOPMENT IN AUSTIN GENERALLY |\n| The City of Austin allows and encourages the development of mixed use projects. Mixed use development integrates two or more land uses, such as residential and commercial, with a strong pedestrian orientation. Requirements and standards for mixed use development appear in various places throughout the Austin City Code. |\n| Zoning Districts in which Mixed Use is Allowed and Encouraged |\n| The following districts are intended primarily for mixed use development and are described more fully in Section 4.2 below: |\n| • Mixed Use Combining District (Section 4.2.1.). |\n| • Vertical Mixed Use Overlay District (Section 4.2.2.). |\n| Mixed use development also is allowed in other Austin zoning districts. Some of these districts are listed below and are described more fully in the referenced sections of the Austin Code. This list is not exhaustive, but rather is intended to illustrate the range of districts in which mixed use development is allowed. |\n| • Central Business (CBD) (Section 25-2-100); |\n| • Central Urban Redevelopment (CURE) (Section 25-2-163); |\n| • Downtown Mixed Use (DMU) (Section 25-2-101); |\n| • Planned Development Area (PDA) (Section 25-2-174); |\n| • Planned Unit Development (Section 25-2-144); |\n| • Traditional Neighborhood Development (Section 25-2-146); |\n| • Transit Oriented Development (Section 25-2-147); |\n| • Waterfront Overlay (WO) (Section 25-2-175); and |\n| • University Neighborhood Overlay (UNO) (Section 25-2-178). |\n| Types of Mixed Use Development |\n| Within the districts that allow mixed use development, uses may be combined either vertically in the same building, or horizontally in multiple buildings, or through a combination of the two, depending on the standards of the district. |\n| Vertical mixed use is allowed in two building types: the Vertical Mixed Use (VMU) Building and the Neighborhood Mixed Use (NMU) Building. Standards for VMU buildings are in Section 4.3. below, and standards for NMU buildings are in Subchapter D, Article 6. |\n| Horizontal mixed use is the mixing of uses in a development project, though not necessarily in the same building. Horizontal mixed use is allowed and encouraged in Austin so long as each of the proposed uses is allowed within the applicable zoning district and the development meets all applicable requirements of the Austin Code. |\n\nSource: Ord. 20060831-068; Ord. 20130606-088.\n\n4.2.1.\n  Mixed Use Combining District\n\nA.\n\nPurpose. The purpose of a mixed use (MU) combining district is to allow office, retail,\ncommercial, and residential uses to be combined in a single development.\n\nB.\n\nBase Districts. A mixed use (MU) combining district may be combined with the following\nbase districts:\n\n1.\n\nNeighborhood office, if the use of an MU combining district will further the purpose\nof the neighborhood office base district;\n\n2.\n\nLimited office;\n\n3.\n\nGeneral office;\n\n4.\n\nNeighborhood commercial;\n\n5.\n\nCommunity commercial;\n\n6.\n\nGeneral commercial services; and\n\n7.\n\nCommercial liquor sales.\n\nC.\n\nUses Allowed. In the MU combining district, the following uses are permitted:\n\n1.\n\nVertical mixed use buildings, subject to compliance with Section 4.3. of this Subchapter;\n\n2.\n\nCommercial uses that are permitted in the base district;\n\n3.\n\nCivic uses that are permitted in the base district;\n\n4.\n\nTownhouse residential;\n\n5.\n\nMultifamily residential;\n\n6.\n\nSingle-family residential;\n\n7.\n\nSingle-family attached residential;\n\n8.\n\nSmall lot single-family residential;\n\n9.\n\nTwo-family residential;\n\n10.\n\nCondominium residential;\n\n11.\n\nDuplex residential;\n\n12.\n\nGroup residential;\n\n13.\n\nGroup home, class I (limited);\n\n14.\n\nGroup home, class I (general);\n\n15.\n\nGroup home, class II; and\n\n16.\n\nShort-term rental.\n\nD.\n\nDistrict Standards.\n\n1.\n\nA single-family residential use must comply with the site development regulations\nprescribed by Section 25-2-492 (Site Development Regulations) for a family residence (SF-3) district, except for the front yard setback. The use\nmust comply with the front yard setback prescribed for the base district.\n\n2.\n\nA single-family attached residential use must comply with Section 25-2-772 (Single-Family Attached Residential Use).\n\n3.\n\nA small lot single-family residential use must comply with Section 25-2-779 (Small Lot Single-Family Residential Use).\n\n4.\n\nA two-family residential use must comply with Section 25-2-773 (Duplex, Two-Unit and Three-Unit Residential Uses).\n\n5.\n\nA duplex residential use must comply with Section 25-2-773 (Duplex, Two-Unit and Three-Unit Residential Uses).\n\n6.\n\nThis subsection applies to a multifamily residential use, a townhouse residential\nuse, a condominium residential use, a group residential use, or a group home use.\n\na.\n\nIn a mixed use (MU) combining district that is combined with a neighborhood office\n(NO) base district, the minimum site area for each dwelling unit is:\n\n(i)\n\n3,600 square feet, for an efficiency dwelling unit;\n\n(ii)\n\n4,000 square feet, for a one bedroom dwelling unit; and\n\n(iii)\n\n4,400 square feet, for a dwelling unit with two or more bedrooms.\n\nb.\n\nIn an MU combining district that is combined with an limited office (LO) or neighborhood\ncommercial (LR) base district, the minimum site area for each dwelling unit is:\n\n(i)\n\n1,600 square feet, for an efficiency dwelling unit;\n\n(ii)\n\n2,000 square feet, for a one bedroom dwelling unit; and\n\n(iii)\n\n2,400 square feet, for a dwelling unit with two or more bedrooms.\n\nc.\n\nIn an MU combining district that is combined with a general office (GO), community\ncommercial (GR), general commercial services (CS), or commercial services - liquor\nsales (CS-1) base district, the minimum site area for each dwelling unit is:\n\n(i)\n\n800 square feet, for an efficiency dwelling unit;\n\n(ii)\n\n1,000 square feet, for a one bedroom dwelling unit; and\n\n(iii)\n\n1,200 square feet, for a dwelling unit with two or more bedrooms.\n\n4.2.2.\n  Vertical Mixed Use Overlay District.\n\nA.\n\nPurpose. The purpose of a vertical mixed use (VMU) overlay district is to allow the development\nof vertical mixed use (VMU) buildings, subject to compliance with the standards in\nSection 4.3.\n\nB.\n\nApplicability. The VMU overlay district is established within each zoning district for all sites\nwith a Core Transit Corridor or Future Core Transit Corridor as the principal street,\nsubject to the following limitations:\n\n1.\n\nIn areas subject to a Neighborhood Plan combining district, VMU buildings may not\ncontain uses prohibited for that lot under the neighborhood plan and are limited to\ncommercially zoned properties.\n\n2.\n\nIn areas that have not undergone the neighborhood planning process, the VMU overlay\nis limited to commercially zoned properties.\n\n3.\n\nThe VMU overlay district does not apply to properties zoned H (Historic) and properties\nthat are \"contributing\" structures to a local or National Register Historic District.\n\nC.\n\nUses Allowed. In a VMU Overlay district, the following uses are permitted:\n\n1.\n\nUses that are permitted in the base district; and\n\n2.\n\nVertical mixed use buildings, subject to compliance with Section 4.3. of this Subchapter.\n\nSource: Ord. 20060831-068; Ord. 20120802-122; Ord. 20130606-088; Ord. No. 20231207-001, Pt. 18, 12-18-23; Ord. No. 20240229-070, Pt. 1, 3-11-24.\n\n4.3.1.\n  Applicability.\n\nThe following table summarizes the applicability of this section:\n\n|  |  |  |\n| --- | --- | --- |\n| Standard | Applies if the Principal Street Is: | Applies to the Following: |\n| b | Core Transit Corridor, Future Core Transit Corridor | - Mixed Use Combining District   - Vertical Mixed Use Overlay District   - Properties that opt in to VMU pursuant to 4.3.5.C.3. |\n| Highway, Hill Country Roadway, Suburban Roadway, or Urban Roadway | - Mixed Use Combining District   - Sites of three acres or more, subject to 4.3.2.B.   - Properties that opt in to VMU pursuant to 4.3.5.C.3. |\n\nCity interpretation of existing technical criteria and development review policies\nshall be to achieve the policies of this section to promote vertical mixed use. Any\ntechnical criteria shall include consideration of pedestrian level of service and\nnot solely automobile level of service and shall include traffic impact analyses methodologies\nfor traffic capture rather than methodologies for disaggregated single-use developments.\n\n4.3.2.\n  Where Allowed.\n\nA.\n\nA VMU building is allowed on properties:\n\n1.\n\nWithin the mixed use (MU) combining district;\n\n2.\n\nWithin the Vertical mixed use (VMU) overlay district, subject to the limitations of\nSection 4.3.5.C;\nand\n\n3.\n\nThat are not located within the MU combining district or VMU overlay, but which have:\n\na.\n\nOpted-in under the process provided for under\nSection 4.3.5.C.3;\nor\n\nb.\n\nObtained a conditional use permit for VMU, subject to the limitations in Section 4.3.2.B.\n\nB.\n\nIn addition, for sites not in the MU combining district or the VMU overlay district,\na VMU building may be allowed through the conditional use permit process on any site\nof three acres or more that has a Highway, Hill Country Roadway, Suburban Roadway,\nor Urban Roadway or Internal Circulation Route as the principal street, subject to\nthe following requirements:\n\n1.\n\nIn areas subject to a Neighborhood Plan combining district, a VMU building may not\ncontain uses prohibited for that lot under the Neighborhood Plan combining district.\n\n2.\n\nIn areas that have not undergone the neighborhood planning process, a VMU building\nis allowed only on commercially zoned properties.\n\n3.\n\nA VMU building allowed under this section may only contain uses permitted in the base\nzoning district, as modified by Section 4.3.3.C.2.\n\nC.\n\nThis subsection applies to property in a VMU overlay district that is used exclusively\nfor residential use and that is not designated as a MU combining district. A VMU building\nis allowed only:\n\n1.\n\nthrough the opt-in process described in\nSection 4.3.5.C.5;\nor\n\n2.\n\nthrough the conditional use permit process.\n\n4.3.3.\n  Standards.\n\nA VMU building shall meet the following requirements:\n\nA.\n\nPre-Application Conference. Prior to filing any application for a development that will contain a VMU building,\nthe developer shall request in writing a pre-application conference with the Director.\nThe purpose of a pre-application conference is to provide an opportunity for an informal\nevaluation of the applicant's proposal and to familiarize the applicant and the city\nstaff with the applicable provisions of this Subchapter such as the VMU affordability\nrequirements, and other issues that may affect the applicant's proposal (e.g., accessibility\nrequirements). The informal evaluation of the Director and staff provided at the conference\nare not binding upon the applicant or the city, but are intended to serve as a guide\nto the applicant in making the application.\n\nB.\n\nMix of Uses. A use on the ground floor must be different from a use on an upper floor. The second\nfloor may be designed to have the same use as the ground floor so long as there is\nat least one more floor above the second floor that has a different use from the first\ntwo floors. At least one of the floors shall contain residential dwelling units. (See\nFigure 46.)\n\n(See Figure 46 set forth in Exhibit A attached to Ord. 20130606-088; Examples (not a comprehensive\nlist) of use mixes that would meet these requirements.)\n\nC.\n\nPedestrian-Oriented Commercial Spaces. Along at least 75 percent of the building frontage along the principal street, the\nbuilding must be designed for commercial uses in ground-floor spaces that meet the\nfollowing standards. A lobby serving another use in the VMU building shall not count\nas a pedestrian-oriented commercial space for purposes of this section.\n\n1.\n\nDimensional Requirements. Each ground-floor commercial space must have: (See Figure 47.)\n\n(See Figure 47 set forth in Exhibit A attached to Ord. 20130606-088; Pedestrian-Oriented Commercial\nSpaces.)\n\na.\n\nA customer entrance that opens directly onto the sidewalk;\n\nb.\n\nA depth of not less than 24 feet;\n\nc.\n\nA height of not less than 12 feet, measured from the finished floor to the bottom\nof the structural members of the ceiling; and\n\nd.\n\nA front façade that meets the glazing requirements of Section 3.2.2. (See Figure 39.)\n\n(See Figure 39 set forth in Exhibit A attached to Ord. 20130606-088; Glazing and façade relief requirements.)\n\n2.\n\nGround-Floor Commercial Uses Allowed. Any commercial uses allowed in the base zoning district may be allowed at the ground-floor\nlevel in VMU buildings. In addition, in office districts the following additional\nuses may be allowed, except as provided in\nSection 4.3.5.:\n\na.\n\nConsumer convenience services;\n\nb.\n\nFood sales;\n\nc.\n\nGeneral retail sales (convenience or general);\n\nd.\n\nRestaurant (limited or general) without drive-in service.\n\nD.\n\nCompatibility and Neighborhood Standards. All VMU buildings are subject to the compatibility standards of Chapter 25-2, Article 10 if applicable.\n\nIn case of conflict between the compatibility standards and this Subchapter, the compatibility\nstandards shall control.\n\n1.\n\nA VMU building that is located on a site that is adjacent to an urban family residence\n(SF-5) or more restrictive zoning district, or is adjacent to a property which contains\na use permitted in an SF-5 or more restrictive zoning district, other than a dwelling\npermitted by Section 25-2-894 (Accessory Uses for a Principal Commercial Use) must comply with the following Table D (Neighborhood Design Standards).\n\n(See Figure 47 set forth in Exhibit A attached to Ord. 20130606-088; Pedestrian-Oriented Commercial\nSpaces.)\n\n|  |  |\n| --- | --- |\n| TABLE D: NEIGHBORHOOD DESIGN STANDARDS | |\n| Required Elements for the Façade | Description |\n| Design and place windows to maintain privacy for both adjoining property owners and residents of the project. | Window location, size and placement should take into account views into and from neighboring single-family properties so as to provide privacy. |\n| Windows facing single family shall have visual transmittance (VT) of 0.6 or higher to minimize reflectivity. |  |\n| Provide visual screening for decks, patios, and public spaces. | For a parking structure: |\n| • Screen vehicle lights from view of adjacent triggering zoning or use. |  |\n| No amplified music in outdoor commercial or retail areas on the side of property adjacent to SF-5 or more restrictive zoning or use. | Applies only to side of property adjacent to SF-5 or more restrictive zoning or use. |\n| Prohibit trash pickup and commercial deliveries between 10 p.m. and 7 a.m. | Prohibition must be noted on the site plan. |\n| In addition a VMU building subject to this subsection must comply with at least one of the following neighborhood design standards: | |\n| Menu of Options | Description |\n| Ensure that the façade of a parking structure facing SF-5 or more restrictive zoning or use, breaks down the horizontal plane of the parking structure through the use of either:   1) Screening with materials sympathetic to those used on the VMU building, or   2) Creating openings on each floor that generally conform to the size and proportion of the windows on the VMU building and the use of materials sympathetic to those used on the VMU building. | Director shall require elevation identifying materials as part of the Site Plan process. |\n| Enclose dumpsters within building or parking structure. |  |\n| Enclose mechanical equipment within building or parking structure. |  |\n| Mitigate traffic impact on streets through measures such as signage, traffic calming, or signalization. | Improvements must be approved by the Director of Public Works or Transportation, as applicable. |\n| Reserve and design 5 percent of parking spaces for large vehicles. |  |\n\nE.\n\nDimensional Requirements.\n\n1.\n\nVMU buildings are subject to the height restrictions as provided in other sections\nof this Code.\n\n2.\n\nExcept as provided in Section 4.3.5., a VMU building that meets the affordability\nrequirements in subsection F. below is not subject to certain dimensional standards\napplicable in the base zoning district. These standards include the following:\n\na.\n\nMinimum site area requirements (if applicable);\n\nb.\n\nMaximum floor area ratio;\n\nc.\n\nMaximum building coverage;\n\nd.\n\nMinimum street side yard setback and interior yard setback; and\n\ne.\n\nMinimum front yard setback; provided, however, that if the right-of-way is less than\n60 feet in width, the minimum front yard setback for buildings three or more stories\nin height shall be 30 feet from the centerline of the street to ensure adequate Fire\nDepartment access.\n\n3.\n\nFor all uses in a VMU building, the minimum off-street parking requirement shall be\n60 percent of that prescribed by Appendix A (Tables of Off-Street Parking and Loading\nRequirements). This reduction may not be used in combination with any other parking\nreduction. Only the parking requirements for commercial uses are subject to modification\nthrough the opt-in/opt-out process in Section 4.3.5.\n\nF.\n\nAffordability Requirements. To be eligible for the dimensional or parking standards exemption in Subsection E\nof this section, the residential units in a VMU building shall meet the following\naffordability requirements, which shall run with the land. This ordinance does not\namend or repeal graphics or pictures that are used to illustrate various code requirements\nin the published version of Chapter 25-2, Subchapter E (Design Standards and Mixed Use).\n\n1.\n\nAffordability Requirements for Owner-Occupied Units.\n\na.\n\nFive percent of the residential units in the VMU building shall be reserved as affordable,\nfor not less than 99 years from the date a certificate of occupancy is issued, for\nownership and occupancy by households earning no more than 80 percent of the current\nAnnual Median Family Income for the City of Austin Metropolitan Statistical Area as\ndetermined by the Director of Neighborhood Housing and Community Development Department.\n\nb.\n\nIn addition, five percent of the residential units in the VMU building shall be reserved,\nfor not less than 99 years from the date a certificate of occupancy is issued, for\nownership and occupancy by households earning no more than 100 percent of the Annual\nMedian Family Income.\n\nc.\n\nThe City in its sole discretion may elect to subsidize an additional ten percent of\nthe for-sale residential units in the building, at an affordability level consistent\nwith criteria and procedures established by the Director.\n\n2.\n\nAffordability Requirements for Rental Units.\n\na.\n\nTen percent of the residential units in the VMU building shall be reserved as affordable,\nfor a minimum of 40 years following the issuance of the certificate of occupancy,\nfor rental by households earning no more than 80 percent of the Annual Median Family\nIncome.\n\nb.\n\nAs part of the one-time opt-in/opt-out process described in Section 4.3.5., an applicable\nneighborhood association or neighborhood planning team may request that the affordable\nrental units be available for renters earning a lower percentage of the annual median\nfamily income, to as low as 60 percent of the median family income. VMU projects that\nfile zoning or site plan applications after the effective date of the first interim\nVMU ordinance and prior to September 1, 2006, will not be subject to this neighborhood\naffordability customization; and instead shall set aside affordable rental units as\nrequired by subsection 2.a. above or provide for affordable units as otherwise agreed\nto by an applicable neighborhood prior to September 1,2006, provided that VMU projects\nare allowed on the applicable site following the completion of the opt-in/opt-out\nprocess.\n\nc.\n\nThe city may elect to subsidize an additional ten percent of the residential units\nin the building for rental purposes for residents at any level of affordability pursuant\nto criteria and procedures established by the Director.\n\n3.\n\nAffordability Definition. For purposes of this subsection, a unit is affordable for purchase or rental if the\nhousehold is required to spend no more than 30 percent of its gross monthly income\non utilities and mortage or rental payments for the unit as determined by the City's\nNeighborhood Housing and Community Development Department, based on the current Annual\nMedian Family Income for the Austin Metropolitan Statistical Area.\n\n4.\n\nFee for Upper-Level Nonresidential Space. The developers of VMU buildings that contain nonresidential uses above the ground-floor\nshall pay a fee as set by the City Council for all climate-controlled nonresidential\nspace above the ground floor. At the same time that it sets the amount of the fee,\nthe City Council shall also identify a means by which fees paid pursuant to this section\nshall be reserved only for expenditure within the area of the City from which they\nwere collected.\n\n5.\n\nMonitoring and Enforcement. The City shall develop procedures to monitor and enforce this section.\n\nG.\n\nMixed Use Buildings Other than VMU. If a building that otherwise meets the standards for VMU buildings may be developed\nusing the site development standards of the underlying zoning category, and without\nthe use of the dimensional standard waivers of Section 4.3.3.E., then that building\nneed not comply with the standards (including affordability) that otherwise apply\nto VMU buildings.\n\n4.3.4.\n  Development Bonuses and Expedited Review of Residential Parking Permit Districts.\n\nA.\n\nBonuses for VMU Buildings. A building that contains at least 100 lineal feet of VMU building frontage along\nthe principal street is entitled to the following development bonuses:\n\n1.\n\nThe queuing requirements of Chapter 25-6, Appendix A, shall be reduced by 50 percent for each drive-through service in the\ndevelopment, so long as sufficient on-site queuing space exists to ensure queuing\ndoes not occur within the public right-of-way.\n\n2.\n\nThe number of connectivity options needed to comply with Section 2.3.1.B.2. of this\nSubchapter shall be reduced by two for each 100 lineal feet of VMU buildings.\n\n3.\n\nAll buildings in the development may aggregate points for building design in Section\n3.3 of this Subchapter, rather than each building needing the minimum number of points.\n\n4.\n\nExcept for in the Barton Springs Zone or the Waterfront Overlay combining district,\nimpervious cover existing as of the effective date of this Subchapter may be retained\nfor redevelopment purposes for VMU buildings no taller than 60 feet and their accompanying\nstructured parking, so long as the redevelopment meets current water quality standards\nand, for projects in the Drinking Water Protection Zone, the redevelopment incorporates\nthe following measures to provide additional water quality benefits, pursuant to administrative\nrules to be developed by the director:\n\na.\n\nRainwater collection and reuse;\n\nb.\n\nPervious pavement;\n\nc.\n\nIntegrated pest management; and\n\nd.\n\nNative and adapted landscaping.\n\nB.\n\nExpedited Review for Residential Permit Parking Districts. Neighborhoods that do not opt out of the VMU overlay district pursuant to the process\nestablished in\nSection 4.3.5.\nshall receive expedited review of applications to establish Residential Permit Parking\n(RPP) districts, for blocks starting within 600 feet of the portion of the Core Transit\nCorridor or Future Core Transit Corridor within the VMU overlay. The application process\nshall proceed in accordance with the guidelines and procedures which are in effect\nat the time of the application except as described below:\n\n1.\n\nThe applicable neighborhood association must endorse the resident's request for the\nResidential Permit Parking program.\n\n2.\n\nRequirements for conducting parking studies or collecting license plate information\nshall be waived.\n\n3.\n\nFollowing the collection of the required signatures and delivery of all necessary\nRPP request documentation to City staff, staff shall review and act on the application\nwithin two weeks. Notice shall be sent to affected residents and the applicable neighborhood\nassociation, and signs shall be installed, within six weeks of approval.\n\n4.3.5.\n  Individual Neighborhood Consideration of VMU Requirements (\"Opt-in/Opt-out Process\").\n\nA.\n\nPurpose. The purpose of this subsection is to establish a one-time process, which will begin\nfollowing the adoption of this Subchapter, whereby individual neighborhoods may consider\ncertain development characteristics of VMU buildings within their boundaries and communicate\ntheir preferences to the City Council. No property is eligible for an exemption from\nthe dimensional standards (of Section 4.3.3.E.2.) or for the additional ground-floor\nuses otherwise authorized by Section 4.3.3.C.2. until the conclusion of the opt-in\nand opt-out processes described in this section.\n\nB.\n\nProcedure.\n\n1.\n\nInitiation. Upon the adoption date of this Subchapter, the Director shall identify neighborhood\nareas and notify each neighborhood planning team that the VMU neighborhood consideration\nprocess shall be initiated. If there is no neighborhood planning team, the applicable\nneighborhood associations in a neighborhood shall work together to develop an opt-in/opt-out\napplication for the purposes of this section.\n\n2.\n\nApplication. Each neighborhood planning team or neighborhood association shall review the VMU\nstandards in Section 4.3.3. The planning team or applicable neighborhood association\nmay, no later than 90 days after receiving written notice from the Director of this\nSubchapter's adoption, submit an opt-in/optout application to the City Manager concerning\nany of the items listed in subsection C. below. The planning team or neighborhood\nassociation may amend a timely filed application not later than August 9, 2007.\n\n3.\n\nPlanning Commission Recommendation. The City Manager shall forward any opt-in/opt-out applications received to the Planning\nCommission, which shall review and make recommendations on all such applications to\nthe City Council.\n\n4.\n\nCity Council Decision. After considering the Planning Commission's recommendations, the Council may by ordinance\napprove, approve with conditions, or deny each opt-in/optout request. The Council\nmay concurrently amend the appropriate neighborhood plan. The neighborhood plan amendment\nprocess does not apply to the amendment.\n\n5.\n\nEffect of Approval. Following completion of this one-time opt-in/opt-out process:\n\na.\n\nThe director shall indicate on the zoning map with map code \"V\" each property receiving\nan exemption from the dimensional standards under Section 4.3.3.E.2, additional ground\nfloor commercial uses under Section 4.3.3.C.2, or a reduction in the median family\nincome for affordable rental housing under Section 4.3.3.F.2.b. The \"V\" shall include\nproperties receiving the exemption under Section 4.3.5.B.4. pursuant to Council action\non an opt-out application, or under Section 4.3.5.C.l.b. if no application has been\nfiled.\n\nb.\n\nAny subsequent amendments to the VMU standards in a neighborhood shall require amendment\nof the applicable neighborhood plan and neighborhood plan combining district.\n\nc.\n\nAny property owner or neighborhood association may submit an application to change\nthe VMU rules on a specific property or properties by amending the applicable neighborhood\nplan and neighborhood plan combining district to opt-in to the exemption from the\ndimensional standards of Section 4.3.3.E.2 and/or the additional ground-floor uses\nidentified by Section 4.3.3.C.2.\n\nd.\n\nAny property owner may file a zoning application for Vertical Mixed Use (V) or Mixed\nUse (MU) combining district, regardless of whether a neighborhood plan combining district\nhas been adopted.\n\nC.\n\nTypes of Opt-in/Opt-Out Applications. Only the following types of opt-in/opt-out applications may be submitted:\n\n1.\n\nVMU Overlay District: Opt-out.\n\na.\n\nA neighborhood with properties in the VMU overlay district may request that the neighborhood\n\"opt-out\" of the dimensional standards exemption in Section 4.3.3.E.2., and/or the\nground-floor commercial uses allowed in Section 4.3.3.C.2. for some or all of the\nproperties within the VMU overlay district. If such an opt-out application is submitted\nand approved, the applicable standards shall not apply to affected VMU buildings within\nthat neighborhood; instead, such buildings shall be required to comply with all dimensional\nand/or use standards applicable to the base zoning district. Such buildings also shall\ncomply with the applicable minimum site area requirements in the MU combining district;\nsee Section 4.2.1.D.6.\n\nb.\n\nIf no opt-out application is submitted on a property, or an opt-out application is\nsubmitted and denied, the dimensional standard exemption in Section 4.3.3.E.2. and\nthe ground-floor commercial use provisions in Section 4.3.3.C.2. shall apply to all\nVMU buildings on that property.\n\n2.\n\nMU-Designated Properties: Opt-in.\n\na.\n\nA neighborhood with properties with the MU zoning designation may request to \"opt-in\"\nto the dimensional standards exemption in Section 4.3.3.E.2., and/or the ground floor\ncommercial uses allowed in Section 4.3.3.C.2. for some or all of the properties with\nthe MU zoning designation. If such an opt-in application is submitted and approved,\nthe dimensional and/or use standards shall apply to VMU buildings on sites with the\nMU zoning designation within the applicable neighborhood boundaries.\n\nb.\n\nIf no opt-in application is submitted for a property, or an opt-in application is\nsubmitted and denied, VMU buildings on a property designated MU shall comply with\nall dimensional and use standards applicable to the base zoning district and the MU\ncombining district.\n\n3.\n\nProperties Not in VMU Overlay District and without MU Designation: Opt-in to VMU. Any neighborhood that desires to allow VMU buildings within its boundaries on commercially\nzoned properties that are not otherwise eligible for VMU buildings under this Subchapter\nmay submit an \"opt-in\" application to allow such development. The application shall\nspecify the properties on which the neighborhood wishes to allow VMU buildings, whether\nthe ground-floor commercial listed in Section 4.3.3.C.2. should be allowed, and whether\nthe dimensional standards exemption of Section 4.3.3.E.2. should apply.\n\n4.\n\nAll Properties that Allow VMU Buildings: Affordability Standards. Also as part of the opt-in/opt-out process, for each neighborhood in which VMU buildings\nare allowed, the neighborhood association or neighborhood planning team may request\nthat the affordable rental units be available for renters earning a lower percentage\nof the area median family income, to as low as 60 percent of the median family income,\npursuant to Section 4.3.3.F.2.b.\n\n5.\n\nVMU Overlay District: Residential Opt-in. A neighbor-hood that desires to allow VMU buildings within its boundaries on property\nin a VMU overlay district that is used exclusively for residential use and that is\nnot designated as a MU combining district may submit an application to allow the development.\nThe application shall specify the properties on which the neighborhood wishes to allow\nVMU buildings, whether ground-floor commercial listed in Section 4.3.3.C.2 should\nbe allowed, and whether the dimensional standards of Section 4.3.3.E.2 should apply.\n\n6.\n\nRemoval from the VMU Overlay District. A neighborhood may request that the Council amend the boundaries of the VMU overlay\ndistrict to remove a property from the overlay district.\n\nSource: Ord. 20060831-068; Ord. 20070215-071; Ord. 20070621-027; Ord. 20070726-133;\nOrd. 20071129-098; Ord. 20090611-074; Ord. 20100408-049; Ord. 20130606-088; Ord. No. 20220609-080, Pts. 1—3, 6-20-22; Ord. No. 20231102-028, Pts. 29—32, 11-13-23; Ord. No. 20240229-070, Pt. 1, 3-11-24.\n\nMany terms used in this Document are defined in the Land Development Code (LDC). Definitions\nare only included here if not defined in the LDC, or if the definition for this Document\ndiffers from the LDC.\n\nA\n\nAwning\n\nA shade device at least 4 feet deep by the width of the entry being served.\n\nB\n\nBuilding Façade Line\n\nA line that is parallel to a lot line or internal circulation route curb line, as\napplicable, and the same distance from the lot line or curb line as the closest portion\nof a building.\n\nC\n\nCivic Buildings\n\nFor purposes of this Subchapter, civic buildings shall consist of the following:\n\n• College or University Facilities\n\n• Community Recreation (Public)\n\n• Cultural Services\n\n• Local Utility Services\n\n• Parks and Recreation Services (General)\n\n• Postal Services\n\n• Public Primary Education Facilities\n\n• Public Secondary Education Facilities\n\n• Safety Services\n\n• Transportation Terminal\n\nClear Zone\n\nThe area dedicated for an unobstructed sidewalk.\n\nCommercial Use\n\nA use that appears in Section 25-2-4, (Commercial Uses Described), of the Land Development Code.\n\nCore Transit Corridors\n\nCore Transit Corridors are the following roadways:\n\n1.\n\nSouth First Street, north of Ben White Boulevard;\n\n2.\n\nEast Seventh Street, west of Pleasant Valley Road;\n\n3.\n\nEast Fifth Street, from I-35 to Pleasant Valley Road;\n\n4.\n\nWest Fifth Street, from Guadalupe Street to Mopac Expressway;\n\n5.\n\nEast Sixth Street, from I-35 to Pleasant Valley Road;\n\n6.\n\nWest Sixth Street, from Guadalupe Street to Pressler Street;\n\n7.\n\nWest Thirty-Fifth Street, from Mopac Expressway eastward until becoming West Thirty-Fifth\nStreet Cutoff, and continuing eastward until becoming West Thirty-Eighth Street, and\ncontinuing eastward to Guadalupe Street;\n\n8.\n\nAirport Boulevard from Lamar Boulevard to I-35;\n\n9.\n\nAnderson Lane, from Burnet Road to Mopac Expressway;\n\n10.\n\nBarton Springs Road, east of Robert E. Lee Drive;\n\n11.\n\nBurnet Road, from 45th Street to Anderson Lane;\n\n12.\n\nSouth Congress Avenue, north of Stassney Lane;\n\n13.\n\nGuadalupe Street;\n\n14.\n\nLamar Boulevard, from Banyon Street to Ben White Boulevard;\n\n15.\n\nMartin Luther King, Jr. Boulevard, from Pearl Street to Airport Boulevard;\n\n16.\n\nRiverside Drive from Lamar Boulevard to E. Ben White Boulevard/Highway 71;\n\n17.\n\nCameron Road, from 51st Street to U.S. Highway 290;\n\n18.\n\nFifty-first Street, from Cameron Road to Manor Road;\n\n19.\n\nGaston Place, from Westminster Drive to Wellington Drive;\n\n20.\n\nBriarcliff Boulevard, from Berkman Drive to Westminster Drive; and\n\nCore Transit Corridors, Future\n\nFor purposes of Section 4.2.2. of this Subchapter, the following roadways are considered\n\"future core transit corridors\" (including all lots with frontage on the listed intersections):\n\n1.\n\nSouth Congress Avenue from Stassney Lane to Slaughter Lane;\n\n2.\n\nSlaughter Lane from I-35 to Mopac;\n\n3.\n\nSeventh Street from Pleasant Valley Road to U.S. Highway 183;\n\n4.\n\nNorth Lamar Boulevard from Banyon Street to Howard Lane;\n\n5.\n\nManor Road from Dean Keaton Street to 183;\n\n6.\n\nAirport Boulevard from Manor Road to I-35;\n\n7.\n\nFifty-First Street from Cameron Road to Airport Boulevard;\n\n8.\n\nFar West Boulevard from Mopac to western side of Chimney Corner;\n\n9.\n\nCameron Road from U.S. Highway 290 to U.S. Highway 183;\n\n10.\n\nMesa Drive from Spicewood Springs to Steck;\n\n11.\n\nJollyville Road from Great Hills Trail to U.S. Highway 183.\n\nD\n\nDirector\n\nUnless otherwise specified, the Director of the Watershed Protection and Development\nReview Department, or his or her designee.\n\nE\n\nF\n\nFaçade Relief\n\nOther non-glass materials that differ in texture from the adjacent façade material\nand made to be set in frames, as in windows and doors. Examples include, but are not\nlimited to, metal panels, shutters, glass block, and wood panels.\n\nFully-Shielded Light Fixture\n\nA lighting fixture constructed in such a manner that the light source is not visible\nwhen viewed from the side and all light emitted by the fixture, either directly from\nthe lamp or a diffusing element, or indirectly by reflection or refraction from any\npart of the luminaire, is projected below the horizontal as determined by photometric\ntest or certified by the manufacturer. Any structural part of the light fixture providing\nthis shielding must be permanently affixed.\n\nFull Cut-off\n\nA luminaire light distribution where zero candela intensity occurs at or above an\nangle of 90 above nadir. Additionally, the candela per 1000 lamp lumens does not numerically\nexceed 100 (10%) at or above a vertical angle of 80 above nadir. This applies to all\nlateral angles around the luminaire.\n\nG\n\nGlazing\n\nThe panes or sheets of glass set in frames, as in windows or doors. Glass includes\ntinted, fritted, vision, spandrel, and other forms of sheet formed glass. Vegetative\nscreening is permitted only if approved by Director, and may not be used on front\nfaçade.\n\nGreenfield Development\n\nDevelopment on an undeveloped parcel located outside the Urban Roadway boundary.\n\nH\n\nHardscape\n\nNonliving components of a streetscape or landscape design, such as paved walkways,\nwalls, sculpture, patios, stone and gravel areas, benches, fountains, and similar\nhard-surface areas and objects.\n\nHighways\n\nAll freeways, parkways, expressways, and frontage roads identified in the Austin Area\nMetropolitan Transportation Plan, except for Core Transit Corridors described in this\nSubchapter.\n\nHill Country Roadways\n\nThis roadway type applies on all properties within 1000 feet of those roadway identified\nin Section 25-2-1103.\n\nI\n\nInternal Block\n\nOne or more lots, tracts, or parcels of land bounded by Internal Circulation Routes,\nrailroads, or subdivision boundary lines.\n\nInternal Circulation Route\n\nA public street or a publicly-accessible private drive that is constructed to satisfy\nthe requirements in Section 2.2.5 (Internal Circulation Routes: Connectivity, Parking, and Sidewalk Requirements for\nLarge Sites) of this Subchapter.\n\nJ\n\nK\n\nL\n\nLDC\n\nThe City of Austin Land Development Code.\n\nLight Fixture\n\nThe complete lighting assembly (including the lamp, housing, reflectors, lenses and\nshields), less the support assembly (pole or mounting bracket); a light fixture.\n\nLiner Store\n\nA commercial use on the ground floor of a building located not more than 30 feet from\nthe street right-of-way with an entrance facing the street.\n\nM\n\nMaximum Extent Feasible\n\nNo feasible and prudent alternative exists, and all possible efforts to comply with\nthe regulation or minimize potential harm or adverse impacts have been undertaken.\nEconomic considerations may be taken into account but shall not be the overriding\nfactor in determining \"maximum extent feasible.\"\n\nMaximum Extent Practicable\n\nUnder the circumstances, reasonable efforts have been undertaken to comply with the\nregulation or requirement, that the costs of compliance clearly outweigh the potential\nbenefits to the public or would unreasonably burden the proposed project, and reasonable\nsteps have been undertaken to minimize any potential harm or adverse impacts resulting\nfrom the noncompliance.\n\nN\n\nNet Frontage Length\n\nDetermined by subtracting required Internal Circulation Routes, side or compatibility\nsetbacks, easements, drive aisles, sidewalks, and stairs that occur at the building\nperimeter from the total property length, as measured along the front lot line from\nproperty line to property line. (See Figure 48.) In the case of a curved corner, the\nDirector may determine the end point for purposes of measuring net frontage.\n\n(See Figure 48 set forth in Exhibit A attached to Ord. 20130606-088; the diagram (in Figure 45)\nprovides an example for determining Net Frontage Length. The net frontage length along\nthe Principal Street for the example above would be the total sum of lengths A and\nB. Required Internal Circulation Routes, drive aisles, and perimeter sidewalks are\nnot included.\n\nNonresidential Zoning Districts\n\nThe following are the City of Austin nonresidential zoning districts for purposes\nof this Subchapter:\n\n• NO\n\n• P\n\n• LO\n\n• GO\n\n• CR\n\n• LR\n\n• GR\n\n• W/LO\n\n• CS\n\n• CS-1\n\n• CH\n\n• IP\n\n• MI\n\n• LI\n\n• R&D\n\nO\n\nP\n\nPad-Site Building\n\nA building that is intended for a single commercial use and that is physically separate\nfrom the other buildings on the site. Typically used in the context of retail shopping\ncenter development, a building or building site that is physically separate from and\nsmaller than the principal building and reserved for free-standing commercial uses.\nTypical pad site uses include, by way of illustration only, free-standing restaurants,\nbanks, and service stations.\n\nPlanting Zone\n\nAn area adjacent to the curb in which street trees are planted and street furniture\nsuch as benches, bicycle racks, and newspaper boxes are placed.\n\nPortico\n\nSee awning.\n\nPrincipal Building\n\nA building in which is conducted the principal use of the lot on which it is located.\n\nPrincipal Entrance\n\nThe place of ingress and egress most frequently used by the public.\n\nPrincipal Street\n\nIn this Subchapter, the principal street of a lot or site is the street with the highest\npriority that is adjacent to the lot or site. Street priorities are as follows, from\nhighest to lowest:\n\n• Core Transit Corridor;\n\n• Internal Circulation Route;\n\n• Urban Roadway;\n\n• Suburban Roadway; and\n\n• Highway or Hill Country Roadway (Unless the higher road runs parallel to the highway\nand is within 660 feet of the Highway or within 1,000 feet of the Hill Country Roadway\n(i.e., a highway development would not have to orient to the Urban/Suburban Roadway\nnext to a highway).\n\nIf a lot is adjacent to more than one street of equally high priority, the principal\nstreet is: the street with the highest level of transit service, as determined by\nthe Director; or, if the streets do not have transit service or the level of transit\nservice is equal, the street designated by the lot owner.\n\nQ\n\nR\n\nS\n\nSignificant Stand of Trees\n\nThree or more Class 1 or Class 2 tree specimens with a minimum measurement of two-inch\nDiameter at Breast Height, meeting the standards outlined within Section 3.5.2 of\nthe Environmental Criteria Manual, and a minimum of 150 sq. feet of critical root\nzone preserved.\n\nStreet-Facing Façade\n\nA wall of a building that is within 60 degrees of parallel to a street lot line; and\nis not behind another wall, as determined by measuring perpendicular to the street\nlot line. The length of a street-facing façade is measured parallel to the street\nlot line.\n\nSuburban Roadways\n\nAll roadways that are not Transit, Hill Country, Highway, or Urban Roadways.\n\nSupplemental Zone\n\nAn area between the clear zone and the building edge for active public uses such as\na plaza, outdoor cafe or patio.\n\nT\n\nTrademarked Design Feature\n\nAn external design feature, including colors, shapes, and materials, of a building\nthat is trademarked by a building occupant.\n\nUrban Roadways\n\nUrban Roadways are roads located within the following boundaries other than those\ndesignated as Core Transit Corridors and Highways:\n\n• 183 from Burnet to Hwy 71\n\n• Hwy 71 from 183 to Loop 1\n\n• Loop 1 from Hwy 71 to Lake Austin\n\n• Lake Austin from Loop 1 to Exposition\n\n• Exposition from Lake Austin to 35th\n\n• 35th from Exposition to Loop 1\n\n• Loop 1 from 38th to RM 2222\n\n• RM 2222 from Loop 1 to Mesa\n\n• Mesa from RM 2222 to Spicewood Springs Road\n\n• Spicewood Springs Road from Mesa to 360\n\n• 360 from Spicewood Springs Road to Great Hills Trail\n\n• Great Hills Trail from 360 to 183\n\n• 183 from Great Hills Trail to Braker\n\n• Braker from 183 to Burnet\n\n• Burnet from Braker to 183\n\nV\n\nVertical Mixed Use (VMU) Building\n\nA building that meets the requirements set forth in Section 4.3. of this Subchapter.\n\nW\n\nX\n\nY\n\nZ\n\nSource: Ord. 20060831-068; Ord. 20070809-058; Ord. 20100225-079; Ord. 20100408-049;\nOrd. 20100624-113; Ord. 20130606-088.\n",
  "start_line": 34815,
  "end_line": 39066,
  "subsections": []
}