{
  "id": "25-2-812",
  "title": "MOBILE FOOD ESTABLISHMENTS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "in Section 25-2-812 (Mobile Food Establishments) of the City Code or to a mobile retail establishment that is located on private\nproperty for three hours or less between the hours of 6 a.m. and 11 p.m.\n\n(C)\n\nTime Limit. A mobile retail establishment may not remain at the same location for\nmore than 180 consecutive days.\n\n(D)\n\nRequired Approvals.\n\n(1)\n\nA person may not operate a mobile retail establishment until the director of the Planning\nand Development Review Department approves the establishment.\n\n(2)\n\nThe director of the Planning and Development Review Department shall approve an establishment\nif all of the following is provided by the operator:\n\n(a)\n\nthe name and address of the mobile retail establishment owner;\n\n(b)\n\nproof of motor vehicle or trailer registration;\n\n(c)\n\na description of the items that the mobile retail establishment sells;\n\n(d)\n\nproof of sales tax and use permit;\n\n(e)\n\nproof of Texas Department of Licensing and Regulation license(s), if applicable for\nPersonal Services use;\n\n(f)\n\nan itinerary of the locations where sales occur;\n\n(g)\n\nif at one location more than two hours, a written agreement from a business within\n150 feet of the location to allow employees of the mobile retail establishment to\nuse flushable restrooms or other facilities approved by the health authority during\nhours of operation;\n\n(h)\n\na fee, as established by separate ordinance; and\n\n(i)\n\nany other information reasonably required by the director of the Planning and Development\nReview Department to enforce this section.\n\n(3)\n\nA site plan, site plan exemption, or temporary use permit is not required for the\noperation of a mobile food establishment.\n\n(E)\n\nItems and Services to be Sold. An operator may only sell non-food retail items or\nservices. Mobile retail establishments may only sell items or services permitted under\na general retail sales (convenience) use, pet services use, and personal services\nuse. All sales items and supplies must be stored within the mobile unit.\n\n(F)\n\nZoning. A mobile retail establishment shall comply with the regulations in this section.\n\n(1)\n\nA mobile retail establishment is permitted in all commercial and industrial zoning\ndistricts except in a neighborhood office (NO), limited office (LO), or general office\n(GO) zoning district.\n\n(2)\n\nUnless located in a central business district (CBD) zoning district, a mobile retail\nestablishment may not be located less than fifty feet from a lot with a building that\ncontains both a residential and commercial use.\n\n(3)\n\nA mobile retail establishment may not be less than fifty feet from property:\n\n(a)\n\nin an SF-5 or more restrictive district; or\n\n(b)\n\non which a residential use permitted in an SF-5 or more restrictive district is located.\n\n(4)\n\nA person may not operate a mobile retail establishment between the hours of 11:00\np.m. and 6:00 a.m.\n\n(5)\n\nA mobile retail establishment may not be located less than twenty feet from a general\nretail sales (convenience) use, general retail sales (general) use, pet services use,\nor personal services use.\n\n(6)\n\nA drive-in service is not permitted.\n\n(7)\n\nExterior lighting must be hooded or shielded so that the light source is not directly\nvisible to a residential use.\n\n(8)\n\nA mobile retail establishment may not be located within the right-of-way unless the\nmobile retail establishment obtains and possesses the permission required under Sections\n14-8-2 (Permit Required; Waiver of Deadlines) and 14-9-21 (Street Vendor License Authorized) of the City Code.\n\n(9)\n\nA mobile retail establishment may not occupy or impede required accessible spaces\nor bicycle parking for another use.\n\n(G)\n\nNoise Level. The noise level of mechanical equipment or outside sound equipment used\nin association with a mobile retail establishment may not exceed seventy decibels\nwhen measured at the property line that is across the street from or abutting a residential\nuse.\n\n(H)\n\nSigns. A mobile retail establishment is limited to signs attached to the exterior\nof the mobile retail establishment. The signs:\n\n(1)\n\nmust be secured and mounted flat against the mobile retail establishment;\n\n(2)\n\nmay not project more than six inches from the exterior of the mobile retail establishment;\n\n(3)\n\nmay not use a flashing light source; and\n\n(4)\n\nmay not use an LED message board.\n\n(I)\n\nDebris and Litter. During business hours a mobile retail establishment shall provide\na trash receptacle for use by customers. The mobile retail establishment shall also\nkeep the area around the mobile retail establishment clear of litter and debris at\nall times.\n\n(J)\n\nUtilities. A permanent water or wastewater connection is prohibited. Electrical service\nmay be provided only by a temporary service or other connection provided by an electric\nutility or by an onboard generator.\n\n(K)\n\nWaste and Disposal. An operator must dispose of all waste generated by the mobile\nretail establishment in accordance with City Code regulations.\n\n(L)\n\nMobility. An operator must demonstrate that the vehicle or trailer is readily moveable\nif requested by the directors of the Planning and Development Review Department or\nthe Code Compliance Department.\n\n(M)\n\nOperations. An operator may not place sales items, equipment, or supplies that are\npart of its operations outside of the permitted unit and must conduct all of its operational\nactivities within the mobile retail establishment.\n\n(N)\n\nBad Actor.\n\n(1)\n\nThe director may revoke an approved application granted under this section if an operator\nprovides false information on an application or commits repeated violations of applicable\nlaw.\n\n(2)\n\nIn determining whether to revoke an approved application, the director shall consider\nthe frequency of any repeated violations, whether a violation was committed intentionally\nor knowingly, and any other information relevant to the degree to which an operator\nhas endangered the public health, safety, or welfare.\n\n(3)\n\nAn operator may appeal the director's decision to revoke an approved application to\nthe Planning Commission.\n\n(4)\n\nAn operator must file an appeal under this section with the director no later than\nthe 20th day following the date of the director's decision. The appeal must be on\na form approved by the director.\n\n(5)\n\nAfter notice and public hearing, the Planning Commission shall either uphold or overturn\nthe decision of the director. In making its decision, the Planning Commission shall\nconsider the criteria contained within this Subsection (N). The Planning Commission's\ndecision shall be final on this matter.\n\n(O)\n\nCompliance Required; Offense. An operator shall comply with this section. A violation\nof this section is a Class C misdemeanor.\n\nSource: Ord. No. 20140626-145, Pt. 1, 7-7-14; Ord. No. 20231102-028, Pt. 15, 11-13-23.\n\n(A)\n\nThe purpose of the performance venue is to enhance the development and preservation\nof venues that support art, music, and culture; and contribute to the City's status\nas the Live Music Capital of the World.\n\n(B)\n\nProduction Space.\n\n(1)\n\nA performance venue must allocate a minimum of 50 percent of the gross floor area\nfor production and programming space.\n\n(2)\n\nProduction and programming space includes stages, green rooms, box offices and ticketing\nbooths, audience areas, and equipment dedicated to producing plays, motion pictures,\nor other performances.\n\n(C)\n\nSale of Alcoholic Beverages.\n\n(1)\n\nA performance venue with a late-hours permit from the Texas Alcoholic Beverage Commission\n(TABC) is subject to Article 10 (Compatibility Standards) unless the venue is eligible for a waiver under Article 10, Division 3 (Waivers).\n\n(2)\n\nFor a performance venue with a late-hours permit:\n\n(a)\n\nan applicant must show all of the proposed parking on a site plan that is required\nfor a conditional use or compatibility standards waiver; and\n\n(b)\n\nthe site is subject to the parking area setback described in Section 25-5-146 (Conditions of Approval).\n\n(3)\n\nDuring the Conditional Use Permitting Process, the Land Use Commission may:\n\n(a)\n\nreduce the amount of gross floor area that can be dedicated as audience space if the\nLand Use Commission determines that the surrounding uses support a reduced amount\nof gross floor area; and\n\n(b)\n\nallow an outdoor entertainment area.\n\n(4)\n\nThe Land Use Commission shall identify the basis for its determination that surrounding\nuses support a reduced amount of gross floor area.\n\nSource: Ord. No. 20230914-097, Pt. 3, 9-25-23.\n\n(A)\n\nThis section applies to electric vehicle charging as a principal use.\n\n(B)\n\nThis section does not apply to electric vehicle charging as an accessory use.\n\n(C)\n\nThis section governs over a conflicting provision of this title or other ordinance\nunless the conflicting provision is more restrictive.\n\n(D)\n\nIn this section:\n\n(1)\n\na roadway description has the meaning assigned in Article 5 (Definitions) of Subchapter E; and\n\n(2)\n\ndistance is measured from lot line to lot line.\n\n(E)\n\nElectric vehicle charging stations may be located one level below ground and above.\n\n(F)\n\nElectric vehicle charging use is a permitted use on a site with a commercial or industrial\nbase zoning district and:\n\n(1)\n\nan existing service station use; or\n\n(2)\n\na discontinued service station use, if a subsequent use on the site did not include\na restaurant (general) use, a restaurant (limited) use, or a residential use.\n\n(G)\n\nSubject to the requirements of Subsections (H), (I), and (J), electric vehicle charging\nuse is a permitted or conditional use on a site zoned:\n\n(1)\n\ngeneral commercial services (CS);\n\n(2)\n\ncommercial liquor sales (CS-1);\n\n(3)\n\ncommercial highway (CH);\n\n(4)\n\nindustrial park (IP);\n\n(5)\n\nmajor industry (MI);\n\n(6)\n\nlimited industrial services (LI); or\n\n(7)\n\nresearch and development (R&D).\n\n(H)\n\nElectric vehicle charging use is a permitted use if:\n\n(1)\n\nthe site is:\n\n(a)\n\nzoned with a base zoning district described in Subsection (G);\n\n(b)\n\nlocated at least 1,000 feet from another lot with electric vehicle charging use as\nits principal use;\n\n(c)\n\n25,000 square feet or less; and\n\n(2)\n\nthe site front-faces or side-faces one of the following roadways:\n\n(a)\n\na core transit corridor;\n\n(b)\n\na future core transit corridor; or\n\n(c)\n\nan urban roadway.\n\n(I)\n\nElectric vehicle charging use is a permitted use if the site:\n\n(1)\n\nis zoned with a base zoning district described in Subsection (G); and\n\n(2)\n\nfront-faces or side-faces one of the following roadways:\n\n(a)\n\na suburban roadway;\n\n(b)\n\na highway;\n\n(c)\n\na hill country roadway; or\n\n(d)\n\nan internal circulation route.\n\n(J)\n\nElectric vehicle charging use is a conditional use if the site:\n\n(1)\n\nis zoned with a base zoning district described in Subsection (G); and\n\n(2)\n\nfront-faces or side-faces a roadway type adopted in Chapter 25-2 (Zoning) other than a roadway described in Subdivision (I)(2); or\n\n(3)\n\nis located within 1,000 feet of a highway cap or stitch.\n\nSource: Ord. No. 20240516-007, Pt. 2, 5-27-24.\n\n(A)\n\nThis section applies to a college and university facilities use.\n\n(B)\n\nA site must be located on a street that has a paved width of at least 40 feet from\nthe site to where it connects with another street that has a paved width of at least\n40 feet.\n\n(C)\n\nIf more than one dwelling unit is located on the site, the dwelling units must comply\nwith the requirements of this title that are applicable to residential uses.\n\nSource: Section 13-2-264; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 16, 11-13-23.\n\nThis section applies to a public or private primary or secondary school.\n\n(1)\n\nA site must be located on a street that has a paved width of at least 40 feet from\nthe site to where it connects with another street that has a paved width of at least\n40 feet.\n\n(2)\n\nIf more than one dwelling unit is located on the site, the dwelling units must comply\nwith the requirements of this title that are applicable to residential uses.\n\nSource: Section 13-2-261; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n",
  "start_line": 26422,
  "end_line": 26912,
  "subsections": [
    "25-2-812-C",
    "25-2-812-D",
    "25-2-812-E",
    "25-2-812-F",
    "25-2-812-G",
    "25-2-812-H",
    "25-2-812-I",
    "25-2-812-J",
    "25-2-812-K",
    "25-2-812-L",
    "25-2-812-M",
    "25-2-812-N",
    "25-2-812-O",
    "25-2-812-A",
    "25-2-812-B",
    "25-2-812-C",
    "25-2-812-A",
    "25-2-812-B",
    "25-2-812-C",
    "25-2-812-D",
    "25-2-812-E",
    "25-2-812-F",
    "25-2-812-G",
    "25-2-812-H",
    "25-2-812-I",
    "25-2-812-J",
    "25-2-812-A",
    "25-2-812-B",
    "25-2-812-C",
    "25-2-812-A"
  ]
}