{
  "id": "25-2-article-7",
  "title": "NONCONFORMING USES",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 7. - NONCONFORMING USES.\n\nNONCONFORMING USE means a land use that does not conform to current use regulations,\nbut did conform to the use regulations in effect at the time the use was established.\n\nSource: Section 13-2-331; Ord. 990225-70; Ord. 031211-11.\n\nThe use of a building, structure, or property that conformed with the zoning regulations\nin effect on March 1, 1984 is a conforming use notwithstanding the requirements of\nthis chapter.\n\nSource: Section 13-2-340; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA substandard lot may be used for a nonresidential use that is permitted in the zoning\ndistrict in which the lot is located if, except for minimum lot area, the use and\ndevelopment complies with the requirements of this title.\n\n(B)\n\nA substandard lot may be used for a single-family residential use if the use is permitted\nin the zoning district in which the lot is located and the lot complies with the requirements\nof this subsection.\n\n(1)\n\nA substandard lot recorded in the county real property records before March 15, 1946\nmust:\n\n(a)\n\nhave an area of not less than 4,000 square feet; and\n\n(b)\n\nbe not less than 33 feet wide at the street or at the building line, or have access\nto a street by an easement that is:\n\n(i)\n\nnot less than ten feet wide if it serves one lot, or not less than 18 feet wide if\nit serves more than one lot;\n\n(ii)\n\nnot more than 150 feet in length; and\n\n(iii)\n\nmaintained for access by the property owner.\n\n(2)\n\nA substandard lot recorded in the county real property records after March 14, 1946\nmust:\n\n(a)\n\nhave an area of not less than 5,750 square feet; and\n\n(b)\n\nbe not less than 50 feet wide at the street or at the building line.\n\n(C)\n\nIf a substandard lot is used with one or more contiguous lots for a single use or\nunified development, the requirements of this chapter apply to the aggregation of\nlots as if the aggregation were a single lot.\n\n(D)\n\nA substandard lot that is aggregated with other property to form a site may not be\ndisaggregated after August 6, 2007 to form a site that is smaller than the minimum\nlot area requirement.\n\nSource: Sections 13-2-334, 13-2-335, and 13-2-336; Ord. 990225-70; Ord. 031211-11;\nOrd. 20070726-131.\n\n(A)\n\nA damaged structure used for a nonconforming use may be repaired and the nonconforming\nuse continued if the building official determines that the cost of repair does not\nexceed 90 percent of the value of the structure immediately before the damage.\n\n(B)\n\nApproval of a site plan is not required to repair a structure under Subsection (A)\nunless the building official determines that:\n\n(1)\n\na substantial change to the structure is proposed; and\n\n(2)\n\na site plan is otherwise required by this title for initial construction of a structure\nsimilar to the structure after the proposed repairs.\n\nSource: Section 13-2-341; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA person abandons a nonconforming use if:\n\n(1)\n\nthe person changes the use of property from a nonconforming use to a conforming use;\nor\n\n(2)\n\nthe person discontinues the nonconforming use for 90 consecutive days.\n\n(B)\n\nA seasonal discontinuance of a use, or a temporary discontinuance of a use for maintenance\nor repair, is excluded from a calculation of the 90 day period described in Subsection\n(A)(2).\n\n(C)\n\nA person may not resume an abandoned nonconforming use.\n\nSource: Sections 13-2-342 and 13-2-343; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe table in this section determines whether a nonconforming use must comply with\nthe nonconforming use regulations of Group \"A\", Group \"B\", Group \"C\", or Group \"D\"\nas prescribed by Section 25-2-947 (Nonconforming Use Regulation Groups).\n\n(B)\n\nTo use the table:\n\n(1)\n\nfind the column with the zoning district in which the nonconforming use is located;\n\n(2)\n\nfind the row that describes the nonconforming use; and\n\n(3)\n\nfind the nonconforming use regulation group for the nonconforming use at the intersection\nof the column and the row.\n\n(C)\n\nIn the table, the phrase \"allowed in\" includes permitted and conditional uses.\n\nNONCONFORMING USE TABLE\n\n|  | LA   RR   SF-1   SF-2   SF-3 | SF-4   SF-5   SF-6   MF-1   MF-2   MF-3 | MF-4   MF-5   MF-6   MH | NO   LO   LR | L   GO   GR   CBD   DMU | CS   CS-1   CH | LI   IP | AG   DR |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| Residential uses | B | C | D | D | D | D | D | D |\n| Commercial uses allowed in a LO or GO district | A | B | C | D | D | D | D | D |\n| Commercial uses allowed in a commercial district other than LO or GO | A | A | B | C | D | D | D | D |\n| Industrial uses allowed in a commercial district | A | A | B | B | C | D | D | D |\n| Industrial uses not allowed in a commercial district | A | A | A | B | B | C | D | D |\n| Civic uses allowed in a residential district | B | C | D | D | D | D | D | D |\n| Civic uses not allowed in a residential district | B | B | C | C | D | D | D | D |\n| Agricultural uses | B | B | B | B | B | C | C | C |\n\nSource: Section 13-2-345; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA Group \"A\" nonconforming use must comply with the regulations described in this subsection.\n\n(1)\n\nExcept as provided in Subsections (B)(1) and (2), a Group \"A\" nonconforming use must\ncomply with Group \"B\" nonconforming use regulations.\n\n(2)\n\nA person shall discontinue a nonconforming use not later than 10 years after the date\nthe use becomes nonconforming, if the use occurs:\n\n(a)\n\noutside a structure; or\n\n(b)\n\nin a structure valued at less than $10,000.\n\n(3)\n\nMaintenance or improvement of a structure is limited to that required by law to comply\nwith minimum health and safety requirements. The value of an improvement described\nin this paragraph may not be used in determining the value of a structure.\n\n(B)\n\nA Group \"B\" nonconforming use must comply with the regulations described in this subsection.\n\n(1)\n\nA person may continue a nonconforming use and maintain an associated structure, except\nthe person may not:\n\n(a)\n\nincrease the floor space or site area of a nonresidential use; or\n\n(b)\n\nmake a change that increases the amount of required accessible spaces.\n\n(2)\n\nA person may improve, enlarge, or structurally alter a structure if the cost does\nnot exceed 20 percent of the value of the structure before the improvement.\n\n(3)\n\nAn improvement required by law to meet minimum health and safety requirements, or\nan improvement to a portion of a structure used solely for a conforming use may not\nbe used in determining valuations under Subsection (B).\n\n(C)\n\nA Group \"C\" nonconforming use must comply with the regulations described in this subsection.\n\n(1)\n\nA person may continue a nonconforming use and maintain an associated structure.\n\n(2)\n\nA person may expand the portion of a structure or site that is used for a nonconforming\nuse, except:\n\n(a)\n\nan expansion of the portion of the site must be on the same lot and may occur only\none time; and\n\n(b)\n\nan expansion may not increase the amount of off-street parking that was required prior\nto November 13, 2023, to more than 120 percent of that required for the use on the\nlater of March 1, 1984 or the date the use became nonconforming.\n\n(3)\n\nIf a structure is used for a nonconforming conditional use that the Land Use Commission\nhas not approved, a person may annually expend not more than 20 percent of the value\nof the structure to improve, enlarge, or structurally alter the structure.\n\n(D)\n\nA Group \"D\" nonconforming use must comply with the regulations described in this subsection.\n\n(1)\n\nA Group \"D\" nonconforming use must comply with Group \"C\" nonconforming use regulations.\n\n(2)\n\nA nonconforming conditional use approved by the Land Use Commission may be replaced\nby a similar nonconforming conditional use if the Land Use Commission:\n\n(a)\n\nreviews traffic generation, noise, hours of operation, number of employees, and other\nappropriate performance measures;\n\n(b)\n\ndetermines that the replacement use will not more adversely affect surrounding uses\nthan does the original use; and\n\n(c)\n\napproves the replacement use.\n\n(E)\n\nExcept as provided in Subsections (A)(3) and (B)(3), the value of a structure is the\nvalue established by the tax appraisal district.\n\nSource: Sections 13-1-333 and 13-2-344; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11;\nOrd. No. 20231102-028, Pt. 21, 11-13-23.\n\n(A)\n\nThis section applies to a use that is nonconforming because of its proximity to a\nhazardous pipeline under Section 25-2-516(B) (Development Near a Hazardous Pipeline).\n\n(B)\n\nProximity to a hazardous pipeline does not cause a structure or area to be noncomplying\nunder Article 8 (Noncomplying Structures).\n\n(C)\n\nExcept as provided by Subsection (C), the use is governed by Group \"D\" regulations\nprescribed by Section 25-2-947 (Nonconforming Use Regulation Groups).\n\n(D)\n\nIf there is a conflict between the regulations prescribed by this section and the\nregulations as determined by Section 25-2-946 (Determination of Nonconforming Use Regulation Group), the more restrictive regulations apply.\n\nSource: Ord. 030410-12; Ord. 031211-11.\n\n(A)\n\nThis section applies to a use that is nonconforming under Section 25-2-766.12 (Use Regulations).\n\n(B)\n\nExcept as provided by Subsection (C), the use is governed by Group \"D\" regulations\nprescribed by Section 25-2-947 (Nonconforming Use Regulation Groups).\n\n(C)\n\nIf there is a conflict between the regulations prescribed by this section and the\nregulations as determined by Section 25-2-946 (Determination of Nonconforming Use Regulation Group), the more restrictive regulations apply.\n\nSource: Ord. 20050519-008.\n\n**Editor's note—**\nOrd. No. 20250227-039, Pt. 1, effective February 27, 2025, repealed § 25-2-950, which\npertained to discontinuance of nonconforming short-term rental (type 2) uses and derived\nfrom Ord. No. 20160223-A.1, Pt. 5, 4-1-2017.\n",
  "start_line": 28833,
  "end_line": 29165,
  "subsections": []
}