{
  "id": "25-2-901",
  "title": "RESERVED",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Section 25-2-901 (Accessory Apartments);\n\n(9)\n\nChapter 25-4, Article 3 (Platting Requirements), except for Section 25-4-134 (Hazardous Pipelines);\n\n(10)\n\nChapter 25-5 (Site Plans);\n\n(11)\n\nChapter 25-6, Article 4, Division 2 (Roadways in Water Supply Rural Watersheds or Water Supply Suburban Watersheds);\n\n(12)\n\nChapter 25-6, Article 7 (Off-Street Parking and Loading); and\n\n(13)\n\nSection 25-6-171 (Standards for Design and Construction).\n\nSource: Section 13-9-5; Ord. 990225-70; Ord. 030410-12; Ord. 031211-11; Ord. No. Ord. No. 20231207-001, Pt. 18, 12-18-23.\n\nOnly property in the full purpose limits of the city may be designated as a traditional\nneighborhood zoning district.\n\nSource: Ord. 031211-42.\n\nA traditional neighborhood district is a zoning district that is created in the same\nmanner as other zoning districts. The procedures in Chapter 25-2, Subchapter B (Zoning Procedures; Special Requirements for Certain Districts) apply to a traditional neighborhood zoning district. Additional requirements are\ndescribed in this article.\n\nSource: Section 13-9-11; Ord. 990225-70; Ord. 031211-11.\n\nAn application for zoning or rezoning to a traditional neighborhood district may not\nbe accepted for filing before the applicant meets with the director or the director's\ndesignee in a presubmittal meeting. The purpose of the meeting is to acquaint the\ncity staff with the proposed development, provide the applicant with preliminary staff\ncomments, and identify major concerns or the need for additional data. Discussion\ntopics at the meeting must include transportation, the environment, drainage, land\nuse, and design concepts.\n\nSource: Section 13-9-12; Ord. 990225-70; Ord. 031211-11.\n\nAn applicant for a traditional neighborhood district shall prepare a Development Plan\nas part of the zoning application. The Development Plan must contain the following\ninformation:\n\n(1)\n\nlocations and sizes of the Neighborhood Center Area, Mixed Residential Area, and,\nif applicable, Neighborhood Edge Area, Workshop Area, and Employment Center Area;\n\n(2)\n\nlocations of major civic uses;\n\n(3)\n\nlocations of commercial uses in Mixed Residential Areas;\n\n(4)\n\nlayout of the transportation network for all modes of travel;\n\n(5)\n\nlocations and sizes of private open space and public open space;\n\n(6)\n\nlocations and descriptions of proposed major private open space improvements;\n\n(7)\n\na construction phasing plan for major private open space improvements, if needed;\n\n(8)\n\nlocations and types of drainage and water quality controls;\n\n(9)\n\nlocations and types of environmentally sensitive areas, including critical environmental\nfeatures, critical water quality zones, and water quality transition zones;\n\n(10)\n\na tree protection plan, including an aerial photograph, that demonstrates that the\ndesign of the traditional neighborhood district will result in the reasonable preservation\nof protected trees and significant tree clusters;\n\n(11)\n\nthe 100-year floodplain, as calculated to exist under fully developed conditions in\naccordance with the Drainage Criteria Manual;\n\n(12)\n\nthe locations of major utility facilities and easements that are within or immediately\nadjacent to the proposed traditional neighborhood district;\n\n(13)\n\npreliminary architectural standards that are consistent with the architectural objectives\nof this chapter; and\n\n(14)\n\nall additional information required by the director to demonstrate compliance with\nthe traditional neighborhood district concept.\n\nSource: Section 13-9-13; Ord. 990225-70; Ord. 031211-11.\n\nThe Development Plan for the traditional neighborhood district shall be included in\nthe ordinance zoning or rezoning the land as a traditional neighborhood district.\n\nSource: Section 13-9-14; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA minor revision to a Development Plan may not be made to an area that is part of\na final plat. The director may administratively approve minor revisions to a Development\nPlan if the director determines that there are no adverse effects on areas that are\npart of a final plat. The following are minor revisions:\n\n(1)\n\nThe location of a Neighborhood Center Area, a Mixed Residential, a Neighborhood Edge\nArea, a Workshop Area, or an Employment Center Area may be revised if the director\ndetermines that (a) the basic layout of the traditional neighborhood district remains\nthe same, and (b) the district functions as well as before the revision.\n\n(2)\n\nThe size of a Neighborhood Center Area, a Mixed Residential, a Neighborhood Edge Area,\na Workshop Area, or an Employment Center Area may be revised if the size is increased\nor decreased by not more than 10 percent, and the director determines that (a) the\nbasic layout of the traditional neighborhood district remains the same, and (b) the\ndistrict functions as well as before the revision.\n\n(3)\n\nThe location of a major civic use may be revised if the director determines that (a)\nthe revised location is appropriate, and (b) the transportation network, the infrastructure,\nand the overall land use mix are not adversely affected. The director may not approve\na revision that includes the addition of a major civic use within 200 feet of an area\nthat is part of a final plat in a Mixed Residential Area or Neighborhood Edge Area.\n\n(4)\n\nThe location of a commercial use in a Mixed Residential Area may be revised if the\ndirector determines that the revised location is appropriate.\n\n(5)\n\nThe layout of a transportation network may be revised if the director determines that\n(a) the basic layout remains the same, and (b) the revised layout functions as well\nas the previous layout.\n\n(6)\n\nThe location or size of a private open space may be revised if the overall amount\nof private open space acreage does not decrease, and the director determines that\nthe quality and functionality of the revised private open space is the same or better.\nThe director may not approve a revision that includes the deletion of a private open\nspace within 200 feet of an area that is part of a final plat in a Mixed Residential\nArea or Neighborhood Edge Area.\n\n(7)\n\nThe location or size of a public open space may be revised if the overall amount of\npublic open space acreage does not decrease, and the director determines that the\nquality and functionality of the revised public open space is the same or better.\nThe director may not approve a revision that includes the deletion of a public open\nspace within 200 feet of an area that is part of a final plat in a Mixed Residential\nArea or Neighborhood Edge Area. The location or size of a public open space may not\nbe revised without the approval of the director of the Parks and Recreation Department.\n\n(8)\n\nThe location or description of a major private open space improvement may be revised\nif the director determines that the revised improvement is as beneficial to the residents\nas the previous improvement.\n\n(9)\n\nA construction phasing plan for major private open space improvements may be revised\nto extend a deadline by not more than 18 months.\n\n(10)\n\nThe location or type of a drainage or water quality control may be revised if the\ndirector determines that (a) the basic layout of the traditional neighborhood district\nremains the same, and (b) the revised location or type of control functions as well\nas the previous location or type of control.\n\n(11)\n\nThe location or type of an environmentally sensitive area may be revised if the director\ndetermines that the revision more accurately describes the location or type of an\nenvironmentally sensitive area.\n\n(12)\n\nA tree protection plan may be revised if the director determines that the revised\nplan provides the same or more protection for trees overall.\n\n(13)\n\nThe location of a 100 year floodplain may be revised if the director determines that\nthe revision more accurately describes the location of the floodplain.\n\n(14)\n\nThe locations of major utility facilities and easements may be revised if the director\ndetermines that the revised locations are more appropriate or functional.\n\n(15)\n\nA preliminary architectural standard may be revised if the director determines that\nthe revised standard is consistent with the architectural character of the traditional\nneighborhood district.\n\n(B)\n\nAll revisions other than those described in Subsection (A) are major revisions. Major\nrevisions must be approved by the city council through a rezoning of the property.\n\nSource: Section 13-9-15; Ord. 990225-70; Ord. 031211-11.\n\nThe city council may, at the time a traditional neighborhood district is created,\nmodify the permitted uses or the site development regulations set forth in this chapter.\nThe modifications must be included in the ordinance zoning or rezoning the property.\nModifications may be permitted only if justified by exceptional circumstances and\nmust be consistent with the character of the traditional neighborhood district.\n\nSource: Section 13-9-16; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe specific land uses for a Workshop Area or an Employment Center Area must be proposed\nby the applicant, approved by the city council, and included in the ordinance zoning\nor rezoning the property. Those land uses must be consistent with this section.\n\n(B)\n\nA Workshop Area is for commercial and light industrial uses that are not appropriate\nfor a Neighborhood Center Area or Mixed Residential Area but which serve the local\nresidents.\n\n(C)\n\nAn Employment Center Area is for large office and low-impact manufacturing uses.\n\nSource: Section 13-9-17; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nSingle family residential use is permitted in a Neighborhood Edge Area.\n\n(B)\n\nA major civic use is permitted in a Neighborhood Edge Area if shown on the Development\nPlan.\n\n(C)\n\nAll other uses are prohibited in a Neighborhood Edge Area.\n\nSource: Section 13-9-18; Ord. 990225-70; Ord. 031211-11.\n\nThe table below lists the permitted uses within a Neighborhood Center Area and a Mixed\nResidential Area of a traditional neighborhood district. \"MRA\" means Mixed Residential\nArea, \"NCA\" means Neighborhood Center area, \"P\" means that a use is permitted, \"P\\*\"\nmeans that a use is permitted but subject to Section 25-3-105 (Additional Regulations For Neighborhood Center Area), and \"X\" means that a use is\nnot permitted. Uses not listed in the table are not permitted.\n\n| TABLE OF PERMITTED USES | | |\n| --- | --- | --- |\n| Residential Uses | MRA | NCA |\n| Condominiums | P | P\\* |\n| Duplex Residential | P | X |\n| Group Residential | P | P\\* |\n| Lodging House Residential | P | P\\* |\n| Multi-Family Residential | P | P\\* |\n| Retirement Housing (Large Site) | X | P\\* |\n| Retirement Housing (Small Site) | P | P\\* |\n| Single Family Residential | P | X |\n| Townhouse Residential | P | P\\* |\n|  |  |  |\n| Commercial Uses | MRA | NCA |\n| Administrative & Business Office | P | P |\n| Art Gallery | P | P |\n| Art Workshop | X | P |\n| Automotive Rentals | X | P\\* |\n| Automotive Repair Services | X | P\\* |\n| Building Maintenance Services | X | P |\n| Business or Trade School | X | P |\n| Business Support Services | X | P |\n| Cocktail Lounge | P | P |\n| Commercial Blood Plasma Center | X | P |\n| Commercial Off-Street Parking | X | P\\* |\n| Communications Services | X | P |\n| Consumer Convenience Services | P | P |\n| Consumer Repair Services | P | P |\n| Drop-off Recycling Collection Facility | X | P |\n| Electronic Prototype Assembly | X | P |\n| Exterminating Services | X | P |\n| Financial Services | X | P |\n| Food Preparation | X | P |\n| Food Sales | P | P |\n| General Retail Sales (Convenience) | P | P |\n| General Retail Sales (General) | X | P |\n| Hotel-Motel | X | P |\n| Indoor Entertainment | X | P |\n| Indoor Sports & Recreation | X | P |\n| Kennels | X | P\\* |\n| Liquor Sales | X | P |\n| Medical Offices | P | P |\n| Off-site Accessory Parking | X | P |\n| Outdoor Sports & Recreation | P | P |\n| Pawn Shop Services | X | P |\n| Personal Improvement Services | P | P |\n| Personal Services | P | P |\n| Pet Services | P | P |\n| Printing and Publishing | X | P |\n| Professional Office | P | P |\n| Research Assembly Services | X | P |\n| Restaurant (General) | P | P |\n| Restaurant (Limited) | P | P |\n| Service Station | X | P\\* |\n| Software Development | P | P |\n| Theater | X | P |\n|  |  |  |\n| Industrial Uses | MRA | NCA |\n| Custom Manufacturing | X | P |\n|  |  |  |\n| Civic Uses | MRA | NCA |\n| Club or Lodge | P | P |\n| College & University Facilities | X | P |\n| Communication Service Facilities | P | P |\n| Community Recreation (Private) | P | P |\n| Community Recreation (Public) | P | P |\n| Congregate Living | X | P |\n| Convalescent Services | X | P |\n| Cultural Services | P | P |\n| Day Care Services (Commercial) | X | P |\n| Day Care Services (General) | P | P |\n| Day Care Services (Limited) | P | P |\n| Family Home | P | P |\n| Group Home, Class I (General) | P | P |\n| Group Home, Class I (Limited) | P | P |\n| Group Home, Class II | P | P |\n| Guidance Services | X | P |\n| Hospital Services (Limited) | X | P |\n| Local Utility Services | P | P |\n| Major Utility Facilities | P | P |\n| Park & Recreation Services (General) | P | P |\n| Park & Recreation Services (Special) | P | P |\n| Postal Facilities | X | P |\n| Private Primary Educational Facilities | P | P |\n| Private Secondary Educational Facilities | P | P |\n| Public Primary Educational Facilities | P | P |\n| Public Secondary Educational Facilities | P | P |\n| Religious Assembly | P | P |\n| Safety Services | P | P |\n| Telecommunications Tower | X | P\\* |\n| Transportation Terminal | X | P |\n\nSource: Section 13-9-19; Ord. 990225-70; Ord. 031211-11; Ord. 031211-41; Ord. 040617-Z-1.\n\nThe subdivision procedures in Chapter 25-4 (Subdivision) apply to the traditional neighborhood district, except as follows:\n\n(1)\n\nAll property within a traditional neighborhood district must be subdivided under this\nchapter. A previously approved final subdivision plat must be vacated, and a previously\napproved preliminary subdivision plan must be withdrawn.\n\n(2)\n\nThe traditional neighborhood district shall be on one preliminary subdivision plan.\n\n(3)\n\nAn open space area shall be included in the final subdivision plat of adjacent property.\nAll open space areas must be platted as separate open space lots.\n\n(4)\n\nA final subdivision plat may not be approved unless there has been compliance with\nthe provisions of this chapter relating to a Property Owners' Association, Architectural\nStandards, Land Use Allocations, Drainage, and Water Quality.\n\n(5)\n\nA final subdivision plat for more than 50 percent of the land area covered by the\npreliminary subdivision plan may not be approved until construction of the community\nmeeting hall has begun. Once begun, the construction of the community meeting hall\nmust be diligently pursued to completion.\n\n(6)\n\nImprovements to private open spaces, except those included in a construction phasing\nplan for major private open space improvements, shall be constructed by the subdivider\nas part of the subdivision infrastructure.\n\nSource: Section 13-9-31; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nStreet monuments and property markers.\n\n(1)\n\nProperty pins or other forms of permanent markers identified in the most recent edition\nof the Manual of Practice for Land Surveying in Texas, published by the Texas Society\nof Professional Surveyors, shall be placed by the surveyor at all corners of boundary\nlines of a subdivision. Pins and markers may not be spaced more than 1,300 feet apart.\nOne corner of the subdivision shall be identified by a concrete monument unless a\nconcrete monument exists on an adjacent platted subdivision within 1,300 feet of the\nproposed plat.\n\n(2)\n\nIf a concrete monument exists on an adjacent platted subdivision within 1,300 feet\nof the proposed plat, no concrete monuments are required for the proposed plat. In\nthat instance, boundary corners may be set with permanent markers identified in the\nmost recent edition of Manual of Practice for Land Surveying in Texas.\n\n(3)\n\nIntermediate property corners, curve points, and angle points shall be marked by iron\nstakes.\n\n(B)\n\nEasements for public utilities and enclosed or open drainage ways shall be retained\nin all subdivisions in the widths and locations deemed necessary by the director.\nTo the extent practicable, the easements for water lines, wastewater lines, and storm\nsewers shall be located in the street rights-of-way, and the easements for all other\nutilities shall be located in the alley rights-of-way. All the easements shall be\ndedicated to public use for the named purpose and shall be aligned to minimize construction\ncost.\n\n(C)\n\nUtilities shall be located underground unless this requirement is, for good cause,\nwaived by the director, and, if applicable, the director of the Electric Utility Department.\n\n(D)\n\nWhen the director finds that easements in areas adjoining a proposed subdivision are\nnecessary to provide adequate drainage or to serve the subdivision with utilities,\nthe subdivider shall obtain the easements or make arrangements with the City to obtain\nthem.\n\n(E)\n\nStreets of new subdivisions shall be aligned with existing streets on adjoining property\nunless the Land Use Commission determines that the Comprehensive Plan, topography,\nrequirements of traffic circulation, or other considerations make it desirable to\ndepart from the alignment.\n\n(F)\n\nEach lot in a subdivision, except a lot that fronts on a plaza and abuts an alley,\nshall abut a dedicated public street.\n\n(G)\n\nExcept in a Neighborhood Edge Area, each lot in a subdivision shall abut an alley\nunless the director determines that good cause exists to omit an alley or portion\nof an alley.\n\n(H)\n\nAn interconnected network of streets is required unless the director determines that\ngood cause exists to require a different street pattern.\n\n(I)\n\nStreets, alleys, and pedestrian paths shall be designed and constructed in accordance\nwith this chapter, the Traditional Neighborhood District Criteria Manual, the Standards\nCriteria Manual, and the Standard Specifications Criteria Manual.\n\n(J)\n\nNew streets in subdivisions shall be named to provide continuity of name with existing\nstreets and to prevent conflict with identical or similarly spelled or pronounced\nnames in other parts of the city's planning jurisdiction.\n\n(K)\n\nStreet intersections, whether public or private streets, shall be designed in accordance\nwith the provisions of the Traditional Neighborhood District Criteria Manual and the\nTransportation Criteria Manual.\n\n(L)\n\nDead-end streets are prohibited unless the director determines that the most desirable\nplan requires laying out a dead-end street. A dead-end street shall terminate in a\ncourtyard designed in accordance with the Traditional Neighborhood District Criteria\nManual, unless the director determines that topography, density, adequate circulation,\nor other unusual conditions require a deviation from the design criteria in the Traditional\nNeighborhood District Criteria Manual.\n\n(M)\n\nThe side lines of lots in subdivisions shall be approximately at right angles to straight\nstreet lines or radial to curved street lines. An arrangement placing adjacent lots\nat right angles to each other shall be avoided.\n\n(N)\n\nBlock length may not exceed 600 feet. Block width may not exceed 300 feet. The director\nmay approve a block width of not more than 400 feet or a block length of not more\nthan 1000 feet if required because of topography or existing street layout, but a\nblock longer than 800 feet must be traversed by a pedestrian path near the midpoint.\n\n(O)\n\nMinimum lot size, maximum lot size, and minimum lot width are specified in the site\ndevelopment regulations contained in this chapter for a Neighborhood Center Area,\na Mixed Residential Area, a Neighborhood Edge Area, a Workshop Area, and an Employment\nCenter Area. Open space lots must comply with the dimensional requirements of this\nchapter.\n\n(P)\n\nTownhouse lots may be created where each townhouse lot is to be served by a public\nsewage system, subject to the following conditions in addition to those applicable\nto all other subdivisions:\n\n(1)\n\nAll common areas shall be clearly identified on the plat and adequate provisions made\nfor maintenance and taxation.\n\n(2)\n\nThere may be not less than two and not more than eight units in a townhouse group.\n\n(3)\n\nNot more than one townhouse may be located on a lot.\n\n(4)\n\nA legal opinion by an attorney licensed to practice law in the state, accurately describing\nand defining the rights and duties of the owners, the legal status of common areas\nand facilities, and provisions for taxation and maintenance of the common areas, must\naccompany each subdivision with townhouse lots.\n\nSource: Section 13-9-32; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nThis article applies to the design and development of a traditional neighborhood district.\n\nSource: Section 13-9-41; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nConditions, Covenants, and Restrictions for all the property within a traditional\nneighborhood district must be filed in the county real property records by the owner\nbefore a final subdivision plat may be approved, a lot sold, or a building permit\nissued.\n\n(B)\n\nConditions, Covenants, and Restrictions must be approved by the city attorney, and\nthey must:\n\n(1)\n\ncreate a Property Owners' Association with mandatory membership for each property\nowner;\n\n(2)\n\nestablish architectural standards that are in conformity with the requirements of\nthis chapter;\n\n(3)\n\ncreate an Architectural Control Committee to review development for compliance with\nthe architectural standards and issue certificates of approval;\n\n(4)\n\nprovide for the ownership, development, management, and maintenance of private open\nspace (except plazas owned by individual property owners), community parking facilities,\ncommunity meeting hall, and other common areas;\n\n(5)\n\nprovide for the maintenance of the landscaping and trees within the streetscape;\n\n(6)\n\nrequire the collection of assessments from members in an amount sufficient to pay\nfor its functions;\n\n(7)\n\nbe effective for a term of not less than 50 years;\n\n(8)\n\nrequire that the Property Owners' Association obtain the approval of the director\nregarding the disposition and management of private open space, community parking\nfacilities, community meeting hall, and other common areas before it may be dissolved;\nand\n\n(9)\n\nrequire that the Property Owners' Association obtain the approval of the director\nfor amendments to the Conditions, Covenants, and Restrictions which relate to provisions\nrequired by this chapter.\n\nSource: Section 13-9-42; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA community meeting hall for the use of the neighborhood residents is required. The\ncommunity meeting hall is a civic use.\n\n(B)\n\nA community meeting hall must be located so that it is easily accessible to the residents.\nIt may be placed in a square, park, or other suitable open space location.\n\n(C)\n\nThe minimum size of a community meeting hall is 2,000 square feet. A community meeting\nhall must be large enough to meet the needs of the neighborhood residents.\n\nSource: Section 13-9-43; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe Conditions, Covenants, and Restrictions shall establish architectural standards\nfor the property within a traditional neighborhood district. The standards must comply\nwith this section.\n\n(B)\n\nThe architectural standards must achieve the following objectives:\n\n(1)\n\narchitectural compatibility;\n\n(2)\n\nhuman scale design;\n\n(3)\n\nintegration of uses;\n\n(4)\n\nencouragement of pedestrian activity;\n\n(5)\n\nbuildings that relate to and are oriented toward the street and surrounding buildings;\n\n(6)\n\nresidential scale buildings in Mixed Residential Areas;\n\n(7)\n\nbuildings that contain special architectural features to signify entrances to the\nNeighborhood Center Area and important street intersections; and\n\n(8)\n\nNeighborhood Center Area buildings that focus activity on the neighborhood square.\n\n(C)\n\nThe director may adopt guidelines for architectural standards for inclusion in the\nTraditional Neighborhood District Criteria Manual.\n\nSource: Section 13-9-44; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nEach lot within a traditional neighborhood district must be allocated to a particular\nland use category.\n\n(B)\n\nThe amounts of land that must be allocated to particular land use categories, excluding\nstreets, alleys, open spaces, drainage controls, and water quality controls, are as\nfollows:\n\n(1)\n\nFor a Neighborhood Center Area:\n\n(a)\n\nTownhouse, condominium, and multi-family uses shall be allocated not less than 20\npercent of the land area.\n\n(b)\n\nCommercial uses shall be allocated not less than 20 percent of the land area.\n\n(c)\n\nCivic use shall be allocated not less than five percent of the land area, or one-half\nacre, whichever is greater. In a traditional neighborhood district of 100 acres or\nless, the provision of a community meeting hall in the Neighborhood Center satisfies\nthe civic use allocation even if less than one-half acre is used.\n\n(2)\n\nFor a Mixed Residential Area:\n\n(a)\n\nSingle family residential use shall be allocated not less than 50 percent and not\nmore than 80 percent of the land area.\n\n(b)\n\nDuplex use shall be allocated not more than 10 percent of the land area.\n\n(c)\n\nTownhouse, condominium, and multi-family uses shall be allocated not less than 10\npercent of the land area.\n\n(d)\n\nCommercial uses shall be allocated not less than one percent and not more than two\npercent of the land area.\n\n(e)\n\nCivic uses shall be allocated not less than two percent of the land area.\n\n(C)\n\nA preliminary subdivision plan may not be approved until the director approves a Land\nUse Allocation Map, submitted by the owner, that allocates a particular land use category\nto each lot on the preliminary subdivision plan.\n\n(D)\n\nDevelopment and use shall comply with the Land Use Allocation Map.\n\n(E)\n\nThe director may approve a revision to a Land Use Allocation Map if the director finds\nthat (a) the revised land uses are appropriate, and (b) the revision does not adversely\naffect land owners within 200 feet of the boundary line of a revised area.\n\n(F)\n\nA Land Use Allocation Map and the land use allocations required by this section are\neffective for a period of 50 years after the date the map is first approved by the\ndirector.\n\nSource: Section 13-9-45; Ord. 990225-70; Ord. 031211-11.\n\nThe following open space requirements apply within a traditional neighborhood district:\n\n(1)\n\nNot less than 20 percent of the gross land area of the traditional neighborhood district\nmust be open space.\n\n(2)\n\nPublic open space shall conform to the plans, goals, and standards of the Parks and\nRecreation Department and must be approved by the director of the Parks and Recreation\nDepartment.\n\n(3)\n\nThe Parks and Recreation Department shall be consulted regarding the locations and\ntypes of private open space.\n\n(4)\n\nThe portions of drainage and water quality facilities that are usable by the public\nfor recreational purposes, as determined by the director, may be designated as parks\nor greenbelts.\n\n(5)\n\nAt least one square shall be located in the Neighborhood Center Area. The required\nsquare shall be at least one-half acre in size in a traditional neighborhood district\nof 100 acres or less, and the required square shall be at least one acre in size in\na traditional neighborhood district that is larger than 100 acres.\n\n(6)\n\nA square must adjoin streets along at least 75 percent of its perimeter.\n\n(7)\n\nA plaza must adjoin building lots along at least 50 percent of its perimeter.\n\n(8)\n\nAt least one green that is not less than one acre in size must be located within 600\nfeet of the geographic center of the traditional neighborhood district.\n\n(9)\n\nA park may be not less than 10,000 square feet in size.\n\n(10)\n\nA greenbelt may not be located behind dwellings. The director may permit exceptions\nwhere topography, existing street layout, or other good reasons that make this restriction\nimpractical. If a greenbelt is located behind dwellings, access shall be provided\nin accordance with the Traditional Neighborhood Criteria Manual standards.\n\n(11)\n\nA greenbelt must have an average width of not less than 200 feet. A greenbelt may\nbe not less than 50 feet wide. Not more than 10 percent of the uninterrupted length\nof a greenbelt may be the minimum 50 feet width. A greenbelt must have not less than\n25 percent of its boundary abutting a street.\n\n(12)\n\nAt least 90 percent of the lots in a Mixed Residential Area must be within 600 feet\nof a square, plaza, green, or park.\n\nSource: Section 13-9-46; Ord. 990225-70; Ord. 031211-11.\n\nThe parkland dedication provisions of Chapter 25-4, Article 3, Division 5 (Parkland Dedication) apply to a traditional neighborhood\ndistrict, except as follows:\n\n(1)\n\nThe amount of land required to be dedicated for parkland is 25 percent of the open",
  "start_line": 41135,
  "end_line": 41981,
  "subsections": [
    "25-2-901-A",
    "25-2-901-B",
    "25-2-901-A",
    "25-2-901-B",
    "25-2-901-C",
    "25-2-901-A",
    "25-2-901-B",
    "25-2-901-C",
    "25-2-901-A",
    "25-2-901-B",
    "25-2-901-C",
    "25-2-901-D",
    "25-2-901-E",
    "25-2-901-F",
    "25-2-901-G",
    "25-2-901-H",
    "25-2-901-I",
    "25-2-901-J",
    "25-2-901-K",
    "25-2-901-L",
    "25-2-901-M",
    "25-2-901-N",
    "25-2-901-O",
    "25-2-901-P",
    "25-2-901-A",
    "25-2-901-B",
    "25-2-901-A",
    "25-2-901-B",
    "25-2-901-C",
    "25-2-901-A",
    "25-2-901-B",
    "25-2-901-C",
    "25-2-901-A",
    "25-2-901-B",
    "25-2-901-C",
    "25-2-901-D",
    "25-2-901-E",
    "25-2-901-F"
  ]
}