{
  "id": "25-2-765",
  "title": "AFFORDABLE HOUSING",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "housing under Section 25-2-765 (Affordable Housing), with each square foot of net rentable floor area counted towards the fee provided\nfor under Subsection (B) of that section.\n\n(K)\n\nA hotel/motel use may associated condominium residential, multifamily residential,\nretirement housing (small site), or retirement housing (large site) uses.\n\n(L)\n\nExisting structures constructed under the provisions of this division may convert\nnon-accessible parking spaces to:\n\n(1)\n\na multi-family residential use;\n\n(2)\n\na group residential use;\n\n(3)\n\nlocal uses located above or adjacent to the street wall area;\n\n(4)\n\nan art gallery use and an art workshop use are limited to 1,500 square feet of floor\narea; and\n\n(5)\n\nan indoor crop production use or convenience storage use not located in or above a\nstreet wall area.\n\nSource: Ord. 040902-58; Ord. 20050519-Z001; Ord. 20080925-039; Ord. 20121108-090; Ord. No. 20191114-067, Pts. 1, 2, 11-25-19.\n\nThe minimum lot area is 2,500 square feet.\n\nSource: Ord. 040902-58.\n\n(A)\n\nExcept as provided in Subsection (B), maximum heights for structures are prescribed\nby Appendix C (University Neighborhood Overlay District Boundaries, Subdistrict Boundaries, Height\nLimits, and Additional Height and Affordability).\n\n(B)\n\nThis subsection applies in the outer west campus subdistrict, Guadalupe subdistrict,\nand inner west campus subdistrict.\n\n(1)\n\nExcept as provided in Paragraph (2), a structure with a multi-family residential use\nor group residential use may exceed by 25 feet in the outer west campus subdistrict\nor the Guadalupe subdistrict the maximum height prescribed by Appendix C (University Neighborhood Overlay District Boundaries, Subdistrict Boundaries, Height\nLimits, and Additional Height and Affordability) if the structure is located in an area with a maximum height of at least 50 feet;\nor\n\n(2)\n\nA structure with a multi-family residential use or group residential use may exceed\nby 125 feet in the inner west campus subdistrict the maximum height prescribed by\nAppendix C (University Neighborhood Overlay District Boundaries, Subdistrict Boundaries, Height\nLimits, and Additional Height and Affordability) if the multi-family residential use or group residential use, for a period of not\nless than 40 years from the date a certificate of occupancy is issued, sets aside\nat least:\n\n(a)\n\n10 percent of the dwelling units or bedrooms on the site to house persons whose household\nincome is at or below 60 percent of the median income in the Austin statistical metropolitan\narea, as determined by the director of the Neighborhood Housing and Community Development\nOffice;\n\n(b)\n\n10 percent of the dwelling units or bedrooms on the site to house persons whose household\nincome is at or below 50 percent of the median income in the Austin statistical metropolitan\narea, as determined by the director of the Neighborhood Housing and Community Development\nOffice; and\n\n(c)\n\nThe applicant:\n\n1.\n\nPays into the University Neighborhood District Housing Trust Fund a fee of $0.50 for\neach square foot of net rentable floor area in the multi-family residential use or\ngroup residential use development; or,\n\n2.\n\nProvides an additional 10 percent of the dwelling units or bedrooms on the site to\nhouse persons whose household income is at or below 50 percent of the median income\nin the Austin statistical metropolitan area as determined by the director of the Neighborhood\nHousing and Community Development Office.\n\n(3)\n\nA building on a lot in the outer west campus subdistrict that has a common side lot\nline with a historic property may not exceed by more than 20 feet the maximum building\nheight of the base district in which the historic property is located.\n\n(4)\n\nThe fee in Subsection (b)(2)(c) above will be adjusted annually in accordance with\nthe Consumer Price Index all Urban Consumers, US City Average, All Items (1982-84=100),\nas published by the Bureau of Labor Statistics of the United States Department of\nLabor or in accordance with any other similar, applicable standard as defined by the\ndirector of the Neighborhood Housing and Community Development Office. The city manager\nshall annually determine the new fee amounts for each fiscal year, beginning October\n1, 2014 and report the new fee amounts to the city council.\n\nSource: Ord. 040902-58; Ord. 20080925-039; Ord. 20140213-056, Pt. 1, 2-25-14; Ord. No. 20191114-067, Pt. 3, 11-25-19.\n\n(A)\n\nThere are no minimum front yard or street side yard setbacks, except the minimum setbacks\nare 10 feet along Martin Luther King, Jr. Blvd. between Rio Grande Street and San\nGabriel Street.\n\n(B)\n\nThe maximum front yard setback and the maximum street side yard setback are 10 feet,\nexcept:\n\n(1)\n\nthe maximum setbacks are 15 feet along 24th Street or along Martin Luther King, Jr.\nBlvd. between Rio Grande Street and San Gabriel Street;\n\n(2)\n\nthe maximum setbacks are 45 feet for a public plaza or private common open space;\n\n(3)\n\nthere are no maximum setbacks for a pedestrian entry court or an outdoor café;\n\n(4)\n\nthe director of the Watershed Protection and Development Review Department may modify\na maximum setback if the director determines that the modification is required to\nprotect a historic structure or a tree designated as significant by the city arborist;\nand\n\n(5)\n\nas otherwise provided in Subsection (E).\n\n(C)\n\nThere is no minimum or maximum interior side yard setback.\n\n(D)\n\nThere is no minimum or maximum rear yard setback.\n\n(E)\n\nA building must be at least 12 feet from the front face of the curb of the adjacent\nstreet and at least 30 feet from the centerline of the adjacent street.\n\n(F)\n\nThis subsection applies to the portion of a site that is subject to compatibility\nstandards, as described in Section 25-2-763(A)(1) (Certain Regulations Inapplicable or Superseded) and Article 10 (Compatibility Standards). A building or a solid masonry wall that is at least six feet high is required between\na public or common open space and the property that triggers the compatibility standards.\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nAn exterior building wall that faces a street must be at least 24 feet high.\n\n(B)\n\nExcept as provided in Subsection (C):\n\n(1)\n\nif an exterior wall of a building is adjacent to a street other than an alley, at\na height of 65 feet, the upper portion of the wall must be set back from the property\nline by a distance of at least 12 feet; and\n\n(C)\n\nA parapet may not extend more than five feet above the 65 foot stepback height described\nin Subsection (B) or more than five feet above the total building height.\n\n(D)\n\nInstead of complying with Subsections (A) and (B), a hotel/motel use in the outer\nwest campus subdistrict must comply with the requirements of this subsection.\n\n(1)\n\nOn property fronting Martin Luther King, Jr. Blvd., all buildings must fit with in\nan envelope delineated by a 45 degree angle starting at a height of 60 feet above\nthe grade of the property line adjacent to Martin Luther King, Jr. Blvd. and extending\nto a maximum height of 85 feet.\n\n(2)\n\nIf the property abuts a historic property as defined in Section 25-2- 756(B)(3), the property must have open space measuring at least 50 feet deep for\nat least 50 feet along the street frontage beginning at the common boundary with the\nhistoric property. The open space shall contain no buildings, but may contain paving,\nparking, fountains, fences, patios, terraces, canopies, trellises, and landscaping.\n\n(3)\n\nIf parking is provided on the site, 75 percent of the spaces must be below grade.\n\nSource: Ord. 040902-58; Ord. 20080925-039; Ord. No. 20191114-067, Pt. 4, 11-25-19.\n\n(A)\n\nAt least 42 percent of the street wall area of a building must contain occupant space.\n\n(B)\n\nIf a building has street wall areas on more than one street, at least 70 percent of\nthe required occupant space must be on a street that runs east and west.\n\n(C)\n\nThis section does not apply to a commercial off-street parking structure.\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nA site owner shall install a sidewalk not less than 12 feet wide along each street\nfrontage adjacent to the site.\n\n(B)\n\nSidewalks must be level with the top of the curb of the adjacent street, except to\nthe minimum degree necessary to provide for drainage.\n\n(C)\n\nA site owner shall plant and maintain trees along an adjacent street right-of-way.\n\n(1)\n\nTrees must be spaced to create a nearly contiguous canopy when the trees reach maturity.\n\n(2)\n\nA tree must be in scale with the adjacent building.\n\n(3)\n\nA tree planted in a sidewalk area must have a tree grating.\n\n(D)\n\nA site owner shall provide pedestrian-scale lighting and street furnishings along\nan adjacent street right-of-way.\n\n(E)\n\nThe director of the Neighborhood Planning and Zoning Department shall adopt rules\nprescribing the requirements for tree planting and maintenance and the provision of\npedestrian-scale lighting and street furnishings.\n\n(F)\n\nThe director of the Watershed Protection and Development Review Department may require\nfiscal security to ensure compliance with this section.\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nUtility equipment, mechanical equipment, and large trash receptacles:\n\n(1)\n\nare prohibited in the area between a building and a street; and\n\n(2)\n\nmust not be visible from a street.\n\n(B)\n\nThis subsection applies to a site with frontage on an alley 20 feet or more wide.\n\n(1)\n\nA transformer room or utility vault must be adjacent to and accessible from the alley.\n\n(2)\n\nA pump room, sprinkler room, or other utility or mechanical room must be adjacent\nto and accessible from the alley unless the Fire Chief determines that placing the\nroom in another location is required because of a fire safety issue.\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nVehicular access to a site from a public street that runs east and west is limited\nto one curb cut for each 140 feet of street frontage.\n\n(B)\n\nVehicular access to a site from a public street that runs north and south is limited\nto two curb cuts.\n\n(C)\n\nVehicular access to a corner lot must be from a public street or alley that runs north\nand south.\n\n(D)\n\nA site with access to an alley must use the alley or a parking structure for service\nand delivery access.\n\n(E)\n\nA site that does not have access to an alley must provide a service and delivery area\nthat is at least 30 feet deep, measured from the front setback line or side setback\nline, as applicable.\n\n(F)\n\nA driveway turn radius may not exceed 15 feet unless the Fire Chief determines that\na larger radius is required because of a fire safety issue.\n\n(G)\n\nThe director of the Watershed Protection and Development Review Department may waive\nor modify a requirement of this section if the director determines that the waiver\nor modification is necessary for adequate traffic circulation or public safety.\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nThe following provisions of this subchapter do not apply:\n\n(1)\n\nmaximum floor-to-area ratios;\n\n(2)\n\nmaximum building coverage percentages;\n\n(3)\n\nArticle 9 (Landscaping); and\n\n(4)\n\nArticle 10 (Compatibility Standards), if the property is at least 75 feet from the boundary of the university neighborhood\noverlay district.\n\n(B)\n\nImpervious cover limitations of this subchapter are superseded by this subsection.\nMaximum impervious cover is:\n\n(1)\n\n100 percent in the inner west campus and Guadalupe subdistricts;\n\n(2)\n\nthe greater of 90 percent or the percentage permitted in the base zoning district\nin the outer west campus subdistrict; and\n\n(3)\n\nthe greater of 85 percent or the percentage permitted in the base zoning district\nin the Dobie subdistrict.\n\n(C)\n\nFor a multi-family residential use, minimum site area and open space requirements\nof this subchapter do not apply.\n\n(D)\n\nSpecial regulations governing signs in university neighborhood overlay district are\nin Section 25-10-133 (University Neighborhood Overlay Zoning District Signs).\n\nSource: Ord. 040902-58; Ord. 20070726-132.\n\n(A)\n\nA site plan must comply with the design guidelines prescribed by administrative rule.\nAn applicant shall file with the site plan drawings of all building elevations and\nstreetscapes that demonstrates substantial compliance with the design guidelines.\n\n(B)\n\nThe director of the Neighborhood Planning and Zoning Department shall determine whether\na site plan substantially complies with the design guidelines.\n\n(C)\n\nThe director of the Neighborhood Planning and Zoning Department may waive a provision\nof the design guidelines if the director determines that the provision is unreasonable\nor impractical as applied to the site plan and that, with the waiver, the site plan\nwill still substantially comply with the design guidelines. A waiver under this subsection\nmust be the minimum departure from the provision necessary to avoid an unreasonable\nor impractical result.\n\n(D)\n\nAn interested party may appeal to the land use commission:\n\n(1)\n\na determination by the director of the Neighborhood Planning and Zoning Department\nthat a site plan substantially complies with the design guidelines; or\n\n(2)\n\na decision by the director of the Neighborhood Planning and Zoning Department granting\nor denying a waiver under Subsection (C).\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nA multi-family residential use or a group residential use established after February\n24, 2014 must, for a period of not less than 40 years from the date a certificate\nof occupancy is issued, set aside at least:\n\n(1)\n\n10 percent of the dwelling units or bedrooms on the site to house persons whose household\nincome is at or below 60 percent of the median income in the Austin statistical metropolitan\narea, as determined by the director of the Neighborhood Housing and Community Development\nOffice; and\n\n(2)\n\nexcept as provided in Subsection (B), an additional 10 percent of the dwelling units\nor bedrooms on the site to house persons whose household income is at or below 50\npercent of the median income in the Austin statistical metropolitan area, as determined\nby the director of the Neighborhood Housing and Community Development Office.\n\n(B)\n\nThe University Neighborhood District Housing Trust Fund is established. Instead of\ncomplying with Paragraph (A)(2), a person may pay into the fund a fee of $1.00 for\neach square foot of net rentable floor area in the multi-family residential use or\ngroup residential use development and the fee will be adjusted annually in accordance\nwith the Consumer Price Index all Urban Consumers, US City Average, All Items (1982-84=100),\nas published by the Bureau of Labor Statistics of the United States Department of\nLabor or in accordance with any other similar, applicable standard as defined by the\ndirector of the Neighborhood Housing and Community Development Office. The city manager\nshall annually determine the new fee amounts for each fiscal year, beginning October\n1, 2014 and report the new fee amounts to the city council.\n\n(C)\n\nThe director of the Neighborhood Housing and Community Development Office may allocate\nmoney from the University Neighborhood District Housing Trust Fund for housing development\nin the university neighborhood overlay district that provides at least 30 percent\nof its dwelling units or bedrooms to persons whose household income is at or below\n50 percent of the median income in the statistical metropolitan area, as determined\nby the director of the Neighborhood Housing and Community Development Office, for\na period of not less than 40 years from the date a certificate of occupancy is issued.\n\nProjects qualifying for the University Neighborhood Overlay Affordable Trust Funds\nshall receive a 100 percent fee waiver as set forth in the S.M.A.R.T. Housing Policy.\n\n(D)\n\nRents will be established annually by the director of Neighborhood Housing and Community\nDevelopment Office as follows:\n\n(1)\n\nRents for single occupancy rental units for households who are at or below 60 percent\nof the median family income may not exceed the Low HOME Rent Limit for one bedroom\nas established annually by the Texas Department of Housing and Community Affairs.\n\n(2)\n\nRents for single occupancy rental units for households who are at or below 50 percent\nmedian family income households may not exceed the 40 percent Median Family Income\nHOME Rent Limit for an efficiency as established annually by the Texas Department\nof Housing and Community Affairs.\n\n(3)\n\nFor existing UNO developments that opt in to leasing by the bedroom for the remainder\nof their commitment:\n\n(a)\n\nrents for single occupancy rental units for households who are at or below 60 percent\nof the median family income may not exceed the high HOME rent limit for a one bedroom\nas established annually by the Texas Department of Housing and Community Affairs;\nand\n\n(b)\n\nrents for single occupancy rental units for households who are at or below 50 percent\nof the median family income may not exceed the 40 percent MFI HOME rent limit for\nan efficiency as established annually by the Texas Department of Housing and Community\nAffairs.\n\n(c)\n\nThe director may adopt administrative rules necessary to enforce these provisions.\n\n(E)\n\nFor a hotel/motel use that has an associated condominium residential use, multifamily\nresidential use, group residential use, retirement housing (small site) use, or retirement\nhousing (large site) use, instead of complying with Subsection (A) a person may pay\ninto the University Neighborhood Housing Trust Fund a fee of $2.00 for each square\nfoot of the combined net square footage of the residential units and the hotel/motel\nunits, if:\n\n(1)\n\nthe number of residential units associated with a hotel/motel use does not exceed\n40% of the number of hotel/motel units; and\n\n(2)\n\nthe net square footage of the residential units does not exceed 45% of the net square\nfootage of hotel/motel units.\n\nSource: Ord. 040902-58; Ord. 20080925-039; Ord. 20140213-056, Pt. 2, 2-25-14.\n\n(A)\n\nThis division supersedes other requirements of Title 25 (Land Development) to the extent of conflict.\n\n(B)\n\nThis division does not apply to property governed by a development plan approved by\na special board of review, as prescribed by Natural Resources Code Sections 31.161\nthrough 31.167.\n\nSource: Ord. 20050519-008.\n\n(A)\n\nA transit oriented development (TOD) district is classified according to its location,\nas described below.\n\n(B)\n\nA neighborhood center TOD district is located at the commercial center of a neighborhood.\nThe average density is approximately 15 to 25 dwelling units for each acre. Typical\nbuilding height is one to six stories. Uses include small lot single-family residential\nuse, single-family residential use with an accessory dwelling unit, townhouse residential\nuse, low-rise condominium residential use and multifamily residential use, neighborhood\nretail and office uses, and mixed-use buildings.\n\n(C)\n\nA town center TOD district is located at a major commercial, employment, or civic\ncenter. The average density is approximately 25 to 50 dwelling units for each acre.\nTypical building height is two to eight stories. Uses include townhouse residential\nuse, low- and mid-rise condominium residential use and multifamily residential use,\nretail and office uses, and mixed-use buildings.\n\n(D)\n\nA regional center TOD district is located at the juncture of regional transportation\nlines or at a major commuter or employment center. The average density is more than\n50 dwelling units for each acre. Typical building height is three to ten stories.\nUses include mid-rise condominium residential use and multifamily residential use,\nmajor retail and office uses, and mixed-use buildings.\n\n(E)\n\nA downtown TOD district is located in a highly urbanized area. The average density\nis more than 75 dwelling units for each acre. Typical building height is six stories\nor more. Uses include mid- and high-rise condominium residential use and multifamily\nresidential use, large retail and office uses, and mixed use buildings.\n\nSource: Ord. 20050519-008.\n\n(A)\n\nA transit oriented development (TOD) district may be divided into zones of varying\ndevelopment intensity, as described in this section.\n\n(B)\n\nA gateway zone is the area immediately surrounding the station platform, where passengers\nenter or exit transit vehicles. Typically, this area includes land that is about 300\nto 500 feet from the edge of the station platform. This zone has a high level of transit\nintegration, including streetscapes that connect the station platform with the surrounding\nbuildings, and buildings that are oriented toward the station platform and provide\nground floor pedestrian-oriented uses and employment or residential uses in the upper\nfloors. A gateway zone has the highest density and building height in a TOD district.\n\n(C)\n\nA midway zone is the area between a gateway zone and a transition zone, beginning\nat the outer boundary of the gateway zone and ending approximately 1,000 to 1,500\nfeet from the edge of the station platform. This zone is predominately residential,\nbut it may also contain retail and office uses. The zone includes a variety of building\ntypes. A midway zone has density and building height that are lower than a gateway\nzone but higher than a transition zone.\n\n(D)\n\nA transition zone is the area at the periphery of the TOD district. Development intensity\nis compatible with the existing or anticipated future development adjacent to the\nTOD district. A transition zone has the lowest density and building height in a TOD\ndistrict.\n\nSource: Ord. 20050519-008.\n\n(A)\n\nTransit oriented development (TOD) districts are established and classified as follows:\n\n(1)\n\nThe Convention Center TOD district is established as a downtown TOD district.\n\n(2)\n\nThe Plaza Saltillo TOD district is established as a neighborhood center TOD district.\n\n(3)\n\nThe Martin Luther King, Jr. Blvd. TOD district is established as a neighborhood center\nTOD district.\n\n(4)\n\nThe Lamar Blvd./Justin Lane TOD district is established as a neighborhood center TOD\ndistrict.\n\n(5)\n\nThe Northwest Park and Ride TOD district is established as a town center TOD district.\n\n(6)\n\nThe North IH-35 Park and Ride TOD district is established as a town center TOD district.\n\n(7)\n\nThe Oak Hill TOD district is established as a town center TOD district.\n\n(8)\n\nThe Highland Mall TOD district is established as a town center TOD district.\n\n(9)\n\nThe South IH-35 Park and Ride TOD district is established as a town center TOD district.\n\n(B)\n\nThe initial boundaries and zones of each TOD district are described in Appendix D\n(Transit Oriented District Boundaries And Zones). The final boundaries and zones of a TOD district are established by the ordinance\nadopting the station area plan, as provided in Section 25-2-766.22 (Adoption Of Station Area Plan). The official maps of the districts are on file with the director, who shall resolve\nuncertainty regarding the boundary of a district.\n\n(C)\n\nCouncil may establish additional TOD districts by amending Subsection (A) and Appendix\nD (Transit Oriented District Boundaries And Zones).\n\nSource: Ord. 20050519-008; Ord. 20060309-057; Ord. 20061005-052; Ord. 20071108-120.\n\n(A)\n\nUntil council approves a station area plan in accordance with Subpart C (Station Area Plan):\n\n(1)\n\na transit oriented development (TOD) district functions as an overlay district; and\n\n(2)\n\nproperty within the TOD district:\n\n(a)\n\nis subject to Subpart B (Initial District Regulations); and\n\n(b)\n\nretains its base district zoning.\n\n(B)\n\nThe approval by council of a station area plan in accordance with Subpart C (Station Area Plan) is a rezoning of the property as a TOD base district. After the rezoning, Subpart\nB (Initial District Regulations) does not apply.\n\nSource: Ord. 20050519-008.\n\nThis subpart applies in a transit oriented development (TOD) district until council\nadopts a station area plan.\n\nSource: Ord. 20050519-008.\n\n(A)\n\nIn a TOD district, the following uses are prohibited:\n\n(1)\n\nautomotive sales;\n\n(2)\n\nautomotive washing;\n\n(3)\n\nbasic industry;\n\n(4)\n\nconvenience storage;\n\n(5)\n\nequipment repair services;\n\n(6)\n\nequipment sales;\n\n(7)\n\nrecycling center;\n\n(8)\n\nscrap and salvage services; and\n\n(9)\n\nvehicle storage.\n\n(B)\n\nIn a gateway zone, the following uses are prohibited:\n\n(1)\n\nsingle-family residential;\n\n(2)\n\nsingle-family attached residential;\n\n(3)\n\nsmall lot single-family residential;\n\n(4)\n\nduplex residential;\n\n(5)\n\ntwo-family residential;\n\n(6)\n\nsecondary apartment;\n\n(7)\n\nurban home; and\n\n(8)\n\ncottage.\n\n(C)\n\nIn a midway zone, the following uses are prohibited:\n\n(1)\n\nsingle-family residential;\n\n(2)\n\nsingle-family attached residential;\n\n(3)\n\nduplex residential; and\n\n(4)\n\ntwo-family residential.\n\n(D)\n\nA use with a drive-in service is prohibited.\n\n(E)\n\nA transportation terminal use is a permitted use if:\n\n(1)\n\nit is operated by a governmental entity; and\n\n(2)\n\nthe director determines that the transportation terminal:\n\n(a)\n\nuses urban design to enhance the community identity of the station area and to make\nit an attractive, safe, convenient, and interesting place;\n\n(b)\n\ncreates convenient connections to and within the station area to promote pedestrian\nand bicycling activity;\n\n(c)\n\nenhances the existing transportation network to promote access to transit and other\ndestinations within the station area;\n\n(d)\n\nmanages the amount and location of parking so that it does not dominate the station\narea or create an unattractive environment or unsafe situation; and\n\n(e)\n\nmakes the station area a unique place.\n\n(F)\n\nAn automotive repair services use, automotive rentals use, or commercial off-street\nparking use that would otherwise be a permitted use is a conditional use.\n\n(G)\n\nA residential use is permitted above the first floor of a commercial building.\n\nSource: Ord. 20050519-008; Ord. 20071108-120.\n\n(A)\n\nThis section applies to:\n\n(1)\n\na new building; or\n\n(2)\n\nan addition to a building, if the addition:\n\n(a)\n\nexceeds 5,000 square feet of gross floor area; or\n\n(b)\n\nincreases the gross floor area on the site by more than 50 percent.\n\n(B)\n\nThe maximum front yard and street side yard setbacks are 15 feet, except the director\nof the Neighborhood Planning and Zoning Department may modify a maximum setback if\nthe director determines that:\n\n(1)\n\nthe modification is required to protect a historic structure or a tree designated\nas significant by the city arborist; or\n\n(2)\n\nthe modification allows an alternative development design that is compatible with\nand supportive of public transit and a pedestrian-oriented environment and that complies\nwith the TOD district principles and best practices established by administrative\nrule.\n\n(C)\n\nThe minimum front yard and street side yard setbacks are the lesser of:\n\n(1)\n\n10 feet; or\n\n(2)\n",
  "start_line": 22478,
  "end_line": 23384,
  "subsections": [
    "25-2-765-K",
    "25-2-765-L",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-D",
    "25-2-765-E",
    "25-2-765-F",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-D",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-D",
    "25-2-765-E",
    "25-2-765-F",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-D",
    "25-2-765-E",
    "25-2-765-F",
    "25-2-765-G",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-D",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-D",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-D",
    "25-2-765-E",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-D",
    "25-2-765-E",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-D",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C",
    "25-2-765-D",
    "25-2-765-E",
    "25-2-765-F",
    "25-2-765-G",
    "25-2-765-A",
    "25-2-765-B",
    "25-2-765-C"
  ]
}