{
  "id": "25-2-807",
  "title": "SPECIAL USE IN HISTORIC DISTRICT",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "SPECIAL USE HISTORIC is a use that complies with the requirements of Section 25-2-807 (Special Use In Historic Districts).\n\n(70)\n\nSTABLE use is the use of a site for boarding, breeding or raising of horses not owned\nby the occupants of the premises, or the rental of horses for riding. This use includes\nboarding stables or public stables.\n\n(71)\n\nTHEATER use is the use of a site for presentation of plays, motion pictures, or other\nperformances within a building. This use also includes live music performances.\n\n(72)\n\nVEHICLE STORAGE use is the use of a site for long term storage for vehicles. This\nuse includes storage of vehicles towed from private parking areas and impound yards,\nbut excludes dismantling or salvage.\n\n(73)\n\nVETERINARY SERVICES use is the use of a site for provision of veterinary services\nand hospitals for animals. This use includes pet clinics, dog and cat hospitals, and\nveterinary hospitals for livestock and large animals.\n\nSource: Section 13-2-3; Ord. 000309-39; Ord. 010426-48; Ord. 020627-Z34; Ord. 031211-11;\nOrd. 031211-41; Ord. 040617-Z-1; Ord. 20060928-107; Ord. 20120426-139; Ord. 20121101-057;\nOrd. No. 20230914-097, Pt. 1, 9-25-23; Ord. No. 20240516-007, Pt. 1, 5-27-24.\n\n(A)\n\nIndustrial uses include the on-site extraction or production of goods by non-agricultural\nmethods, and the storage and distribution of products.\n\n(B)\n\nIndustrial use classifications are described as follows:\n\n(1)\n\nBASIC INDUSTRY use is the use of a site for:\n\n(a)\n\nthe basic processing and manufacturing of materials or products predominately from\nextracted or raw materials;\n\n(b)\n\nstorage or manufacturing processes that involve flammable or explosive materials;\nor\n\n(c)\n\nstorage or manufacturing processes that involve hazardous or commonly recognized offensive\nconditions, including poultry processing.\n\n(2)\n\nCUSTOM MANUFACTURING use is the use of a site for on-site production of goods by the\nuse of hand tools, domestic mechanical equipment not exceeding five horsepower, or\na single kiln not exceeding 12 kilowatts, and the incidental sale of those goods.\nThis use includes candle-making shops and custom jewelry manufacturing.\n\n(3)\n\nGENERAL WAREHOUSING AND DISTRIBUTION use is open-air storage, distribution, or handling\nof materials or equipment. This use includes monument or stone yards, grain elevators,\nand open storage yards.\n\n(4)\n\nLIGHT MANUFACTURING use is the use of a site for manufacture, predominantly from previously\nprepared materials, of finished products or parts, including processing, fabrication,\nassembly, treatment, and packaging of the products, and incidental storage, sales,\nand distribution of the products. This use excludes basic industrial processing.\n\n(5)\n\nLIMITED WAREHOUSING AND DISTRIBUTION use is the use of a site for provision of wholesaling,\nstorage, or warehousing services within an enclosed structure. This use includes wholesale\ndistributors, storage warehouses, and moving or storage firms.\n\n(6)\n\nRECYCLING CENTER use is the use of a site for collection, transfer, or processing\nof recyclable materials. Recyclable materials include glass, paper, plastic, cans,\nor other source-separated, nonputrescible materials. This use excludes bulk or single-feed\nreverse vending machines.\n\n(7)\n\nRESOURCE EXTRACTION use is the use of a site for on-site extraction of surface or\nsub-surface mineral products or natural resources. This use includes quarries, borrow\npits, sand or gravel operations, oil or gas extraction, and mining operations.\n\n(8)\n\nSTOCKYARDS use is the use of a site for temporary keeping of livestock for slaughter,\nmarket, or shipping. This use includes stockyards, animal sales, and auction yards.\n\nSource: Section 13-2-4; Ord. 990225-70; Ord. 031211-11; Ord. 040617-Z-1.\n\n(A)\n\nCivic uses include the performance of utility, educational, recreational, cultural,\nmedical, protective, and governmental functions, and other uses that are strongly\nvested with public or social importance.\n\n(B)\n\nCivic use classifications are described as follows:\n\n(1)\n\nADMINISTRATIVE SERVICES use is the use of a site for provision of offices or administrative,\nclerical, or public contact services, together with incidental storage and maintenance\nof necessary vehicles. This use includes offices and courthouses serving federal,\nstate, county, and city government.\n\n(2)\n\nADULT CARE SERVICES (GENERAL) use is the use of a site for the provision of care for\nless than 24 hours per day for more than 6 persons who are 18 years of age or older.\n\n(3)\n\nADULT CARE SERVICES (LIMITED) use is the use of a site for the provision of care for\nless than 24 hours per day for 6 or fewer persons who are 18 years of age or older.\n\n(4)\n\nAVIATION FACILITIES use is the use of a site for provision of landing fields, aircraft\nparking and service facilities, and related facilities for operation, service, fueling,\nrepair, storage, charter, sales, or rental of aircraft, including activities directly\nassociated with the operation and maintenance of airport facilities.\n\n(5)\n\nCAMP use is the use of a site for provision of indoor or outdoor activities for children,\nincluding sports, arts and crafts, entertainment, recreation, educational activities,\nswimming, fishing, horseback riding, and incidental food service. If incidental to\nthe camp use, camp facilities may be used to provide meeting, recreation, or social\nfacilities for a private association or group.\n\n(6)\n\nCEMETERY is the use of land that is dedicated for cemetery purposes for the burial\nof the dead, including columbariums, crematoriums, mausoleums, and mortuaries.\n\n(7)\n\nCHILD CARE SERVICES (GENERAL) use of a site for the provision of care for less than\n24 hours per day for more than 12 persons who are less than 18 years of age or are\neligible to utilize child care under federal or state laws. This use includes nursery\nschools, preschools, day care centers for children, and similar uses, and excludes\npublic and private primary or secondary educational facilities.\n\n(8)\n\nCHILD CARE SERVICES (LIMITED) use of a site for the provision of care for less than\n24 hours for 12 or fewer persons who are less than 18 years of age or are eligible\nto utilize child care under federal or state laws. This use includes nursery schools,\npreschools, day care centers for children, and similar uses, and excludes public and\nprivate primary or secondary educational facilities.\n\n(9)\n\nCLUB OR LODGE use is the use of a site for provision of meeting, recreational, or\nsocial facilities by a private or nonprofit association, primarily for use by members\nand guests. This use includes private social clubs and fraternal organizations.\n\n(10)\n\nCOLLEGE AND UNIVERSITY FACILITIES use is the use of a site as an educational institution\nof higher learning that offers a course of study designed to culminate in the issuance\nof a degree in accordance with the Texas Education Code.\n\n(11)\n\nCOMMUNICATION SERVICE FACILITIES use is the use of a site for the transmission, transfer,\nor distribution of telephone service and related activities.\n\n(12)\n\nCOMMUNITY EVENTS use is a use described in Local Government Code Chapter 334 as permitted\nfor an \"approved venue project\", except for a hotel, zoological park, museum, or aquarium.\nThe use includes the sale of alcoholic beverages.\n\n(13)\n\nCOMMUNITY RECREATION (PRIVATE) use is the use of a site for the provision of an indoor\nor outdoor recreational facility for use by residents or guests of a residential development,\nplanned unit development, church, private primary or secondary educational facility,\nclub or lodge, or non-profit organization.\n\n(14)\n\nCOMMUNITY RECREATION (PUBLIC) use is the use of a site for the provision of an indoor\nor outdoor recreational facility for use by the general public, but not for economic\ngain.\n\n(15)\n\nCONGREGATE LIVING use is the use of a site for the provision of 24 hour supervision\nand assisted living for more than 15 residents not needing regular medical attention.\nThis use includes personal care homes for the physically impaired, mentally retarded,\ndevelopmentally disabled, or persons 60 years of age or older, basic child care homes,\nmaternity homes, and emergency shelters for victims of crime, abuse, or neglect.\n\n(16)\n\nCONVALESCENT SERVICES use is the use of a site for the provision of bed care and in-patient\nservices for persons requiring regular medical attention. This use excludes the provision\nof surgical or emergency medical services and the provision of care for alcoholism,\ndrug addiction, mental disease, or communicable disease.\n\n(17)\n\nCONVENTION CENTER use is the use of a site for the provision of space or facilities\nowned or managed by the City for conventions, meetings, exhibitions, shows, gatherings,\npresentations, or celebrations, including related incidental facilities for office\nand administrative use, food and beverage preparation and service, and on-site and\noff-site parking facilities.\n\n(18)\n\nCOUNSELING SERVICES use is the use of a site for the provision of daytime counseling\nto neglected or abused children, 15 years of age or younger, or their managing conservators,\nwho are referred by a governmental entity or other counseling service providers.\n\n(19)\n\nCULTURAL SERVICES use is the use of a site for a library, museum, or similar facility.\n\n(20)\n\nDETENTION FACILITIES use is the use of a site for the provision by a public agency\nof housing and care for legally confined individuals.\n\n(21)\n\nEMPLOYEE RECREATION use is the use of a site for the provision of an indoor or outdoor\nrecreational facility for use by employees of a business engaged in basic industry,\ncommercial services, manufacturing, administrative activities, or research and development\nservices, that is located on property reserved by the business for future expansion.\n\n(22)\n\nGUIDANCE SERVICES use is the use of a site for the provision of daytime counseling,\nguidance, recuperative, or similar services to persons requiring rehabilitation assistance\nas a result of mental illness, alcoholism, detention, drug addiction, or similar condition.\n\n(23)\n\nHOSPITAL SERVICES (GENERAL) use is the use of a site for the provision of medical,\npsychiatric, or surgical services on an in-patient basis, and includes ancillary facilities\nfor out-patient and emergency treatment, diagnostic services, training, research,\nadministration, and services to patients, employees, and visitors.\n\n(24)\n\nHOSPITAL SERVICES (LIMITED) use is the use of a site for the provision of medical,\npsychiatric, or surgical services on an out-patient basis, and includes emergency\ntreatment, diagnostic services, training, administration, and services to out-patients,\nemployees, and visitors.\n\n(25)\n\nLOCAL UTILITY SERVICES use is the use of a site for the provision of services that\nare necessary to support the development in the area and involve only minor structures\nincluding lines and poles.\n\n(26)\n\nMAINTENANCE AND SERVICE FACILITIES use is the use of a site for the provision of maintenance,\nrepair, vehicular or equipment servicing, material storage, or similar activities,\nand includes equipment service centers and similar uses having characteristics of\ncommercial services, contracting, or industrial activities.\n\n(27)\n\nMAJOR UTILITY FACILITIES use is the use of a site for the provision of generating\nplants, electrical switching facilities or primary substations, refuse collection\nor disposal facilities, water or wastewater treatment plants, or similar facilities.\n\n(28)\n\nMILITARY INSTALLATIONS use is the use of a site for the provision of military facilities\nby the federal or state government.\n\n(29)\n\nPARKS AND RECREATION SERVICES (GENERAL) use is the use of a site for the provision\nof parks, playgrounds, recreation facilities, or open spaces available to the general\npublic and under the management or control of a public agency.\n\n(30)\n\nPARK AND RECREATION SERVICES (SPECIAL) use is the use of a site for the sale of beer\nor wine in a building that is located in a park or recreation facility under the management\nor control of a public agency.\n\n(31)\n\nPOSTAL FACILITIES use is the use of a site for the provision of postal services and\nincludes post offices, bulk mail processing, and sorting centers operated by the United\nStates Postal Service.\n\n(32)\n\nPRIVATE PRIMARY EDUCATIONAL FACILITIES use is the use of a site for a private or parochial\nschool offering instruction at the elementary school level in the branches of learning\nand study required to be taught in the public schools of the state.\n\n(33)\n\nPRIVATE SECONDARY EDUCATIONAL FACILITIES use is the use of a site for a private or\nparochial school offering instruction at the junior and senior high school levels\nin the branches of learning and study required to be taught in the public schools\nof the state.\n\n(34)\n\nPUBLIC PRIMARY EDUCATIONAL FACILITIES use is the use of a site for a public school\noffering instruction at the elementary school level in the branches of learning and\nstudy required to be taught in the public schools of the state. The term includes\nan open enrollment charter school as defined under the Texas Education Code.\n\n(35)\n\nPUBLIC SECONDARY EDUCATIONAL FACILITIES use is the use of a site for a public school\noffering instruction at the junior and senior high school levels in the branches of\nlearning and study required to be taught in the public schools of the state. The term\nincludes an open enrollment charter school as defined under the Texas Education Code.\n\n(36)\n\nQUALIFIED COMMUNITY GARDEN use is a garden that complies with the requirements of\nChapter 8-4 (Qualified Community Garden) of the City Code.\n\n(37)\n\nRAILROAD FACILITIES use is the use of a site for provision of railroad yards, equipment\nservicing facilities, or terminal facilities.\n\n(38)\n\nRELIGIOUS ASSEMBLY use is regular organized religious worship or religious education\nin a permanent or temporary building. The use excludes private primary or secondary\neducational facilities, community recreational facilities, day care facilities, and\nparking facilities. A property tax exemption is prima facie evidence of religious\nassembly use.\n\n(39)\n\nRESIDENTIAL TREATMENT use is 24 hour supervision, counseling, or treatment for more\nthan 15 residents not needing regular medical attention. This use includes alcohol\nand chemical dependency rehabilitation facilities, facilities to which persons convicted\nof alcohol or drug-related offenses are ordered to remain under custodial supervision\nas a condition of probation or parole, and residential care facilities and halfway\nhouses for the emotionally ill.\n\n(40)\n\nSAFETY SERVICES use is the use of a site for provision of public safety and emergency\nservices, and includes police and fire protection services and emergency medical and\nambulance services.\n\n(41)\n\nTELECOMMUNICATION TOWER use is the use of a site for provision of a structure built\nexclusively to support one or more antennae for receiving or transmitting electronic\ndata or telephone communications.\n\n(42)\n\nTRANSITIONAL HOUSING use is the use of a site for the supervision or detention of\nmore than 15 residents who are making the transition from institutional to community\nliving. This use includes pre-parole detention facilities and halfway houses for juvenile\ndelinquents and adult offenders, and overnight shelters for the homeless.\n\n(43)\n\nTRANSPORTATION TERMINAL use is the use of a site for the provision of a facility for\nthe loading, unloading, or interchange of passengers, baggage, or incidental freight\nor package express between modes of transportation, and includes bus terminals, railroad\nstations, airport terminals, and public transit facilities.\n\n(C)\n\nThis subsection applies to a provision of this code or other ordinance, resolution,\nor rule that was in effect before October 30, 2023.\n\n(1)\n\nDaycare services (commercial) use or daycare services (general) use has the same meaning\nas adult care services (general) use or child care services (general) use as defined\nin Subsection (B).\n\n(2)\n\nDaycare services (limited) use has the same meaning as adult care services (limited)\nuse or child care services (limited) use as defined in Subsection (B).\n\nSource: Section 13-2-5; Ord. 990225-70; Ord. 990902-57; Ord. 031211-11; Ord. No. 20160623-090, Pt. 1, 7-4-16; Ord. No. 20190207-050, Pt. 1, 2-18-19; Ord. No. 20231019-052, Pts. 1, 2, 10-30-23; Ord. No. 20231207-001, Pt. 3, 12-18-23.\n\n(A)\n\nAgricultural uses include the on-site production of plant and animal products by agricultural\nmethods.\n\n(B)\n\nAgricultural use classifications are described as follows:\n\n(1)\n\nANIMAL PRODUCTION use is the use of a site for the raising of animals or production\nof animal products including eggs and dairy products, on an agricultural or commercial\nbasis. This use includes grazing, ranching, dairy farming, and poultry farming.\n\n(2)\n\nAQUAPONIC SYSTEM is the symbiotic cultivation of fish and plants in a recirculation\nsystem.\n\n(3)\n\nCOMMUNITY GARDEN use is the use of a site for growing or harvesting food crops or\nornamental crops on an agricultural basis, by a group of individuals for personal\nor group use, consumption or donation.\n\n(4)\n\nCROP PRODUCTION use is the use of a site for the raising and harvesting of tree crops,\nrow crops, or field crops on an agricultural or commercial basis, including packing\nand processing.\n\n(5)\n\nHORTICULTURE use is the use of a site for the growing of horticultural or flora cultural\nspecialties, including flowers, shrubs, and trees intended for ornamental or landscaping\npurposes, but excluding retail sales. This use includes wholesale plant nurseries\nand greenhouses.\n\n(6)\n\nSUPPORT HOUSING use is the use of a site for living accommodations by agricultural\nemployees or their families.\n\n(7)\n\nURBAN FARM use is the use of a site that can consist of multiple contiguous parcels\nthat is at least one acre in size cultivated primarily for the sustainable production\nof agricultural products to be sold for profit and may provide agricultural education\nactivities. Agricultural education activities include volunteer programs, farm tours,\nyouth programs and farming classes.\n\n(8)\n\nMARKET GARDEN use is the use of a site that is less than one acre in size cultivated\nprimarily for the sustainable production of agricultural products to be sold for profit\nand may provide agricultural education activities. Agricultural education activities\ninclude volunteer programs, farm tours, youth programs and farming classes.\n\n(9)\n\nINDOOR CROP PRODUCTION use is the use of a site for the raising and harvesting indoors\nof tree crops, row crops, or field crops on an agricultural or commercial basis, including\npacking and processing.\n\nSource: Section 13-2-6; Ord. 990225-70; Ord. 000406-86; Ord. 031211-11; Ord. 20110210-018;\nOrd. 20131121-105, Pt. 1, 3-21-14.\n\nThe zoning districts described in this chapter establish site development regulations\nand performance standards that are intended to promote compatible land use patterns.\n\nSource: Section 13-2-20; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section provides the City's zoning districts and the corresponding zoning map\ncodes. A zoning district may be referred to by its map code.\n\n(B)\n\nResidential base districts and map codes are as follows:\n\n(1)\n\nLake Austin residence .....LA\n\n(2)\n\nrural residence .....RR\n\n(3)\n\nsingle-family residence large lot .....SF-1\n\n(4)\n\nsingle-family residence standard lot .....SF-2\n\n(5)\n\nfamily residence .....SF-3\n\n(6)\n\nsingle-family residence small lot .....SF-4A\n\n(7)\n\nsingle-family residence condominium site .....SF-4B\n\n(8)\n\nurban family residence .....SF-5\n\n(9)\n\ntownhouse and condominium residence .....SF-6\n\n(10)\n\nmultifamily residence limited density .....MF-1\n\n(11)\n\nmultifamily residence low density .....MF-2\n\n(12)\n\nmultifamily residence medium density .....MF-3\n\n(13)\n\nmultifamily residence moderate-high density .....MF-4\n\n(14)\n\nmultifamily residence high density .....MF-5\n\n(15)\n\nmultifamily residence highest density .....MF-6\n\n(16)\n\nmobile home residence .....MH\n\n(C)\n\nCommercial base districts and map codes are as follows:\n\n(1)\n\nneighborhood office .....NO\n\n(2)\n\nlimited office .....LO\n\n(3)\n\ngeneral office .....GO\n\n(4)\n\ncommercial recreation .....CR\n\n(5)\n\nneighborhood commercial .....LR\n\n(6)\n\ncommunity commercial .....GR\n\n(7)\n\nlake commercial .....L\n\n(8)\n\ncentral business .....CBD\n\n(9)\n\ndowntown mixed use .....DMU\n\n(10)\n\nwarehouse limited office .....W/LO\n\n(11)\n\ngeneral commercial services .....CS\n\n(12)\n\ncommercial-liquor sales .....CS-1\n\n(13)\n\ncommercial highway services .....CH\n\n(D)\n\nIndustrial base districts and map codes are as follows:\n\n(1)\n\nindustrial park .....IP\n\n(2)\n\nmajor industry .....MI\n\n(3)\n\nlimited industrial services .....LI\n\n(4)\n\nresearch and development .....R&D\n\n(E)\n\nSpecial purpose base districts and map codes are as follows:\n\n(1)\n\ndevelopment reserve .....DR\n\n(2)\n\naviation services .....AV\n\n(3)\n\nagricultural .....AG\n\n(4)\n\nplanned unit development .....PUD\n\n(5)\n\npublic .....P\n\n(6)\n\ntraditional neighborhood .....TN\n\n(7)\n\ntransit oriented development .....TOD\n\n(8)\n\nNorth Burnet/Gateway .....NBG\n\n(9)\n\nEast Riverside Corridor .....ERC\n\n(F)\n\nCombining districts and map codes are as follows:\n\n(1)\n\nhistoric landmark .....H\n\n(2)\n\nhistoric area .....HD\n\n(3)\n\nconditional overlay .....CO\n\n(4)\n\nneighborhood conservation .....NC\n\n(5)\n\nplanned development area .....PDA\n\n(6)\n\nwaterfront overlay .....WO\n\n(7)\n\nmixed use .....MU\n\n(8)\n\nvertical mixed use .....VMU\n\n(9)\n\nvertical mixed use building .....V\n\n(10)\n\nCapitol view corridor .....CVC\n\n(11)\n\nCapitol dominance .....CD\n\n(12)\n\nCongress Avenue CA .....\n\n(13)\n\nEast Sixth/Pecan Street .....PS\n\n(14)\n\ndowntown parks .....DP\n\n(15)\n\ndowntown creeks .....DC\n\n(16)\n\nconvention center .....CC\n\n(17)\n\ncentral urban redevelopment .....CURE\n\n(18)\n\nEast Austin .....EA\n\n(19)\n\nneighborhood plan .....NP\n\n(20)\n\nuniversity neighborhood overlay .....UNO\n\n(21)\n\ndensity bonus 90 .....DB90\n\n(22)\n\nequitable transit-oriented development .....ETOD\n\n(23)\n\ndensity bonus ETOD .....DBETOD\n\n(24)\n\ndensity bonus creative spaces .....DBCS\n\nSource: Section 13-2-21; Ord. 990225-70; Ord. 000309-39; Ord. 000406-81; Ord. 031211-11;\nOrd. 040902-58; Ord. 041202-16; Ord. 20050519-008; Ord. 20060831-068; Ord. 20071101-052;\nOrd. 20071129-098; Ord. 20090312-035; Ord. 20130509-039; Ord. No. 20221201-056, Pt. 1, 12-12-22; Ord. No. 20240229-070, Pt. 1, 3-11-24Ord. No. 20240229-073, Pt. 1, 3-11-24; Ord. No. 20240516-005, Pt. 1, 7-15-24; Ord. No. 20241010-034, Pt. 1, 10-21-24.\n\n(A)\n\nThe residential, commercial, and industrial base districts in Subsections (B), (C),",
  "start_line": 9904,
  "end_line": 10679,
  "subsections": [
    "25-2-807-A",
    "25-2-807-B",
    "25-2-807-A",
    "25-2-807-B",
    "25-2-807-C",
    "25-2-807-A",
    "25-2-807-B",
    "25-2-807-A",
    "25-2-807-B",
    "25-2-807-C",
    "25-2-807-D",
    "25-2-807-E",
    "25-2-807-F",
    "25-2-807-A"
  ]
}