{
  "id": "25-2-894",
  "title": "ACCESSORY USES FOR A PRINCIPAL COMMERCIAL USE",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "The provisions of this section supersede the requirements of Section 25-2-894 (Accessory Uses for a Principal Commercial Use) to the extent of conflict.\n\n(B)\n\nThe following are permitted as accessory uses in a commercial recreation zoning district:\n\n(1)\n\nfood sales;\n\n(2)\n\ngeneral retail sales (convenience);\n\n(3)\n\npersonal improvement services;\n\n(4)\n\nrestaurant (limited) without drive-in service;\n\n(5)\n\nday care services (general);\n\n(6)\n\nday care services (limited); and\n\n(7)\n\nsafety services.\n\n(C)\n\nAn accessory use described in Subsection (B) may occupy not more than 50 percent of\nthe site area or of the gross floor area of the structures on the site.\n\nSource: Section 13-2-304; Ord. 990225-70; Ord. 031211-11; Ord. 031211-41.\n\n(A)\n\nFor a principal industrial use, this section prescribes the requirements for an accessory\nuse.\n\n(B)\n\nA commercial use that is otherwise prohibited in the zoning district is permitted\nas an accessory use if the use:\n\n(1)\n\nis operated primarily for the convenience of employees, clients, or customers of the\nprincipal use;\n\n(2)\n\noccupies less than 25 percent of the total floor area of the use;\n\n(3)\n\nis an integral part of the principal use.\n\n(C)\n\nA parking facility is permitted as an accessory use.\n\n(D)\n\nA major utility facility is permitted as an accessory use if the facility is operated\nas an integral part of the principal use, and the facility is not a public utility\nunder the Texas Public Utility Regulatory Act.\n\n(E)\n\nFor a warehouse use, a dwelling unit is permitted as an accessory use if the dwelling\nunit is occupied by a person engaged in security, leasing, or management for the principal\nuse, and not more than 25 percent of the building is used for the dwelling unit.\n\nSource: Section 13-2-305; Ord. 990225-70; Ord. 031211-11.\n\nFor a principal civic use, the following are accessory uses:\n\n(1)\n\na dwelling unit that is occupied only by a family that has at least one member employed\non-site for security, maintenance, management, supervision, or personal service;\n\n(2)\n\nrefreshment stands and convenience food or beverage sales that serve a public assembly\nuse;\n\n(3)\n\ncafeterias, dining halls, and similar food services that are primarily for the convenience\nof employees, residents, clients, patients, or visitors;\n\n(4)\n\ngift shops, news stands, and similar commercial activities primarily for the convenience\nof employees, residents, clients, patients, or visitors;\n\n(5)\n\nparking facilities, except a facility located in an SF-6 or more restrictive zoning\ndistrict may not exceed the former minimum parking requirements included in Appendix\nA (Tables of Off-Street Loading Requirements and Former Off-Street Parking Requirements) to Chapter 25-6 (Transportation);\n\n(6)\n\na child care services (limited) use; and\n\n(7)\n\na columbarium that:\n\n(a)\n\nis affiliated with a religious assembly use;\n\n(b)\n\noccupies not more than 10 percent of the site area or 10,000 square feet, whichever\nis less;\n\n(c)\n\nis oriented to the interior to the site; and\n\n(d)\n\nis not visible from public rights-of-way.\n\nSource: Section 13-2-306; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231019-052, Pt. 7, 10-30-23; Ord. No. 20231102-028, Pt. 18, 11-13-23.\n\nFor a principal agricultural use, accessory uses that are necessarily and customarily\nassociated with the purpose and function of the agricultural use are permitted.\n\nSource: Section 13-2-307; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as otherwise provided in this chapter, a fence:\n\n(1)\n\nis permitted as an accessory use in any zoning district; and\n\n(2)\n\nmust comply with the requirements of this section.\n\n(B)\n\nIn this section:\n\n(1)\n\nan ornamental fence is a fence with an open design that has a ratio of solid material\nto open space of not more than one to four; and\n\n(2)\n\na solid fence is a fence other than an ornamental fence.\n\n(C)\n\nThe height restrictions of this section do not apply to an ornamental fence.\n\n(D)\n\nExcept as otherwise provided in this section, a solid fence constructed along a property\nline may not exceed a height of six feet measured from the natural grade up.\n\n(E)\n\nIf there is a change in grade of at least one foot measured along any run of a solid\nfence along a property line, then the portion of the fence where the grade change\noccurs may be constructed to a maximum height of seven feet.\n\n(F)\n\nA solid fence along a property line may be constructed to a maximum height of eight\nfeet if each owner of property that adjoins a section of the fence that exceeds a\nheight of six feet files a written consent to the construction of the fence with the\nbuilding official, and:\n\n(1)\n\nthere is a change in grade of at least two feet within 50 feet of the boundary between\nadjoining properties; or\n\n(2)\n\na structure, including a telephone junction box, exists that is reasonably likely\nto enable a child to climb over a six foot fence and gain access to a hazardous situation,\nincluding a swimming pool.\n\n(G)\n\nA solid fence may be constructed to a maximum of eight feet in height if the fence\nis located on or within the building setback lines.\n\n(H)\n\nA solid fence may be constructed to a height of eight feet if the fence is located\nbetween a residential use and:\n\n(1)\n\nproperty zoned as a commercial or industrial base district;\n\n(2)\n\nproperty used for a commercial or industrial use; or\n\n(3)\n\nan alley that separates a residential use and:\n\n(a)\n\nproperty zoned as a commercial or industrial base district; or\n\n(b)\n\nproperty used for a commercial or industrial use.\n\n(I)\n\nExcept as provided in Paragraph (1), a fence shall be constructed in accordance with\nthis subsection.\n\n(1)\n\nThis subsection does not apply to a fence that:\n\n(a)\n\nwas constructed before July 31, 2023; or\n\n(b)\n\nis more than six feet in height and located on a property with a non-residential use.\n\n(2)\n\nWhen more than 50 percent of the total linear distance of an existing fence is replaced,\nthe entire fence must comply with this subsection.\n\n(3)\n\nFor new or replacement fences that follow historic design standards, this subsection\nwill control if there is a conflict with the historic design standards.\n\n(4)\n\nA fence may not include:\n\n(a)\n\nspiked pickets, spiked bars, or other spiked decorative elements above the top horizontal\nbacker rail;\n\n(b)\n\nvertical pickets above the top horizontal backer rail if the vertical pickets are\nseparated by more than two inches and less than nine inches;\n\n(c)\n\nrazor-like wire; or\n\n(d)\n\nbarbed wire unless the fence is enclosing an airport or other landing area for aircraft\nand the use of barbed wire is required by Federal Aviation Administration regulation.\n\n(5)\n\nA fence that creates a substantial risk of entrapment or impalement is prohibited.\n\n(6)\n\nA solid chain link fence shall use knuckle selvage.\n\n(J)\n\nA fence used as a swimming pool barrier shall comply with Chapter 25-12, Article 14 (Swimming Pool and Spa Code).\n\nSource: Section 13-2-308; Ord. 990225-70; Ord. 031211-11; Ord. 050127-64; Ord. No. 20141120-181, Pt. 1, 12-1-14; Ord. No. 20230720-156, Pt. 2, 7-31-23.\n\n(A)\n\nA home occupation is a commercial use that is accessory to a residential use. A home\noccupation must comply with the requirements of this section.\n\n(B)\n\nA home occupation must be conducted entirely within the dwelling unit or an accessory\nstructure.\n\n(C)\n\nParticipation in Home Occupation.\n\n(1)\n\nExcept as otherwise provided in this subsection, participation in a home occupation\nis limited to occupants of the dwelling unit.\n\n(2)\n\nA person who does not reside on-site may participate in a home occupation if the home\noccupation is:\n\n(a)\n\na medical, professional, administrative, or business office;\n\n(b)\n\nan art workshop or gallery;\n\n(c)\n\na music, dance, or photography studio; or\n\n(d)\n\nhandicraft or hobby instruction.\n\n(D)\n\nThe residential character of the lot and dwelling must be maintained. A home occupation\nthat requires a structural alteration of the dwelling to comply with a nonresidential\nconstruction code is prohibited. This prohibition does not apply to modifications\nto comply with accessibility requirements.\n\n(E)\n\nA home occupation may not generate more than three vehicle trips each day of customer-related\nvehicular traffic.\n\n(F)\n\nExcept for materials and equipment used in an art workshop, equipment or materials\nassociated with the home occupation must not be visible from locations off the premises.\n\n(G)\n\nA home occupation may not produce noise, vibration, smoke, dust, odor, heat, glare,\nfumes, electrical interference, or waste run-off outside the dwelling unit or accessory\nstructure.\n\n(H)\n\nParking a commercial vehicle on the premises or on a street adjacent to residentially\nzoned property is prohibited.\n\n(I)\n\nAdvertising a home occupation by a sign on the premises is prohibited, except as provided\nunder Section 25-10-156 (Home Occupation Signs). Advertising the street address of a home occupation through signs, billboards,\ntelevision, radio, or newspapers is prohibited.\n\n(J)\n\nThe following are prohibited as home occupations:\n\n(1)\n\nanimal hospitals, animal breeding;\n\n(2)\n\nclinics, hospitals;\n\n(3)\n\nhospital services;\n\n(4)\n\ncontractors yards;\n\n(5)\n\nscrap and salvage services;\n\n(6)\n\nmassage parlors other than those employing massage therapists licensed by the state;\n\n(7)\n\nrestaurants;\n\n(8)\n\ncocktail lounges;\n\n(9)\n\nrental outlets;\n\n(10)\n\nequipment sales;\n\n(11)\n\nadult oriented businesses;\n\n(12)\n\nrecycling centers;\n\n(13)\n\ndrop-off recycling collection facilities;\n\n(14)\n\nan activity requiring an H-occupancy under Chapter 25-12, Article 1 (Uniform Building Code);\n\n(15)\n\nautomotive repair services; and\n\n(16)\n\nbusinesses involving the repair of any type of internal combustion engine, including\nequipment repair services.\n\nSource: Section 13-2-260; Ord. 990225-70; Ord. 990520-38; Ord. 031211-11; Ord. 20090827-032;\nOrd. No. 20230914-097, Pt. 4, 9-25-23; Ord. No. 20231102-028, Pt. 19, 11-13-23.\n\n**Editor's note—**\nOrd. No. 20231207-001, Pt. 15, effective December 18, 2023, repealed § 25-2-901, which pertained to accessory\napartments and derived from Sections 13-2-1 and 13-2-251; Ord. 990225-70; Ord. 031120-44;\nOrd. 031211-11.\n\n(A)\n\nParticipation on an annual or semi-annual tour is allowed as an accessory residential\nuse subject to the requirements of this section and all other applicable regulations.\n\n(B)\n\nAs authorized by this section, a tour is an organized event in which multiple residential\nproperties are opened to members of the public for any lawful purpose, including:\n\n(1)\n\nthe appreciation and study of architecture; and\n\n(2)\n\nthe production and incidental sale of artwork by an individual responsible for making\nor producing the artwork.\n\n(C)\n\nTo qualify as an accessory use under this section, a residential tour that includes\nthe production or sale of art must comply with the requirements of this subsection.\n\n(1)\n\nA tour organizer must provide the dates of the tour and the address of all participating\nproperties to the City of Austin Cultural Arts Division.\n\n(2)\n\nA tour may not take place on more than six days per calendar year.\n\n(3)\n\nA residential property may not:\n\n(a)\n\nparticipate on a tour more than 12 days per calendar year;\n\n(b)\n\nparticipate in more than three tours per calendar year;\n\n(c)\n\nparticipate in a tour more than three days per week;\n\n(d)\n\ninclude more than six guest artists, in addition to the primary artist; or\n\n(e)\n\ninclude a garage sale.\n\nSource: Ord. 20110922-087; Ord. 20121018-024.\n\n(A)\n\nA garage sale is allowed as an accessory residential use subject to the requirements\nof this section.\n\n(B)\n\nA garage sale includes yard sales, carport sales, or similar types of sales involving:\n\n(1)\n\nthe sale of used or secondhand tangible property customarily found at a residence;\nand\n\n(2)\n\nthe production and incidental sale of artwork by an individual responsible for making\nor producing the artwork.\n\n(C)\n\nA garage sale must be conducted entirely on a property used as the seller's principal\nresidence.\n\n(D)\n\nA garage sale may not be held at the same property more than four days per calendar",
  "start_line": 28017,
  "end_line": 28547,
  "subsections": [
    "25-2-894-B",
    "25-2-894-C",
    "25-2-894-A",
    "25-2-894-B",
    "25-2-894-C",
    "25-2-894-D",
    "25-2-894-E",
    "25-2-894-A",
    "25-2-894-B",
    "25-2-894-C",
    "25-2-894-D",
    "25-2-894-E",
    "25-2-894-F",
    "25-2-894-G",
    "25-2-894-H",
    "25-2-894-I",
    "25-2-894-J",
    "25-2-894-A",
    "25-2-894-B",
    "25-2-894-C",
    "25-2-894-D",
    "25-2-894-E",
    "25-2-894-F",
    "25-2-894-G",
    "25-2-894-H",
    "25-2-894-I",
    "25-2-894-J",
    "25-2-894-A",
    "25-2-894-B",
    "25-2-894-C",
    "25-2-894-A",
    "25-2-894-B",
    "25-2-894-C",
    "25-2-894-D"
  ]
}