{
  "id": "25-2-article-9",
  "title": "LANDSCAPING",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 9. - LANDSCAPING.\n\n(A)\n\nExcept as provided in Subsection (B), this article applies in the city's zoning jurisdiction.\n\n(B)\n\nDivision 2 (Requirements for a Site Plan) and Division 3 (Additional Site Plan Requirements in Hill Country Roadway Corridors) do not apply to:\n\n(1)\n\nproperty zoned central business district (CBD) or downtown mixed use district (DMU);\n\n(2)\n\na lot containing one single-family residence;\n\n(3)\n\na lot containing one duplex residence, unless the residence exceeds 4,000 square feet\nof gross floor area or has more than six bedrooms;\n\n(4)\n\na two-unit residential use;\n\n(5)\n\na secondary apartment special use;\n\n(6)\n\na small lot single-family residential use on property zoned single-family residence\nlarge lot (SF-1) district, single family residence standard lot (SF-2) district, or\nfamily residence (SF-3) district;\n\n(7)\n\nsubstantial restoration of a building within one year after the building is damaged;\n\n(8)\n\nrestoration of a building designated as a historic landmark; or\n\n(9)\n\ninterior or façade remodeling, if the front and side exterior walls of the building\nremain in the same location.\n\n(C)\n\nDeveloped property, or property with an approved site plan, that is affected by right-of-way\ncondemnation may be developed without compliance with this article, as provided by\nthis subsection.\n\n(1)\n\nAfter condemnation, improvements shown on the remainder of an approved site plan may\nbe constructed, and only the landscaping on the remainder of the approved site plan\nis required.\n\n(2)\n\nImprovements on developed properties that are lost through condemnation may be replaced.\nOnly the area within the limits of construction for the replaced improvements must\ncomply with this article, except an owner is not required to provide more landscaping\nthan was in existence before the condemnation.\n\nSource: Sections 13-7-56(a), (c), and (e), and 13-7-66(e); Ord. 990225-70; Ord. 000831-65;\nOrd. 030605-49; Ord. 031211-11; Ord. 041202-16; Ord. 20090618-077; Ord. No. 20240516-006, Pt. 6, 5-27-24.\n\n(A)\n\nExcept as provided by Subsection (B), if this article conflicts with other provisions\nof this title, this article prevails.\n\n(B)\n\nIf this article conflicts with a provision of Chapter 25-6 (Transportation), Chapter 25-7 (Drainage), Chapter 25-8 (Environment), or another provision of this chapter, those provisions prevail.\n\nSource: Section 13-7-56(d); Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nThe Watershed Protection and Development Review Department shall inspect each site\nto ensure compliance with this article. Before the Watershed Protection and Development\nReview Department may conduct a final landscape inspection, it must receive a letter,\nunder seal, from a licensed professional engineer, architect, or landscape architect,\nstating that the project has been implemented in accordance with the approved plan.\n\n(B)\n\nThe requirements for an automatic irrigation system under the Environmental Criteria\nManual shall be noted on the development permit by the authority issuing the permit,\nand must be implemented by the owner before the final landscape inspection.\n\nSource: Sections 13-7-58(c) and 13-7-62(e); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nThis section applies to an owner who is responsible for property for which a site\nplan has been approved by the City.\n\n(B)\n\nAn owner shall maintain required landscaped areas in accordance with the site plan\nand in healthy condition, free from diseases, pests, weeds, and litter, in accordance\nwith generally accepted horticultural practice.\n\n(C)\n\nAn owner who receives notification from the Watershed Protection and Development Review\nDepartment that plants on a site are dead, diseased, or severely damaged:\n\n(1)\n\nshall remove the plants not later than the 60th day after notification; and\n\n(2)\n\nreplace the plants within six months after notification, or by the next planting season,\nwhichever comes first.\n\n(D)\n\nAn owner required to replace plants under Subsection (B) must use replacement plants\nthat are the same size and species as shown on the approved site plan or must be of\nequivalent quality and size. The replacement of plants under this section is not an\namendment to the approved plan.\n\nSource: Section 13-7-63,(a), (c), and (d); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nA site plan must comply with the requirements of this article.\n\n(B)\n\nThe Land Use Commission or the Watershed Protection and Development Review Department\nmay approve a site plan that proposes an alternative to compliance with this article\nif the Land Use Commission or the Watershed Protection and Development Review Department\ndetermines that the site plan adequately achieves, or is an improvement on, the intent\nof the landscaping requirements in this article.\n\n(C)\n\nIn considering an alternative plan under Subsection (B), the Land Use Commission or\nthe Watershed Protection and Development Review Department shall give special consideration\nto the preservation of large existing native trees.\n\nSource: Section 13-7-56(b), 13-7-58(a) and (b), 13-7-65; Ord. 990225-70; Ord. 010329-18;\nOrd. 010607-8; Ord. 031211-11; Ord. 20101216-097.\n\nBefore the City may approve a site plan, an applicant must post fiscal security to\nensure that the applicant installs landscaping and irrigation systems in compliance\nwith the Environmental Criteria Manual.\n\nSource: Section 13-7-59; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this article, landscape yard means the area of a lot between the street right-of-way\nand a line that coincides with the front wall of the building and extends from the\nbuilding corners to the side property lines.\n\n(B)\n\nAt least 20 percent of the area of the landscape yard of a lot must be landscaped\narea.\n\n(C)\n\nEach square foot of permeable landscaped area under the canopy of a tree that has\na trunk diameter of at least two inches, counts as one and one-fourth square feet\nof landscaped area for calculating compliance with Subsection (A). This credit applies\nonly if:\n\n(1)\n\nat least 50 percent of the area under the canopy of the tree is permeable; and\n\n(2)\n\nthe provisions of the Environmental Criteria Manual are met.\n\n(D)\n\nA required landscaped area may include planters, brick, stone, natural forms, water\nforms, aggregate, and other landscape features, if inorganic materials do not predominate\nover the plants. Smooth concrete or asphalt may not be included in a required landscaped\narea.\n\n(E)\n\nFor a capital improvement project involving right-of-way, landscaping may not be installed\nuntil construction is finished.\n\nSource: Sections 13-7-61(a), (c), (h)(4), and (j), and 13-7-64; Ord. 990225-70; Ord.\n031211-11.\n\n(A)\n\nA required landscaped area, or a plant, that is adjacent to pavement must be protected\nwith a concrete curb or an equivalent barrier.\n\n(B)\n\nA site plan must show how conditions adequate to sustain healthy plant growth will\nbe achieved.\n\nSource: Sections 13-7-61(f), (I); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this article, the diameter of a tree trunk is measured at a height of 4½ feet above\nthe ground, except as otherwise provided.\n\n(B)\n\nIn this section:\n\n(1)\n\na tree must be at least 6 feet in height and have a trunk diameter of one and one\nhalf inches measured 6 inches above the ground at the time it is counted; and\n\n(2)\n\na tree that has a trunk diameter of at least eight inches, or a tree that has a trunk\ndiameter of at least six inches and a height of at least 15 feet, is counted as two\ntrees.\n\n(C)\n\nA landscape yard that measures less than 10,000 square feet in area must contain at\nleast one tree for each 1,000 square feet, or fraction thereof.\n\n(D)\n\nA landscape yard that measures 10,000 or more square feet, but less than 110,000 square\nfeet, must contain at least ten trees, plus at least one additional tree for each\n2,500 square feet, or fraction thereof, over 10,000 square feet.\n\n(E)\n\nA landscape yard that measures 110,000 or more square feet must contain at least 50\ntrees, plus at least one additional tree for each 5,000 square feet, or fraction thereof,\nover 110,000.\n\n(F)\n\nA newly planted tree must be located in a landscaped area that is at least eight feet\nwide.\n\nSource: 13-7-61 (b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe following features must be at least partially and periodically obscured from view\nfrom the street by landscaping, or by the use of landscaping along with berms, walls,\nor decorative fences:\n\n(1)\n\na water quality control facility under Chapter 25-8, Subchapter A (Water Quality);\n\n(2)\n\na stormwater drainage facility under Chapter 25-7 (Drainage); and\n\n(3)\n\nan area where motor vehicles are moved, loaded, parked, or stored.\n\n(B)\n\nPlants may not obstruct the view between the street and a driveway.\n\n(C)\n\nThe Environmental Criteria Manual shall prescribe standards for screening in accordance\nwith this subsection.\n\n(1)\n\nFor a townhouse, condominium, multiple family, group, or mobile home residential use,\nscreening is required at a property line that adjoins a residential district in which\nthe use is not a permitted use.\n\n(2)\n\nFor a commercial or industrial use, screening is required at a property line that\nadjoins a residential district.\n\n(3)\n\nFor a civic use, screening is required at a property line that adjoins a more restrictive\ndistrict in which the use is not permitted.\n\nSource: Sections 13-7-61 (d), (e), and (g), 13-7-67(a); Ord. 990225-70; Ord. 000309-39;\nOrd. 031211-11.\n\n(A)\n\nFor each 12 parking spaces in a parking lot that is in a landscape yard, a minimum\nof 90 square feet of landscaped area are required within the parking lot.\n\n(B)\n\nFor each 12 parking spaces in a parking lot that is not in a landscape yard, a minimum\nof 60 square feet of landscaped area are required within the parking lot.\n\n(C)\n\nA parking lot must have end islands landscaped with trees in accordance with the Environmental\nCriteria Manual.\n\n(D)\n\nExcept as provided in Subsection (E), a parking space may not be located more than\n50 feet from a landscaped area, or more than 50 feet from a tree.\n\n(E)\n\nIn a parking lot that has more than three distinct modules for the parking of vehicles:\n\n(1)\n\na landscaped median at least 10 feet wide and at least the length of the parking module\nis required for every second parking module for the parking of vehicles;\n\n(2)\n\na tree must be located within 25 feet of each parking space adjacent to a median;\nand\n\n(3)\n\nend islands with trees are required.\n\n(F)\n\nA landscaped area that is required by this section:\n\n(1)\n\nmay consist of non-contiguous portions, and may be in the form of features commonly\nreferred to as medians, peninsulas, and islands;\n\n(2)\n\nmust be evenly distributed throughout a parking lot, except that the distribution\nand location of landscaped area may accommodate existing trees or other natural features\nif the total area requirement is satisfied;\n\n(3)\n\nmay count toward compliance with Section 25-2-1003(A) (General Requirements); and\n\n(4)\n\nmust consider an edge-of-pavement treatment that allows overland flow of stormwater\nrunoff across the landscape area except:\n\n(a)\n\nperimeter landscape areas that are not required to drain to a stormwater control measure;\n\n(b)\n\nimpervious areas on which the land use or activity may generate highly contaminated\nrunoff, as prescribed by the Environmental Criteria Manual; and\n\n(c)\n\nsites located within the Edwards Aquifer recharge zone.\n\nSource: Section 13-7-61(e) - (g); Ord. 990225-70; Ord. 031211-11; Ord. 20090618-076;\nOrd. No. 20221027-045, Pt. 1, 11-7-22.\n\n(A)\n\nNo permanent irrigation is required for all or a portion of a required landscaped\narea that consists of:\n\n(1)\n\nundisturbed natural area; or\n\n(2)\n\nundisturbed existing trees;\n\n(B)\n\nSupplemental irrigation using irrigation methods described in Subsection (C) is required:\n\n(1)\n\nfor the first two growing seasons for all or a portion of a newly planted required\nlandscaped area without permanent irrigation;\n\n(2)\n\npermanently for all newly planted trees in a required landscape area; and\n\n(3)\n\nas prescribed by rule for all newly planted required landscaping located in medians,\nislands, or peninsulas.\n\n(C)\n\nIrrigation required under Subsection (B) may be provided only by one or more of the\nmethods described below:\n\n(1)\n\nan automatic irrigation system;\n\n(2)\n\na hose attachment, if:\n\n(a)\n\nthe hose attachment is within 100 feet of the landscaped area or plant; and\n\n(b)\n\nthere is not a road or parking pavement between the hose attachment and the landscaped\narea or plan; or\n\n(3)\n\na temporary, above ground automatic irrigation system, if the system complies with\nthe water conservation requirements in the Environmental Criteria Manual.\n\n(D)\n\nAn irrigation method must:\n\n(1)\n\nprovide a moisture level adequate to sustain growth of the plant materials on a permanent\nbasis;\n\n(2)\n\nunless fiscal security is provided to the City for the installation of the system,\nbe operational at the time of the final landscape inspection; and\n\n(3)\n\nbe maintained and kept operational.\n\n(E)\n\nA site plan must show:\n\n(1)\n\nthe drainage area(s) used to irrigate under Subsection (B), including notation of\nthe land uses on impervious areas within the drainage area(s);\n\n(2)\n\nthe nature and location of an irrigation system; and\n\n(3)\n\nthat there is no disturbance to the critical root zone of an existing tree.\n\n(F)\n\nThe director may grant an administrative variance to the requirements in this section.\nAn applicant for a variance must demonstrate that:\n\n(1)\n\nstrict compliance with this section is infeasible due to unique site conditions including\nbut not limited to topography, size, shape, and location of existing features such\nas trees or previous development; and\n\n(2)\n\nthe proposed irrigation plan is the minimal departure from the requirements of this\nsection.\n\nSource: Section 13-7-62; Ord. 990225-70; Ord. 031211-11; Ord. 20101216-097; Ord. No. 20221027-045, Pt. 2, 11-7-22.\n\nThe requirements of this division are cumulative, and apply to a site in a Hill Country\nroadway corridor described in Section 25-2-1103 (Hill Country Roadway Corridors Identified).\n\nSource: Section 13-7-66; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this section:\n\n(1)\n\nNATIVE TREE means live oak, Spanish oak, cedar elm, shin oak, bald cypress, post oak,\npecan, bur oak, or black walnut.\n\n(2)\n\nSMALL NATIVE TREE means Texas madrone, black cherry, Texas mountain laurel, evergreen\nsumac, Mexican buckeye, flameleaf sumac, or Texas persimmon.\n\n(B)\n\nA site plan must provide a sufficient number of native or small native trees to reasonably\ncompensate for the removal of:\n\n(1)\n\neach small native tree;\n\n(2)\n\neach native tree with a trunk diameter greater than six inches; and\n\n(3)\n\neach cluster of three or more native trees located within ten feet of each other with\ntrunk diameters greater than two inches.\n\nSource: Section 13-7-66(a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as otherwise provided by this section, vegetation within 100 feet of the dedicated\nright-of-way may not be cleared, unless the clearing is necessary to provide utilities\nand access to the site.\n\n(B)\n\nExcept as otherwise provided by Subsection (D), in the roadway corridor along the\nSouthwest Parkway:\n\n(1)\n\nvegetation within 50 feet of the dedicated right-of-way or drainage easement may not\nbe cleared, unless the clearing is necessary to provide utilities and access to the\nsite; and\n\n(2)\n\na building must be at least 75 feet from the dedicated right-of-way or drainage easement.\n\n(C)\n\nThe council may, after a public hearing, waive the requirements of Subsection (B)\nfor a site if the owner dedicated the right-of-way or a drainage easement to the public\nat no cost.\n\n(D)\n\nExcept as otherwise provided in Subsection (E), in a roadway corridor along a parkway\nidentified in the Transportation Plan, other than Southwest Parkway:\n\n(1)\n\nvegetation within 25 feet of the dedicated right-of-way or drainage easement may not\nbe cleared, unless the clearing is necessary to provide utilities and access to the\nsite; and\n\n(2)\n\na building must be at least 50 feet from the dedicated right-of-way or drainage easement.\n\n(E)\n\nAn area described in this section in which clearing is prohibited may not exceed 20\npercent of the acreage of an applicant's property.\n\nSource: Sections 13-7-66(b)(2) and (3) and 13-2-781(d); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf vegetation in an area in which clearing is prohibited by Section 25-2-1023 (Roadway Vegetative Buffer) has been substantially disturbed, it must be revegetated with native trees, shrubs,\nand grasses.\n\n(B)\n\nNot more than 50 percent of the area in which clearing is prohibited may be used for\ndetention or sedimentation ponds or wastewater drain fields.\n\nSource: Section 13-7-66(b)(1); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAt least 40 percent of a site, excluding dedicated right-of-way, must be left in a\nnatural state. Natural areas within parking medians and in an area in which clearing\nis prohibited by Section 25-2-1023 (Roadway Vegetative Buffer) count toward this requirement.\n\n(B)\n\nIn complying with this section, priority must be given to the protection of natural\ncritical areas identified in the City's Comprehensive Plan.\n\n(C)\n\nIf this section conflicts with another provision of this title, the conflict must\nbe resolved with the minimum departure from the requirement of this section. The resolution\nmust receive approval from the council. The council must receive a recommendation\nfrom the Land Use Commission.\n\n(D)\n\nIf an area required to be kept in a natural state by this section is revegetated,\nnot more than 25 percent of the area may be used for sewage disposal fields.\n\nSource: Section 13-7-66(c); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nA parking lot must have a median at least ten feet wide containing existing native\ntrees or dense massing of installed trees between each distinct parking area.\n\nSource: 13-7-66(d); Ord. 990225-70; Ord. 031211-11.\n\nVisual screening required by this article must:\n\n(1)\n\nuse existing vegetation or installed landscaping;\n\n(2)\n\ninclude dense massing of trees, native understory vegetation, shrub massing, or berms;\nand\n\n(3)\n\nallow for topographic changes.\n\nSource: Section 13-7-67(b); Ord. 990225-70; Ord. 031211-11.\n\nThe requirements of this division apply to a lot in a residential subdivision in the\ncity's zoning jurisdiction. This division does not authorize removal of trees.\n\nSource: Ord. 20090618-077.\n\n(A)\n\nEach single family lot in a residential subdivision shall contain:\n\n(1)\n\nat least two trees of at least two different species listed in the Environmental Criteria\nManual, Appendix F (Descriptive Categories of Tree Species) if the lot is in a single family residence small lot (SF4a) zoning district;\n\n(2)\n\nat least three trees of at least two different species listed in the Environmental\nCriteria Manual, Appendix F (Descriptive Categories of Tree Species) if the lot is in any zoning district other than SF4a.\n\n(B)\n\nTrees required under this section must be planted or preserved in accordance with\nthis division and the Environmental Criteria Manual.\n\nSource: Ord. 20090618-077.\n\n(A)\n\nA tree planted under this division shall:\n\n(1)\n\nbe suitable, as defined in the Environmental Criteria Manual;\n\n(2)\n\nmeet the spacing and location requirements in the Environmental Criteria Manual; and\n\n(3)\n\nbe maintained in accordance with the Environmental Criteria Manual.\n\n(B)\n\nThe size of a tree planted under this division shall be:\n\n(1)\n\nat least two inches in diameter measured six inches above root flare; or\n\n(2)\n\nif an understory tree, at least one inch in diameter measured six inches above root\nflare.\n\nSource: Ord. 20090618-077.\n\n(A)\n\nA tree required under this division may be satisfied by preserving an existing tree\non the lot.\n\n(B)\n\nThe city arborist may adjust the requirements in section 25-2-1032 (Trees Required) based on preservation of:\n\n(1)\n\nan existing tree of a species listed in the Environmental Criteria Manual, Appendix\nF (Descriptive Categories of Tree Species); or\n\n(2)\n\na protected tree or heritage tree as defined in section 25-8-602 (Definitions).\n\n(C)\n\nTo satisfy the tree requirement through preservation, the applicant must demonstrate,\nto the satisfaction of the city arborist, that the tree has not been damaged in a\nmanner that could jeopardize its long-term survival.\n\n(D)\n\nA tree preserved under this division shall\n\n(1)\n\nmeet the spacing and location requirements in the Environmental Criteria Manual; and\n\n(2)\n\nbe maintained in accordance with the Environmental Criteria Manual.\n\n(E)\n\nThe size of a tree preserved under this division shall be at least two inches in diameter\nmeasured four and a half feet above natural grade.\n\nSource: Ord. 20090618-077.\n\nA tree required under this division may be satisfied by preserving or planting a tree\noff-site, only if the Watershed Protection and Development Review Department director\ndetermines that:\n\n(1)\n\ndue to special circumstances unique to a property, preserving or planting three trees\non a particular single family lot is not feasible;\n\n(2)\n\nthe proposed off-site tree will adequately achieve, or be an improvement on, the intent\nof this division; and\n\n(3)\n\nthe proposed off-site tree will meet the requirements of section 25-2-1033 or 25-2-1034 and will be preserved or planted in the subdivision within which the particular single\nfamily lot is located.\n\nSource: Ord. 20090618-077.\n",
  "start_line": 29421,
  "end_line": 30180,
  "subsections": []
}