{
  "id": "25-2-781",
  "title": "BED AND BREAKFAST RESIDENTIAL USE STRUCTURES CLASSIFIED",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "of bed and breakfast structures refer to Section 25-2-781\n(Bed and Breakfast Residential Use Structures Classified).\n\nSTART OF CONSTRUCTION. The date a permit is issued for new construction or substantial improvements to existing\nstructures if construction, repair, reconstruction, rehabilitation, addition, placement\nor other improvement starts within 180 days from the date the permit is issued. Construction\nstarts when permanent construction of a building (including a manufactured home) is\nfirst placed and includes pouring a slab or footing, installing pilings, or constructing\ncolumns. Permanent construction does not include preparing land (clearing, excavating,\ngrading, or filing); installing streets or walkways; excavating for a basement, footing,\npier, or foundation; or erecting temporary forms or installing accessory buildings\nnot occupied as dwelling units or not part of the main building. For a substantial\nimprovement, construction starts when a wall, ceiling, floor, or other structural\npart of a building is altered even if the alteration does not affect the external\ndimensions of the building.\n\nSUBSTANTIAL DAMAGE. Damage of any origin sustained by a structure, whereby the cost of restoring the\nstructure to its before-damage condition would equal or exceed 50 percent of the market\nvalue of the structure before the damage occurred.\n\n414.1.3 Information Required. Separate floor plans shall be submitted for buildings and structures with an occupancy\nin Group H, identifying the locations of anticipated contents and processes, to reflect\nthe nature of each occupied portion of every building and structure. The floor plan\nshall identify the hazards associated with the contents and processes. A report identifying\nhazardous materials including, but not limited to, materials representing hazards\nthat are classified in Group H to be stored or used, shall be submitted and the methods\nof protection from such hazards shall be indicated on the construction documents.\nThe building official or fire marshal may also require a technical opinion that addresses\nthe adequacy of the protective measures provided. The opinion and report shall be\nprepared by a qualified individual, firm or corporation approved by the building official\nand fire marshal and shall be provided without charge to the City.\n\n503.1.4 Occupiable Roofs. A roof level or portion thereof shall not be used as an occupiable roof unless the\noccupancy of the roof is an occupancy that is permitted by Table 504.4 for the story\nimmediately below the roof. The area of the occupiable roof shall not be included\nin the building area as regulated by Section 506. An occupiable roof shall not be\nincluded in the building height or number of stories as regulated by Section 504,\nprovided that the penthouses and other enclosed rooftop structures comply with Section\n1511.\n\nExceptions:\n\n1.\n\nThe occupancy located on an occupied roof shall not be limited to the occupancies\nallowed on the story immediately below the roof where the building is equipped throughout\nwith an automatic sprinkler system in accordance with Sections 903.3.1.1 or 903.3.1.2\nand occupant notification in accordance with Sections 907.5.2.1 and 907.5.2.3 is provided\nin the area of the occupied roof. Emergency voice/alarm communication system notification\nper Section 907.5.2.2 shall also be provided in the area of the occupied roof where\nsuch system is required elsewhere in the building.\n\n2.\n\nAssembly occupancies shall be permitted on roofs of open parking spaces of Type I\nor Type II construction, in accordance with the exception to Section 903.2.1.6.\n\n3.\n\nAn open noncombustible trellis or similar overhead shading device complying with the\nstructural requirements of this code shall not be considered an enclosure, covering,\nor roof provided that the trellis or shade has an evenly distributed net free area\nof 50 percent or greater.\n\n503.1.4.1 Enclosures over occupiable roof areas. Elements or structures enclosing the occupiable roof areas shall not extend more\nthan 48 inches (1220 mm) above the surface of the occupiable roof.\n\nExceptions:\n\n1.\n\nPenthouses constructed in accordance with Section 1511.2 and towers, domes, spires,\nand cupolas constructed in accordance with Section 1511.5.\n\n2.\n\nElements or structures enclosing the occupiable roof areas where the roof deck is\nlocated more than 75 feet (22,860 mm) above the lowest level of fire department vehicle\naccess.\n\nCHAPTER 9 FIRE PROTECTION AND LIFE SAFETY SYSTEMS.\n\n901.1 Scope. The provisions of this chapter shall specify where fire protection and life safety\nsystems are required and shall apply to the design, installation and operation of\nfire protection and life safety systems. For those requirements, see Chapter 25-12, Article 7 (Fire Code).\n\nTABLE 1004.5 MAXIMUM FLOOR AREA ALLOWANCES PER OCCUPANT\n\n| Function of Space | Occupant Load Factora |\n| --- | --- |\n| Accessory storage areas, mechanical equipment room | 300 gross |\n| Agricultural building | 300 gross |\n| Aircraft hangars | 500 gross |\n| Airport terminal |  |\n| Baggage claim | 20 gross |\n| Baggage handling | 300 gross |\n| Concourse | 100 gross |\n| Waiting areas | 15 gross |\n| Assembly |  |\n| Gaming floors (keno, slots, etc.) | 11 gross |\n| Exhibit Gallery and Museum | 30 net |\n| Assembly with fixed seats | See Section 1004.5 |\n| Assembly without fixed seats |  |\n| Concentrated | 7 net |\n| Standing space | 7 net |\n| Unconcentrated (tables and chairs) | 15 net |\n| Bowling centers, allow 5 persons for each lane including 15 feet of runway, and for additional areas | 7 net |\n| Business areas | 150 gross |\n| Courtrooms—other than fixed seating areas | 40 net |\n| Day care | 35 net |\n| Dormitories | 50 gross |\n| Educational |  |\n| Classroom area | 20 net |\n| Shops and other vocational room areas | 50 net |\n| Exercise rooms | 50 gross |\n| Group H-5 Fabrication and manufacturing areas | 200 gross |\n| Industrial areas | 100 gross |\n| Information technology equipment facilities | 300 gross |\n| Institutional areas |  |\n| Inpatient treatment areas | 240 gross |\n| Outpatient areas | 100 gross |\n| Sleeping areas | 120 gross |\n| Kitchens, commercial | 200 gross |\n| Library |  |\n| Reading rooms | 50 net |\n| Stack area | 100 gross |\n| Locker rooms | 50 gross |\n| Mall buildings—covered and open | See Section 402.8.2 |\n| Mercantile | 60 gross |\n| Storage, stock, shipping areas | 300 gross |\n| Parking garages | 200 gross |\n| Residential | 200 gross |\n| Skating rinks, swimming pools |  |\n| Rink and pool | 50 gross |\n| Decks | 15 gross |\n| Stages and platforms | 15 net |\n| Warehouses | 500 gross |\n| For SI: 1 square foot = 0.0929 m2.   a. Floor area in square feet per occupant. | |\n\n1010.1.2 Egress door types. Egress doors shall be of the pivoted or side-hinged swinging type.\n\nExceptions:\n\n1.\n\nPrivate garages, office areas, factory and storage areas with an occupant load of\n10 or less.\n\n2.\n\nGroup I-3 occupancies used as a place of detention.\n\n3.\n\nCritical or intensive care patient rooms within suites of health care facilities.\n\n4.\n\nDoors within or serving a single dwelling unit in Groups R-2 and R-3.\n\n5.\n\nIn other than Group H occupancies, revolving doors complying with Section 1010.3.1\n(Revolving Doors).\n\n6.\n\nIn other than Group H-1, H-2, H-3, and H-4 occupancies, special purpose horizontal\nsliding, accordion or folding door assemblies complying with Section 1010.3.3 (Special Purpose Horizontal Sliding, Accordion or Folding Doors).\n\n7.\n\nPower-operated doors in accordance with Section 1010.3.2 (Power-operated Doors).\n\n8.\n\nDoors serving a bathroom within an individual dwelling unit or sleeping unit in Group\nR- 1.\n\n9.\n\nIn other than Group H occupancies, manually operated horizontal sliding doors are\npermitted in a means of egress from spaces with an occupant load of 10 or less.\n\n1010.3.3 Special Purpose Horizontal Sliding, Accordion or Folding Doors. In other than Group H-1, H-2, H3 and H-4 occupancies, special purpose horizontal\nsliding, accordion or folding door assemblies permitted to be a component of a means\nof egress in accordance with Exception 6 to Section 1010.1.2 (Egress Door Types) shall comply with all of the following criteria:\n\n1.\n\nThe doors shall be power operated and shall be capable of being operated manually\nin the event of power failure.\n\n2.\n\nThe doors shall be openable by a simple method without special knowledge or effort\nfrom the egress side or sides.\n\n3.\n\nThe force required to operate the door shall not exceed 30 pounds (133 N) to set the\ndoor in motion and 15 pounds (67 N) to close or open the door to the minimum required\nwidth.\n\n4.\n\nThe door shall be openable with a force not to exceed 15 pounds (67 N) when a force\nof 250 pounds (1100 N) is applied perpendicular to the door adjacent to the operating\ndevice.\n\n5.\n\nThe door assembly shall comply with the applicable fire protection rating and, where\nrated, shall be self-closing or automatic closing by smoke detection in accordance\nwith Section 716.2.6.6 (Smoke-activated Doors), shall be installed in accordance with NFPA 80 and shall comply with Section 716 (Opening Protectives).\n\n6.\n\nThe door assembly shall have an integrated standby power supply.\n\n7.\n\nThe door assembly power supply shall be electrically supervised.\n\n8.\n\nThe door shall open to the minimum required width within 10 seconds after activation\nof the operating device.\n\n1025.6 Active Egress Path Illumination System. An active egress path illumination system shall be in accordance with Sections 1025.6.1\n(Luminaires) through 1025.6.6.3 (Instrumentation and Annunciation). Designs complying with this section are equivalent to the requirements in Sections\n1025.1 (General) through 1025.5 (Illumination).\n\nThe level of the egress illumination shall be in accordance with Section 1008 (Means of Egress Illumination).\n\n1025.6.1 Luminaires. Luminaires shall be listed for emergency illumination and contain a lamp with an\nintegral battery, battery charger and manual test switch and comply with Article 700\nof the Electrical Code. The unit equipment shall be housed in a rated fixture for\nindoor wet locations. Luminaire batteries shall be listed for use as a secondary power\nsupply in accordance with UL 924. Luminaires shall not be equipped with an occupancy\nsensor. Every luminaire shall have a test switch to confirm the lamp's availability\nfor service when operating on primary or emergency power.\n\nException: The integral battery and battery charger is not required when luminaires are connected\nto a Stored Energy Emergency Power Supply System (SEPSS) complying with Section 1025.6.6\n(Stored Energy Emergency Power Supply System).\n\n1025.6.2 Primary and Secondary Electrical Power. A primary and secondary power source shall be provided for each luminaire. Primary\npower shall be a dedicated electrical branch circuit supplied from utility power.\nSecondary power shall be a branch circuit connected to an Emergency Power system complying\nwith the International Fire Code Section 1203.2.15 (Means of Egress Illumination). The primary and emergency source for each luminaire shall be connected to a dedicated\nprimary and emergency power branch circuit.\n\n1025.6.3 Location. Luminaires for the active egress path illumination system shall be located at each\nintermediate landing and stair landing within each interior exit stairway.\n\n1025.6.4 Functional Test and Records. The luminaires shall be tested in accordance with Fire Code Section 1032.10 (Emergency Lighting Equipment Inspection and Testing) except that the frequency of activation tests shall be weekly. Documentation records\nfor the location of each luminaire and the results of the weekly activation and annual\npower tests shall be in accordance with Fire Code Section 1032.10 (Emergency Lighting Equipment Inspection and Testing). Records shall be available to the fire code official upon request. Operational testing\nand maintenance reports produced by the SEPSS are permitted provided they comply with\nNFPA 110 Chapter 8.\n\n1025.6.5 Lamp Failure. Luminaire lamps that do not operate because of a test or an incident shall be replaced.\nAny battery that cannot operate a lamp for a minimum of 90 minutes shall be replaced.\n\n1025.6.6 Stored Energy Emergency Power Supply System (SEPSS). When provided, the SEPSS with an integral alternating current - to - direct current\ninverter shall comply with International Fire Code Section 1203.1.3 (Installation) and be listed in accordance with UL 924. The SEPSS shall be designed as Level 1 system\nin accordance with NFPA 111.\n\nThe SEPSS shall be located in a room separated from the remainder of the building\nby a minimum one-hour fire-resistance rated construction and required opening protectives\nin accordance with this code. The design temperature and humidity of the room housing\nthe SEPSS shall be in accordance the manufacture installation instructions.\n\nSEPSS is prohibited inside a Fire Command Center.\n\n1025.6.6.1 Load Carrying Capacity. Battery systems complying with NFPA 111 shall be used to supply the emergency power\nto luminaires serving the active egress path illumination system. Batteries shall\nbe rated for a minimum 90-minute discharge time and sized based on the total combined\nload of luminaires connected to the SEPSS.\n\n1025.6.6.2 Required SEPSS. In buildings where the highest occupied floor is less than or equal to 120 feet above\nthe lowest level of fire department access, one SEPSS shall be provided that complies\nwith Section 1025.6.6 (Stored Energy Emergency Power Supply System) for all required interior exit stairways. A SEPSS shall be provided for each required\ninterior exit stairway that serves floors greater than 120 feet above the lowest level\nof fire department access.\n\n1025.6.6.3 Instrumentation and Annunciation. Instrumentation and annunciation shall be in accordance with NFPA 111. A remote annunciator\ndisplaying the status of the SEPSS shall be provided in the Fire Command Center. The\nSEPSS and its annunciator shall display the following information and its function\nshall be identified in the Fire Command Center:\n\n1.\n\nElectrical load on utility power;\n\n2.\n\nElectrical load on emergency power;\n\n3.\n\nOutput circuit breaker open;\n\n4.\n\nOutput overload or overcurrent;\n\n5.\n\nHigh temperature;\n\n6.\n\nEmergency conversion equipment is bypassed;\n\n7.\n\nLow battery capacity; and\n\n8.\n\nAny major or minor alarms prescribed by the SEPSS manufacturer.\n\n1102.1 Design. Buildings and facilities shall be designed and constructed to be accessible in accordance\nwith this code and ICC A117.1.\n\nException: Components of projects designed in accordance with and regulated by the Architectural\nBarriers Division of the Texas Department of Licensing and Regulation shall be deemed\nto be in compliance with the requirements of this chapter, provided the scope of accessible\nfeatures complies with the building code.\n\n1203.1.1 (1) Required Air Conditioning.\n\n1.\n\nAn owner shall:\n\na.\n\nprovide, and maintain, in operating condition, refrigerated air equipment capable\nof maintaining a room temperature of at least 15 degrees cooler than the outside temperature,\nbut in no event higher than 85°F in each habitable room;\n\nb.\n\nmaintain all fixed air conditioning systems, including air conditioning unit covers,\npanels, conduits, and disconnects, in operating condition, properly attached; and\n\n2.\n\nThe required room temperatures shall be measured three feet (914 mm) above the floor\nnear the center of the room and two feet (610 mm) inward from the center of each exterior\nwall.\n\n1204.1 General. Every space intended for human occupancy shall be provided with natural light by\nmeans of exterior glazed openings in accordance with Section 1204.2 (Natural Light) and shall be provided with artificial light in accordance with Section 1204.3 (Artificial Light). Exterior glazed openings shall open directly onto a public way or onto a yard or\ncourt in accordance with Section 1205 (Yards or Courts).\n\nExceptions:\n\n1.\n\nAny room or space that is not within a dwelling unit or sleeping unit shall not be\nrequired to provided natural light in accordance with Section 1204.2.\n\n2.\n\nAny room or space with an area of 70 square feet or less and is not a sleeping room\nshall not be required to provide natural light in accordance with Section 1204.2.\n\n3.\n\nSleeping rooms within an existing dwelling unit shall not be required to provide natural\nlight in accordance with Section 1204.2 when alterations do not increase the total\nnumber of sleeping rooms within the dwelling unit.\n\n1204.2 Natural Light. The minimum net exterior glazed opening area shall be not less than eight percent\nof the floor area of the room(s) served.\n\n1204.2.1 Adjoining Spaces. For the purpose of natural lighting, any room is permitted to be considered as a\nportion of an adjoining room where the common wall provides an opening of not less\nthan one-tenth of the floor area of the interior room or 24 square feet (2.23 m\n2\n), whichever is greater. Openings required for natural light in common walls may be\nwindows or glazed doors.\n\nException: Openings required for natural light shall be permitted to open into a sunroom with\nthermal isolation or a patio cover where the common wall provides a glazed area of\nnot less than one-tenth of the floor area of the interior room.\n\n1204.2.2 Exterior Openings. Exterior openings required by Section 1204.2 (Natural Light) for natural light shall open directly onto a public way, yard, or court, as set forth\nin Section 1205 (Yards or Courts).\n\nExceptions:\n\n1.\n\nRequired exterior openings are permitted to open into a roofed porch where the porch\nmeets all of the following criteria:\n\n1.1\n\nAbuts a public way, yard, or court;\n\n1.2\n\nHas a ceiling height of not less than seven feet; and\n\n1.3\n\nHas a longer side at least 65 percent open and unobstructed.\n\n2.\n\nSkylights are not required to open directly onto a public way, yard, or court.\n\n1204.3 Artificial Light. Artificial light shall be provided that is adequate to provide an average illumination\nof 10 footcandles (107 lux) over the area of the room at a height of 30 inches (762\nmm) above the floor level.\n\n1204.4 Stairway Illumination. Stairways within dwelling units and exterior stairways serving a dwelling unit shall\nhave an illumination level on tread runs of not less than 1 footcandle (11 lux). Stairways\nin other occupancies shall be governed by Chapter 10.\n\n1204.4.1 Controls. The control for activation of the required stairway lighting shall be in accordance\nwith NFPA 70.\n\n1204.5 Emergency Egress Lighting. The means of egress shall be illuminated in accordance with Section 1008.1.\n\n1301.1 Energy Efficiency. Buildings shall be designed and constructed in accordance with the Energy Code.\n\nTABLE 1006.3.4(1)\nSTORIES WITH ONE EXIT OR ACCESS TO ONE EXIT FOR R-2 OCCUPANCIES\n\n| STORY | OCCUPANCY | MAXIMUM NUMBER OF DWELLING UNITS | MAXIMUM EXIT ACCESS TRAVEL DISTANCE |\n| --- | --- | --- | --- |\n| Basement, first, second, third, fourth, or fifth story above grade plane and occupiable roofs over the first, second, third, or fourth story. | R-2 a, b, c, d | 4 dwelling units | 125 feet |\n| Sixth story above grade plane and higher | NP | NA | NA |\n\nFor SI: 1 foot = 304.8 mm.\n\nNP = Not Permitted.\n\nNA = Not Applicable.\n\na.\n\nBuildings classified as Group R-2 equipped throughout with an automatic sprinkler\nsystem in accordance with Section 903.3.1.1 or Section 903.3.1.2 and provided with\nemergency escape and rescue openings in accordance with Section 1031.\n\nb.\n\nThis table is used for Group R-2 occupancies consisting of dwelling units. For Group\nR-2 occupancies consisting of sleeping units, use Table 1006.3.4(2).\n\nc.\n\nThis table is for occupiable roofs accessed through and serving individual dwelling\nunits in Group R-2 occupancies. For Group R-2 occupancies with occupiable roofs that\nare not accessed through and serving individual units, use Table 1006.3.4(2).\n\nd.\n\nFive-story buildings and four-story buildings with an occupiable roof above the third\nstory shall also comply with Section 1006.3.4.2.\n\n1006.3.4.2 Single Exit Four- or Five-story Group R-2 Occupancies. Four- or five-story buildings with a single exit for Group R-2 occupancies shall\ncomply with Table 1006.3.4(1) and all the following:\n\n1.\n\nThe net floor area of each floor served by a single exit shall not exceed 4,000 square\nfeet (418.5 m).\n\n2.\n\nAn exterior exit stairway or interior exit stairway shall be provided at each story\nserved by a single exit. Exit Access Doors into the exit stairway shall swing in the\ndirection of egress travel regardless of the occupant load served.\n\n3.\n\nRegardless of the stairway construction type, automatic sprinkler locations in interior\nexit stairways shall comply with the requirements of NFPA 13 for combustible stairways.\n\n4.\n\nThere shall be no more than 20 feet (6096 mm) of travel to the exit stairway from\nthe entry/exit door of any dwelling unit.\n\n5.\n\nThe exit shall not terminate in an egress court where the court depth exceeds the\ncourt width unless it is possible to exit in either direction to the public way.\n\n6.\n\nOther occupancies shall not communicate with the Group R occupancy portion of the\nbuilding or with the single-exit stairway. Exception: parking garages and occupied\nroofs accessory to the Group R occupancy are permitted to communicate with the exit\nstairway.\n\n7.\n\nThe exit serving the Group R occupancy shall not discharge through any other occupancy,\nincluding an accessory parking garage.\n\n8.\n\nOpenings to the interior exit stairway enclosure shall be limited to those required\nfor exit access into the enclosure from normally occupied spaces, those required for\negress from the enclosure, and openings to the exterior. Elevators shall not open\ninto the interior exit stairway enclosure.\n\n9.\n\nThe fire department connection (FDC) shall be located adjacent to, and be visible\nfrom, the primary fire department vehicle access location.\n\n10.\n\nA manual fire alarm system and automatic smoke detection system that activates the\noccupant notification system in accordance with Section 907.5 shall be provided. Smoke\ndetectors shall be in common spaces outside of dwelling units, including but not limited\nto gathering areas, laundry rooms, mechanical equipment rooms, storage rooms, interior\ncorridors, interior exit stairways, and exit passageways.\n\n11.\n\nElectrical receptacles shall be prohibited in the single exit stairway.\n\n12.\n\nElevator access shall be provided.\n\n1607.8.2 Fire Truck and Emergency Vehicles. Where a structure or portions of a structure are accessed by fire department vehicles\nand other similar emergency vehicles, those portions of the structure subject to such\nloads shall be designed for the greater of the following loads:\n\n1.\n\nAs specified in the International Fire Code Section 503.2.6 (Bridges and Elevated Surfaces), or\n\n2.\n\nThe live loading specified in Section 1607.8.1 (Loads).\n\nEmergency vehicle loads need not be assumed to act concurrently with other uniform\nlive loads.\n\nSECTION 1612 FLOOD LOADS.\n\n1612.1 General. A building or structure in a flood hazard area shall be designed and constructed\naccording to Chapter 25-12, Article 3 (Flood Hazard Areas).\n\n1612.2 Design and Construction. A building or structure in a flood hazard area shall be designed in accordance with\nChapter 25-12, Article 3 (Flood Hazard Areas).\n\n1612.3 Establishment of Flood Hazard Areas. Flood hazard areas are established in Chapter 25-12, Article 3 (Flood Hazard Areas).\n\n1612.4 Flood Hazard Documentation.\nChapter 25-12, Article 3 (Flood Hazard Areas) describes the documentation necessary for a building or structure located in a flood\nhazard area.\n\nSECTION 1811 EARTH RETENTION SYSTEMS\n\n1811.1 Tieback Anchors and Soil and Rock Nails. Tieback anchors and soil and rock nails that are allowed in the public right-of-way\nas components of earth retention systems as provided in Section 3202.1.4 (Earth Retention System Components) shall comply with Sections 1811.1.1 (Depth of Tiebacks Anchors and Soil and Rock Nails) through 1811.1.3 (Length of Tiebacks Anchors and Soil and Rock Nails).\n\n1811.1.1 Depth of Tieback Anchors and Soil and Rock Nails. At the right-of-way line, tieback anchors and soil and rock anchors shall be at least\n6 feet (1,829 mm) below the elevation of the adjacent street curb.\n\n1811.1.2 Separation Distance from Buried Utilities. Tieback anchors and soil and rock nails shall be below and at least five feet (1,524\nmm) away from the nearest outside surface of any existing or planned buried utility\nin the public right-of-way.\n\n1811.1.3 Length of Tieback Anchors and Soil and Rock Nails. Tieback anchors and soil and rock nails that extend beyond the center of the public\nright-of-way are prohibited.\n\n2901.1 Scope. The provisions of this chapter and the Plumbing Code shall govern the design, construction,\nerection and installation of plumbing components, appliances, equipment, and systems\nused in buildings and structures covered by this code.\n\n3201.1 Encroachments Scope. The provisions of this chapter shall govern the encroachment of structures into the\npublic right-of-way, including components of earth retention systems used to facilitate\nbelow-grade construction of a building or structure.\n\n3202.1 Encroachments Below Grade. Encroachments below grade shall comply with Sections 3202.1.1 (Structural Support) through 3202.1.4 (Earth Retention System Components).\n\n3202.1.4 Earth Retention System Components. Components of earth retention systems that are required for structural support of\na building or structure are prohibited in the public right-of-way. Components of earth\nretention systems that are needed only during construction of the below-grade portion\nof a building or structure are subject to the following conditions:\n\n1.\n\nApproval of the Director of the Public Works Department is required before construction\nof earth retention system components in public right-of-way commences.\n\n2.\n\nAll components of an earth retention system are prohibited in the public right-of-way\nexcept for (1) tieback anchors that are part of a soldier pile and lagging system;\n(2) tieback anchors that are part of a diaphragm or slurry wall system; (3) tieback\nanchors that are part of a sheet pile wall system; (4) tieback anchors that are part\nof a secant wall system; and (5) soil or rock nails that are part of a nail wall.\n\n3.\n\nTieback anchors or soil or rock nails that are necessary as functional components\nof the earth retention system for longer than 12 months are prohibited in the public\nright-of-way.\n\n4.\n\nTieback anchors and soil and rock nails allowed in the public right-of-way shall be\ndesigned according to the criteria in Section 1811 (Earth Retention Systems).\n\n3202.3.4 Pedestrian Walkways. An approved encroachment agreement that complies with Chapter 14-11 (Use of Right-of-Way) is required prior to the installation of a pedestrian walkway and all associated\nutilities over a public right-of-way. The vertical clearance from the public right-of-way\nto the lowest part of a pedestrian walkway shall be not less than 16 feet 6 inches\nover roadway and alley subject to truck traffic, and not less than 15 feet over other\nareas in the right-of-way.\n\nSource: Ord. No. 20170928-096, Pt. 1, 1-1-18; Ord. No. 20191114-064, Pts. 13—17, 11-25-19; Ord. No. 20210603-059, Pt. 1, 9-1-21; Ord. No. 20240418-062, Pt. 1, 5-20-24; Ord. No. 20250410-045, Pt. 1, 7-10-25.\n\nThis division prescribes minimum outdoor-to-indoor noise level reduction measures\nfor certain airport compatible land uses governed by Chapter 25-13, Article 3 (Compatible Land Uses).\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n(A)\n\nThis section prescribes the building requirements to achieve a minimum outdoor-to-indoor\nnoise level reduction of 25 decibels.\n\n(B)\n\nThis subsection prescribes requirements for exterior walls.\n\n(1)\n\nA masonry wall must equal or exceed the weight of an equivalent wall constructed of\nsix-inch light-weight concrete block. At least one surface must be painted or plastered.\nA furred interior wall is not required on the inside of a masonry wall.\n\n(2)\n\nSiding-on-sheathing or stucco or brick veneer must be installed on the outside of\nminimum 4-inch nominal deep studs.\n\n(3)\n\nThe interior wall surface of an exterior wall must be minimum ½ inch gypsum board\nor plaster installed on the inside of the wall studs.\n\n(4)\n\nContinuous sheathing as required by the Building Code must cover the exterior side\nof the wall studs behind wood, asphalt or aluminum siding. The sheathing must be at\nleast ½ inch thick.\n\n(5)\n\nSheathing boards or panels must be butted tightly and covered on the exterior with\noverlapping and airtight building paper when wood sheathing is used.\n\n(6)\n\nGlass fiber or mineral wool insulation with a minimum thermal resistance (R) factor\nof 11 is required in the cavity space behind the exterior sheathing and between wall\nstuds.\n\n(7)\n\nA brick veneer, masonry block, or stucco wall must be constructed airtight except\nas otherwise required by the Building Code. All surface joints must be grouped or\ncaulked airtight.\n\n(8)\n\nA penetration of a wall by a pipe or duct must be caulked or filled with mortar.\n\n(C)\n\nThis subsection prescribes the requirements for windows.\n\n(1)\n\nGlass of a single-glazed window must be minimum\n3/16\ninch thick.\n\n(2)\n\nGlass of a double-glazed window must be of standard manufacturers' thickness and separation.\n\n(3)\n\nAn operable window in a dwelling must contain a hinged-type sash or double-hung sash.\nThe sash must be rigid and weather stripped with an efficiently airtight, flexible\nnonmetallic material that is compressed airtight when the window is closed.\n\n(4)\n\nA horizontally sliding sash window may be used if the sash is weather stripped with\nan efficiently airtight gasket and if the window has a laboratory sound transmission\nrating of STC-28 or greater.\n\n(5)\n\nGlass of a fixed-sash window must be set and sealed in an airtight non-hardening glazing\ncompound or in an elastomer gasket.\n\n(6)\n\nThe perimeter of a window frame must be sealed airtight to the exterior wall construction.\n\n(D)\n\nThis subsection prescribes requirements for exterior doors.\n\n(1)\n\nAn exterior door must be minimum 1¾ inch thick solid core wood or metal clad and must\nbe fully weather stripped in an airtight manner.\n\n(2)\n\nA sliding door may be used if the operable sash is weather stripped with an efficient\nairtight gasket and if the door has a laboratory sound transmission rating of STC-28\nor greater. Glass of a sliding door must be minimum\n3/16\ninch thick.\n\n(3)\n\nThe perimeter of a door frame must be sealed airtight to the exterior wall construction.\n\n(E)\n\nThis subsection prescribes requirements for ceilings.\n\n(1)\n\nA gypsum board or plaster ceiling at least ½ inch thick is required below attic spaces\nor roof rafters or roof construction weighing less than eight pounds per square foot.\n\n(2)\n\nInsulation with a minimum thermal resistance (R) factor of 19 is required above the\nceiling between the joists. Insulation in attic spaces may not have paper or foil\ncovering on the face exposed to the attic.\n\n(F)\n\nThis subsection prescribes requirements for ventilation.\n\n(1)\n\nMechanical ventilation is required and must be of a type and design that provides\nadequate environmental comfort with all doors and windows closed during all seasons.\n\n(2)\n\nA window ventilation unit may not be used. A wall-mounted ventilation unit may be\nused if the unit is insulated to minimize outdoor-to-indoor sound and the wall penetrations\nare sealed.\n\n(3)\n\nVent openings in attic or crawl spaces must be the minimum number and size necessary\nto provide proper ventilation. In this paragraph, \"vent\" includes a conduit or passageway,\nvertical or nearly so, for conveying products of combustion to the outside atmosphere.\n\n(4)\n\nCoated glass fiber duct liner at least one inch thick is required for a return air\nduct.\n\n(5)\n\nA fireplace must be provided with a well-fitted damper.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n(A)\n\nThis section prescribes the building requirements to achieve a minimum outdoor-to-indoor\nnoise level reduction of 30 decibels.\n\n(B)\n\nThis subsection prescribes the requirements for exterior walls.\n\n(1)\n\nA masonry wall must equal or exceed the weight of an equivalent wall constructed of\nsix-inch dense concrete block. At least one surface must be painted or plastered.\nA furred interior wall is not required on the inside of a masonry wall.\n\n(2)\n\nSiding-on-sheathing, stucco, or brick veneer must be installed on the outside of minimum\nfour-inch nominal deep studs.\n\n(3)\n\nThe interior wall surface of an exterior wall must be minimum ⅝ inch gypsum board\nor plaster installed on the inside of the wall studs.\n\n(4)\n\nContinuous sheathing as required by the Building Code must cover the exterior side\nof the wall studs behind wood, asphalt, or aluminum siding. The sheathing must be\nminimum ½ inch thick. The weight of the sheathing and facing must be at least four\npounds per square foot.\n\n(5)\n\nSheathing boards or panels must be butted tightly and covered on the exterior with\noverlapping and airtight building paper. The top and bottom edges of the sheathing\nmust be sealed airtight.\n\n(6)\n\nGlass fiber or mineral wool insulation at least two-inches thick is required in the\ncavity space behind the exterior sheathing and between wall studs.\n\n(7)\n\nA brick veneer, masonry block, or stucco wall must be constructed airtight except\nas otherwise required by the Building Code. All surface joints must be grouped or\ncaulked airtight.\n\n(8)\n\nA penetration of a wall by a pipe or duct must be caulked or filled with mortar.\n\n(C)\n\nThis subsection prescribes the requirements for windows.\n\n(1)\n\nA single-glazed window may be used if the window is fixed and if the glazing is acoustical\nglass with a laboratory sound transmission rating of minimum STC-35.\n\n(2)\n\nGlass of a double-glazed window must be minimum ⅛-inch thickness. Panes of glass must\nbe separated by a minimum three-inch air space and may not be equal in thickness.\n\n(3)\n\nGlass of a triple-glazed window must be of standard manufacturers' thickness and separation.\n\n(4)\n\nA double-glazed or triple-glazed window must contain a fixed sash or efficiently weather\nstripped operable sash. The sash must be rigid and weather stripped with an efficiently\nairtight material that is compressed airtight when the window is closed.\n\n(5)\n\nGlass of a fixed-sash window must be set and sealed in an airtight non-hardening glazing\ncompound or in an elastomer gasket.\n\n(6)\n\nThe perimeter of a window frame must be sealed airtight to the exterior wall construction.\n\n(7)\n\nFor a sleeping space, the total area of glass of windows and doors may not exceed\n20 percent of the net floor area.\n\n(D)\n\nThis subsection prescribes the requirements for exterior doors.\n\n(1)\n\nDouble door construction is required for a door opening to the exterior.\n\n(2)\n\nIf doors are separated by a vestibule of three-foot minimum depth, each door must\nbe minimum 1½ inch solid core wood or metal clad. One door must be weather stripped\nin an airtight manner. The other door must be tightly fitted to the door frame or\nweather stripped.\n\n(3)\n\nIf a vestibule is not used, a minimum 1¾ inch solid core wood door may be used in\nseries with a storm door. Both doors must be weather stripped in an airtight manner.\n\n(4)\n\nA single frame sliding glass door may not be used. The glass of a double sliding door\nmust be separated by a minimum four inch airspace. Each sliding frame must be provided\nwith an efficiently airtight weather stripping material.\n\n(5)\n\nGlass of a storm or sliding door must be minimum\n3/16\ninch. Glass of a double sliding door may not be equal in thickness.\n\n(6)\n\nThe perimeter of a door frame must be sealed airtight to the exterior wall construction.\n\n(E)\n\nThis subsection prescribes the requirements for a roof.\n\n(1)\n\nRoof sheathing must be minimum ¾ inch thick continuous plywood. Spaced board sheathing\nmay not be used.\n\n(2)\n\nA roof sheathing joint must be sealed airtight and must be covered with overlapping,\nairtight building paper.\n\n(3)\n\nAn exposed roof deck must be minimum two-inch thick wood or concrete, and the total\nweight of the roof construction must be at least 12 pounds per square foot.\n\n(F)\n\nThis subsection prescribes the requirements for ceilings.\n\n(1)\n\nA gypsum board or plaster ceiling at least ½ inch thick is required below attic spaces\nor below the roof rafters or roof decks less than two inches thick and weighing less\nthan 12 pounds per square foot.\n\n(2)\n\nThe ceiling must be a minimum of 12 inches below the roof sheathing.\n\n(3)\n\nGlass fiber or mineral wool insulation at least two-inches thick is required above\nthe ceiling between joists. Insulation in attic spaces may not have paper or foil\ncovering on the face exposed to the attic.\n\n(G)\n\nThis subsection prescribes the requirements for ventilation.\n\n(1)\n\nMechanical ventilation is required and must be of a type and design that provides\nadequate environmental comfort with all doors and windows closed during all seasons.\n\n(2)\n\nA window or through-the-wall ventilation unit may not be used.\n\n(3)\n\nVent openings in attic or crawl spaces must be the minimum number and size to provide\nadequate ventilation. The openings must be provided with five-foot long transfer ducts\ncontaining at least one 90-degree elbow and internal acoustical lining.\n\n(4)\n\nA ventilation duct connecting an interior space to the outdoors or an attic space\nmust contain at least ten foot long internal duct lining plus one limited 90 degree\nelbow.\n\n(5)\n\nCoated glass fiber duct liner at least one-inch thick is required.\n\n(6)\n\nA vented fireplace may not be used.\n\n(7)\n\nA building heating unit with a flue or combustion air vent must be located in a closet\nor room closed off from the occupied space by doors.\n\n(8)\n\nA door to a mechanical equipment area must be minimum 1¾ inch solid core wood or 20\ngauge steel hollow metal and must be fully weather stripped.\n\n(H)\n\nThis subsection prescribes other requirements.\n\n(1)\n\nCarpeting or an acoustical ceiling is required for a sleeping space.\n\n(2)\n\nA through-the-wall or through-the-door mailbox may not be used.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n(A)\n\nWhenever a building within the city is constructed, remodeled or converted for use\nas a food products or service establishment as described in Title 12 (Public Health), properly prepared plans and specifications for such construction, remodeling, or\nconversion in accordance with the Administrative Manual and the Buildings Criteria\nManual shall be submitted to the Health Authority for review and approval prior to\nbeginning the construction, remodeling or conversion. The Health Authority shall approve\nthe plans and specifications if they meet the requirements of the Administrative Manual,\nBuildings Criteria Manual, and all applicable laws. No food establishment shall be\nconstructed, remodeled, or converted except in accordance with plans and specifications\napproved by the Health Authority.\n\n(B)\n\nWhenever plans and specifications are required to be submitted to the Health Authority\nby Subsection (A), the Health Authority shall inspect the food establishment prior\nto commencement of operation to determine compliance with the approved plans and specifications\nand with the requirements of all applicable laws.\n\nSource: Section 13-8-50; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), grease traps shall be installed and properly\noperated in all food establishments where preparation of food occurs on the premises.\nThe design and construction of any grease trap shall be approved by the building official\nor the official's designee. The director of the Water and Wastewater Utility shall\ndetermine the minimum acceptable capacity and size of any grease trap, shall issue\npermits for the operation of grease traps and shall be responsible for enforcement\nof the proper operation of grease traps.\n\n(B)\n\nA grease trap is not required for a food establishment that:\n\n(1)\n\nserves only beverages; or\n\n(2)\n\nis a Category 1 or Category 2 charitable feeding organization as established under\nCity Code Subsection (B) of Section 10-3-100 (Charitable Feeding Organizations).\n\nSource: Section 13-8-51; Ord. 990225-70; Ord. 031211-11; Ord. No. 20210506-013, Pt. 10, 5-17-21.\n\n(A)\n\nThis article applies to the design, construction of buildings and structures, and\nadditions and alterations to buildings and structures located in flood hazard areas.\n\n(B)\n\nThis article is administered, implemented, and enforced in conjunction with each article\nof Chapter 25-12 (Technical Codes).\n\n(C)\n\nThis article is amended in the same manner as the Building and Residential Codes.\n\n(Ord. No. 20210603-059, Pt. 4, 9-1-21)\n\n(A)\n\nExcept as otherwise provided, the definitions in this subsection apply to all articles\nin this chapter:\n\n(1)\n\nBASE FLOOD. A flood that has the following characteristics:\n\n(a)\n\nFor areas amended to incorporate Atlas 14 data, a flood that has a one percent chance\nof being equaled or exceeded in any given year (100-year flood) calculated under fully\ndeveloped conditions as prescribed by the Drainage Criteria Manual as amended to incorporate\nAtlas 14 data;\n\n(b)\n\nFor areas not yet amended to incorporate Atlas 14 data, a flood that has a 0.2 percent\nchance of being equaled or exceeded in any given year (500-year flood) calculated\nunder the conditions underlying the FEMA Flood Insurance Studies listed in Section 25-12-53(B)(1) or as calculated under existing conditions as prescribed by the Drainage Criteria\nManual using data predating Atlas 14; or\n\n(c)\n\nFor the Colorado River, a flood that has a one percent chance of being equaled or\nexceeded in any given year (100-year flood) calculated under the conditions underlying\nthe FEMA Flood Insurance Rate Map dated January 6, 2016, or as subsequently revised.\n\n(2)\n\nBASE FLOOD ELEVATION. The elevation of the base flood, including wave height, relative to the National\nGeodetic Vertical Datum (NGVD), North American Vertical Datum (NAVD) or other datum\nspecified on the Flood Insurance Rate Map (FIRM).\n\n(3)\n\nDESIGN FLOOD. A flood that has the following characteristics:\n\n(a)\n\nFor areas amended to incorporate Atlas 14 data, a flood associated with an area of\na floodplain subject to a one percent or greater chance of being flooded in any year\n(100-year flood) based on projected full development in accordance with the City of\nAustin Drainage Criteria Manual as amended to incorporate Atlas 14 data;\n\n(b)\n\nFor areas not yet amended to incorporate Atlas 14 data, a flood associated with an\narea of a floodplain subject to a 0.2 percent or greater chance of being flooded in\nany year (500-year flood) calculated under the conditions underlying the FEMA Flood\nInsurance Studies listed in Section 25-12-53(B)(1), or as calculated under existing conditions as prescribed by the Drainage Criteria\nManual using data predating Atlas 14;\n\n(c)\n\nFor the Colorado River, a flood associated with an area of a floodplain subject to\na one percent or greater chance of being flooded in any year (100-year flood) as depicted\non the FEMA Flood Insurance Rate Map dated January 6, 2016, or as subsequently revised.\n\n(4)\n\nDESIGN FLOOD ELEVATION. The elevation of the \"design flood\" relative to the City of Austin vertical datum\nstandard.\n\n(5)\n\nDEVELOPMENT. Any man-made change to improved or unimproved real estate, including but not limited\nto, buildings or other structures, temporary or permanent storage of materials, mining,\ndredging, filling, grading, paving, excavations, operations and other land disturbing\nactivities.\n\n(6)\n\nFLOOD or FLOODING. A general and temporary condition of partial or complete inundation of normally dry\nland from:\n\n(a)\n\nthe overflow of inland waters; or\n\n(b)\n\nthe unusual and rapid accumulation or runoff of surface waters from any source.\n\n(7)\n\nFLOOD DAMAGE-RESISTANT MATERIALS. Any construction material capable of withstanding direct and prolonged contact with\nfloodwaters without sustaining any damage that requires more than cosmetic repair.\n\n(8)\n\nFLOOD HAZARD AREA. An area that has the following characteristics:\n\n(a)\n\nFor areas amended to incorporate Atlas 14 data, an area within a floodplain subject\nto a one percent or greater chance of being flooded in any year (100-year flood) based\non projected full development in accordance with the City of Austin Drainage Criteria\nManual as amended to incorporate Atlas 14 data;\n\n(b)\n\nFor areas not yet amended to incorporate Atlas 14 data, an area of a floodplain subject\nto a 0.2 percent or greater chance of being flooded in any year (500-year flood) calculated\nunder the conditions underlying the FEMA Flood Insurance Studies listed in 25-12-53(B)(1), or as calculated under existing conditions as prescribed by the Drainage Criteria\nManual using data predating Atlas 14;\n\n(c)\n\nFor the Colorado River, an area within a floodplain subject to a one percent or greater\nchance of being flooded in any year (100-year flood) as depicted on the FEMA Flood\nInsurance Rate Map dated January 6, 2016, or as subsequently revised.\n\n(9)\n\nFLOOD INSURANCE RATE MAP (FIRM). An official map of a community on which the Federal Emergency Management Agency (FEMA)\nhas delineated both the special flood hazard areas and the risk premium zones applicable\nto the community.\n\n(10)\n\nFLOOD INSURANCE STUDY. The official report provided by the Federal Emergency Management Agency containing\nthe Flood Insurance Rate Map (FIRM), the Flood Boundary Map, the water surface elevation\nof the base flood, and supporting technical data.\n\n(11)\n\nFLOODWAY. The channel of the river, creek, or other watercourse and the adjacent land areas\nthat shall be reserved in order to discharge the base flood without cumulatively increasing\nthe water surface elevation more than a designated height. An area that has the following\ncharacteristics:\n\n(a)\n\nFor the Colorado River, an area with a floodplain subject to a four percent or greater\nchance of flooding in any year (25-year flood) based on existing developed conditions\nas prescribed by the Drainage Criteria Manual using data predating Atlas 14; or\n\n(b)\n\nFor all other rivers, creeks, and watercourses in areas amended to incorporate Atlas\n14 data, an area with a four percent or greater chance of flooding in any year (25-year\nflood) based on a projected full development in accordance with the City of Austin\nDrainage Criteria Manual as amended to incorporate Atlas 14 data; or\n\n(c)\n\nFor all other rivers, creeks, and watercourses in areas not yet amended to incorporate\nAtlas 14 data, an area with a one percent or greater chance of flooding in any year\n(100-year flood) based on a projected full development in accordance with the City\nof Austin Drainage Criteria Manual using data predating Atlas 14.\n\n(12)\n\nFUNCTIONALLY DEPENDENT FACILITY. A facility which cannot be used for its intended purpose unless it is located or\ncarried out in close proximity to water, such as a docking or port facility necessary\nfor the loading or unloading of cargo or passengers, shipbuilding or ship repair.\nThe term does not include long-term storage, manufacture, sales or service facilities.\n\n(13)\n\nMANUFACTURED HOME. A structure that is transportable in one or more sections, built on a permanent chassis,\ndesigned for use with or without a permanent foundation when attached to the required\nutilities, and constructed to the Federal Mobile Home Construction and Safety Standards\nand rules and regulations promulgated by the U.S. Department of Housing and Urban\nDevelopment. The term also includes mobile homes, park trailers, travel trailers and\nsimilar transportable structures that are placed on a site for 180 consecutive days\nor longer.\n\n(14)\n\nMANUFACTURED HOME PARK OR SUBDIVISION. A parcel (or contiguous parcels) of land divided into two or more manufactured home\nlots for rent or sale.\n\n(15)\n\nRECREATIONAL VEHICLE. A vehicle that is built on a single chassis, 400 square feet (37.16 m2) or less when\nmeasured at the largest horizontal projection, designed to be self-propelled or permanently\ntowable by a light-duty truck, and designed primarily not for use as a permanent dwelling\nbut, as temporary living quarters for recreational, camping, travel or seasonal use.\nA recreational vehicle is ready for highway use if it is on its wheels or jacking\nsystem, is attached to the site only by quick disconnect-type utilities and security\ndevices and has no permanently attached additions.\n\n(16)\n\nREGULATORY FLOOD DATUM. An established plane of reference from which elevations and depth of flooding may\nbe determined for specific locations of the floodplain. It is the water level of the\ndesign flood plus a freeboard factor of one foot. Design flood plus freeboard equals\nRegulatory Flood Datum.\n\n(17)\n\nSPECIAL FLOOD HAZARD AREA. The land area subject to flood hazards and shown on a Flood Insurance Rate Map or\nother flood hazard map as Zone A, AE, A1-30, A99, AR, AO, AH, V, VO, VE or VI-30.\n\n(18)\n\nSTART OF CONSTRUCTION. The date a permit is issued for new construction or substantial improvements to existing\nstructures if construction, repair, reconstruction, rehabilitation, addition, placement\nor other improvement starts within 180 days from the date the permit is issued. Construction\nstarts when permanent construction of a building (including a manufactured home) is\nfirst placed and includes pouring a slab or footing, installing pilings, or constructing\ncolumns. Permanent construction does not include preparing land (clearing, excavating,\ngrading, or filing); installing streets or walkways; excavating for a basement, footing,\npier, or foundation; or erecting temporary forms or installing accessory buildings\nnot occupied as dwelling units or not part of the main building. For a substantial\nimprovement, construction starts when a wall, ceiling, floor, or other structural\npart of a building is altered even if the alteration does not affect the external\ndimensions of the building.\n\n(19)\n\nSUBSTANTIAL DAMAGE. Damage of any origin sustained by a structure, whereby the cost of restoring the\nstructure to its before-damage condition would equal or exceed 50 percent of the market\nvalue of the structure before the damage occurred.\n\n(20)\n\nSUBSTANTIAL IMPROVEMENT. For the purpose of determining compliance with the flood hazard management provisions\nof the Building Code, a substantial improvement is any combination of repair, reconstruction,\nrehabilitation, alteration, addition or other improvement of a building or structure\nduring the immediate 10-year period, the cost of which cumulatively equals or exceeds\n50 percent of the market value of the structure before the improvement or repair is\nstarted, or if the structure has been damaged and is being restored, before the damage\noccurred. If the structure has sustained substantial damage, any repairs are considered\nsubstantial improvement regardless of the actual repair work performed. The term does\nnot, however, include either of the following:\n\n1.\n\nAny project for improvement of a building required to correct existing health, sanitary\nor safety code violations identified by the building official and that are the minimum\nnecessary to assure safe living conditions.\n\n2.\n\nAny alteration of a historic structure, provided that the alteration will not preclude\nthe structure's continued designation as a historic structure; for the purpose of\nthis exclusion, a historic building is a building that is:\n\na.\n\nlisted or preliminarily determined to be eligible for listing in the National Register\nof Historic Places; or\n\nb.\n\ndetermined by the Secretary of the U.S. Department of the Interior as contributing\nto the historical significance of a registered historic district or a district preliminarily\ndetermined to qualify as a historic district; or\n\nc.\n\ndesignated as historic under a State of Texas or local historic preservation program\nthat is approved by the Department of the Interior.\n\n(22)\n\nVARIANCE. A grant of relief from the requirements of this article which permits construction\nin a manner otherwise prohibited by this article where specific enforcement would\nresult in unnecessary hardship.\n\n(B)\n\nA term defined in an article in this chapter has the same meaning in this article.\n\n(Ord. No. 20210603-059, Pt. 4, 9-1-21; Ord. No. 20241121-079, Pt. 1, 12-2-2024)\n\n(A)\n\nGeneral.\n\n(1)\n\nWithin flood hazard areas as established in Subsection (B) (Establishment of flood hazard areas), all new construction and alterations of buildings, structures and portions of buildings\nand structures, including substantial improvement and restoration of substantial damage\nto buildings and structures, shall be designed and constructed to resist the effects\nof flood hazards and flood loads. When new construction constitutes a substantial\nimprovement or restoration of substantial damage all aspects of the existing structure\nshall be brought into compliance with the requirements for new construction for flood\ndesign. All elevation requirements noted in this ordinance shall be documented using\nthe Elevation Certificate, FEMA 086-0-33, and shall be certified by a registered professional\nengineer, surveyor, or architect, and shall be submitted to the Floodplain Administrator.\n\n(2)\n\nExcept as otherwise provided, this section applies to residential and non-residential\nbuilding and structures.\n\n(B)\n\nEstablishment of flood hazard areas. The City establishes a flood hazard area that includes the following:\n\n(1)\n\nareas of special flood hazard areas identified by the Federal Emergency Management\nAgency in the current scientific and engineering report entitled, \"The Flood Insurance\nStudy (FIS) for Williamson County, Texas and Incorporated Areas\" dated December 20,\n2019, with accompanying Flood Insurance Rate Maps (FIRM) dated December 20, 2019,\nthe current scientific and engineering report entitled \"The Flood Insurance Study\n(FIS) for Travis County, Texas and Incorporated Areas\" dated January 6, 2016, with\naccompanying Flood Insurance Rate Maps dated January 6, 2016, the current scientific\nand engineering report entitled, \"The Flood Insurance Study (FIS) for Hays County,\nTexas and Incorporated Areas\" dated January 17, 2025, with accompanying Flood Insurance\nRate Maps (FIRM) dated January 17, 2025, and any revisions are adopted by reference\nand declared to be a part of this section; and\n\n(2)\n\nthe 100-year and 25-year floodplains as defined in the Austin City Code are adopted\nby reference and declared to be part of this section.\n\n(C)\n\nDesign and construction. The design and construction of buildings and structures, and additions and alterations\nto buildings and structures located in flood hazard areas, shall be in accordance\nwith ASCE 24, Flood Resistant Design and Construction.\n\n(1)\n\nElevation Requirements.\n\n(a)\n\nUnless otherwise specified in Title 25 (Land Development), the lowest floor of a building or structure shall be elevated a minimum of two\nfeet above the design flood elevation.\n\n(b)\n\nFreeboard. Unless otherwise specified in the Title 25 (Land Development), a minimum freeboard of two foot shall be added where the design flood elevation\nor other elevation requirements are specified.\n\n(c)\n\nIn areas of shallow flooding (AO Zones), the lowest floor (including a basement) of\na building or structure shall be elevated higher than the highest adjacent grade as\nthe depth number specified in feet (mm) on the FIRM plus two feet, or at least three\nfeet (915 mm) if a depth number is not specified.\n\n(d)\n\nA basement floor that is below grade on all sides shall be elevated at least two feet\nabove the design flood elevation.\n\nExceptions: An enclosed area, including a basement, which is below the design flood elevation\nbut not below grade on all sides shall meet the requirements in Subsection (C)(2)\n(Enclosed area below design flood elevation).\n\n(2)\n\nEnclosed area below design flood elevation. An enclosed area, including a crawl space,\nthat is below the regulatory flood datum shall:\n\n(a)\n\nbe used only for parking vehicles, building access or storage excluding property,\nmaterial, or equipment that may constitute a safety hazard when contacted by flood\nwaters;\n\n(b)\n\ninclude flood openings that meet the following criteria:\n\n(i)\n\nthe enclosed area shall have a minimum of two openings located on different sides\nof the enclosed area; if a building includes more than one enclosed area below the\ndesign flood elevation, each area shall have openings on exterior walls;\n\n(ii)\n\nthe total net area of all openings shall be at least 1 square inch (645 mm2) per square\nfoot (0.093 m2) of the enclosed area, or the openings are designed and the construction\ndocuments state that the design and installation will provide for the equalization\nof hydrostatic flood forces on exterior walls by allowing for the automatic entry\nand exit of floodwaters;\n\n(iii)\n\nthe bottom of each opening is 1 foot (305 mm) or less above adjacent ground level;\n\n(iv)\n\neach opening is at least 3 inches (76 mm) in diameter;\n\n(v)\n\nany louvers, screens or other opening covers allow the automatic flow of floodwaters\ninto and out of the enclosed areas;\n\n(vi)\n\na door or window that does not meet the requirements in Subsection (C)(2)(b)(i) through\n(v) does not comply with this section; and\n\n(vii)\n\nconstructed of flood damage-resistant materials.\n\n(3)\n\nProvisions of safe refuge.\n\n(a)\n\nA building or structure constructed in the flood hazard area where the ground surface\nis below the design flood elevation or where flood water velocities at the building\nmay exceed five feet per second shall provide an enclosed refuge space two feet or\nmore above the design flood elevation of sufficient area to provide for the occupancy\nload with a minimum of 12 square feet per person. The refuge space shall be provided\nto an exterior platform and stairway not less than three feet wide.\n\n(b)\n\nAn existing building or structure in a flood hazard area that is substantially improved\nor where a change of use or occupancy is made, shall conform to the requirements of\nSubsection (a).\n\n(c)\n\nRegardless of the structure or space classification, a floor level or portion of a\nbuilding or structure that is lower than two feet above the design flood elevation\nshall not be used residentially, or for storage of any property, materials, or equipment\nthat might constitute a safety hazard when contacted by flood waters.\n\n(4)\n\nMeans of egress.\n\n(a)\n\nUnless otherwise approved by the building official, normal access to the building\nshall be by direct connection with an area that is a minimum of one foot above the\ndesign flood elevation.\n\n(b)\n\nFor a building that is part of a single-family condo regime residential building permit\napplication and part of a site plan that was approved between December 1, 2017, and\nNovember 25, 2019, compliance with this section shall be determined at the time of\nsite plan approval.\n\n(c)\n\nFor a building that is part of a single-family building permit application and part\nof (a) a preliminary plan that was submitted for approval between December 1, 2014,\nand November 25, 2019, or (b) a final plat that was approved between December 1, 2017,\nand November 25, 2019, compliance with this section shall be determined at the time\nof preliminary plan or final plat approval, respectively.\n\n(d)\n\nFor all other buildings subject to Article 11 (Residential Code), compliance with this section shall be determined at the time of building permit\napplication.\n\nException: This subsection does not apply to an addition or alteration to an existing building\nor structure subject to Article 11 (Residential Code) that is not a substantial improvement as defined in Section 25-12-52 (Definitions).\n\n(5)\n\nInstallation of openings. The walls of enclosed areas shall have openings installed such that:\n\n(a)\n\nThere shall be not less than two openings on different sides of each enclosed area;\nif a building has more than one enclosed area, each area shall have openings.\n\n(b)\n\nThe bottom of each opening shall be not more than 1 foot (305 mm) above the higher\nof the final interior grade or floor and the finished exterior grade immediately under\neach opening.\n\n(c)\n\nOpenings shall be permitted to be installed in doors and windows; doors and windows\nwithout installed openings do not meet the requirements of this section.\n\n(D)\n\nFlood hazard documentation. For construction in flood hazard areas, the following documentation shall be prepared\nand sealed by a registered design professional and submitted to the building official:\n\n(1)\n\nThe elevation of the lowest floor, including the basement, as required by the lowest\nfloor elevation inspection in Building Code Section 110.3.3 (Lowest floor elevation) and for the final inspection in Building Code Section 110.3.10.1 (Flood hazard documentation).\n\n(2)\n\nFor fully enclosed areas below the design flood elevation where provisions to allow\nfor the automatic entry and exit of floodwaters do not meet the minimum requirements\nin Section 2.6.2.1 of ASCE 24, construction documents shall include a statement that\nthe design will provide for equalization of hydrostatic flood forces in accordance\nwith Section 2.6.2.2 of ASCE 24.\n\n(3)\n\nFor dry flood-proofed nonresidential buildings, construction documents shall include\na statement that the dry floodproofing is designed in accordance with ASCE 24.\n\n(4)\n\nThe as-built elevation documentation of the elevations specified in Section 25-12-53(C)(1) (Elevation Requirements).\n\n(Ord. No. 20210603-059, Pt. 4, 9-1-21; Ord. No. 20241121-079, Pt. 2, 12-2-2024)\n\n(A)\n\nStatutory Authorization. As a home-rule city, the City of Austin has the responsibility and power to adopt\nregulations designed to minimize flood losses. The Legislature of the State of Texas\nhas in Sections 16.3145 and 16.315 of the Texas Water Code authorized local government\nunits to adopt regulations designed to minimize flood losses.\n\n(B)\n\nAdministration.\n\n(1)\n\nPurpose. The purpose of this section is to promote the public health, safety and general welfare\nand to minimize public and private losses due to flood conditions in specific flood\nhazard areas through the establishment of comprehensive regulations for management\nof flood hazard areas designed to:\n\n(a)\n\nprevent unnecessary disruption of commerce, access and public service during times\nof flooding;\n\n(b)\n\nmanage the alteration of natural flood plains, stream channels and shorelines;\n\n(c)\n\nmanage filling, grading, dredging and other development which may increase flood damage\nor erosion potential;\n\n(d)\n\nprevent or regulate the construction of flood barriers which will divert floodwaters\nor which can increase flood hazards;\n\n(e)\n\ncontribute to improved construction techniques in the flood plain;\n\n(f)\n\nrestrict or prohibit uses that are dangerous to health, safety or property in times\nof flood, or cause excessive increases in flood heights or velocities; and\n\n(g)\n\nrequire that uses vulnerable to floods, including facilities which serve such uses,\nbe protected against flood damage at the time of initial construction.\n\n(2)\n\nObjectives. The objectives of this section are to protect human life, minimize the expenditure\nof public money for flood control projects, minimize the need for rescue and relief\nefforts associated with flooding, minimize prolonged business interruption, minimize\ndamage to public facilities and utilities, help maintain a stable tax base by providing\nfor the sound use and development of flood-prone areas, contribute to improved construction\ntechniques in the flood plain and ensure that potential owners and occupants are notified\nthat property is within flood hazard areas.\n\n(3)\n\nScope. The provisions of this section shall apply to all proposed development in a flood\nhazard area established in Section 25-12-53 (Flood Loads) of this code.\n\n(4)\n\nAlternative provisions. As an alternative to the requirements applicable to building and structures subject\nto Article 11 (Residential Code), ASCE 24 is permitted subject to the limitations of this code and the limitations\ntherein.\n\n(5)\n\nStructural systems. Structural systems of buildings and structures shall be designed, connected and anchored\nto resist flotation, collapse or permanent lateral movement due to structural loads\nand stresses from flooding equal to the design flood elevation.\n\n(6)\n\nFlood-resistant construction. Buildings and structures erected in areas prone to flooding shall be constructed\nby methods and practices that minimize flood damage.\n\n(C)\n\nApplicability.\n\n(1)\n\nGeneral. This section, in conjunction with other applicable provisions in this chapter, provides\nminimum requirements for development located in flood hazard areas, including:\n\n(a)\n\nthe subdivision of land;\n\n(b)\n\nsite improvements and installation of utilities;\n\n(c)\n\nplacement and replacement of manufactured homes;\n\n(d)\n\nplacement of recreational vehicles;\n\n(e)\n\nnew construction and repair, reconstruction, rehabilitation, or additions to new construction;\n\n(f)\n\nsubstantial improvement of existing buildings and structures, including restoration\nafter damage; and\n\n(g)\n\nthe installation of tanks.\n\n(2)\n\nAbrogation and greater restrictions. This section is not intended to repeal, abrogate, or impair any existing easements,\ncovenants, or deed restrictions. However, where this section and another city code\nprovision, easement, covenant, or deed restriction conflict or overlap, whichever\nimposes the more stringent restrictions shall prevail.\n\n(3)\n\nEstablishment of flood hazard areas. Flood hazard areas are established in Section 25-12-53(B) (Establishment of flood hazard areas).\n\n(4)\n\nNonconforming Uses. A structure, or the use of a structure or premises, which was lawful before the adoption\nof the Building Code, but which does not conform with the requirements of these regulations,\nmay be continued subject to the following conditions:\n\n(a)\n\nNo such use shall be expanded, changed, enlarged, or altered in a way which increases\nits nonconformity.\n\n(b)\n\nNo substantial improvement of the structure shall be made unless the structure is\nchanged to conform to these regulations.\n\n(c)\n\nIf a nonconforming use is discontinued for a period of 90 days, any future use of\nthe building or premises shall conform to these regulations.\n\n(d)\n\nAny nonconforming use or structure which is destroyed by any means, including floods,\nto an extent of 50 percent or more of its market value, shall not be reconstructed\nexcept in conformance with the provisions of these regulations.\n\n(D)\n\nPowers and Duties.\n\n(1)\n\nPermit applications. All applications for permits shall comply with the following:\n\n(a)\n\nThe building official shall review all permit applications to determine whether proposed\ndevelopment is located in flood hazard areas established in Section 25-12-53(B) (Establishment of flood hazard areas).\n\n(b)\n\nWhere a proposed development site is in a flood hazard area, all development to which\nthis section is applicable as specified in Subsection (C)(1) (General) shall be designed and constructed with methods, practices and materials that minimize\nflood damage and that are in accordance with the applicable provisions in Chapter 25-12 (Technical Code) and ASCE 24.\n\n(2)\n\nOther Permits. It shall be the responsibility of the building official to ensure that approval of\na proposed development shall not be given until proof that necessary approvals and/or\npermits have been granted by federal, state, or local agencies having jurisdiction\nover such development.\n\n(3)\n\nEstablishing the design flood elevation. The design flood elevation defines areas prone to flooding and describes, at a minimum,\nthe base flood elevation at the depth of peak elevation of flooding based upon:\n\n(a)\n\nFor areas amended to incorporate Atlas 14 data, the 100-year floodplain calculated\nunder fully developed conditions in accordance with the City of Austin Drainage Criteria\nManual as amended to incorporate Atlas 14 data;\n\n(b)\n\nFor areas not yet amended to incorporate Atlas 14 data, the 500-year floodplain either\nas depicted on the FEMA Flood Insurance Rate Map as of January 6, 2016, as subsequently\nrevised, or as calculated under existing conditions as prescribed by the Drainage\nCriteria Manual using data predating Atlas 14; or\n\n(c)\n\nFor the Colorado River, the 100-year floodplain as depicted on the FEMA Flood Insurance\nRate Map dated January 6, 2016, or as subsequently revised.\n\n(4)\n\nDetermination of design flood elevations. If design flood elevations are not specified, the building official is authorized\nto require the applicant to:\n\n(a)\n\nObtain, review and reasonably utilize data available from a federal, state or other\nsource; or\n\n(b)\n\nDetermine the design flood elevation in accordance with the 100-year floodplain as\ndefined in the Austin City Code. Such analyses shall be performed and sealed by a\nProfessional Engineer licensed by the State of Texas. Studies, analyses and computations\nshall be submitted in sufficient detail to allow review and approval by the building\nofficial. The accuracy of data submitted for such determination shall be the responsibility\nof the applicant.\n\n(5)\n\nDetermination of impacts. In a riverine flood hazard area where design flood elevations are specified but floodways\nhave not been designated, an applicant shall demonstrate that the effect of the proposed\nbuilding or structure on design flood elevations, including fill, when combined with\nall other existing and anticipated flood hazard area encroachments, will not increase\nthe design flood elevation at any point within the jurisdiction.\n\n(6)\n\nActivities in riverine flood hazard areas. In riverine situations, the building official shall not permit any new construction,\nsubstantial improvement or other development, including fill, unless the applicant\nsubmits an engineering analysis prepared by a registered design professional, demonstrating\nthat the cumulative effect of the proposed development, when combined with all other\nexisting and anticipated development, will not increase the design flood elevation\nat any point that results in additional adverse flooding on other property.\n\n(7)\n\nLowest floor. The lowest floor shall be the floor of the lowest enclosed area, including basement.\nThe lowest floor does not include any unfinished flood-resistant enclosure that is\nused only for vehicle parking, building access, or limited storage, unless the enclosure\nis built to cause the building or structure to violate this section.\n\nException: An unfinished enclosure used for storage of property, materials, or equipment that\nconstitute a safety hazard if contacted by flood waters is a lowest floor.\n\n(8)\n\nProtection of mechanical, plumbing and electrical systems. Electrical systems, equipment and components; heating, ventilating, air-conditioning;\nplumbing appliances and plumbing fixtures; duct systems; and other service equipment\nshall be located at or above the elevation required in Section 25-12-53(C)(1) (Elevation Requirements). If replaced as part of a substantial improvement, electrical systems, equipment\nand components; heating, ventilating, air-conditioning and plumbing appliances and\nplumbing fixtures; duct systems; and other service equipment shall meet the requirements\nof this section. Systems, fixtures, and equipment and components shall not be mounted\non or penetrate through walls intended to break away under flood loads.\n\nException: Locating electrical systems, equipment and components; heating, ventilating, air-conditioning;\nplumbing appliances and plumbing fixtures; duct systems; and other service equipment\nis permitted below the elevation required in Section 25-12-53(C)(1) (Elevation Requirements) provided that they are designed and installed to prevent water from entering or\naccumulating within the components and to resist hydrostatic and hydrodynamic loads\nand stresses, including the effects of buoyancy, during the occurrence of flooding\nto the required elevation in accordance with ASCE 24. Electrical wiring systems are\npermitted to be located below the required elevation provided that they conform to\nthe provisions of the electrical part of this code for wet locations.\n\n(9)\n\nProtection of water supply and sanitary sewage systems. New and replacement water supply systems shall be designed to minimize or eliminate\ninfiltration of flood waters into the systems in accordance with the plumbing provisions\nof this code. New and replacement sanitary sewage systems shall be designed to minimize\nor eliminate infiltration of floodwaters into systems and discharges from systems\ninto floodwaters in accordance with the plumbing provisions of this code and Chapter\n3 of the International Private Sewage Disposal Code.\n\n(10)\n\nFlood-resistant materials. Building materials and installation methods used for flooring and interior and exterior\nwalls and wall coverings below the elevation required in Section 25-12-53(C)(1) (Elevation Requirements) shall be flood damage-resistant materials that conform to the provisions of FEMA\nTB-2.\n\n(11)\n\nFloodway encroachment. Prior to issuing a permit for any floodway encroachment, including fill, new construction,\nsubstantial improvements and other development or land-disturbing activity, the building\nofficial shall require submission of a certification prepared by a Professional Engineer\nlicensed by the State of Texas, along with supporting technical data in accordance\nwith the City of Austin Drainage Criteria Manual, demonstrating that such development\nwill not cause any increase of the level of the design flood.\n\n(12)\n\nFloodway revisions. A floodway encroachment that increases the level of the design flood may be considered\nfor a variance only if the applicant has applied for a conditional Flood Insurance\nRate Map (FIRM) revision and has received the approval of the Federal Emergency Management\nAgency (FEMA) provided the conditional Flood Insurance Rate Map (FIRM) revision is\nrequired by the City of Austin Drainage Criteria Manual.\n\n(13)\n\nWatercourse alteration. Prior to issuing a permit for any alteration or relocation of any watercourse, the\nbuilding official shall require the applicant to provide notification of the proposal\nto the appropriate authorities of all affected adjacent government jurisdictions,\nas well as appropriate state agencies. A copy of the notification shall be maintained\nin the permit records and submitted to FEMA.\n\n(14)\n\nEngineering analysis. The building official shall require submission of an engineering analysis in accordance\nwith the City of Austin Drainage Criteria Manual performed and sealed by a Professional\nEngineer licensed by the State of Texas demonstrating that the flood-carrying capacity\nof the altered or relocated portion of the watercourse will not be decreased. Such\nwatercourses shall be maintained in a manner which preserves the channel's flood-carrying\ncapacity.\n\n(15)\n\nRecords. The building official shall maintain a permanent record of all permits issued in\nflood hazard areas, including copies of inspection reports and certifications required\nin Section 25-12-53(D) (Flood hazard documentation).\n\n(16)\n\nInspections. Development for which a permit under this section is required shall be subject to\ninspection. The building official or the building official's designee shall make,\nor cause to be made, inspections of all development in flood hazard areas authorized\nby issuance of a permit under this section.\n\n(E)\n\nPermits.\n\n(1)\n\nRequired. Any person, owner or owner's authorized agent who intends to conduct any development\nin a flood hazard area shall first make application to the building official and shall\nobtain the required permit.\n\n(2)\n\nApplication for permit. The applicant shall file an application in writing on a form furnished by the building\nofficial. Such application shall:\n\n(a)\n\nIdentify and describe the development to be covered by the permit.\n\n(b)\n\nDescribe the land on which the proposed development is to be conducted by legal description,\nstreet address or similar description that will readily identify and definitely locate\nthe site.\n\n(c)\n\nInclude a site plan showing the delineation of flood hazard areas, floodway boundaries,\nflood zones, design flood elevations, ground elevations, proposed lowest floor elevation,\nproposed fill and excavation and drainage patterns and facilities.\n\n(d)\n\nInclude in subdivision proposals and other proposed developments with more than 50\nlots or larger than 5 acres (20,234 m\n2\n), base flood elevation data in accordance with Section 25-12-53(B) (Establishment of flood hazard areas).\n\n(e)\n\nIndicate the use and occupancy for which the proposed development is intended.\n\n(f)\n\nBe accompanied by construction documents, grading and filling plans and other information\ndeemed appropriate by the building official.\n\n(g)\n\nState the valuation of the proposed work.\n\n(h)\n\nBe signed by the applicant or the applicant's authorized agent.\n\n(3)\n\nValidity of permit. The issuance of a permit under this section shall not be construed to be a permit\nfor, or approval of, any violation of this section or any other ordinance of the jurisdiction.\nThe issuance of a permit based on submitted documents and information shall not prevent\nthe building official from requiring the correction of errors. The building official\nis authorized to prevent occupancy or use of a structure or site which is in violation\nof this section or other ordinances of the City of Austin.\n\n(4)\n\nTime Limitation on Application; Permit Expiration and Reactivation. Article 13 (Administration of Technical Codes) of this chapter establishes permit application time limits and requirements applicable\nto permit expiration and reactivation, including a review fee for expired permits.\n\nException: Permits issued under Section 105.1.1 (Annual permit) are only valid for a period of 360 days from the date of issuance and cannot be\nextended.\n\n(5)\n\nSuspension or revocation. The building official is authorized to suspend or revoke a permit issued under this\nsection wherever the permit is issued in error or on the basis of incorrect, inaccurate\nor incomplete information, or in violation of any ordinance or code of the City of\nAustin.\n\n(F)\n\nVariances.\n\n(1)\n\nGeneral. The City Council shall decide requests for variances from the floodplain regulations\nin this code and Chapter 25-7 (Drainage) after conducting a public hearing. The City Council shall base its determination\non technical justifications and has the right to attach such conditions to variances\nas it deems necessary to further the purposes and objectives of this article.\n\n(2)\n\nRecords. The building official shall maintain a permanent record of all variance actions,\nincluding justification for their issuance.\n\n(3)\n\nHistoric structures. A variance may be issued for the repair or rehabilitation of a historic structure\nupon a determination that the proposed repair or rehabilitation will not preclude\nthe structure's continued designation as a historic structure, and the variance is\nthe minimum necessary to preserve the historic character and design of the structure.\n\nExceptions: Within flood hazard areas, historic structures that are not:\n\n(a)\n\nlisted or preliminarily determined to be eligible for listing in the National Register\nof Historic Places; or\n\n(b)\n\ndetermined by the Secretary of the U.S. Department of Interior as contributing to\nthe historical significance of a registered historic district or a district preliminarily\ndetermined to qualify as a historic district; or\n\n(c)\n\ndesignated as historic under a state or local historic preservation program that is\napproved by the Department of Interior.\n\n(4)\n\nFunctionally dependent facilities. A variance may be issued for the construction or substantial improvement of a functionally\ndependent facility provided the criteria in Section 25-12-53(A) (General) are met and the variance is the minimum necessary to allow the construction or substantial\nimprovement, and that all due consideration has been given to methods and materials\nthat minimize flood damages during the design flood and create no additional threats\nto public safety.\n\n(5)\n\nRestrictions. The City Council shall not issue a variance for any proposed development in a floodway\nif any increase in flood levels would result during the design flood discharge.\n\n(6)\n\nConsiderations. In reviewing applications for variances, the City Council shall consider all technical\nevaluations, all relevant factors, all other portions of this section, and each of\nthe following:\n\n(a)\n\nThe danger that materials and debris may be swept onto other lands resulting in further\ninjury or damage.\n\n(b)\n\nThe danger to life and property due to flooding or erosion damage.\n\n(c)\n\nThe susceptibility of the proposed development, including contents, to flood damage\nand the effect of such damage on current and future owners.\n\n(d)\n\nThe importance of the services provided by the proposed development to the community.\n\n(e)\n\nThe availability of alternate locations for the proposed development that are not\nsubject to flooding or erosion.\n\n(f)\n\nThe compatibility of the proposed development with existing and anticipated development.\n\n(g)\n\nThe relationship of the proposed development to the comprehensive plan and flood plain\nmanagement program for that area.\n\n(h)\n\nThe safety of access to the property in times of flood for ordinary and emergency\nvehicles.\n\n(i)\n\nThe expected heights, velocity, duration, rate of rise and debris and sediment transport\nof the floodwaters and the effects of wave action, if applicable, expected at the\nsite.\n\n(j)\n\nThe costs of providing governmental services during and after flood conditions including\nmaintenance and repair of public utilities and facilities such as sewer, gas, electrical\nand water systems, streets and bridges.\n\n(7)\n\nConditions for issuance. Variances shall only be issued by the City Council upon:\n\n(a)\n\na technical showing of good and sufficient cause based on the unique characteristics\nof the size, configuration or topography of the site;\n\n(b)\n\na determination that failure to grant the variance would result in exceptional hardship\nby rendering the lot undevelopable;\n\n(c)\n\na determination that the granting of a variance will not result in increased flood\nheights, additional threats to public safety, extraordinary public expense, nor create\nnuisances, cause fraud on or victimization of the public or conflict with existing\nlocal laws or ordinances;\n\n(d)\n\na determination that the variance is the minimum necessary, considering the flood\nhazard, to afford relief; and\n\n(e)\n\nnotification to the applicant in writing over the signature of the building official\nthat the issuance of a variance to construct a structure below the base flood level\nwill result in increased premium rates for flood insurance, and that such construction\nbelow the base flood level increases risks to life and property.\n\n(G)\n\nSubdivisions.\n\n(1)\n\nGeneral. Any subdivision proposal, including proposals for manufactured home parks and subdivisions,\nor other proposed new development in a flood hazard area shall be reviewed to verify\nall of the following:\n\n(a)\n\nall such proposals are consistent with the need to minimize flood damage;\n\n(b)\n\nall public utilities and facilities, such as sewer, gas, electric and water systems\nare located and constructed to minimize or eliminate flood damage; and\n\n(c)\n\nadequate drainage is provided to reduce exposure to flood hazards.\n\n(2)\n\nSubdivision requirements. The following requirements shall apply in the case of any proposed subdivision, including\nproposals for manufactured home parks and subdivisions, any portion of which lies\nwithin a flood hazard area:\n\n(a)\n\nThe flood hazard area, including floodways, as appropriate, shall be delineated on\ntentative and final subdivision plats.\n\n(b)\n\nDesign flood elevations shall be shown on tentative and final subdivision plats.\n\n(c)\n\nResidential building lots shall be provided with adequate buildable area outside the\nflood hazard area.\n\n(d)\n\nThe design criteria for utilities and facilities set forth in this section, Section 25-12-53 (Flood Loads), ASCE 24, the City of Austin Drainage Criteria Manual, and applicable FEMA design\ncriteria shall be met.\n\n(H)\n\nSite Improvement.\n\n(1)\n\nDevelopment in floodways. Development or land disturbing activity shall not be authorized in the floodway unless\nit has been demonstrated through hydrologic and hydraulic analyses performed and sealed\nby a Professional Engineer licensed by the State of Texas in accordance with the City\nof Austin Drainage Criteria Manual, that the proposed encroachment will not result\nin any increase in the level of the design flood.\n\n(2)\n\nSewer facilities. All new or replaced sanitary sewer facilities, private sewage treatment plants (including\nall pumping stations and collector systems) and on-site waste disposal systems shall\nbe designed in accordance with Chapter 7, ASCE 24, to minimize or eliminate infiltration\nof floodwaters into the facilities and discharge from the facilities into floodwaters,\nor impairment of the facilities and systems.\n\n(3)\n\nWater facilities. All new replacement water facilities shall be designed in accordance with the provisions\nof Chapter 7, ASCE 24, to minimize or eliminate infiltration of floodwaters into the\nsystems.\n\n(4)\n\nStorm drainage. Storm drainage shall be designed to convey the flow of surface waters to minimize\nor eliminate damage to persons or property.\n\n(5)\n\nStreets and sidewalks. Streets and sidewalks shall be designed to minimize potential for increasing or aggravating\nflood levels.\n\n(I)\n\nManufactured Homes.\n\n(1)\n\nElevation.\n\n(a)\n\nAll new and replacement manufactured homes to be placed or substantially improved\nin a flood hazard area shall be elevated such that the lowest floor of the manufactured\nhome is elevated to a minimum of two feet above the design flood elevation. Elevation\ncertification required by Section 25-12-53(D) (Flood hazard documentation) shall be submitted to the building official.\n\n(b)\n\nThe bottom of the frame of new and replacement manufactured homes on foundations that\nconform to the requirements of Section 25-12-53(C)(1) (Elevation Requirements), as applicable, shall be elevated to or above the elevations specified in Section 25-12-53(C)(1) (Elevation Requirements). The anchor and tie-down requirements of the applicable state or federal requirements\nshall apply. The foundation and anchorage of manufactured homes to be located in identified\nfloodways shall be designed and constructed in accordance with ASCE 24.\n\n(2)\n\nFoundations. All new and replacement manufactured homes, including substantial improvement of\nexisting manufactured homes, shall be placed on a permanent, reinforced foundation\nthat is designed in accordance with Section 25-12-53 (Flood Loads).\n\n(3)\n\nAnchoring. All new and replacement manufactured homes to be placed or substantially improved\nin a flood hazard area shall be installed using methods and practices which minimize\nflood damage. Manufactured homes shall be securely anchored to an adequately anchored\nfoundation system to resist flotation, collapse and lateral movement. Methods of anchoring\nare authorized to include, but are not limited to, use of over-the-top or frame ties\nto ground anchors. This requirement is in addition to applicable state and local anchoring\nrequirements for resisting wind forces.\n\n(4)\n\nProtection of mechanical equipment and outside appliances. Mechanical equipment and outside appliances shall be elevated a minimum of two foot\nabove the design flood elevation to or above the design flood elevation.\n\nException: Where such equipment and appliances are designed and installed to prevent water from\nentering or accumulating within their components and the systems are constructed to\nresist hydrostatic and hydrodynamic loads and stresses, including the effects of buoyancy,\nduring the occurrence of flooding up to the elevation required by Section 25-12-53(C)(1) (Elevation Requirements), the systems and equipment shall be permitted to be located below the elevation\nrequired by 25-12-53(C)(1) (Elevation Requirements). Electrical wiring systems shall be permitted below the design flood elevation provided\nthey conform to the provisions of NFPA 70.\n\n(5)\n\nEnclosures. Fully enclosed areas below elevated manufactured homes shall comply with the requirements\nof 25-12-53(C) (Design and Construction).\n\n(J)\n\nRecreational Vehicles.\n\n(1)\n\nPlacement prohibited. The placement of recreational vehicles shall not be authorized in floodways.\n\n(2)\n\nTemporary placement. Recreational vehicles in flood hazard areas shall be fully licensed and ready for\nhighway use; and shall be placed on a site for less than 180 consecutive days.\n\n(3)\n\nPermanent placement. Recreational vehicles that are not fully licensed and ready for highway use, or that\nare to be placed on a site for more than 180 consecutive days, shall meet the requirements\nof Subsection (I) (Manufactured Homes) for manufactured homes.\n\n(K)\n\nTanks. Underground and above-ground tanks shall be designed, constructed, installed and\nanchored in accordance with ASCE 24.\n\n(L)\n\nFoundation design and construction. This subsection applies to a building or structure subject to Article 11 (Residential Code).\n\n(1)\n\nA foundation wall in a building or structure erected in a flood hazard area shall\nmeet the requirements in Residential Code, Chapter 4 (Foundations).\n\nExceptions: Unless designed consistent with Residential Code, Section R404 (Foundation and Retaining Walls):\n\n(a)\n\nthe unsupported height of a 6-inch (152 mm) plain masonry wall shall not exceed 3\nfeet (914 mm);\n\n(b)\n\nthe unsupported height of an 8-inch (203 mm) plain masonry wall shall not exceed 4\nfeet (1219 mm); and\n\n(c)\n\nthe unsupported height of an 8-inch (203 mm) reinforced masonry wall shall not exceed\n8 feet (2438 mm).\n\n(2)\n\nFor purposes of the exception in subsection (1), unsupported height is measured from\nthe finished grade of the under-floor space to the top of the wall.\n\n(Ord. No. 20210603-059, Pt. 4, 9-1-21)\n\n(A)\n\nA person who violates this article commits a separate offense for each day the violation\ncontinues.\n\n(B)\n\nA person who fails to comply with a permit or variance granted pursuant to this article\ncommits a separate offense for each day the violation continues.\n\n(C)\n\nA person who violates this article or fails to comply with a permit or a variance\ngranted pursuant to this article commits a misdemeanor punishable as set forth in",
  "start_line": 67037,
  "end_line": 69384,
  "subsections": [
    "25-2-781-A",
    "25-2-781-B",
    "25-2-781-C",
    "25-2-781-D",
    "25-2-781-E",
    "25-2-781-F",
    "25-2-781-A",
    "25-2-781-B",
    "25-2-781-C",
    "25-2-781-D",
    "25-2-781-E",
    "25-2-781-F",
    "25-2-781-G",
    "25-2-781-H",
    "25-2-781-A",
    "25-2-781-B",
    "25-2-781-A",
    "25-2-781-B",
    "25-2-781-A",
    "25-2-781-B",
    "25-2-781-C",
    "25-2-781-A",
    "25-2-781-B",
    "25-2-781-A",
    "25-2-781-B",
    "25-2-781-C",
    "25-2-781-D",
    "25-2-781-A",
    "25-2-781-B",
    "25-2-781-C",
    "25-2-781-D",
    "25-2-781-E",
    "25-2-781-F",
    "25-2-781-G",
    "25-2-781-H",
    "25-2-781-I",
    "25-2-781-J",
    "25-2-781-K",
    "25-2-781-L",
    "25-2-781-A",
    "25-2-781-B",
    "25-2-781-C"
  ]
}