{
  "id": "25-2-893",
  "title": "ACCESSORY USES FOR A PRINCIPAL RESIDENTIAL USE",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "all other applicable regulations of Article 13 (Docks, Bulkheads, and Shoreline Access) and Section 25-2-893 (Accessory Uses for a Principal Residential Use);\n\n(6)\n\nno increase is allowed to:\n\n(a)\n\nthe number of walls;\n\n(b)\n\nthe height, width or depth; or\n\n(c)\n\nthe number of slips or mooring capacity; and\n\n(7)\n\nfor a dock, bulkhead, or shoreline access constructed after January 1, 1984, the applicant\nmust provide evidence of a prior permit authorizing the construction; and\n\n(8)\n\nfor a dock, bulkhead, or shoreline access constructed prior to January 1, 1984, no\nunpermitted additions or alterations that occurred after January 1, 1984 are allowed.\n\n(E)\n\nA person may increase the height of a building that is a noncomplying structure based\non a height requirement of this title if:\n\n(1)\n\nthe increase is made to a portion of the building that:\n\n(a)\n\ndoes not exceed the existing maximum height of the building; and\n\n(b)\n\ncomplies with the yard setback requirements of this title;\n\n(2)\n\nthe increase does not exceed 15 percent of the existing maximum height of the building;\nand\n\n(3)\n\nafter modification, the height of the modified portion of the building does not exceed\nthe existing maximum height of the building.\n\n(F)\n\nA person may modify a building that is a noncomplying structure based on a yard setback\nrequirement of this title if:\n\n(1)\n\nthe modified portion of the building:\n\n(a)\n\ndoes not extend further into the required yard setback than the existing noncomplying\nportion of the building, except for a vertical change in finished floor elevation\nallowed under Subsection (B)(2) of this section;\n\n(b)\n\nunless located in a street side yard, is not greater in height than the existing noncomplying\nportion of the building, except for a vertical change in finished floor elevation\nallowed under Subsection (B)(2) of this section; and\n\n(c)\n\ncomplies with the height requirements of this title; and\n\n(2)\n\nthe additional length of a modified portion of the building does not exceed the lesser\nof 50 percent of the length of the noncomplying portion of the building or 25 feet\nmeasured from the existing building and parallel to the lot line.\n\n(G)\n\nSubsection (F) applies to each yard setback requirement with which the existing building\ndoes not comply.\n\n(H)\n\nA person may modify a noncomplying building once under Subsection (E) and once under\nSubsection (F). This section does not prohibit a person from modifying a building\nalong more than one yard setback as part of a single project.\n\nSource: Sections 13-2-820 and 13-2-823; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-043;\nOrd. 20060309-058; Ord. 20060622-022; Ord. 20060928-022; Ord. 20100624-149; Ord. 20101209-075;\nOrd. No. 20140626-113, Pt. 4, 7-7-14.\n\n(A)\n\nA person may restore a noncomplying structure that is damaged or destroyed by fire,\nexplosion, flood, tornado, riot, act of the public enemy, or accident of any kind\nif the restoration begins not later than 12 months after the date the damage or destruction\noccurs.\n\n(B)\n\nExcept as provided in Section 25-2-963 (Modification and Maintenance of Noncomplying Structures):\n\n(1)\n\na structure restored under this section is limited to the same building footprint,\ngross floor area, and interior volume as the damaged or destroyed structure; and\n\n(2)\n\na noncomplying portion of the structure may be restored only in the same location\nand to the same degree of noncompliance as the damaged or destroyed structure.\n\n(C)\n\nThis section does not apply to loss of land resulting from wave action behind a bulkhead\non Lake Austin.\n\nSource: Section 13-2-821; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-043; Ord.\n20060309-058; Ord. 20060622-022; Ord. 20060928-022; Ord. No. 20140626-113, Pt. 5, 7-7-14.\n\n### ARTICLE 9. - LANDSCAPING.\n\n(A)\n\nExcept as provided in Subsection (B), this article applies in the city's zoning jurisdiction.\n\n(B)\n\nDivision 2 (Requirements for a Site Plan) and Division 3 (Additional Site Plan Requirements in Hill Country Roadway Corridors) do not apply to:\n\n(1)\n\nproperty zoned central business district (CBD) or downtown mixed use district (DMU);\n\n(2)\n\na lot containing one single-family residence;\n\n(3)\n\na lot containing one duplex residence, unless the residence exceeds 4,000 square feet\nof gross floor area or has more than six bedrooms;\n\n(4)\n\na two-unit residential use;\n\n(5)\n\na secondary apartment special use;\n\n(6)\n\na small lot single-family residential use on property zoned single-family residence\nlarge lot (SF-1) district, single family residence standard lot (SF-2) district, or\nfamily residence (SF-3) district;\n\n(7)\n\nsubstantial restoration of a building within one year after the building is damaged;\n\n(8)\n\nrestoration of a building designated as a historic landmark; or\n\n(9)\n\ninterior or façade remodeling, if the front and side exterior walls of the building\nremain in the same location.\n\n(C)\n\nDeveloped property, or property with an approved site plan, that is affected by right-of-way\ncondemnation may be developed without compliance with this article, as provided by\nthis subsection.\n\n(1)\n\nAfter condemnation, improvements shown on the remainder of an approved site plan may\nbe constructed, and only the landscaping on the remainder of the approved site plan\nis required.\n\n(2)\n\nImprovements on developed properties that are lost through condemnation may be replaced.\nOnly the area within the limits of construction for the replaced improvements must\ncomply with this article, except an owner is not required to provide more landscaping\nthan was in existence before the condemnation.\n\nSource: Sections 13-7-56(a), (c), and (e), and 13-7-66(e); Ord. 990225-70; Ord. 000831-65;\nOrd. 030605-49; Ord. 031211-11; Ord. 041202-16; Ord. 20090618-077; Ord. No. 20240516-006, Pt. 6, 5-27-24.\n\n(A)\n\nExcept as provided by Subsection (B), if this article conflicts with other provisions\nof this title, this article prevails.\n\n(B)\n\nIf this article conflicts with a provision of Chapter 25-6 (Transportation), Chapter 25-7 (Drainage), Chapter 25-8 (Environment), or another provision of this chapter, those provisions prevail.\n\nSource: Section 13-7-56(d); Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nThe Watershed Protection and Development Review Department shall inspect each site\nto ensure compliance with this article. Before the Watershed Protection and Development\nReview Department may conduct a final landscape inspection, it must receive a letter,\nunder seal, from a licensed professional engineer, architect, or landscape architect,\nstating that the project has been implemented in accordance with the approved plan.\n\n(B)\n\nThe requirements for an automatic irrigation system under the Environmental Criteria\nManual shall be noted on the development permit by the authority issuing the permit,\nand must be implemented by the owner before the final landscape inspection.\n\nSource: Sections 13-7-58(c) and 13-7-62(e); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nThis section applies to an owner who is responsible for property for which a site\nplan has been approved by the City.\n\n(B)\n\nAn owner shall maintain required landscaped areas in accordance with the site plan\nand in healthy condition, free from diseases, pests, weeds, and litter, in accordance\nwith generally accepted horticultural practice.\n\n(C)\n\nAn owner who receives notification from the Watershed Protection and Development Review\nDepartment that plants on a site are dead, diseased, or severely damaged:\n\n(1)\n\nshall remove the plants not later than the 60th day after notification; and\n\n(2)\n\nreplace the plants within six months after notification, or by the next planting season,\nwhichever comes first.\n\n(D)\n\nAn owner required to replace plants under Subsection (B) must use replacement plants\nthat are the same size and species as shown on the approved site plan or must be of\nequivalent quality and size. The replacement of plants under this section is not an\namendment to the approved plan.\n\nSource: Section 13-7-63,(a), (c), and (d); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nA site plan must comply with the requirements of this article.\n\n(B)\n\nThe Land Use Commission or the Watershed Protection and Development Review Department\nmay approve a site plan that proposes an alternative to compliance with this article\nif the Land Use Commission or the Watershed Protection and Development Review Department\ndetermines that the site plan adequately achieves, or is an improvement on, the intent\nof the landscaping requirements in this article.\n\n(C)\n\nIn considering an alternative plan under Subsection (B), the Land Use Commission or\nthe Watershed Protection and Development Review Department shall give special consideration\nto the preservation of large existing native trees.\n\nSource: Section 13-7-56(b), 13-7-58(a) and (b), 13-7-65; Ord. 990225-70; Ord. 010329-18;\nOrd. 010607-8; Ord. 031211-11; Ord. 20101216-097.\n\nBefore the City may approve a site plan, an applicant must post fiscal security to\nensure that the applicant installs landscaping and irrigation systems in compliance\nwith the Environmental Criteria Manual.\n\nSource: Section 13-7-59; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this article, landscape yard means the area of a lot between the street right-of-way\nand a line that coincides with the front wall of the building and extends from the\nbuilding corners to the side property lines.\n\n(B)\n\nAt least 20 percent of the area of the landscape yard of a lot must be landscaped\narea.\n\n(C)\n\nEach square foot of permeable landscaped area under the canopy of a tree that has\na trunk diameter of at least two inches, counts as one and one-fourth square feet\nof landscaped area for calculating compliance with Subsection (A). This credit applies\nonly if:\n\n(1)\n\nat least 50 percent of the area under the canopy of the tree is permeable; and\n\n(2)\n\nthe provisions of the Environmental Criteria Manual are met.\n\n(D)\n\nA required landscaped area may include planters, brick, stone, natural forms, water\nforms, aggregate, and other landscape features, if inorganic materials do not predominate\nover the plants. Smooth concrete or asphalt may not be included in a required landscaped\narea.\n\n(E)\n\nFor a capital improvement project involving right-of-way, landscaping may not be installed\nuntil construction is finished.\n\nSource: Sections 13-7-61(a), (c), (h)(4), and (j), and 13-7-64; Ord. 990225-70; Ord.\n031211-11.\n\n(A)\n\nA required landscaped area, or a plant, that is adjacent to pavement must be protected\nwith a concrete curb or an equivalent barrier.\n\n(B)\n\nA site plan must show how conditions adequate to sustain healthy plant growth will\nbe achieved.\n\nSource: Sections 13-7-61(f), (I); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this article, the diameter of a tree trunk is measured at a height of 4½ feet above\nthe ground, except as otherwise provided.\n\n(B)\n\nIn this section:\n\n(1)\n\na tree must be at least 6 feet in height and have a trunk diameter of one and one\nhalf inches measured 6 inches above the ground at the time it is counted; and\n\n(2)\n\na tree that has a trunk diameter of at least eight inches, or a tree that has a trunk\ndiameter of at least six inches and a height of at least 15 feet, is counted as two\ntrees.\n\n(C)\n\nA landscape yard that measures less than 10,000 square feet in area must contain at\nleast one tree for each 1,000 square feet, or fraction thereof.\n\n(D)\n\nA landscape yard that measures 10,000 or more square feet, but less than 110,000 square\nfeet, must contain at least ten trees, plus at least one additional tree for each\n2,500 square feet, or fraction thereof, over 10,000 square feet.\n\n(E)\n\nA landscape yard that measures 110,000 or more square feet must contain at least 50\ntrees, plus at least one additional tree for each 5,000 square feet, or fraction thereof,\nover 110,000.\n\n(F)\n\nA newly planted tree must be located in a landscaped area that is at least eight feet\nwide.\n\nSource: 13-7-61 (b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe following features must be at least partially and periodically obscured from view\nfrom the street by landscaping, or by the use of landscaping along with berms, walls,\nor decorative fences:\n\n(1)\n\na water quality control facility under Chapter 25-8, Subchapter A (Water Quality);\n\n(2)\n\na stormwater drainage facility under Chapter 25-7 (Drainage); and\n\n(3)\n\nan area where motor vehicles are moved, loaded, parked, or stored.\n\n(B)\n\nPlants may not obstruct the view between the street and a driveway.\n\n(C)\n\nThe Environmental Criteria Manual shall prescribe standards for screening in accordance\nwith this subsection.\n\n(1)\n\nFor a townhouse, condominium, multiple family, group, or mobile home residential use,\nscreening is required at a property line that adjoins a residential district in which\nthe use is not a permitted use.\n\n(2)\n\nFor a commercial or industrial use, screening is required at a property line that\nadjoins a residential district.\n\n(3)\n\nFor a civic use, screening is required at a property line that adjoins a more restrictive\ndistrict in which the use is not permitted.\n\nSource: Sections 13-7-61 (d), (e), and (g), 13-7-67(a); Ord. 990225-70; Ord. 000309-39;\nOrd. 031211-11.\n\n(A)\n\nFor each 12 parking spaces in a parking lot that is in a landscape yard, a minimum\nof 90 square feet of landscaped area are required within the parking lot.\n\n(B)\n\nFor each 12 parking spaces in a parking lot that is not in a landscape yard, a minimum\nof 60 square feet of landscaped area are required within the parking lot.\n\n(C)\n\nA parking lot must have end islands landscaped with trees in accordance with the Environmental\nCriteria Manual.\n\n(D)\n\nExcept as provided in Subsection (E), a parking space may not be located more than\n50 feet from a landscaped area, or more than 50 feet from a tree.\n\n(E)\n\nIn a parking lot that has more than three distinct modules for the parking of vehicles:\n\n(1)\n\na landscaped median at least 10 feet wide and at least the length of the parking module\nis required for every second parking module for the parking of vehicles;\n\n(2)\n\na tree must be located within 25 feet of each parking space adjacent to a median;\nand\n\n(3)\n\nend islands with trees are required.\n\n(F)\n\nA landscaped area that is required by this section:\n\n(1)\n\nmay consist of non-contiguous portions, and may be in the form of features commonly\nreferred to as medians, peninsulas, and islands;\n\n(2)\n\nmust be evenly distributed throughout a parking lot, except that the distribution\nand location of landscaped area may accommodate existing trees or other natural features\nif the total area requirement is satisfied;\n\n(3)\n\nmay count toward compliance with Section 25-2-1003(A) (General Requirements); and\n\n(4)\n\nmust consider an edge-of-pavement treatment that allows overland flow of stormwater\nrunoff across the landscape area except:\n\n(a)\n\nperimeter landscape areas that are not required to drain to a stormwater control measure;\n\n(b)\n\nimpervious areas on which the land use or activity may generate highly contaminated\nrunoff, as prescribed by the Environmental Criteria Manual; and\n\n(c)\n\nsites located within the Edwards Aquifer recharge zone.\n\nSource: Section 13-7-61(e) - (g); Ord. 990225-70; Ord. 031211-11; Ord. 20090618-076;\nOrd. No. 20221027-045, Pt. 1, 11-7-22.\n\n(A)\n\nNo permanent irrigation is required for all or a portion of a required landscaped\narea that consists of:\n\n(1)\n\nundisturbed natural area; or\n\n(2)\n\nundisturbed existing trees;\n\n(B)\n\nSupplemental irrigation using irrigation methods described in Subsection (C) is required:\n\n(1)\n\nfor the first two growing seasons for all or a portion of a newly planted required\nlandscaped area without permanent irrigation;\n\n(2)\n\npermanently for all newly planted trees in a required landscape area; and\n\n(3)\n\nas prescribed by rule for all newly planted required landscaping located in medians,\nislands, or peninsulas.\n\n(C)\n\nIrrigation required under Subsection (B) may be provided only by one or more of the\nmethods described below:\n\n(1)\n\nan automatic irrigation system;\n\n(2)\n\na hose attachment, if:\n\n(a)\n\nthe hose attachment is within 100 feet of the landscaped area or plant; and\n\n(b)\n\nthere is not a road or parking pavement between the hose attachment and the landscaped\narea or plan; or\n\n(3)\n\na temporary, above ground automatic irrigation system, if the system complies with\nthe water conservation requirements in the Environmental Criteria Manual.\n\n(D)\n\nAn irrigation method must:\n\n(1)\n\nprovide a moisture level adequate to sustain growth of the plant materials on a permanent\nbasis;\n\n(2)\n\nunless fiscal security is provided to the City for the installation of the system,\nbe operational at the time of the final landscape inspection; and\n\n(3)\n\nbe maintained and kept operational.\n\n(E)\n\nA site plan must show:\n\n(1)\n\nthe drainage area(s) used to irrigate under Subsection (B), including notation of\nthe land uses on impervious areas within the drainage area(s);\n\n(2)\n\nthe nature and location of an irrigation system; and\n\n(3)\n\nthat there is no disturbance to the critical root zone of an existing tree.\n\n(F)\n\nThe director may grant an administrative variance to the requirements in this section.\nAn applicant for a variance must demonstrate that:\n\n(1)\n\nstrict compliance with this section is infeasible due to unique site conditions including\nbut not limited to topography, size, shape, and location of existing features such\nas trees or previous development; and\n\n(2)\n\nthe proposed irrigation plan is the minimal departure from the requirements of this\nsection.\n\nSource: Section 13-7-62; Ord. 990225-70; Ord. 031211-11; Ord. 20101216-097; Ord. No. 20221027-045, Pt. 2, 11-7-22.\n\nThe requirements of this division are cumulative, and apply to a site in a Hill Country\nroadway corridor described in Section 25-2-1103 (Hill Country Roadway Corridors Identified).\n\nSource: Section 13-7-66; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this section:\n\n(1)\n\nNATIVE TREE means live oak, Spanish oak, cedar elm, shin oak, bald cypress, post oak,\npecan, bur oak, or black walnut.\n\n(2)\n\nSMALL NATIVE TREE means Texas madrone, black cherry, Texas mountain laurel, evergreen\nsumac, Mexican buckeye, flameleaf sumac, or Texas persimmon.\n\n(B)\n\nA site plan must provide a sufficient number of native or small native trees to reasonably\ncompensate for the removal of:\n\n(1)\n\neach small native tree;\n\n(2)\n\neach native tree with a trunk diameter greater than six inches; and\n\n(3)\n\neach cluster of three or more native trees located within ten feet of each other with\ntrunk diameters greater than two inches.\n\nSource: Section 13-7-66(a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as otherwise provided by this section, vegetation within 100 feet of the dedicated\nright-of-way may not be cleared, unless the clearing is necessary to provide utilities\nand access to the site.\n\n(B)\n\nExcept as otherwise provided by Subsection (D), in the roadway corridor along the\nSouthwest Parkway:\n\n(1)\n\nvegetation within 50 feet of the dedicated right-of-way or drainage easement may not\nbe cleared, unless the clearing is necessary to provide utilities and access to the\nsite; and\n\n(2)\n\na building must be at least 75 feet from the dedicated right-of-way or drainage easement.\n\n(C)\n\nThe council may, after a public hearing, waive the requirements of Subsection (B)\nfor a site if the owner dedicated the right-of-way or a drainage easement to the public\nat no cost.\n\n(D)\n\nExcept as otherwise provided in Subsection (E), in a roadway corridor along a parkway\nidentified in the Transportation Plan, other than Southwest Parkway:\n\n(1)\n\nvegetation within 25 feet of the dedicated right-of-way or drainage easement may not\nbe cleared, unless the clearing is necessary to provide utilities and access to the\nsite; and\n\n(2)\n\na building must be at least 50 feet from the dedicated right-of-way or drainage easement.\n\n(E)\n\nAn area described in this section in which clearing is prohibited may not exceed 20\npercent of the acreage of an applicant's property.\n\nSource: Sections 13-7-66(b)(2) and (3) and 13-2-781(d); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf vegetation in an area in which clearing is prohibited by Section 25-2-1023 (Roadway Vegetative Buffer) has been substantially disturbed, it must be revegetated with native trees, shrubs,\nand grasses.\n\n(B)\n\nNot more than 50 percent of the area in which clearing is prohibited may be used for\ndetention or sedimentation ponds or wastewater drain fields.\n\nSource: Section 13-7-66(b)(1); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAt least 40 percent of a site, excluding dedicated right-of-way, must be left in a\nnatural state. Natural areas within parking medians and in an area in which clearing\nis prohibited by Section 25-2-1023 (Roadway Vegetative Buffer) count toward this requirement.\n\n(B)\n\nIn complying with this section, priority must be given to the protection of natural\ncritical areas identified in the City's Comprehensive Plan.\n\n(C)\n\nIf this section conflicts with another provision of this title, the conflict must\nbe resolved with the minimum departure from the requirement of this section. The resolution\nmust receive approval from the council. The council must receive a recommendation\nfrom the Land Use Commission.\n\n(D)\n\nIf an area required to be kept in a natural state by this section is revegetated,\nnot more than 25 percent of the area may be used for sewage disposal fields.\n\nSource: Section 13-7-66(c); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nA parking lot must have a median at least ten feet wide containing existing native\ntrees or dense massing of installed trees between each distinct parking area.\n\nSource: 13-7-66(d); Ord. 990225-70; Ord. 031211-11.\n\nVisual screening required by this article must:\n\n(1)\n\nuse existing vegetation or installed landscaping;\n\n(2)\n\ninclude dense massing of trees, native understory vegetation, shrub massing, or berms;\nand\n\n(3)\n\nallow for topographic changes.\n\nSource: Section 13-7-67(b); Ord. 990225-70; Ord. 031211-11.\n\nThe requirements of this division apply to a lot in a residential subdivision in the\ncity's zoning jurisdiction. This division does not authorize removal of trees.\n\nSource: Ord. 20090618-077.\n\n(A)\n\nEach single family lot in a residential subdivision shall contain:\n\n(1)\n\nat least two trees of at least two different species listed in the Environmental Criteria\nManual, Appendix F (Descriptive Categories of Tree Species) if the lot is in a single family residence small lot (SF4a) zoning district;\n\n(2)\n\nat least three trees of at least two different species listed in the Environmental\nCriteria Manual, Appendix F (Descriptive Categories of Tree Species) if the lot is in any zoning district other than SF4a.\n\n(B)\n\nTrees required under this section must be planted or preserved in accordance with\nthis division and the Environmental Criteria Manual.\n\nSource: Ord. 20090618-077.\n\n(A)\n\nA tree planted under this division shall:\n\n(1)\n\nbe suitable, as defined in the Environmental Criteria Manual;\n\n(2)\n\nmeet the spacing and location requirements in the Environmental Criteria Manual; and\n\n(3)\n\nbe maintained in accordance with the Environmental Criteria Manual.\n\n(B)\n\nThe size of a tree planted under this division shall be:\n\n(1)\n\nat least two inches in diameter measured six inches above root flare; or\n\n(2)\n\nif an understory tree, at least one inch in diameter measured six inches above root\nflare.\n\nSource: Ord. 20090618-077.\n\n(A)\n\nA tree required under this division may be satisfied by preserving an existing tree\non the lot.\n\n(B)\n\nThe city arborist may adjust the requirements in section 25-2-1032 (Trees Required) based on preservation of:\n\n(1)\n\nan existing tree of a species listed in the Environmental Criteria Manual, Appendix\nF (Descriptive Categories of Tree Species); or\n\n(2)\n\na protected tree or heritage tree as defined in section 25-8-602 (Definitions).\n\n(C)\n\nTo satisfy the tree requirement through preservation, the applicant must demonstrate,\nto the satisfaction of the city arborist, that the tree has not been damaged in a\nmanner that could jeopardize its long-term survival.\n\n(D)\n\nA tree preserved under this division shall\n\n(1)\n\nmeet the spacing and location requirements in the Environmental Criteria Manual; and\n\n(2)\n\nbe maintained in accordance with the Environmental Criteria Manual.\n\n(E)\n\nThe size of a tree preserved under this division shall be at least two inches in diameter\nmeasured four and a half feet above natural grade.\n\nSource: Ord. 20090618-077.\n\nA tree required under this division may be satisfied by preserving or planting a tree\noff-site, only if the Watershed Protection and Development Review Department director\ndetermines that:\n\n(1)\n\ndue to special circumstances unique to a property, preserving or planting three trees\non a particular single family lot is not feasible;\n\n(2)\n\nthe proposed off-site tree will adequately achieve, or be an improvement on, the intent\nof this division; and\n\n(3)\n\nthe proposed off-site tree will meet the requirements of section 25-2-1033 or 25-2-1034 and will be preserved or planted in the subdivision within which the particular single\nfamily lot is located.\n\nSource: Ord. 20090618-077.\n\n### ARTICLE 10. - COMPATIBILITY STANDARDS.\n\nFootnotes:\n\n--- (**3**) ---\n\n**Editor's note—**\nOrd. No. 20240516-004, Pt. 1, effective July 15, 2024, repealed the former Art. 10, §§ 25-2-1051, 25-2-1052,\n25-2-1061—25-2-1068, 25-2-1081, 25-2-1082, and enacted a new Art. 10 as set out herein.\nThe former Art. 10 pertained to similar subject matter and derived from Sections 13-2-25(2),\n13-2-731, 13-2-733—13-2-739; Ord. 990225-70; Ord. 000309-39; Ord. 000406-81; Ord.\n010329-18; Ord. 010607-8; Ord. 031211-11; Ord. 041202-16; Ord. 20050519-008; Ord.\n20060216-043; Ord. 20060309-058; Ord. 20060504-039; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20061130-064; Ord. 20080618-093; Ord. 20090212-070; Ord. 20101209-075; Ord. 20131017-046;\nOrd. No. 20160922-080, Pt. 1, 10-3-16; Ord. No. 20231019-052, Pt. 9, 10-30-23; Ord. No. 20231102-028, Pt. 22, 11-13-23.\n\nExcept as provided in Section 25-2-1052 (Exceptions) or another specific provision of this title, this article applies to a site that\nis:\n\n(1)\n\nzoned multi-family residence moderate-high density (MF-4) district or less restrictive\ndistrict; and\n\n(2)\n\nlocated within 75 feet of a triggering property.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\nThis article does not apply to:\n\n(1)\n\na structural alteration that does not increase the square footage, area, or height\nof a building;\n\n(2)\n\na site zoned central business district (CBD) or downtown mixed-use (DMU); or\n\n(3)\n\na site that is used for:\n\n(a)\n\nduplex use;\n\n(b)\n\nsingle-family attached residential use;\n\n(c)\n\nsingle-family residential use;\n\n(d)\n\nsmall lot single-family residential use;\n\n(e)\n\ntwo-unit residential use;\n\n(f)\n\nthree-unit residential use;\n\n(g)\n\nadult care services use (limited or general); or\n\n(h)\n\nchild care services use (limited or general).\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\nA triggering property is a site:\n\n(1)\n\nwith at least one dwelling unit but less than four dwelling units; and\n\n(2)\n\nzoned urban family residence (SF-5) district or more restrictive.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\n(A)\n\nExcept as provided in Subsection (B), council may grant site-specific amendments to\nheight and compatibility buffers if council determines that an amendment is appropriate\nand will not harm the surrounding area.\n\n(B)\n\nA site is not eligible for a site-specific amendment if the site is:\n\n(1)\n\nzoned:\n\n(a)\n\na special purpose base zoning district;\n\n(b)\n\ndensity bonus (DB) combining district; or\n\n(2)\n\nsubject to the university neighborhood overlay (UNO).\n\n(C)\n\nA site-specific amendment to this article is considered a rezoning of property and\nis subject to the same requirements and procedures established for a rezoning application\nthat changes the base district classification of a property.\n\n(D)\n\nA site-specific amendment may be initiated by:\n\n(1)\n\ncouncil;\n\n(2)\n\nthe Land Use Commission; or\n\n(3)\n\nthe record owner.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\n(A)\n\nIn this section, structure means a portion of a structure.\n\n(B)\n\nAny structure that is located 75 or more feet from any part of a triggering property\nshall comply with the height limits established by the site's zoning ordinance.\n\n(C)\n\nExcept as provided by a site-specific amendment to this section, any structure that\nis located:\n\n(1)\n\nat least 50 feet but less than 75 feet from any part of a triggering property may\nnot exceed 60 feet; and\n\n(2)\n\nless than 50 feet from any part of a triggering property may not exceed 40 feet.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\n(A)\n\nThis section does not apply to:\n\n(1)\n\ncondominium residential use; or\n\n(2)\n\ntownhouse residential use.\n\n(B)\n\nCompatibility Buffers.\n\n(1)\n\nExcept as provided in Subdivision (B)(2), a compatibility buffer is required along\na site's property line that is shared with a triggering property.\n\n(2)\n\nA compatibility buffer is not required if:\n\n(a)\n\nthe site includes only residential uses and the number of dwelling units is 16 or\nfewer dwelling units; or\n\n(b)\n\nthe site's zoning ordinance establishes a maximum height of 40 feet or less and the\nsite is zoned:\n\n(i)\n\nneighborhood office (NO) district;\n\n(ii)\n\nlimited office (LO) district; or\n\n(iii)\n\nneighborhood commercial (LR) district.\n\n(3)\n\nExcept as provided in Subdivision (B)(5), the minimum width of a compatibility buffer\nis 25 feet.\n\n(4)\n\nA compatibility buffer must comply with Section 25-8-700 (Minimum Requirements for Compatibility Buffers).\n\n(5)\n\nThe minimum width of a compatibility buffer is 15 feet for a site that is less than\n75 feet wide when measured from site's property line that is shared with a triggering\nproperty.\n\n(C)\n\nSetbacks.\n\n(1)\n\nThis subsection applies to a site's property line that is shared with a triggering\nproperty.\n\n(2)\n\nThe minimum rear yard setback is 10 feet if the site is zoned:\n\n(a)\n\nneighborhood office (NO) district;\n\n(b)\n\nlimited office (LO) district; or\n\n(c)\n\nneighborhood commercial (LR) district.\n\n(3)\n\nThe minimum interior side-yard setback is five feet if the site is zoned neighborhood\ncommercial (LR) district.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\n(A)\n\nExterior lighting must be hooded or shielded so that the light source is not visible\nfrom the site's property line or alleyway that is shared with a triggering property.\n\n(B)\n\nMechanical equipment may not produce sound in excess of 70 decibels measured at the\nsite's property line or alleyway that is shared with a triggering property.\n\n(C)\n\nA concrete slab used for a refuse receptacle may not be placed within 15 feet of triggering\nproperty.\n\n(D)\n\nExcept for a multi-use trail, an on-site amenity that is available only to residents\nand occupants of the site and their guests may not be located within 25 feet of a\ntriggering property.\n\n(E)\n\nScreening Requirements. Except when visible from or through a pedestrian or bicycle\naccess point, the following objects shall be screened and may not be visible at the\nsite's property line or alleyway that is shared with a triggering property:\n\n(1)\n\nvehicle lights from vehicles that use or are parked on a parking lot or in a parking\nstructure located on the site;\n\n(2)\n\nground floor and rooftop mechanical equipment;\n\n(3)\n\noutdoor storage;\n\n(4)\n\nrefuse receptacles and collection areas; and\n\n(5)\n\ncommon areas for amenities, including outdoor decks, patios, and pools.\n\n(F)\n\nThe screening required in Subsection (E) may not impede pedestrian or bicycle access\npoints.\n\n(G)\n\nRooftop mechanical equipment may be screened by a parapet.\n\nSource: Ord. No. 20240516-004, Pt. 1, 7-15-24.\n\n### ARTICLE 11. - HILL COUNTRY ROADWAY REQUIREMENTS.\n\nIn this article:\n\nSCENIC VISTA means a generally recognizable, noteworthy view of:\n\n(1)\n\nBarton Creek;\n\n(2)\n\nBull Creek;\n\n(3)\n\nWest Bull Creek;\n\n(4)\n\nLake Austin;\n\n(5)\n\nLake Travis;\n\n(6)\n\na valley of the Colorado River; or\n\n(7)\n\nthe downtown area of Austin.\n\nSource: Section 13-2-783(b)(1); Ord. 990225-70; Ord. 031211-11.\n\nExcept as provided in Section 25-2-1104 (Exceptions), this article applies to development on a site in a hill country roadway corridor.\n\nSource: Section 13-2-782 ; Ord. 990225-70; Ord. 031211-11.\n\nA hill country roadway corridor is the land within the City's zoning jurisdiction\nlocated 1,000 feet or less from each side of the right-of-way of the following roadways:\n\n(1)\n\nLoop 360, from US 290 West to US 183;\n\n(2)\n\nRM 620, from SH 71 to Anderson Mill Road;\n\n(3)\n\nRM 2222, from Highland Hills Drive to RM 620;\n\n(4)\n\nRM 2244, from Loop 360 to SH 71; and\n\n(5)\n\nSouthwest Parkway.\n\nSource: Section 13-2-1; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis article does not apply to development that occurs 1,000 feet or less from the\ndedicated right-of-way of:\n\n(1)\n\nUS 183; or\n\n(2)\n\nUS 290 West.\n\n(B)\n\nThis article does not apply to development that complies with a site plan approved\nby council before January 27, 1986 or to a modification of the approved site plan\nif a zoning change was approved to allow the modification.\n\n(C)\n\nThis article does not apply to development that complies with a site plan for which\na development permit was issued by the City before January 27, 1986.\n\n(D)\n\nThis article does not apply to development that complies with a site plan that was\nsubmitted for approval before May 23, 1985, or that was recommended for approval by\nthe Planning Commission before November 6, 1985. The development must comply with\nCity requirements in effect on the date the site plan was submitted for approval.\n\n(E)\n\nThis article does not apply to development that complies with a planned development\narea agreement approved by the council before January 26, 1986.\n\nSource: Section 13-2-781(a), (b), (c), (e) and (f); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nSubject to Subsection (B), the Land Use Commission may approve the waiver of a provision\nin this article if the person applying for the waiver demonstrates that:\n\n(1)\n\nthe provision imposes an undue hardship on a development because of the location,\ntopography, or peculiar configuration of the tract; or\n\n(2)\n\na proposed development incorporates the use of highly innovative architectural, site\nplanning, or land use technique; and\n\n(3)\n\nif the waiver is approved, a proposed development will equal or exceed a development\nthat is in compliance with this article in terms of:\n\n(a)\n\nenvironmental protection;\n\n(b)\n\naesthetic enhancement;\n\n(c)\n\nland use compatibility; and\n\n(d)\n\ntraffic considerations.\n\n(B)\n\nThe Land Use Commission may waive a provision only to the extent necessary to allow\nthe development to occur.\n\n(C)\n\nThe approval or disapproval of a waiver by the Land Use Commission under this section\nmay be appealed to the council.\n\nSource: Section 13-2-785; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThis section applies to development that is:\n\n(1)\n\non a site in a hill county roadway corridor; and\n\n(2)\n\nexcepted from the application of this article.\n\n(B)\n\nThe owner of a site may file a request with the director to apply this article to\nthe development.\n\n(C)\n\nIf an owner requests that this article apply to a development, the council may approve\na waiver or a provision of this article.\n\n(D)\n\nThe director shall recommend to the Land Use Commission and council each provision\nof this article that should be:\n\n(1)\n\napplied to the development; or\n\n(2)\n\nwaived by the council.\n\n(E)\n\nThe Land Use Commission shall review a request filed under Subsection (B) and shall\nprepare a recommendation on the request.\n\n(F)\n\nIn making a recommendation under Subsection (D), the director shall take into consideration\neach existing land use approved for the site.\n\n(G)\n\nThe council may approve a waiver of a provision of this article to the minimum extent\nnecessary to allow development to occur, based on the recommendations of the director\nand the Land Use Commission.\n\nSource: Section 13-2-781(g); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nThe Watershed Protection and Development Review Department shall maintain a file on\nthe hill country roadway corridors. The file must contain:\n\n(1)\n\na contour map of each corridor that shows each proposed or approved land use in a\ncorridor;\n\n(2)\n\na copy of each site plan submitted in connection with development in each corridor,\nwhether the site plan was subsequently approved, disapproved, or withdrawn;\n\n(3)\n\na map that shows each scenic vista or overlook in each corridor that the Watershed\nProtection and Development Review Department has identified; and\n\n(4)\n\na map that shows each segment of a hill country roadway along which scenic vistas\nare prevalent.\n\nSource: Sections 13-2-783(b)(1) and 13-2-784; Ord. 990225-70; Ord. 010329-18; Ord.\n031211-11.\n\n(A)\n\nProperty is in a high intensity zone, if the property:\n\n(1)\n\nis along Loop 360 and within 3,500 feet of the intersection of Loop 360 with US 290;\nor\n\n(2)\n\nis within 1,000 feet of the right-of-way of two intersecting highways that are maintained\nby the state; and\n\n(a)\n\nhas frontage on:\n\n(i)\n\nboth highways; or\n\n(ii)\n\none highway and an intersecting arterial or collector street.\n\n(B)\n\nProperty is in a moderate intensity zone, if the property:\n\n(1)\n\nis not in a high intensity zone; and\n\n(2)\n\nhas frontage on:\n\n(a)\n\nLoop 360, north of RM 2222 and south of RM 2244;\n\n(b)\n\nthe segment of Loop 360 that is 1,200 feet or less from Westlake Drive;\n\n(c)\n\nthe segment of RM 2222 that extends east from RM 620 for 2.1 miles;\n\n(d)\n\nthe segment of RM 620 that extends from Comanche Trail to Anderson Mill Road;\n\n(e)\n\nthe segment of RM 620 that extends from Lohman's Crossing to Steward Road; or\n\n(f)\n\na segment of a roadway that would otherwise place the property in a low intensity\nzone, if access to the property is solely from an arterial or collector street that\nis not a hill country roadway.\n\n(C)\n\nProperty is in a moderate intensity zone, if the property is not in a high intensity\nzone, has frontage on a hill country roadway and on an intersecting arterial or collector\nstreet, and is located 500 feet or less from the right-of-way boundary of the arterial\nor collector street. This subsection does not apply to an intersection on RM 2222\neast of Loop 360.\n\n(D)\n\nProperty is in a low intensity zone if the property is not in a high intensity zone\nor a moderate intensity zone.\n\nSource: Section 13-2-782(1); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), the floor-to-area ratio of a nonresidential\nbuilding may not exceed:\n\n(1)\n\nin a low intensity zone:\n\n(a)\n\n0.20 for a building on property with a slope gradient of 15 percent or less;\n\n(b)\n\n0.08 for a building on property with a slope gradient of more than 15 percent, but\nnot more than 25 percent; or\n\n(c)\n\n0.04 for a building on property with a slope gradient of more than 25 percent, but\nnot more than 35 percent;\n\n(2)\n\nin a moderate intensity zone:\n\n(a)\n\n0.25 for a building on property with a slope gradient of 15 percent or less;\n\n(b)\n\n0.10 for a building on property with a slope gradient of more than 15 percent, but\nnot more than 25 percent; or\n\n(c)\n\n0.05 for a building on property with a slope gradient of more than 25 percent, but\nnot more than 35 percent; or\n\n(3)\n\nin a high intensity zone:\n\n(a)\n\n0.30 for a building on property with a slope gradient of 15 percent or less;\n\n(b)\n\n0.12 for a building on property with a slope gradient of more than 15 percent, but\nnot more than 25 percent; or\n\n(c)\n\n0.06 for a building on property with a slope gradient of more than 25 percent, but\nnot more than 35 percent.\n\n(B)\n\nIf the Land Use Commission grants a development bonus under Section 25-2-1128 (Development Bonuses), the floor-to-area ratio of a building on a slope that has a gradient of not more\nthan 15 percent may not exceed:\n\n(1)\n\n0.25 if the property is a low intensity zone;\n\n(2)\n\n0.30 if the property is in a moderate intensity zone; or\n\n(3)\n\n0.35 if the property is in a high intensity zone.\n\n(C)\n\nIf a portion of developed property or property covered by an approved site plan is\ncondemned for right-of-way and if the development complies with other applicable requirements,\nthe gross square footage permitted before the condemnation is the gross square footage\npermitted for the portion of the property remaining after the condemnation.\n\n(D)\n\nTo calculate allowable floor area under this section, gross site area includes all\nland dedicated for right-of-way under Section 25-6-55 (Dedication Of Right-Of-Way) that is more than 60 feet from the centerline of a hill country roadway.\n\n(E)\n\nThis section does not apply to property in the Southwest Parkway hill country roadway\ncorridor.\n\nSource: Section 13-2-782(2); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nDevelopment of property in a hill country roadway corridor must comply with Chapter 25-8, Subchapter A, Article 7, Division 3 (Construction On Slopes) and this section. If a conflict exists between this section and another section\nof this title, the more restrictive provision applies.\n\n(B)\n\nA person who constructs a structure uphill of a slope with a gradient of 15 percent\nor more:\n\n(1)\n\nmust use a pier and beam technique to construct the structure; and\n\n(2)\n\nmay not extend a vertical wall below the lowest finished floor elevation of the structure,\nexcept as necessary to screen mechanical equipment.\n\n(C)\n\nA person who constructs a structure downhill of a slope with a gradient of 15 percent\nor more may not exceed a depth of eight feet for structural excavation.\n\n(D)\n\nTo restore a cut or fill for a roadway, driveway, or structure, a person may construct\na terraced wall and fill with a finished gradient of 100 percent. The wall may not\nexceed a height of four feet. More than one level of terracing may be constructed.\n\n(E)\n\nIf a person does not use terracing to restore a cut or fill, the person must revegetate\nand restore the cut or fill to a slope have a finished gradient of 33 percent.\n\n(F)\n\nA cut or fill restored under Subsection (E) may not exceed eight feet in length. If\nadditional restoration is required, a terrace that complies with Subsection (D) must\nbe constructed between each eight-foot slope segment.\n\n(G)\n\nA person must place fill to blend with the natural contour of the slope.\n\nSource: Section 13-2-782; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (C) or Section 25-2-1128 (Development Bonuses), a person may not construct a building that is more than 28 feet in height, if the\nbuilding is:\n\n(1)\n\n200 feet or less from the nearest right-of-way boundary of a hill country roadway;\nor\n\n(2)\n\nin a low intensity zone.\n\n(B)\n\nIf a building is more than 200 feet from the nearest right-of-way boundary of a hill\ncountry roadway, a person may construct a building that is not more than:\n\n(1)\n\n40 feet in height in a moderate intensity zone; or\n\n(2)\n\n53 feet in a high intensity zone.\n\n(C)\n\nThe height of a building in the Southwest Parkway roadway corridor may not exceed\nthe lesser of:\n\n(1)\n\nthe height permitted by the zoning or the site plan approved for the property; or\n\n(2)\n\n60 feet.\n\nSource: Section 13-2-782(4); Ord. 990225-70; Ord. 031211-11.\n\nEach on-site utility must be located underground, unless otherwise required by the\nutility provider.\n\nSource: Section 13-2-782(5); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nEach building shall be designed to use, to the greatest extent feasible, building\nmaterials that are compatible with the environment of the hill country, including\nrock, stone, brick, and wood.\n\n(B)\n\nA person may not construct a building that has mirrored glass with a reflectance of\nmore than 20 percent.\n\nSource: Section 13-2-782(6); Ord. 990225-70; Ord. 031211-11.\n\nTo calculate impervious cover under this article, gross site area includes all land\ndedicated for right-of-way under Section 25-6-55 (Dedication Of Right-Of-Way) that is more than 60 feet from the centerline of a hill country roadway.\n\nSource: Section 13-2-782(2); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe Land Use Commission shall grant a development bonus to a proposed development\nif the Land Use Commission determines that:\n\n(1)\n\nan unusual circumstance exists, as defined in Subsection (C); and\n\n(2)\n\nthe proposed development as constructed will comply with at least 50 percent of the\ncriteria identified in Section 25-2-1129 (Criteria For Approval Of A Development Bonus).\n\n(B)\n\nA development bonus approved by the Land Use Commission for a proposed development\nmay:\n\n(1)\n\nfor property on a slope with a gradient of 15 percent or less, increase the floor-to-area\nratio up to .05 to 1;\n\n(2)\n\nincrease building height up to:\n\n(a)\n\n40 feet in a low intensity zone;\n\n(b)\n\n53 feet in a moderate intensity zone; or\n\n(c)\n\n63 feet in a high intensity zone; or\n\n(3)\n\nreduce a required setback by 25 feet or less.\n\n(C)\n\nIn Subsection (A), an unusual circumstance must involve:\n\n(1)\n\nan undue hardship caused by this article, or by the cumulative effects of this title,\nbecause of the configuration, topography, or location of the tract;\n\n(2)\n\nthe demonstration of an innovative architectural, site planning, or land use design\nthat:\n\n(a)\n\nhas not been used in the Austin area before; and\n\n(b)\n\nwill serve as an excellent example for a subsequent development; or\n\n(3)\n\na condemnation for right-of-way, if a bonus allows the property owner to recapture\nsquare footage potential that was lost because of that condemnation.\n\n(D)\n\nNotwithstanding Subsection (A)(2), if an unusual circumstance exists, the Land Use\nCommission may approve a development bonus if the proposed development does not comply\nwith at least 50 percent of the criteria in Section 25-2-1129 (Criteria For Approval Of A Development Bonus).\n\nSource: Sections 13-2-783(a) and (c); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nIn determining whether to approve a development bonus for a proposed development,\nthe Land Use Commission may consider criteria that reasonably relate to the development\nbonus, including if the proposed development:\n\n(1)\n\npreserves a scenic vista and provides a place where the public can view the scenic\nvista;\n\n(2)\n\nlimits access to a roadway that is not a hill country roadway if use of the roadway\ndoes not increase traffic in a residential area;\n\n(3)\n\nreduces by at least 15 percent the amount of impervious cover otherwise required for\nthe development;\n\n(4)\n\nincreases landscaping or a setback by more than 50 percent above the amount required\nfor the development or increases a natural area;\n\n(5)\n\nis a mixed-use development, particularly a mixed-use development that includes a residential\nuse and community facility;\n\n(6)\n\nreduces building mass by breaking up buildings;\n\n(7)\n\nuses pervious pavers although the development is not entitled to receive an impervious\ncover credit;\n\n(8)\n\nconsolidates small lots to create a parcel that has at least 300 feet of frontage\non a hill country roadway;\n\n(9)\n\nuses pitched roof design features;\n\n(10)\n\nincludes the construction or dedication of a public facility that is not required\nby a City ordinance, including a park, roadway and right-of-way, Police Department\nsite, Fire Department site, emergency medical services facility site, or a regional\ndrainage facility;\n\n(11)\n\nlimits the construction of a building or parking area to an area with a slope that\nhas a gradient of not more than 15 percent; or\n\n(12)\n\nuses an energy-conserving or a water-conserving device that reduces energy or water\nconsumption below City requirements.\n\nSource: Section 13-2-783(b); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n### ARTICLE 12. - RESERVED.\n\n## ARTICLE 12. - RESERVED.\n\n### ARTICLE 13. - DOCKS, BULKHEADS, AND SHORELINE ACCESS.\n\n(A)\n\nThis article applies to a structure or development:\n\n(1)\n\nin Lake Austin, Lady Bird Lake, or Lake Walter E. Long;\n\n(2)\n\nalong the shore of Lake Austin in the area below 504.9 feet above mean sea level;\n\n(3)\n\nalong the shore of Lady Bird Lake below 435 feet above mean sea level;\n\n(4)\n\nalong the shore of Lake Walter E. Long; or\n\n(5)\n\nused for access to areas described in this Subsection.\n\n(B)\n\nThe director of the Planning and Development Review Department shall implement and\nenforce this article.\n\nSource: Section 13-2-791(a) and (d); Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075;\nOrd. 20131017-079; Ord. No. 20140626-113, Pt. 6, 7-7-14.\n\nIn this article:\n\n(1)\n\nBULKHEAD means a revetment or wall constructed for the purpose of stabilizing or modifying\nthe shoreline.\n\n(2)\n\nCLUSTER DOCK means a dock not used for commercial purposes that is associated with:\n\n(a)\n\ndwelling units in a multifamily development with lake frontage; or\n\n(b)\n\nprincipal residential structures in a subdivision with perpetual use rights to a common\narea that fronts a lake.\n\n(3)\n\nCONSTRUCT includes placing or replacing a structure and structurally altering an existing\nstructure.\n\n(4)\n\nDOCK includes a wharf, pier, float, floating dock, island, boat dock, boat slip, boat\nlift, stationary platform, or other similar structure.\n\n(5)\n\nMOTORBOAT means a watercraft propelled by an internal combustion engine or electric\nmotor.\n\n(6)\n\nNORMAL POOL ELEVATION means:\n\n(a)\n\nfor Lake Austin, 492.8 feet above mean sea level;\n\n(b)\n\nfor Lady Bird Lake, 429 feet above mean sea level; and\n\n(c)\n\nfor Lake Walter E. Long, 554.5 feet above mean sea level.\n\n(7)\n\nPERSONAL WATERCRAFT includes jet skis and means a type of motorboat specifically designed\nto be operated by a person or persons sitting, standing or kneeling on the vessel\nrather than in the conventional manner of sitting or standing inside the vessel and\nthat is less than 13 feet in length.\n\n(8)\n\nSHORELINE means the line where the edge of the water meets the land at normal pool\nelevation.\n\n(9)\n\nSHORELINE ACCESS means improvements constructed to provide a means of approaching\nthe shoreline such as stairs, lifts, trams, incline elevators or escalators.\n\n(10)\n\nSHORELINE FRONTAGE means the total linear distance of the shoreline.\n\nSource: Section 13-2-790; Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075; Ord. No. 20140626-113, Pt. 7, 7-7-14; Ord. No. 20160922-048, Pt 2, 10-3-16.\n\n(A)\n\nA person may not modify a shoreline or construct or modify a dock, bulkhead, or shoreline\naccess unless the person first obtains a site plan, except as otherwise allowed under\nSection 25-5-2 (Site Plan Exemptions), and building permit and pays the applicable fees established by ordinance. A site\nplan required under this section must be signed and sealed by a licensed professional\nengineer and must include all information required by the director responsible for\nadministering this chapter.\n\n(B)\n\nA permit obtained under this section shall be prominently displayed at the construction\nsite until the final inspection and approval by the building official.\n\n(C)\n\nIf a permit is required under this section and is not obtained before construction\nbegins, the required fee is increased by an amount established by ordinance. Payment\nof the additional fee does not relieve a person from complying with the requirements\nof this title.\n\n(D)\n\nWhere an inspection is required by state law, neither a Certificate of Compliance\nnor a final inspection may be issued for shoreline access unless the applicant has\nsubmitted an inspection report, signed by a QEI-1 inspector registered with the Texas\nDepartment of Licensing and Regulation, stating that all applicable state regulations\nhave been met.\n\nSource: Sections 13-2-791 and 13-2-794; Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075;\nOrd. 20131017-079; Ord. No. 20140626-113, Pt. 8, 7-7-14.\n\n(A)\n\nIn addition to other applicable requirements of this title, a dock must:\n\n(1)\n\ncomply with the requirements of\nChapter 25-12\n(Technical Codes), including Article 1 (Building Code), Article 7 (Fire Code), and the Building Criteria Manual;\n\n(2)\n\nbe designed and constructed in a manner that does not pose a hazard to navigation\nsafety;\n\n(3)\n\nbe braced to withstand pressure of wind and water when boats are tied to the dock;\nand\n\n(4)\n\nif the dock is a floating dock, be supported by solid displacement flotation devices,\nwith durable nonferrous protective coverings that are securely attached to the dock\nand capable of withstanding prolonged exposure to wave action and weather.\n\n(B)\n\nA bulkhead with a greater than 45 degree vertical slope for any portion greater than\none foot in height is not permitted on or adjacent to the shoreline of a lake that\nis subject to this article, unless the shoreline is located within an existing man-made\nchannel.\n\nSource: Section 13-2-792; Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075; Ord.\n20121018-024; Ord. No. 20140626-113, Pt. 9, 7-7-14.\n\n(A)\n\nA dock must be lighted as provided in this section and in compliance with\nChapter 25-12, Article 4\n(Electrical Code). This section does not apply to a dock located on an inlet or slough, unless the\ndock is on Bee Creek or Bull Creek.\n\n(B)\n\nThis subsection applies to a dock that extends more than eight feet from the shoreline.\nIn this subsection, the distance that a dock extends from a shoreline is measured\nperpendicular to the shoreline.\n\n(1)\n\nA dock must be continuously lighted with amber lights between sunset and sunrise each\nday.\n\n(2)\n\nA dock must have at least one light station. Except as otherwise provided in this\nsubsection, the light station must be located on the end of the dock and on the side\nthat is farthest from and parallel to the shoreline. The light must be visible to\na properly approaching watercraft.\n\n(3)\n\nA dock that extends 30 feet or more from the shoreline, or that has a shoreline frontage\nof 25 feet or more, must have at least one light station on each side of the dock\nthat does not face the shoreline.\n\n(4)\n\nThe requirements of this paragraph apply if the director determines that a dock described\nin Subsection (B)(3) may be a navigational hazard between sunset and sunrise.\n\n(a)\n\nA dock that extends less than 50 feet from the shoreline must have a light station\nhalfway between the shoreline and the end of the dock that is farthest from the shoreline.\n\n(b)\n\nA dock that extends 50 feet or more from the shoreline must have light stations from\nthe shoreline to the end of the dock at intervals of not more than 25 feet, except\nthat a light station may not be located within 8 feet of the shoreline.\n\n(c)\n\nA dock that has a shoreline frontage of at least 25 feet but less than 50 feet must\nhave a light station located at each end of the dock on the side farthest from the\nshoreline.\n\n(d)\n\nA dock that has a shoreline frontage of 50 feet or more must have light stations located\nat intervals of not more than 25 feet along its frontage.\n\n(e)\n\nLight stations are required at each end of the dock on the side farthest from the\nshoreline.\n\n(C)\n\nA light station required by this section must have a two-bulb fixture, with two working\nlight bulbs that emit at least 112 lumens and not more than 400 lumens. Light bulbs\nor bulb covers must be amber, and white light may not radiate from the fixture. Weatherproof\nlamp holders and junction boxes are required. Each light fixture must be wired with\na switch operated by a photoelectric cell so that the lights will operate automatically\nduring the hours that the dock is required to be lighted by this section.\n\n(D)\n\nWiring on a dock must be enclosed in rigid conduit or weatherproof flexible conduit\nwith appropriate fittings.\n\n(E)\n\nIf lights other than those required by this section are installed on a dock, only\nan amber navigation light may cast a beam of light outward from the dock.\n\n(F)\n\nA dock that requires lights under this section must provide temporary navigation lights\nthat meet the requirements of this section during construction and until the permanent\nnavigation lights installed on the dock are working.\n\n(G)\n\nIf a dock does not comply with this section, the building official or other authorized\ncity official shall post notice on the dock and shall notify the owner by mail of\nthe violation. An offense under this section is punishable by a fine of not less than\n$200.\n\nSource: Section 13-2-793; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-079; Ord. No. 20140626-113, § 10, 7-7-14; Ord. No. 20160922-048, Pt. 3, 10-3-16.\n\n(A)\n\nA dock or similar structure must comply with the requirements of this subsection.\n\n(1)\n\nA dock may extend up to 30 feet from the shoreline, except that the director may require\na dock to extend a lesser or greater distance from the shoreline if deemed necessary\nto ensure navigation safety.\n\n(2)\n\nNo portion of a dock shall extend more than 20% of a channel width as measured by\na line that is perpendicular to the centerline of the channel and that extends from\nthe shoreline where the dock is located to the opposite shoreline.\n\n(3)\n\nA dock may not be constructed closer than 10 feet to the side property line, regardless\nof the side-yard setback generally applicable within the base zoning district.\n\n(4)\n\nThe width of a dock measured parallel to the shoreline of the lot or tract where the\ndock is proposed, and including all access and appurtenances, may not exceed:\n\n(a)\n\n20 percent of the shoreline frontage, if the shoreline width exceeds 70 feet;\n\n(b)\n\n14 feet, if the shoreline frontage is no greater than 70 feet.\n\n(5)\n\nThe footprint of a dock, including the portion of a cut-in slip, attached access structures,\nor roof overhang, may not exceed:\n\n(a)\n\n1,200 square feet for a dock that is accessory to a principal residential use;\n\n(b)\n\nfor a cluster dock, 600 square feet multiplied by:\n\n(i)\n\nthe number of dwelling units in a multifamily development; or\n\n(ii)\n\nthe number of principal residential structures in a subdivision, if:\n\nthe dock will be located in a common area that fronts Lake Austin or Lady Bird Lake;\nand\n\nlots within the subdivision have perpetual use rights to the common area.\n\n(6)\n\nA dock may not exceed 30 feet in height as measured from the highest point of the\nstructure above the normal pool elevation of the lake.\n\n(7)\n\nNo portion of a dock may be enclosed, except for an enclosed storage closet that is:\n\n(a)\n\nlimited to no more than 48 square feet for each principal residential use associated\nwith the dock; and\n\n(b)\n\noriented to minimize cross sectional area perpendicular to flow.\n\n(8)\n\nThe dock must be designed and constructed to meet the following requirements:\n\n(a)\n\nexcept for storage closets permitted under Paragraph (7), all solid structural supports\nand other materials used for enclosure, including lattice, wire panels, seat walls,\nand screening, must be at least 66 percent open, except that mesh for insect screening\nthat is at least 66 percent open will not count toward the total enclosure percentage;\n\n(b)\n\nno framing materials that are capable of being converted to support walls or windows\nmay be used; and\n\n(c)\n\npercentage of required openness is calculated per side, with the assumed height of\neight feet per floor when no roof is proposed.\n\n(9)\n\nThe number of motorboats anchored, moored, or stored on a dock may not exceed:\n\n(a)\n\ntwo, for a principal residential use utilizing an individual dock that is not part\nof a cluster dock; or\n\n(b)\n\nthe number of single-family or multifamily residential units that:\n\n(i)\n\nhave a perpetual right to use of a cluster dock located in a common area of the residential\nsubdivision or multi-family development; and\n\n(ii)\n\ndo not utilize a dock other than a cluster dock.\n\n(10)\n\nFor purposes of determining the total number of motorboats that may be anchored, moored,\nor stored on a dock or over water, one personal watercraft is equivalent to one-half\nof a motorboat.\n\n(B)\n\nA marina area or cluster dock must comply with the requirements of this subsection.\n\n(1)\n\nA parking lot or permanent structure, other than a dock or a combined storage area\non the water's edge, must be set back at least 100 feet from the shoreline.\n\n(2)\n\nSanitation facilities must be provided in accordance with the following requirements.\n\n(a)\n\nPermanent sanitation facilities are required for a marina or common area with 10 or\nmore boat slips.\n\n(b)\n\nTemporary or permanent sanitation facilities are required for a marina or common area\nwith fewer than 10 boat slips.\n\n(3)\n\nA facility operator must:\n\n(a)\n\nremove garbage in a timely manner and provide for the on-site collection of garbage\nat a marina or common area; and\n\n(b)\n\nprovide at least one garbage can with a capacity of at least 32 gallons for each four\npicnic units and for each four boat slips.\n\n(C)\n\nA fence may not extend into the water beyond the shoreline unless the fence:\n\n(1)\n\nwas part of a commercial livestock operation, other than raising domestic pets, existing\non April 17, 1994:\n\n(2)\n\nis constructed of smooth wire or mesh;\n\n(3)\n\nextends no more than 40 feet beyond the shoreline;\n\n(4)\n\nincludes a navigation buoy indicating \"DANGER\", in accordance with the Texas Water\nSafety Act, installed at the end of the fence, unless the fence does not extend further\nbeyond the shoreline than an immediately adjacent dock; and\n\n(5)\n\nmust be removed if the livestock operation ceases.\n\n(D)\n\nConstruction of a boat ramp is prohibited, unless the boat ramp is constructed on\npublic land and dedicated for public use.\n\n(E)\n\nA person constructing shoreline access, as that term is defined in Section 25-2-1172 (Definitions), shall screen the shoreline access from the view of a property with at least one\ndwelling unit but less than four dwelling units and is zoned urban family residence\n(SF-5) district or more restrictive.\n\n(1)\n\nA person may comply with this subsection by providing vegetation and tree canopy as\nprescribed by rule and may supplement compliance with other screening methods prescribed\nby rule.\n\n(2)\n\nThe owner must maintain the screening required by this section.\n\nSource: Section 13-2-795; Ord. 990225-70; Ord. 031120-44; Ord. 031211-11; Ord. 20101209-075;\nOrd. 20131017-079; Ord. No. 20140626-113, Pt. 11, 7-7-14; Ord. No. 20160922-048, Pt. 4, 10-3-16; Ord. No. 20240516-004, Pt. 3, 7-15-24.\n\n(A)\n\nA license agreement from the City is not required for a dock located along Lake Austin,\nLady Bird Lake, or Lake Walter E. Long, regardless of any easements or other ownership\nrights held by the City.\n\n(B)\n\nNo living quarters or business, including a marina, may be constructed into or above\na lake that is subject to this article, unless the city council approves a license\nagreement for the use after receiving a recommendation from the Land Use Commission.\n\nSource: Section 13-2-796; Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075; Ord. No. 20140626-113, Pt. 12, 7-7-14.\n\n**Editor's note—**\nOrd. No. 20140626-113, Pt. 13, effective July 7, 2014, repealed § 25-2-1178, which pertained to fire protection. See References to Ordinances\nfor complete derivation.\n\n(A)\n\nIn addition to other applicable requirements of this title, a dock, bulkhead, or shoreline\naccess must be designed, constructed, and maintained in accordance with the applicable\nrequirements of this subsection.\n\n(B)\n\nA marine fuel facility or service station must comply with the requirements of Chapter\n6-2 (Hazardous Materials) and shall be designed, maintained, and operated in a manner that prevents the spilling\nor leaking of fuel or petroleum products into the water.\n\n(C)\n\nThe maintenance and repair of watercraft shall be performed in a manner that prevents\ndischarge of fuel, oil, or other pollutants into the water.\n\n(D)\n\nContainers of hazardous materials, fuel, oil, herbicides, insecticides, fertilizers\nor other pollutants may not be stored on docks extending into or above Lake Austin,\nLady Bird Lake, or Lake Walter E. Long.\n\n(E)\n\nConstruction of shoreline access structures must minimize disturbance to woody and\nherbaceous vegetation, preserve the tree canopy, and replace herbaceous ground cover\nto the extent practicable.\n\n(F)\n\nA marina or marine fuel service facility or service station must provide adequate\nfire protection approved by the Fire Chief of the Austin Fire Department in accordance\nwith the Fire Code and National Fire Protection Association standards for marinas\nand boatyards.\n\nSource: Section 13-2-798; Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075; Ord. No. 20140626-113, Pt. 13, 7-7-14; Ord. No. 20221027-045, Pt. 3, 11-7-22.\n\n(A)\n\nOn a determination by a city official or employee that a dock has become or is in\nimminent danger of becoming structurally unsound, the building official:\n\n(1)\n\nshall take action to declare the dock a hazard;\n\n(2)\n\nshall abate the hazard under\nChapter 25-12, Article 9\n(Property Maintenance Code), at the owner's expense; and\n\n(3)\n\nmay impose a lien on the affected property to recover the cost of abatement.\n\n(B)\n\nAn applicant must place a registration tag on a boat dock in a manner prescribed by\nthe director of the Code Compliance Department. A person may not remove a tag required\nto be placed on a dock under this subsection.\n\n(C)\n\nIn addition to the actions authorized under this section, the building official may\ntake any other authorized action to enforce the requirements of this article.\n\nSource: Ord. No. 20140626-113, Pt. 14, 7-7-14.\n\n### ARTICLE 14. - MOBILE HOMES AND TOURIST OR TRAILER CAMPS.\n\nThis division applies in the zoning jurisdiction.\n\nSource: Section 13-2-933; Ord. 990225-70; Ord. 031211-11.\n\nIn this division:\n\n(1)\n\nMOBILE HOME SPACE means an area in a mobile home park that is designed for and designated\nas the location for a single mobile home and the exclusive use of its occupants.\n\n(2)\n\nMOBILE HOME STAND means that portion of a mobile home space on which the mobile home\nis placed.\n\nSource: Section 13-2-930; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA person may not operate a mobile home park without a mobile home park license issued\nby the director.\n\n(B)\n\nThe director may not issue a mobile home park license unless:\n\n(1)\n\nthe fire chief approves the fire-fighting appliances, water supply, access ways, and\nall fire safety requirements; and\n\n(2)\n\nthe applicant holds a certificate of compliance with site plan improvements.\n\n(C)\n\nA license issued under this division is void on the revocation or expiration of the\nsite plan.\n\n(D)\n\nA mobile home park licensee who sells, transfers, or disposes of an interest in or\ncontrol of a mobile home park shall:\n\n(1)\n\ngive written notice to the director not later than the 14th day after the sale, transfer,\nor disposition; and\n\n(2)\n\nnot later than the 10th day after giving notice under this subsection, request that\nthe director transfer the mobile home park license.\n\n(E)\n\nThe director shall act on a license transfer request not later than the 10th day after\nreceiving the request. The director shall approve a license transfer if the mobile\nhome park complies with the requirements of this division.\n\n(F)\n\nA mobile home park license expires one year after the date issued.\n\nSource: Sections 13-2-946; 13-2-947; 13-2-948; and 13-2-949; Ord. 990225-70; Ord.\n031211-11.\n\nAn applicant whose application under this division is denied may appeal the denial\nto the council under Chapter 25-1, Article 7, Division 1 (Appeals).\n\nSource: Section 13-2-950; Ord. 990225-70; Ord. 031211-11.\n\nA mobile home park must comply with the following requirements:\n\n(1)\n\nA park must have a minimum site area of 90,000 square feet and contain a minimum of\n20 mobile home spaces.\n\n(2)\n\nA park must provide a minimum of 4,500 square feet of site area for each dwelling\nunit.\n\n(3)\n\nA mobile home must have a minimum street yard of at least 25 feet in length, and minimum\ninterior yard at least 15 feet in length. A mobile home space may not be placed in\na street yard.\n\n(4)\n\nA park must provide direct access to a public street with a right-of-way at least\n60 feet wide.\n\n(5)\n\nA park must provide private, paved internal streets at least 30 feet wide for interior\nvehicular circulation. An internal street must be continuous and connect with other\ninternal streets or with public streets, or provide a paved cul-de-sac having a diameter\nof at least 80 feet. An internal street ending in a cul-de-sac may not exceed 400\nfeet in length.\n\n(6)\n\nA mobile home space must contain a minimum area of 2,500 square feet that is adjacent\nto an internal street designed to provide adequate space for moving a mobile home\ninto and out of the space.\n\n(7)\n\nIf provided, all off-street parking spaces shall be located on a mobile home space\nor in a common parking area.\n\n(8)\n\nA mobile home and an attached accessory structure must be located at a distance of\nat least 10 feet from another mobile home or other structure.\n\n(9)\n\nA mobile home stand must be separated from the pavement of an internal street, common\nparking area, or other common areas by a minimum distance of 10 feet.\n\n(10)\n\nExcept where the boundary of the park abuts a public right of way or the boundary\nof the park abuts another mobile home development, a barrier that is at least six\nfeet high shall be erected and maintained along all boundaries of the park.\n\n(11)\n\nA mobile home chassis may not rest more than three feet above the ground elevation\nat the low end, measured at 90 degrees to the frame.\n\n(12)\n\nExcept for necessary driveways and walkways providing access to the park, a required\nstreet yard shall be landscaped.\n\n(13)\n\nA park must provide pedestrian access to and from each mobile home space and all common\nfacilities. A walkway that is designed separately from internal streets or parking\nareas must have a minimum paved width of two feet.\n\n(14)\n\nA park must contain a minimum of 300 square feet of open space for each dwelling unit,\nwith at least 150 square feet being located on each mobile home space. Open space\nthat is not located on a mobile home space may be located in common open space areas\ndistributed throughout the park in a manner that provides reasonable and convenient\naccess to each mobile home space.\n\n(15)\n\nThe maximum height of a structure shall be 35 feet.\n\n(16)\n\nA mobile home park may consist of recreational vehicles if the mobile home park contains\nfive or more manufactured homes. The provisions of Subsections (C), (D), (F), (G),\nand (I) of Section 25-2-1265 (Technical Requirements) apply to this section.\n\n(17)\n\nFor purposes of meeting the five or more manufactured homes threshold in Subsection\n(16) above and tenant relocation requirements, recreational vehicles may be counted\nas manufactured homes if the mobile home space is providing a stay for thirty days\nor longer.\n\n(18)\n\nAll residences in Mobile Home (MH) zoning must provide a stay for 30 days or longer.\n\nSource: Section 13-2-931; Ord. 990225-70; Ord. 031120-44; Ord. 031211-11; Ord. No.\n20190808-092, Pt. 1, 8-19-19; Ord. No. 20231102-028, Pt. 23, 11-13-23.\n\nA mobile home subdivision designed for the placement of mobile home dwellings on individually\nsubdivided lots with frontage on a public street must comply with the site development\nregulations applicable to the SF-2 district.\n\nSource: Section 13-2-932; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as otherwise provided in this section, a person may not place, maintain, or\noccupy a mobile home in the city other than in a mobile home park that is licensed\nunder this division, or in a mobile home subdivision.\n\n(B)\n\nThis section does not apply to a mobile home that is:\n\n(1)\n\nlocated on a construction site and is used as a field office during construction;\n\n(2)\n\na mobile home sales lot; or\n\n(3)\n\na mobile home that is under construction or stored at a mobile home manufacturing\nplant.\n\nSource: Section 13-2-934; Ord. 990225-70; Ord. 031211-11.\n\nAn occupant of a mobile home in a mobile home subdivision or park shall secure the\nmobile home in a manner that complies with the Buildings Criteria Manual.\n\nSource: Section 13-2-935; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAn occupant of a mobile home in a mobile home subdivision or park shall maintain skirting,\nporches, awnings, and other additions in good repair.\n\n(B)\n\nThe space immediately beneath a mobile home may be used for storage only if the storage\narea is supported by a base of impervious material and the stored items do not interfere\nwith the inspection of the underside of the mobile home or the area underneath the\nmobile home.\n\nSource: Section 13-2-936; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA mobile home owner or licensee shall operate the park in compliance with this division\nand other applicable ordinances and shall provide adequate supervision to maintain\nthe park, its facilities, and equipment in good repair and in a clean and sanitary\ncondition.\n\n(B)\n\nThe owner or licensee shall notify park occupants of the provisions of this division\nand their duties and responsibilities under this division.\n\n(C)\n\nThe owner or licensee shall notify the building official of a violation of this division.\n\nSource: Section 13-2-937; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nNot later than the 11th day of January of each year, a mobile home owner or licensee\nshall furnish to the appropriate county tax assessor a list of mobile homes located\nin the park on the first day of January, on a form prescribed by the tax assessor.\nThe list shall include the name and address of the owner of the mobile home; the make,\nlength, width, and year of manufacture of the mobile home; and mobile home identification\nnumber.\n\n(B)\n\nNot later than the 11th day of July of each year, the owner or licensee shall furnish\nto the appropriate tax assessor the information required under Subsection (A) for\nmobile homes that have been moved into the park after January 1. The owner or licensee\nshall also furnish to the tax assessor the information required under Subsection (A)\nfor mobile homes that were moved out of the park after first January 1, including\nthe date that the mobile home was moved out of the park and the destination of that\nmobile home.\n\nSource: Section 13-2-938; Ord. 990225-70; Ord. 031211-11.\n\nAn occupant of a mobile home located in a mobile home park shall comply with all requirements\nof this article and shall maintain the mobile home space, its facilities, and equipment\nin good repair and in a clean and sanitary condition. The occupant shall place the\nmobile home in its mobile home stand and install utility connections in accordance\nwith the instructions of the park management and in compliance with applicable codes.\n\nSource: Section 13-2-939; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA mobile home park owner or licensee shall maintain an annual register of park occupants\nthat includes the following information:\n\n(1)\n\nthe name and address of each park resident;\n\n(2)\n\nthe resident's mobile home registration data, including make, length, width, year\nof manufacture, and identification number;\n\n(3)\n\nthe location of each mobile home in the park by space or lot number and street address;\nand\n\n(4)\n\nthe date of arrival and departure of each mobile home.\n\n(B)\n\nA register compiled under Subsection (A) shall be retained on the premises of the\npark for a period of at least three years after the close of the year for which it\nwas compiled. An owner or licensee shall make a register available for inspection\nat all reasonable times by the building official, the health authority, the fire chief,\nthe police chief, the county tax assessor, or other city official whose duties require\naccess to the information contained in the register.\n\nSource: Section 13-2-940; Ord. 990225-70; Ord. 031211-11.\n\nAn occupant of a mobile home park shall provide to the owner or licensee access to\nany part of the park at reasonable times for the purpose of making the repairs or\nalterations necessary to comply with this division.\n\nSource: Section 13-2-941; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as otherwise provided Subsections (B) and (C), the building official may not\nissue a permit for the construction or occupancy of a permanent residential structure\nin a mobile home park.\n\n(B)\n\nAn existing residential structure may be retained or a new residential structure may\nbe constructed for the occupancy of the owner or operator of the park.\n\n(C)\n\nAn existing residence may be converted to a clubhouse, community center, or service\nbuilding for use by the park residents.\n\n(D)\n\nA person affected by the building official's denial of a permit to construct or occupy\na permanent residential structure under this division may appeal the denial to the\ncouncil.\n\nSource: Sections 13-2-944 and 13-2-945; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA mobile home stand in a mobile home park must be installed in a manner that prevents\nthe stand from heaving, shifting, or settling unevenly in the event of frost, inadequate\ndrainage, vibration, or other force acting on the super-structure.\n\n(B)\n\nThe exposed ground surface in a park must be paved, covered with stone screening or\nother solid material, or protected with a vegetative growth that is capable of preventing\nsoil erosion and eliminating dust.\n\n(C)\n\nThe ground surface in a park must be graded and equipped to drain all surface water\nin a safe, efficient manner.\n\n(D)\n\nUnless provided in current mobile home models, a park may provide storage facilities\nwith a minimum capacity of 200 cubic feet for each mobile home space on a mobile home\nspace or in a compound located within 100 feet of a space. A storage facility provided\nby a park under this subsection shall be designed in a manner that enhances the appearance\nof the park and shall be faced with masonry, porcelainized steel, baked enamel steel\nor other material of equal fire resistance, durability and appearance. Storage outside\nthe perimeter wall of a mobile home must be provided in the manner described in this\nsubsection.\n\nSource: Section 13-2-951; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA mobile home park owner or licensee shall construct and maintain internal streets\nin the park at the owner or licensee's expense.\n\n(B)\n\nA park owner or licensee shall install parking control signs, street name signs, and\nother traffic control devices in the park at the owner's or licensee's expense.\n\n(C)\n\nInternal streets shall be designed for safe and convenient access to each space and\nto the common-use facilities for park residents and internal streets shall be kept\nfree of obstruction.\n\n(D)\n\nThe Austin Police Department may issue a citation for a violation of this division\nand may impound vehicles occupying the park in violation of this division.\n\n(E)\n\nThe owner or licensee shall erect metal signs indicating that parking is prohibited\non all sections of internal streets on which parking is prohibited. The sign type,\nsize, height, and location must be approved by the city manager before installation.\n\n(F)\n\nAn internal street shall be designed by a licensed professional engineer in compliance\nwith the Transportation Criteria Manual and must be approved by the director before\nconstruction. Internal streets shall be maintained by the owner or licensee free of\ncracks, holes, or other hazards.\n\n(G)\n\nAn internal street must be designed and constructed in a manner that provides that\nno portion of a mobile home is more than 200 feet from the internal street.\n\n(H)\n\nAll streets in a park shall be named and mobile home spaces numbered to conform with\nblock numbers on adjacent public streets. All street name signs must be of a reflective\nmaterial and shall be of a color and size contrasting with those on public streets.\nHouse numbers shall be of reflective material. All street signs and mobile home space\nnumbers in a park shall be of standard size and placement to facilitate locating addresses\nby emergency vehicles.\n\n(I)\n\nInterior streets shall intersect adjoining public streets at approximately 90 degree\nangles and at locations that eliminate or minimize interference with traffic on the\npublic streets.\n\nSource: Section 13-2-952; Ord. 990225-70; Ord. 031211-11; Ord. 20060504-039.\n\nThe owner or licensee shall provide street lighting along all internal streets in\nthe mobile home park.\n\nSource: Section 13-2-953; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nLiquefied petroleum gases may not be stored or dispensed in a mobile home park unless\nthey are handled and stored in compliance with the requirements of applicable city\ncodes.\n\n(B)\n\nGasoline, fuel oil or other flammable liquids may not be stored or dispensed in a\npark unless they are handled and stored in compliance with the requirements of the\ncity fire code.\n\n(C)\n\nApproaches to mobile homes shall be kept clear.\n\n(D)\n\nThe owner or licensee shall instruct the park staff in the use of the fire protection\nequipment in the park and in their specific duties in the event of fire.\n\n(E)\n\nWater supply facilities for Fire Department operations shall be connected to the city\npublic water supply system unless the council grants a special exception to use a\nprivate water supply system. If a private supply is used for service to the park,\nthe private supply must be adequate for both domestic requirements and for fire fighting\nrequirements established by the City. The Fire Chief shall determine the adequacy\nof the water supply for fire fighting requirements. A park owner or licensee may not\nuse a private water supply unless it has sufficient volume and pressure to assure\nthat the city water supply will not be required for fire fighting.\n\n(F)\n\nA park owner or licensee shall provide standard city fire hydrants located within\n500 feet of all mobile home spaces, measured along the driveways and streets. The\nfire hydrants are subject to periodic inspection by the City Fire Department. A park\nowner or licensee shall immediately notify the City Fire Department of a fire hydrant\nin need of repair.\n\n(G)\n\nA park owner or licensee shall provide an adequate system for the collection and safe\ndisposal of rubbish that is approved by the Fire Chief and the Health Authority.\n\n(H)\n\nA park owner or licensee shall maintain the entire area of the park free of dry bush,\nleaves, and weeds.\n\nSource: Section 13-2-954; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA mobile home park shall have at least one recreation area.\n\n(B)\n\nThe owner or licensee of a park shall provide a recreation area or recreational facility\nsuch as a playground, swimming pool, or community building for the use of the mobile\nhome residents in the park.\n\n(C)\n\nIf a playground space is provided, the owner or licensee of the park shall designate\nthe area as playground and protect the playground from traffic, thoroughfares, and\nparking areas. A playground space shall be maintained in a sanitary condition and\nfree of safety hazards.\n\nSource: Section 13-2-955; Ord. 990225-70; Ord. 031211-11.\n\nThe owner or licensee of a mobile home park shall provide an accessible, adequate,\nand safe potable water supply to the park. The owner or licensee must connect the\nwater supply for the park to the public supply of water unless the council grants\na special exception to use a private water supply system. If a private water supply\nis used for service to the park, the private water supply must be adequate for both\ndomestic requirements and for fire fighting requirements established by the City.\n\nSource: Section 13-2-956; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe park's water supply system must be connected by pipes to all mobile homes, buildings,\nand other facilities requiring water.\n\n(B)\n\nThe owner or licensee of the park shall construct and maintain water piping, fixtures,\nand other equipment of the water distribution system in compliance with applicable\nstate and city codes.\n\nSource: Section 13-2-957; Ord. 990225-70; Ord. 031211-11.\n\nIndividual water riser pipes and connections must be installed and maintained in compliance\nwith the City's plumbing code.\n\nSource: Section 13-2-958; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe owner or licensee of a mobile home park shall provide an adequate and safe sewerage\nsystem to convey and dispose of sewage.\n\n(B)\n\nThe sewer system and any sewer lines for a park must be constructed in compliance\nwith the City's plumbing code. A proposed sewage disposal facility must be approved\nby the Health Authority before construction. Unless specific prior approval is obtained\nfrom the Health Authority and the Texas Natural Resource Conservation Commission,\nsewage treatment effluent may not be discharged into any waters of the state.\n\n(C)\n\nThe owner or licensee of a park shall provide each mobile home stand with one sewer\nriser pipe with a minimum diameter of four inches. The sewer riser pipe and other\nsewer connections shall be installed and maintained in compliance with the plumbing\ncode. The sewer riser pipe must be located on a mobile home stand in a manner that\ncauses the sewer connection to the mobile home drain outlet to approximate a vertical\nposition. The owner or licensee of a park shall plug the sewer riser pipe on a mobile\nhome space when no mobile home occupies the space and divert surface drainage away\nfrom the riser.\n\nSource: Section 13-2-959; Ord. 990225-70; Ord. 031211-11.\n\nElectrical wiring and power distribution lines in a mobile home park shall be installed\nin compliance with the City's electrical code.\n\nSource: Section 13-2-960; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to management offices, repair shops, storage areas, sanitary\nfacilities, laundry facilities, indoor recreation areas, commercial uses supplying\nessential goods or services for the benefit and convenience of park occupants, and\nother community service facilities.\n\n(B)\n\nA facility described in Subsection (A) must comply with all applicable city codes.\nThe facility shall be properly protected from damage by ordinary uses and by decay,\ncorrosion, termites, and other destructive elements. Exterior portions of the structure\nshall be constructed to prevent moisture from entering the structure.\n\n(C)\n\nThe owner or licensee of a park shall furnish hot and cold water to every lavatory,\nsink, bathtub, shower, and laundry fixture and cold water to every water closet and\nurinal.\n\n(D)\n\nThe owner or licensee of a park shall maintain service buildings at a comfortable\ntemperature. Between October 1 and May 1, the owner or licensee shall use heating\nequipment that conforms to the requirements of\nChapter 25-12,\nArticle 9 (Property Maintenance Code), if necessary, to maintain a comfortable temperature.\n\n(E)\n\nA cooking shelter, barbecue pit, fireplace, wood-burning stove, or incinerator must\nbe located, constructed, maintained and used in a manner that minimizes fire hazards\nand smoke nuisance in the park and on neighboring property. A person may not start\nor maintain an open fire in a park except in a facility constructed for that purpose.\nA person may not leave an open fire unattended. A person may not use a fuel or burn\nmaterial in an open fire that emits dense smoke or objectionable odors.\n\nSource: Section 13-2-961; Ord. 990225-70; Ord. 031211-11.\n\nThe owner or licensee of a mobile home park shall provide for the storage, collection,\nand disposal of refuse in the park in a manner that does not create a health hazard,\nrodent harborage, an insect breeding area, an accident or fire hazard, or air pollution.\n\nSource: Section 13-2-962; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe owner or licensee of a mobile home park shall maintain the grounds, buildings,\nand structures in a park free of insect and rodent harborage and infestation. The\nowner or licensee of a park may not use an extermination method or insect and rodent\ncontrol that does not comply with the requirements of the Health Authority.\n\n(B)\n\nThe owner or licensee of a park shall maintain the park free of accumulations of debris\nthat may provide rodent harborage or insect breeding areas.\n\n(C)\n\nThe owner or licensee of a park shall control the growth of brush, weeds, and grass\nin the park to prevent rodent and insect harborage or other pests, and the growth\nof noxious weeds detrimental to health. Open areas shall be maintained free of heavy\nundergrowth.\n\nSource: Section 13-2-963; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA natural gas piping system installed in a mobile home park shall be installed underground\nand maintained in compliance with applicable codes. An owner or licensee that provides\npiped gas to a mobile home space shall cap the outlet in a manner that prevents the\naccidental discharge of gas and in compliance with the plumbing code when the outlet\nis not in use.\n\n(B)\n\nA liquefied petroleum gas system may not be installed in a park unless the available\nnatural gas system is more than 1,000 feet from the park. A liquified petroleum gas\nsystem shall be maintained in compliance with applicable state statutes and city codes.\n\nSource: Section 13-2-964; Ord. 990225-70; Ord. 031211-11.\n\nIn this division:\n\n(1)\n\nRECREATIONAL VEHICLE PARK means a lot, tract, or parcel of land that provides accommodation\nfor at least two recreational vehicles used by transients as living or sleeping quarters\nby the day, week, or month.\n\n(2)\n\nCAMP COTTAGE means a building or structure in a recreational vehicle park used by\na single family as living or sleeping quarters.\n\n(3)\n\nUNIT means an area designated within a recreational vehicle park for one camp cottage\nor recreational vehicle.\n\nSource: Section 13-2-981; Ord. 990225-70; Ord. 031211-11.\n\nA recreational vehicle park shall be operated in conformity with state law relating\nto hotels. A person engaging accommodations in a recreational vehicle park shall register\nand give to the manager, operator, or person in charge the person's name, residence\naddress, and automobile license plate number and the state in which it is registered.\n\nSource: Section 13-2-980; Ord. 990225-70; Ord. 031211-11.\n\nApproval of a site plan by the Health Authority is required before the director may\napprove a site plan under this division.\n\nSource: Sections 13-2-984 and 13-2-985; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA person must obtain a permit from the Health Authority to establish, maintain, or\noperate a recreational vehicle park, whether or not a payment for use is required.\n\n(B)\n\nThe Health Authority shall inspect and issue a permit, in writing, for the establishment,\noperation and maintenance of a recreational vehicle park, as applicable.\n\n(C)\n\nA permit issued under this division is nontransferable and expires one year from the\ndate of issuance. The permit fee shall be set by a separate ordinance.\n\n(D)\n\nIf the Health Authority denies an application for a permit under this section, the\napplicant may appeal to the council in accordance with the procedures established\nin Chapter 25-1, Article 7, Division 1 (Appeals).\n\nSource: Sections 13-2-983, 13-2-985, 13-2-986, and 13-2-988; Ord. 990225-70; Ord.\n031211-11.\n\n(A)\n\nA recreational vehicle park must be located on land that is well-drained, free from\nheavy growth or brush or weeds, free from marsh, and graded or equipped with storm\nsewers to insure rapid drainage of rainwater.\n\n(B)\n\nAn entrance or exit drive to a recreational vehicle park licensed under this division\nmust:\n\n(1)\n\nbe surfaced with a minimum width of 18 feet;\n\n(2)\n\nbe well marked to designate roadway, parking, and unit boundaries, lighted at night;\nand\n\n(3)\n\ncomply with the Fire Code.\n\n(C)\n\nA unit reserved for the accommodation of a recreational vehicle or camp cottage must:\n\n(1)\n\nhave an area of not less than 576 square feet, excluding the driveway\n\n(2)\n\nbe at least 24 feet wide, defined clearly by markers at each corner; and\n\n(3)\n\nbe level, free from rock and weeds, and well drained.\n\n(D)\n\nThe owner or licensee of a recreational vehicle park shall provide the park with a\nwater supply that complies with the utility standards of this code and is approved\nby the Health Authority. If the owner or licensee proposes to provide water from a\nsource other than the city water supply, the proposed water supply source must first\nbe approved by the Health Authority. A water supply source provided under this section\nis subject to periodic examination by the Health Authority and the City.\n\n(E)\n\nThe owner or licensee of a recreational vehicle park shall provide the park with a\nsewer system, either by connecting to the City sewerage system if available, or to\na private on-site sewage facility, in compliance with the City code and regulations\nprescribed by the Health Authority.\n\n(F)\n\nThe owner or licensee of recreational vehicle park shall provide the park with facilities\nfor the collection and removal of waste and garbage.\n\n(G)\n\nThe owner or licensee of a recreational vehicle park shall provide the park with a\nsewer system, either by connecting to the city sewer system if available, or to a\nprivate on-site sewage facility, in compliance with the City Code and regulations\nprescribed by the Health Authority.\n\n(H)\n\nAn owner or licensee of a recreational vehicle park shall provide toilet facilities,\nwash basins, bathing facilities, slop basins, and water faucets and spigots in compliance\nwith the Buildings Criteria Manual in a recreational vehicle park where two or more\nrecreational vehicles or camp cottages are located and where private conveniences\nfor each site or cottage are not provided. A toilet facility must be in room separate\nfrom a bathing facility, or partitioned in a manner that provides privacy and promotes\ncleanliness. A community toilet facility must provide private toilet stalls separated\nby a partition. The floor surface surrounding a toilet facility must be designed and\nconstructed to prevent that area from draining on to a shower floor.\n\n(I)\n\nA recreational vehicle or other structure may not be placed or erected at a distance\nof less than five feet from the property line separating the court from the adjoining\nproperty, measuring from the nearest point of the recreational vehicle.\n\n(J)\n\nA sleeping room in a recreational vehicle park must contain not less than 1,000 cubic\nfeet, and must have at least two well screened windows with a total window surface\narea of not less than 25 square feet. The greatest dimension of a single room may\nnot be more than twice its minimum dimension, and the height from the floor to the\ntop of the wall may not be less than seven feet.\n\nSource: Sections 13-2-989 through 13-2-996; Ord. 990225-70; Ord. 031211-11.\n\n## SUBCHAPTER D. - NEIGHBORHOOD PLAN COMBINING DISTRICTS.\n\nThis subchapter applies to property that is:\n\n(1)\n\nlocated in a neighborhood plan (NP) combining district; and\n\n(2)\n\nused or developed as a special use described in Section 25-2-1403 (Special Uses).\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nFor property used or developed as a special use described in Section 25-2-1403, (Special Uses):\n\n(1)\n\nthe regulations prescribed by this subchapter supersede the other provisions of Title 25 (Land Development) to the extent of conflict; and\n\n(2)\n\nthe following regulations do not apply:\n\n(a)\n",
  "start_line": 29291,
  "end_line": 32563,
  "subsections": [
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-G",
    "25-2-893-H",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-G",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-G",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-G",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-G",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-G",
    "25-2-893-H",
    "25-2-893-I",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-G",
    "25-2-893-H",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-A",
    "25-2-893-B",
    "25-2-893-C",
    "25-2-893-D",
    "25-2-893-E",
    "25-2-893-F",
    "25-2-893-G",
    "25-2-893-H",
    "25-2-893-I",
    "25-2-893-J"
  ]
}