{
  "id": "25-2-863",
  "title": "URBAN FARMS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "\n(A)\n\nThis section applies to an urban farm use.\n\n(B)\n\nAn urban farm is allowed within the critical water quality zone if it meets the requirements\nin 25-8-261(B)(4) (Critical Water Quality Zone Development) for sustainable urban agriculture or a community garden.\n\n(C)\n\nA site area for an urban farm shall not be less than one acre and not more than five\nacres.\n\n(D)\n\nThe number of dwelling units allowed on a site may not exceed the number of dwelling\nunits allowed under the base zoning district regulations. Notwithstanding the foregoing,\nnot more than two units are allowed on the site. Animal raising in accordance with\nSection 25-2-863(F) is not allowed without a dwelling on the site. Accessory structures are permitted\nwithout a dwelling.\n\n(E)\n\nRaising livestock is prohibited notwithstanding Chapter 3-2 of the City Code.\n\n(F)\n\nFor properties not zoned residential, raising, slaughtering, processing and composting\nof fowl, rabbits, and aquatic foods using an aquaponic system is permitted in accordance\nwith Chapter 3-2 (Restrictions on Animals) of the City Code. One animal (either fowl or rabbit) may be processed per 1/10\nth\nof an acre per week. Composting, slaughtering or processing of animals must take place\nat least 50 feet from the nearest residential structure other than the structure associated\nwith the use. Slaughtering and processing animals must take place out of public view.\n\nFor properties zoned residential, raising of fowl, rabbits, and aquatic foods using\nan aquaponic system is permitted in accordance with Chapter 3-2 (Restrictions on Animals) of the City Code. Slaughtering and processing of aquatics foods is permitted. Slaughtering,\nprocessing of fowl and rabbits is prohibited. Composting of animal parts is prohibited\nin residential zoning districts.\n\n(G)\n\nWater conservation practices must be followed, at minimum in accordance with Chapter\n6-4 (Water Conservation) of the City Code.\n\n(H)\n\nThe use of synthetic inputs is prohibited. An Integrated Pest Management Plan, developed\nin accordance with the Environmental Criteria Manual and approved by the Watershed\nProtection Department, must be followed.\n\n(I)\n\nAgricultural and value-added agricultural products raised by the farmer or produced\nwithin the State of Texas may be sold from the site or distributed off-site to buyers.\nAgricultural products and value-added agricultural products produced off-site by someone\nother than the farmer cannot exceed 20% of the retail space by area.\n\n(J)\n\nEmployees are permitted. The maximum number of full-time, non-seasonal employees is\ntwo for each full acre, plus two for the remaining portion of an acre, if any. This\ndoes not include the property owner.\n\n(K)\n\nThe residential character of the lot and dwelling must be maintained.\n\n(L)\n\nFor an urban farm use, a sign is permitted in accordance with Chapter 25-10-155 (Urban Farm Sign).\n\n(M)\n\nAgricultural education activities as referenced in Chapter 25-2-7 (Agricultural Uses Described) do not require a temporary use permit.\n\nSource: Ord. 000406-86; Ord. 031211-11; Ord. 20110210-018; Ord. 20131121-105, Pt. 3, 3-21-14.",
  "start_line": 27536,
  "end_line": 27614,
  "subsections": []
}