{
  "id": "25-2-648",
  "title": "PLANNED DEVELOPMENT AREA (PDA) PERFORMANCE STANDARDS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "\n3.2.1.\n  Uses and Regulations.\n\nThe permitted uses, conditional uses, and site development regulations for a planned\nunit development (PUD) district are established by the ordinance zoning property as\na PUD district, the accompanying land use plan, and this section. The council may\nrequire development phasing or the construction of off-site infrastructure.\n\n3.2.2.\n  Residential Uses.\n\nFor residential uses, a land use plan must include:\n\nA.\n\nthe type and location of each use;\n\nB.\n\nthe maximum density;\n\nC.\n\nfor multifamily development, the maximum floor to area ratio;\n\nD.\n\nthe maximum building height;\n\nE.\n\nthe minimum lot size and width; and\n\nF.\n\nother site development regulations that may be required by the council.\n\n3.2.3.\n  Nonresidential Uses.\n\nFor non-residential uses, a land use plan must include:\n\nA.\n\nthe type and location of each use;\n\nB.\n\nthe maximum floor area ratio, which may not be greater than the maximum floor to area\nratio permitted in the most restrictive base zoning district in which proposed use\nis permitted;\n\nC.\n\nthe maximum building height;\n\nD.\n\nthe minimum front yard and street side yard setbacks, which must be not less than\nthe greater of:\n\n1.\n\n25 feet for a front yard, and 15 feet for a street side yard; or\n\n2.\n\nthose required by Subchapter C, Article 10 (Compatibility Standards);\n\nE.\n\nthe number of curb cuts or driveways, which must be the minimum necessary for adequate\naccess to the site; and\n\nF.\n\nother site development regulations that may be required by the council.\n\n3.2.4.\n  Industrial Uses.\n\nAn industrial use must comply with the performance standards established by Section 25-2-648 (Planned Development Area (PDA) Performance Standards).\n\nSource: Ord. 20080618-098.",
  "start_line": 13633,
  "end_line": 13717,
  "subsections": []
}