{
  "id": "25-2-32",
  "title": "ZONING DISTRICTS AND MAP CODES",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "and (D) of Section 25-2-32 (Zoning Districts And Map Codes) are arranged in a hierarchy that begins with the LA base district as the most restrictive\ndistrict and ends with the LI base district as the least restrictive district.\n\n(B)\n\nA combining district is classified in the hierarchy of zoning districts according\nto the base district with which the combining district is combined.\n\n(C)\n\nSpecial purpose base districts are not included in the hierarchy described in this\nsection.\n\nSource: Section 13-2-25; Ord. 990225-70; Ord. 031211-11.\n\nThe purposes of the residential district designations are to:\n\n(1)\n\nreserve areas for residential occupancy and provide for a broad range of residential\ndensities and variety of housing types consistent with the Comprehensive Plan and\nstandards of public health, safety, and welfare;\n\n(2)\n\nensure adequate light, air, privacy, and open space for each dwelling;\n\n(3)\n\nencourage compatibility between residential uses and other land uses;\n\n(4)\n\nfacilitate the planning for and provision of infrastructure improvements to serve\nanticipated population, dwelling unit density, traffic generation, and public service\nrequirements; and\n\n(5)\n\npromote energy conservation.\n\nSource: Section 13-2-40; Ord. 990225-70; Ord. 031211-11.\n\nThere are 16 residential district designations. The designation established for a\nproposed use is based on:\n\n(1)\n\ndensity;\n\n(2)\n\nlot size;\n\n(3)\n\nterrain;\n\n(4)\n\nenvironmental conditions;\n\n(5)\n\nlocation;\n\n(6)\n\nsurrounding uses;\n\n(7)\n\npublic infrastructure; and\n\n(8)\n\nother factors determined to be relevant by the council.\n\nSource: Sections 13-2-40 through 13-2-56; Ord. 990225-70; Ord. 031211-11.\n\nLake Austin residence (LA) district is the designation for a low density single-family\nresidential use on a lot that is a minimum of one acre and that is located 1,000 feet\nor less, measured horizontally, from the 492.8 foot topographic contour line on either\nside of Lake Austin.\n\nSource: Section 13-2-41; Ord. 990225-70; Ord. 031211-11.\n\nRural residence (RR) district is the designation for a low density residential use\non a lot that is a minimum of one acre. An RR district designation may be applied\nto a use in an area for which rural characteristics are desired or an area whose terrain\nor public service capacity require low density.\n\nSource: Section 13-2-42; Ord. 990225-70; Ord. 031211-11.\n\nSingle-family residence large lot (SF-1) district is the designation for a low density\nsingle-family residential use on a lot that is a minimum of 10,000 square feet. An\nSF-1 district designation may be applied to a use on land with sloping terrain or\nenvironmental limitations that preclude standard lot size or to a use in an existing\nresidential development on a lot that is 10,000 square feet or more.\n\nSource: Section 13-2-43; Ord. 990225-70; Ord. 031211-11.\n\nSingle-family residence standard lot (SF-2) district is the designation for a moderate\ndensity single-family residential use on a lot that is a minimum of 5,750 square feet.\nAn SF-2 district designation may be applied to a use in an existing single-family\nneighborhood that has moderate sized lots or to new development of single-family housing\non lots that are 5,750 square feet or more.\n\nSource: Section 13-2-44; Ord. 990225-70; Ord. 031211-11.\n\nFamily residence (SF-3) district is the designation for a moderate density single-family\nresidential use and a duplex use on a lot that is a minimum of 5,750 square feet.\nAn SF-3 district designation may be applied to a use in an existing single-family\nneighborhood with moderate sized lots or to new development of family housing on lots\nthat are 5,750 square feet or more. A duplex use that is designated as an SF-3 district\nis subject to development standards that maintain single-family neighborhood characteristics.\n\nSource: Section 13-2-45; Ord. 990225-70; Ord. 031211-11.\n\nSingle-family residence small lot (SF-4A) district is the designation for a moderate\ndensity single-family residential use on a lot that is a minimum of 3,600 square feet.\nAn SF-4A district use is subject to development standards that maintain single family\nneighborhood characteristics.\n\nSource: Section 13-2-46; Ord. 990225-70; Ord. 031211-11.\n\nSingle-family residence condominium site (SF-4B) district is the designation for a\nmoderate density single-family residential use on a site surrounded by existing structures,\nmost of which are single-family residences. An SF-4B district use is subject to development\nstandards that maintain single family neighborhood characteristics. An SF-4B district\ndesignation may only be applied to a use at a proposed location if the existing use\nat the location is designated as an urban family (SF-5) or less restrictive district.\n\nSource: Section 13-2-47; Ord. 990225-70; Ord. 031211-11.\n\nUrban family residence (SF-5) district is the designation for a moderate density single-family\nresidential use on a lot that is a minimum of 5,750 square feet. A duplex, two-family,\ntownhouse, or condominium residential use is permitted in an SF-5 district under development\nstandards that maintain single family neighborhood characteristics. An SF-5 district\ndesignation may be applied to a use in an existing family residential neighborhood\nin a centrally located area of the City. An SF-5 district may be used as a transition\nbetween a single family and multifamily residential use or to facilitate the implementation\nof City affordable housing programs.\n\nSource: Section 13-2-48; Ord. 990225-70; Ord. 031211-11.\n\nTownhouse and condominium residence (SF-6) district is the designation for a moderate\ndensity single family, duplex, two-family, townhouse, and condominium use that is\nnot subject to the spacing and location requirements for townhouse and condominium\nuse in an SF-5 district. An SF-6 district designation may be applied to a use in an\narea with large lots that have access to streets other than minor residential streets.\nAn SF-6 district may be used as a transition between a single family and multifamily\nresidential use.\n\nSource: Section 13-2-49; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence limited density (MF-1) district is the designation for a multifamily\nuse with a maximum density of up to 17 units per acre, depending on unit size. An\nMF-1 district designation may be applied to a use in a residential neighborhood that\ncontains a mixture of single family and multifamily uses or in an area for which limited\ndensity multifamily use is desired. An MF-1 district may be used as a transition between\na single family and higher intensity uses.\n\nSource: Section 13-2-50; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence low density (MF-2) district is the designation for a multifamily\nuse with a maximum density of up to 23 units per acre, depending on unit size. An\nMF-2 district designation may be applied to a use in a multifamily residential area\nlocated near single family neighborhoods or in an area for which low density multifamily\nuse is desired.\n\nSource: Section 13-2-51; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence medium density (MF-3) district is the designation for multifamily\nuse with a maximum density of up to 36 units per acre, depending on unit size. An\nMF-3 district designation may be applied to a use in a multifamily residential area\nlocated near supporting transportation and commercial facilities in a centrally located\narea or in an area for which medium density multifamily use is desired.\n\nSource: Section 13-2-52; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence moderate - high density (MF-4) district is the designation for\nmultifamily and group residential use with a maximum density of 36 to 54 units per\nacre, depending on unit size. An MF-4 district designation may be applied to high\ndensity housing in a centrally located area near supporting transportation and commercial\nfacilities, in an area adjacent to the central business district or a major institutional\nor employment center, or in an area for which moderate to high density multifamily\nuse is desired.\n\nSource: Section 13-2-53; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence high density (MF-5) district is the designation for multifamily\nand group residential use with a maximum density of up to 54 units per acre, depending\non unit size. An MF-5 district designation may be applied to a use in a centrally\nlocated area near supporting transportation and commercial facilities, an area adjacent\nto the central business district or a major institutional or employment center, or\nan area for which high density multifamily use is desired.\n\nSource: Section 13-2-54; Ord. 990225-70; Ord. 031211-11.\n\nMultifamily residence highest density (MF-6) district is the designation for multifamily\nand group residential use. An MF-6 district designation may be applied to a use in\na centrally located area near supporting transportation and commercial facilities,\nan area adjacent to the central business district or a major institutional or employment\ncenter, or an area for which the high density multifamily use is desired.\n\nSource: Section 13-2-55; Ord. 990225-70; Ord. 031211-11.\n\nMobile home residence (MH) district is the designation for a mobile home residence\npark and mobile home subdivision use. An MH use is subject to standards that promote\na residential environment and compatibility with adjoining family residence neighborhoods.\n\nSource: Section 13-2-56; Ord. 990225-70; Ord. 031211-11.\n\nThe purposes of the commercial district designations are to:\n\n(1)\n\nreserve areas for offices, retail stores, and service establishments that provide\na broad range of goods and services to residents of Austin and the surrounding area;\n\n(2)\n\npromote the grouping of office and commercial uses that are convenient for the public\nand that benefit the uses in a district;\n\n(3)\n\nensure adequate access and off-street loading for office and commercial uses and minimize\ntraffic congestion and other adverse effects on nearby land uses;\n\n(4)\n\nencourage high standards of site planning, architecture, and landscape design for\noffice and commercial development in the City;\n\n(5)\n\nfacilitate the planning for and provision of infrastructure improvements to meet traffic,\ncommercial, and public service needs generated by the residents of Austin; and\n\n(6)\n\npromote energy conservation.\n\nSource: Section 13-2-60; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 2, 11-13-23.\n\nThere are 13 commercial district designations. The designation established for a proposed\ncommercial use is based on:\n\n(1)\n\ntype of use;\n\n(2)\n\ncustomer base;\n\n(3)\n\nlocation;\n\n(4)\n\nsurrounding uses;\n\n(5)\n\ntraffic generation; and\n\n(6)\n\nother factors determined to be relevant by the council.\n\nSource: Sections 13-2-60 through 13-2-73; Ord. 990225-70; Ord. 031211-11.\n\nNeighborhood office (NO) district is the designation for a small office use that serves\nneighborhood or community needs, is located in or adjacent to a residential neighborhood\nand on a collector street that has a width of 40 feet or more, and does not unreasonably\naffect traffic. An office in an NO district may contain not more than one use. Site\ndevelopment regulations applicable to an NO district use are designed to preserve\ncompatibility with existing neighborhoods through renovation and modernization of\nexisting structures.\n\nSource: Section 13-2-61; Ord. 990225-70; Ord. 031211-11.\n\nLimited office (LO) district is the designation for an office use that serves neighborhood\nor community needs and that is located in or adjacent to residential neighborhoods.\nAn office in an LO district may contain one or more different uses. Site development\nregulations and performance standards applicable to an LO district use are designed\nto ensure that the use is compatible and complementary in scale and appearance with\nthe residential environment.\n\nSource: Section 13-2-62; Ord. 990225-70; Ord. 031211-11.\n\nGeneral office (GO) district is the designation for an office or commercial use that\nserves community and city-wide needs. A building in a GO district may contain one\nor more different uses.\n\nSource: Section 13-2-63; Ord. 990225-70; Ord. 031211-11.\n\nCommercial recreation (CR) district is the designation for a commercial or recreation\nuse that serves visitors to major recreational areas, including Lake Travis and Lake\nAustin. Site development regulations applicable to a CR district use are designed\nto minimize visual and environmental disruptions of scenic views.\n\nSource: Section 13-2-64; Ord. 990225-70; Ord. 031211-11.\n\nNeighborhood commercial (LR) district is the designation for a commercial use that\nprovides business service and office facilities for the residents of a neighborhood.\nSite development regulations and performance standards applicable to a LR district\nuse are designed to ensure that the use is compatible and complementary in scale and\nappearance with the residential environment.\n\nSource: Section 13-2-65; Ord. 990225-70; Ord. 031211-11.\n\nCommunity commercial (GR) district is the designation for an office or other commercial\nuse that serves neighborhood and community needs and that generally is accessible\nfrom major traffic ways.\n\nSource: Section 13-2-66; Ord. 990225-70; Ord. 031211-11.\n\nLake commercial (L) district is the designation for a use located near Town Lake.\nAn L district designation may be applied to a development that includes any combination\nof office retail, commercial, and residential uses. Use and site development regulations\napplicable to an L district use are designed to ensure that the use is compatible\nand complementary with the Town Lake environment.\n\nSource: Section 13-2-67; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nCentral business district (CBD) is the designation for an office, commercial, residential,\nor civic use located in the downtown area.\n\n(B)\n\nSite development regulations applicable to a CBD district use are designed to:\n\n(1)\n\nensure that a CBD use is compatible with the commercial, cultural, historical, and\ngovernmental significance of downtown and preserves selected views of the Capitol;\n\n(2)\n\npromote the downtown area as a vital commercial retail area;\n\n(3)\n\ncreate a network of pleasant public spaces and pedestrian amenities in the downtown\narea;\n\n(4)\n\nenhance existing structures, historic features, and circulation patterns in the downtown\narea; and\n\n(5)\n\nconsider significant natural features and topography in the downtown area.\n\nSource: Section 13-2-68; Ord. 990225-70; Ord. 031211-11.\n\nDowntown mixed use (DMU) district is the designation for a use located on the periphery\nof an area that has a CBD designation. A DMU district designation may be applied to\na development that includes any combination of office retail, commercial, and residential\nuses and that is compatible with the downtown area. A DMU district use with an intermediate\ndensity may be used as a transition between the downtown area and surrounding districts.\nA DMU district is suitable for an area to which the central business district may\nexpand.\n\nSource: Section 13-2-69; Ord. 990225-70; Ord. 031211-11.\n\nWarehouse/limited office (W/LO) district is the designation for an office or warehouse\nuse for a building trade or other business that does not require a highly visible\nlocation or generate substantial volumes of heavy truck traffic, that generates low\nor moderate vehicular trips, and that requires less access than a retail use. A W/LO\ndistrict use may require special measures to be compatible with adjacent uses. A W/LO\ndistrict use may be located on a site that is adjacent to or near an arterial or major\nnonresidential collector street, adjacent to a rail line, or near existing or proposed\nemployment uses. A W/LO district use may also be located on a site that functions\nas a transition between commercial and industrial uses. A W/LO district use may be\nlocated adjacent to a residential use only if the density of the residential development\nis higher than a typical single-family density or if the physical conditions of the\nsite allow for buffering and project design to mitigate potential adverse effects.\n\nSource: Section 13-2-70; Ord. 990225-70; Ord. 031211-11.\n\nGeneral commercial services (CS) district is the designation for a commercial or industrial\nuse of a service nature that has operating characteristics or traffic service requirements\nthat are incompatible with residential environments.\n\nSource: Section 13-2-71; Ord. 990225-70; Ord. 031211-11.\n\nCommercial-liquor sales (CS-1) district is the designation for a commercial or industrial\nuse of a service nature that has operating characteristics or traffic service requirements\nthat are incompatible with residential environments. Liquor sales is one of the permitted\nuses in a CS-1 district.\n\nSource: Section 13-2-72; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nCommercial highway services (CH) district is the designation for a use that has operating\nand traffic generation characteristics that require that the use be located at the\nintersection of state maintained highways other than scenic arterial roadways. A CH\ndistrict designation may be applied to a single major mixed use development of a service\nnature that includes any combination of office, retail, commercial, and residential\nuses. A CH district may include a high density residential use. Site development regulations\nand performance standards applicable to a CH district are designed to ensure adequate\naccess to and from all uses.\n\n(B)\n\nA CH district may be located along the following highway corridors:\n\n(1)\n\nIH-35;\n\n(2)\n\nUS-183;\n\n(3)\n\nUS-290 (including Ben White Boulevard);\n\n(4)\n\nSH-71;\n\n(5)\n\nFM-1325 north of US-183; and\n\n(6)\n\nLoop 1, at least 400 feet north of the northernmost right-of-way line of US 183.\n\nSource: Section 13-2-73; Ord. 990225-70; Ord. 031211-11.\n\nThe purposes of the industrial district designation are to:\n\n(1)\n\nreserve areas for industrial use and protect the uses from intrusion by dwellings\nand other incompatible uses;\n\n(2)\n\nprotect residential, commercial, and nuisance-free nonhazardous industrial uses from\nthe adverse effects of certain industrial uses;\n\n(3)\n\nensure adequate access and off-street loading and minimize traffic congestion and\nother adverse effects on nearby land uses; and\n\n(4)\n\nfacilitate the planning for and provision of infrastructure improvements to meet traffic,\ncommercial, and public service needs generated by the residents of the City.\n\nSource: Section 13-2-80; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 3, 11-13-23.\n\nThere are four industrial district designations. The designation established for a\nproposed use is based on:\n\n(1)\n\nproposed use;\n\n(2)\n\nlocation;\n\n(3)\n\nsite size; and\n\n(4)\n\nother factors determined to be relevant by the council.\n\nSource: Sections 13-2-80 through 13-2-84; Ord. 990225-70; Ord. 031211-11.\n\nIndustrial park (IP) district is the designation for a limited commercial service\nuse, research and development use, administrative use, or manufacturing use that meets\nstrict development and performance standards and is generally located on a large site\nor in a planned industrial center.\n\nSource: Section 13-2-81; Ord. 990225-70; Ord. 031211-11.\n\nMajor industry (MI) district is the designation for a commercial service use, research\nand development use, administrative use, or manufacturing use generally located on\na large site planned for major industrial development.\n\nSource: Section 13-2-82; Ord. 990225-70; Ord. 031211-11.\n\nLimited industrial service (LI) district is the designation for a commercial service\nuse or limited manufacturing use generally located on a moderately-sized site.\n\nSource: Section 13-2-83; Ord. 990225-70; Ord. 031211-11.\n\nResearch and development (R&D) district is the designation for a research use located\non a site with a campus-style design. An R&D district designation may be applied to\ntesting services, research warehousing services, or research assembly services. An\nR&D district use may not include fabrication, processing, manufacturing, refining,\nor resource extraction.\n\nSource: Section 13-2-84; Ord. 990225-70; Ord. 031211-11.\n\nAgricultural (AG) district is the designation for an agriculture use or an agriculture-related\nuse. The purpose of the AG district designation is to preserve areas of prime agricultural\nsoils, concentrate urban development in and around growth centers, promote compact\nurban development, and preserve the environment and open spaces.\n\nSource: Section 13-2-92; Ord. 990225-70; Ord. 031211-11.\n\nAviation services (AV) district is the designation for an airport-related use that\nrequires direct access to airport facilities or that is compatible with or supports\nairport operations and services. An AV district designation may be applied to major\npublic airport facilities, including airport-related uses on public lands and on private\nlands adjoining airport facilities.\n\nSource: Section 13-2-91; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDevelopment reserve (DR) district is a designation for a temporary use or a use that\nwill not commit land to a particular use pattern or intensity.\n\n(B)\n\nA DR district designation may be applied to a use located on land for which:\n\n(1)\n\nadequate public services or facilities are not available;\n\n(2)\n\neconomic, demographic, and geographic data is not available; or\n\n(3)\n\nland use and urban development policies have not been completed.\n\nSource: Section 13-2-90; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nPlanned unit development (PUD) district is the designation for a large or complex\nsingle or multi-use development that is planned as a single contiguous project and\nthat is under unified control.\n\n(B)\n\nThe purpose of a PUD district designation is to preserve the natural environment,\nencourage high quality development and innovative design, and ensure adequate public\nfacilities and services for development within a PUD.\n\n(C)\n\nA PUD district designation provides greater design flexibility by permitting modifications\nof site development regulations. Development under the site development regulations\napplicable to a PUD must be superior to the development that would occur under conventional\nzoning and subdivision regulations.\n\n(D)\n\nA PUD district must include at least 10 acres of land, unless the property is characterized\nby special circumstances, including unique topographic constraints.\n\nSource: Section 13-2-93; Ord. 990225-70; Ord. 031211-11.\n\nPublic (P) district is the designation for a governmental, civic, public service,\nor public institution use. A P district designation may be applied to a use located\non property used or reserved for a civic or public institutional purpose or for a\nmajor public facility, regardless of ownership of the land on which the use is located.\nA P district designation may not be applied to government-owned property that is leased\nto a nongovernmental agency for a use other than a governmental service or for a use\nthat supports a primary civic or public institutional use.\n\nSource: Section 13-2-94; Ord. 990225-70; Ord. 031211-11.\n\nTraditional neighborhood (TN) district is the designation for a compact, mixed-use\ndevelopment that reflects the urban design practices that existed in the United States\nfrom colonial times until the 1940's. The TN district is governed by Chapter 25-3 (Traditional Neighborhood District).\n\nSource: Section 13-2-95; Ord. 990225-70; Ord. 031211-11.\n\nTransit oriented development (TOD) district is the designation for an identified transit\nstation and the area around it. The district provides for development that is compatible\nwith and supportive of public transit and a pedestrian-oriented environment.\n\nSource: Ord. 20050519-008.\n\n(A)\n\nNorth Burnet/Gateway (NBG) district is the designation for an identified area of existing\nlow density, auto-oriented commercial, warehouse, and industrial uses that is the\nsubject of an approved master plan for redevelopment of the area into a higher density\nurban mixed-use neighborhood that is more pedestrian friendly and takes advantage\nof the links to commuter rail transit and the area's key position in the urban core.\n\n(B)\n\nAn NBG designation may be applied only within the North Burnet/Gateway neighborhood\nplan area.\n\nSource: Ord. 20090312-035.\n\n(A)\n\nEast Riverside Corridor (ERC) district is the designation for an identified area of\nexisting auto-oriented commercial and multifamily uses that is the subject of an approved\nmaster plan for redevelopment of the area into an urban mixed-use neighborhood that\nis more pedestrian friendly and takes advantage of access to existing and future transit\noptions and the area's key position in the urban core.\n\n(B)\n\nAn ERC designation may be applied only within the boundaries identified in the East\nRiverside Corridor Regulating Plan.\n\nSource: Ord. 20130509-039.\n\n(A)\n\nThe purpose of the Capitol dominance (CD) overlay district is to protect the visual\nand symbolic significance of the State Capitol by keeping buildings in close proximity\nto the Capitol from dominating the structure.\n\n(B)\n\nThe CD overlay district applies to all property in a one-quarter mile radius of the\nState Capitol dome.\n\nSource: Section 13-2-171; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the Capitol view corridor (CVC) overlay district is to preserve the\nview of the State Capitol Building by limiting the height of structures located in\nthe capitol view corridors.\n\n(B)\n\nThe CVC overlay district applies to all property in the capital view corridors described\nin Appendix A of this chapter.\n\nSource: Section 13-2-145 (a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of a central urban redevelopment (CURE) combining district is to promote\nthe stability of neighborhoods in the central urban area.\n\n(B)\n\nA CURE combining district may be used:\n\n(1)\n\nfor sustainable redevelopment of homes, multifamily housing, and small businesses;\n\n(2)\n\nto accommodate high priority projects that enhance the stability of urban neighborhoods\nincluding the development of affordable housing and small businesses along principal\ntransportation routes that serve a neighborhood;\n\n(3)\n\nto improve the natural environment; and\n\n(4)\n\nto encourage high quality development with architectural design and proportion compatible\nwith the neighborhood.\n\nSource: Section 13-2-180; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of a conditional overlay (CO) combining district is to modify use and\nsite development regulations to address the specific circumstances presented by a\nsite.\n\n(B)\n\nA CO combining district may be used to:\n\n(1)\n\npromote compatibility between competing or potentially incompatible uses;\n\n(2)\n\nease the transition from one base district to another;\n\n(3)\n\naddress land uses or sites with special requirements; and\n\n(4)\n\nguide development in unique circumstances.\n\nSource: Section 13-2-120; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the Congress Avenue (CA) overlay district is to protect the historic\ncharacter and symbolic significance of Congress Avenue and to enhance the pedestrian\nenvironment of the area.\n\n(B)\n\nThe CA overlay district applies to all property zoned CBD or DMU that is between the\nalleys on each side of and parallel to Congress Avenue from First Street to Eleventh\nStreet.\n\nSource: Section 13-2-172; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the Convention Center overlay district is to protect and enhance the\nhealth, safety, and welfare of the public, to promote pedestrian activity and vitality\nin the Convention Center area, and to protect the existing character of the area.\n\n(B)\n\nExcept as otherwise provided in Subsection (C), the Convention Center overlay district\napplies to the land bounded on the west by the boundary line for the Congress Avenue\ncombining district; on the north by the boundary line for the East Sixth/Pecan Street\ncombining district and extending eastward across IH-35 to Waller Street; on the east\nby Waller Street and an imaginary centerline of Waller Street, if that street were\nextended in a straight line south to intersect the shoreline of Town Lake; and on\nthe south by the north Town Lake shoreline.\n\n(C)\n\nProperty in the following areas is excluded from the Convention Center overlay district\nif the property was owned by a governmental entity on February 20, 1994 or is owned\nby a governmental entity at the time an application for a development permit is filed\nand if the property is used for a governmental tax-exempt purpose:\n\n(1)\n\nthe land bounded by East 4th Street on the north, East 3rd Street on the south, Trinity\nStreet on the west, and Red River Street on the east;\n\n(2)\n\nthe land bounded by East 5th Street on the north, East 4th Street on the south, IH-35\non the west, and Waller Street on the east; and\n\n(3)\n\nthe area bounded by East 2nd Street on the north, East 1st Street on the south, Red\nRiver Street on the west, and Sabine Street on the east.\n\nSource: Section 13-2-176; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the downtown creeks (DC) overlay district is to promote public accessibility\nto the creeks, to promote pedestrian use of the creeks, and to protect and enhance\nthe scenic character of the creek corridors.\n\n(B)\n\nThe DC overlay district applies to property within 60 feet of the centerline of creeks\nthat is located within the CBD or DMU base districts.\n\nSource: Section 13-2-175; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the downtown parks (DP) overlay district is to enhance the pedestrian\nuse and vitality of downtown parks and to establish a unique urban design identity\nassociated with the public open spaces.\n\n(B)\n\nThe DP overlay district applies to property zoned CBD or DMU that is within:\n\n(1)\n\n60 feet of the public right-of-way surrounding Republic Square;\n\n(2)\n\n60 feet of the public right-of-way surrounding Brush Square; or\n\n(3)\n\n60 feet of the public right-of-way surrounding Wooldridge Square.\n\nSource: Section 13-2-174; Ord. 990225-70; Ord. 030612-93; Ord. 031211-11.\n\n(A)\n\nThe purpose of the East Austin (EA) overlay district is to reduce the concentration\nof intensive commercial and industrial uses in close proximity to residential areas\nin East Austin and to mitigate the effect of commercial and industrial uses on nearby\nresidential uses.\n\n(B)\n\nExcept as provided in Subsection (C), the EA overlay district applies to property\nlocated in the area bounded by Interregional Highway 35, Airport Boulevard, and Town\nLake.\n\n(C)\n\nThe EA overlay district does not apply to land included in a neighborhood plan combining\ndistrict.\n\nSource: Section 13-2-190; Ord. 990225-70; Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nThe purpose of the East Sixth/Pecan Street (PS) overlay district is to protect the\nhistoric character of East Sixth/Pecan Street and to enhance the pedestrian environment\nof the area.\n\n(B)\n\nThe PS overlay district applies to all property zoned CBD or DMU that is located between\nthe alleys and the extension of alley lines on each side of and parallel to East Sixth\nStreet from IH-35 to the first alley east of and parallel to Congress Avenue.\n\nSource: Section 13-2-173; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of a historic landmark (H) combining district is to protect, enhance,\nand preserve individual structures or sites that are of architectural, historical,\narchaeological, or cultural significance.\n\n(B)\n\nThe purpose of a historic area (HD) combining district is to protect, enhance, and\npreserve areas that include structures or sites that are of architectural, historical,\narchaeological, or cultural significance.\n\nSource: Section 13-2-1 and 13-2-100; Ord. 990225-70; Ord. 031211-11; Ord. 041202-16.\n\nMixed use (MU) combining districts and vertical mixed use (VMU) overlay districts\nare described and governed by Subchapter E, Article 4 (Mixed Use).\n\nSource: Sections 13-2-165; Ord. 990225-70; Ord. 031211-11; Ord. 20060831-068.\n\nThe purpose of a neighborhood conservation (NC) combining district is to preserve\nneighborhoods with distinctive architectural styles that were substantially built\nout at least 30 years before the date an application for an NC combining district\nclassification is filed.\n\nSource: Section 13-2-130; Ord. 990225-70; Ord. 031211-11.\n\nThe purpose of a planned development area (PDA) combining district is to:\n\n(1)\n\nprovide for industrial and commercial uses in certain commercial and industrial base\ndistricts; or\n\n(2)\n\nincorporate the terms of a planned development area agreement into a zoning ordinance\nfollowing annexation of a property that is subject to a planned development area agreement.\n\nSource: Section 13-2-150; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the waterfront overlay (WO) district is to promote the harmonious interaction\nand transition between urban development and the park land and shoreline of Town Lake\nand the Colorado River.\n\n(B)\n\nThe WO district applies to all property in its boundaries.\n\n(C)\n\nThe boundaries of the WO district are identified in Appendix B of this chapter.\n\nSource: Section 13-2-160(a); Ord. 990225-70; Ord. 031211-11.\n\nThe purpose of a neighborhood plan (NP) combining district is to allow infill development\nby implementing a neighborhood plan that has been adopted by the council as an amendment\nto the comprehensive plan.\n\nSource: Ord. 000406-81; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of the criminal justice center (CJC) overlay district is to mitigate the\neffects of the criminal justice center on the surrounding neighborhood by restricting\ncertain land uses.\n\n(B)\n\nThe CJC overlay district applies to the area generally bounded on the north by 13th\nStreet, on the east by Guadalupe Street, on the south by 7th Street, and on the west\nby Shoal Creek Boulevard. The official map of the district is on file with the director\nof the Neighborhood Planning and Zoning Department, who shall resolve uncertainty\nregarding the boundary of the district.\n\nSource: Ord. 010426-48; Ord. 031211-11.\n\n(A)\n\nThe purpose of the Barton Springs Zone (BSZ) overlay district is to preserve the natural\nbeauty of the Hill Country, protect the image and character of the neighborhoods in\nthe district, and reduce the negative effects of urbanization by restricting the scale\nand intensity of retail development.\n\n(B)\n\nThe BSZ overlay district applies to the portion of the Barton Springs Zone, as described\nin Section 25-8-2 (Descriptions of Regulated Areas), that is within the city's zoning jurisdiction.\n\nSource: Ord. 031204-57; Ord. 031211-11.\n\n(A)\n\nThe purpose of the university neighborhood overlay (UNO) district is to promote high\ndensity redevelopment in the area generally west of the University of Texas campus,\nprovide a mechanism for the creation of a densely populated but livable and pedestrian\nfriendly environment, and protect the character of the predominantly single-family\nresidential neighborhoods adjacent to the district.\n\n(B)\n\nThe UNO district consists of the following subdistricts:\n\n(1)\n\ninner west campus subdistrict;\n\n(2)\n\nouter west campus subdistrict;\n\n(3)\n\nGuadalupe subdistrict; and\n\n(4)\n\nDobie subdistrict.\n\n(C)\n\nThe boundaries of the UNO district and each subdistrict are identified in Appendix\nC (University Neighborhood Overlay District Boundaries, Subdistrict Boundaries, And Height\nLimits) of this chapter.\n\nSource: Ord. 040902-58.\n\n(A)\n\nThe purpose of the Lake Austin (LA) overlay district is to protect the scenic, recreational,\nand environmental benefits of Lake Austin by restricting the scale and intensity of\ndevelopment near the lake.\n\n(B)\n\nThe boundaries of the Lake Austin (LA) overlay district include land that is located",
  "start_line": 10680,
  "end_line": 11655,
  "subsections": [
    "25-2-32-B",
    "25-2-32-C",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-C",
    "25-2-32-D",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-C",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-C",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-C",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-A",
    "25-2-32-B",
    "25-2-32-C",
    "25-2-32-A",
    "25-2-32-B"
  ]
}