{
  "id": "25-2-subchapter-F",
  "title": ": - RESIDENTIAL DESIGN AND COMPATIBILITY STANDARDS",
  "level": 1,
  "parent_id": null,
  "content": "## SUBCHAPTER F: - RESIDENTIAL DESIGN AND COMPATIBILITY STANDARDS.\n\nThis Subchapter is intended to minimize the impact of new construction, remodeling,\nand additions to existing buildings on surrounding properties in residential neighborhoods\nby defining an acceptable buildable area for each lot within which new development\nmay occur. The standards are designed to protect the character of Austin's older neighborhoods\nby ensuring that new construction and additions are compatible in scale and bulk with\nexisting neighborhoods.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022.\n\nExcept as provided in Section 1.3, this Subchapter applies to property that is:\n\n1.2.1.\n  Within the area bounded by:\n\nA.\n\nHighway 183 from Loop 360 to Ben White Boulevard;\n\nB.\n\nBen White Boulevard from Highway 183 to South Interstate Highway 35;\n\nC.\n\nSouth Interstate Highway 35 from Ben White Boulevard to William Cannon Drive;\n\nD.\n\nWilliam Cannon Drive from South Interstate Highway 35 to Manchaca Road;\n\nE.\n\nManchaca Road from William Cannon Drive to Ben White Boulevard;\n\nF.\n\nBen White Boulevard from Manchaca Road to Loop 360;\n\nG.\n\nLoop 360 from Ben White Boulevard to Loop 1;\n\nH.\n\nLoop 1 from Loop 360 to the Colorado River;\n\nI.\n\nThe Colorado River from Loop 1 to Loop 360; and\n\nJ.\n\nLoop 360 from the Colorado River to Highway 183; and\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubChF-1-2-1.png)\n\n1.2.2.\n  Used for a:\n\nA.\n\nBed and breakfast (group 1) residential use;\n\nB.\n\nBed and breakfast (group 2) residential use;\n\nC.\n\nCottage special use;\n\nD.\n\nSecondary apartment special use;\n\nE.\n\nSingle-family attached residential use;\n\nF.\n\nSingle-family residential use;\n\nG.\n\nSmall lot single-family residential use;\n\nH.\n\nUrban home special use;\n\nI.\n\nClub or lodge;\n\nJ.\n\nDaycare services (general and limited);\n\nK.\n\nCondo residential;\n\nL.\n\nRetirement housing (small and large site); or\n\nM.\n\nTownhouse residential.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093; Ord. 20100805-051; Ord. No. 20231207-001, § 16, 12-18-23.\n\n1.3.1.\n\nThis Subchapter does not apply to a lot zoned as a single-family residence small lot\n(SF-4A) district unless the lot is adjacent to property zoned as a single-family residence\nstandard lot (SF-1), single-family residence standard lot (SF-2) district, or family\nresidence (SF-3) district.\n\n1.3.2.\n\nThis Subchapter does not apply to the approximately 698.7 acres of land known as the\nMueller Planned Unit Development, which was zoned as a planned unit development (PUD)\ndistrict by Ordinance Number 040826-61.\n\n1.3.3.\n\nA use listed in Subsections 1.2.2(I)—(M) of Section 1.2 may comply with this subchapter\nor the requirements of Chapter 25-2, Article 10 (Compatibility Standards).\n\n1.3.4.\n\nThis Subchapter does not apply to a property zoned Downtown mixed use (DMU) district,\nCentral business district (CBD), East Riverside Corridor (ERC) district, or transit\noriented development (TOD) district.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093; Ord. No. 20150212-085, Pt. 2, 2-23-15; Ord. No. 20151015-071, Pt. 1, 10-26-15; Ord. No. 20240516-004, Pt. 2, 7-15-24.\n\n1.4.1.\n\nTo the extent of conflict, this Subchapter supersedes:\n\nA.\n\nSection 25-1-21 (Definitions);\n\nB.\n\nSection 25-2-492 (Site Development Regulations);\n\nC.\n\nSection 25-2-555 (Family Residence (SF-3) District Regulations);\n\nD.\n\nSection 25-2-773 (Duplex, Two-Unit and Three-Unit Residential Uses);\n\nE.\n\nSection 25-2-778 (Front Yard Setback for Certain Residential Uses);\n\nF.\n\nSection 25-2-779 (Small Lot Single-Family Residential Uses); and\n\nG.\n\nSection 25-4-232 (Small Lot Subdivisions).\n\n1.4.2.\n\nTo the extent of conflict, the following provisions supersede this Subchapter:\n\nA.\n\nSection 25-2-1424 (Urban Home Regulations);\n\nB.\n\nSection 25-2-1444 (Cottage Regulations);\n\nC.\n\nSection 25-2-1463 (Secondary Apartment Regulations); or\n\nD.\n\nThe provisions of an ordinance designating property as a:\n\n1.\n\nNeighborhood plan (NP) combining district;\n\n2.\n\nNeighborhood conservation (NC) combining district; or\n\n3.\n\nHistoric area (HD) combining district.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093; Ord. No. 20231207-001, Pt. 18, 12-18-23.\n\nThe maximum amount of development permitted on a property subject to this Subchapter\nis limited to the greater of 0.4 to 1.0 floor-to-area ratio or 2,300 square feet of\ngross floor area, as defined in Section 3.3. Floor-to-area ratio shall be measured\nusing gross floor area as defined in Section 3.3, except that the lot area of a flag\nlot is calculated consistent with the requirements of Section 25-1-22 (Measurements).\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093.\n\nExcept where these regulations are superseded, the maximum building height for development\nsubject to this Subchapter is:\n\n(A)\n\n32 feet for development located outside the 100-year floodplain; and\n\n(B)\n\n35 feet for development located in the 100-year floodplain.\n\nSection 25-2-531 (Height Limit Exceptions) does not apply to development subject to this Subchapter, except for a chimney,\nvent, antenna, or energy conservation or production equipment or feature not designed\nfor occupancy. Building height shall be measured under the requirements defined in\nSection 3.4.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. No. 20191114-064, Pt. 1, 11-25-19.\n\nA.\n\nMinimum Setback Required. The minimum front yard setback required for development\nsubject to this Subchapter is the lesser of:\n\n1.\n\nThe minimum front yard setback prescribed by the other provisions of this Code; or\n\n2.\n\nThe average front yard setback, if an average may be determined as provided in Subsection\nB. below.\n\nB.\n\nAverage Front Yard Setback. The following rules apply for purposes of the setback\ncalculation required by Paragraph A.2:\n\n1.\n\nA front yard setback is the distance between the front lot line and the closest front\nexterior wall or building façade of the principal residential structure located on\nthe lot.\n\n2.\n\nExcept as provided in paragraph 3, average front yard setback is determined using\nthe front yard setback of the four principal residential structures that are: (a)\nbuilt within fifty feet of the front lot line; and (b) closest to, and on the same\nside of the block, as the property subject to the setback required by this section.\n\n3.\n\nIf less than four structures satisfy the criteria in paragraph B.2, average front\nyard setback is calculated using the number of existing residential structures on\nthe same side of the street block as the property subject to the setback required\nby this section. If there are no structures on the same side of the block, average\nfront yard setback is calculated using the front yard setbacks of the four structures\non the opposite side of the block that are closest to the property subject to the\nsetback required by this section. If there are less than four structures on the opposite\nside of the block, the lesser number of structures is used in the calculation. See\nFigure 1.\n\n![Figure 1: Average Front Yard Setback](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig1.png)\n\nFigure 1: Average Front Yard Setback\n\nIn this example, the minimum required front setback in the underlying zoning district\nis 25 feet. However, because of the variety in existing setbacks of buildings on the\nsame block face, new development on lot C may be located with a setback of only 20\nfeet, which is the average of the setbacks of lots B, D, and E. The building on lot\nA is not included in the average because it is located more than 50 feet from the\nproperty line.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093.\n\nThe principal structure shall comply with the rear yard setback prescribed by other\nprovisions of this Code. All other structures shall comply with the rear yard setback\nprovisions of this Code, but the minimum rear yard setback of a second dwelling unit\nmay be reduced to five feet if the rear lot line is adjacent to an alley. See Figure\n2.\n\n![Figure 2: Rear Yard Setback](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig2.png)\n\nFigure 2: Rear Yard Setback\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093.\n\nAll structures shall comply with the side yard setbacks prescribed by other provisions\nof this Code.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022.\n\nThis subsection prescribes side and rear setback planes in order to minimize the impact\nof new development and rear development on adjacent properties. A structure may not\nextend beyond a setback plane except as authorized by subsection D. below. The height\nof a setback plane shall be measured under the requirements defined in Section 3.4.\n\nA.\n\nSide Setback Plane. Except as provided in subsection B. below, an inwardly sloping 45-degree angle side\nsetback plane begins at a horizontal line 15 feet directly above the side property\nline. The 15-foot height of the horizontal line is established for 40-foot deep portions\nof the lot beginning at the building line and extending to the rear of the lot, except\nthat the last portion at the rear of the lot may be less than 40 feet deep. See Figures\n3 through 5.\n\n1.\n\nFor the first portion, the 15-foot height of the horizontal line is measured at the\nhighest of the elevations of the four intersections of the side lot lines, the building\nline, and a line 40 feet from and parallel to the building line.\n\n2.\n\nFor successive portions other than the last portion, the 15-foot height of the horizontal\nline is measured at the highest of the elevations of the four intersections of the\nside lot lines and the appropriate two lines that are 40 feet apart and parallel to\nthe building line.\n\n3.\n\nFor the last portion, the 15-foot height of the horizontal line is measured at the\nhighest of the elevations of the four intersections of the side lot lines, the appropriate\nline parallel to the building line, and the rear lot line.\n\n![Figure 3: Side Setback Plane Measured From Side Property Line](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig3.png)\n\nFigure 3: Side Setback Plane Measured From Side Property Line\n\n![Figure 4: (Elevation View) Dividing Lot into 40-foot Portions to Create Side Setback Planes (Rear Setback Plane Not Shown)](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig4.png)\n\nFigure 4: (Elevation View) Dividing Lot into 40-foot Portions to Create Side Setback\nPlanes (Rear Setback Plane Not Shown)\n\n![Figure 5: Determining High Points on a Sloping Lot](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig5.png)\n\nFigure 5: Determining High Points on a Sloping Lot\n\nFor each portion of the side setback plane, the 15-foot height of the horizontal line\nis measured starting from the highest point of the four intersections defining the\nportion. In this example, topography lines indicate that the lot is sloping downward\nfrom the rear to the front of the lot, and from the right to the left. The high points\nfor Portions 1, 2, and 3 are indicated, along with the Building Line.\n\nB.\n\nRear Setback Plane. Except as provided in subsection D., an inwardly sloping 45-degree angle rear setback\nplane begins at a horizontal line directly above the rear property line at the same\nelevation as the horizontal line for the last portion of the side setback plane established\nin paragraph A.3. See Figures 6 through 9.\n\n![Figure 6: (Elevation View) Rear Setback Plane (Level Ground)](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig6.png)\n\nFigure 6: (Elevation View) Rear Setback Plane (Level Ground)\n\n![Figure 7: (Elevation View) Rear Setback Plane (Sloping Ground)](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig7.png)\n\nFigure 7: (Elevation View) Rear Setback Plane (Sloping Ground)\n\n![Figure 8: Side and Rear Setback Planes on Level Ground](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig8.png)\n\nFigure 8: Side and Rear Setback Planes on Level Ground\n\nThe side and rear setback planes form a \"tent\" over the lot, rising from the property\nlines for 15 feet and then angling in at 45-degree angles from the side and rear.\nThe required front, rear, and side yard setbacks are indicated by the darker shading\non the ground.\n\n![Figure 9: Side and Rear Setback Planes on Sloping Ground](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig9.png)\n\nFigure 9: Side and Rear Setback Planes on Sloping Ground\n\nC.\n\nBuildable Area. The buildable area, as defined in Section 3.3., consists of the smallest area within\nthe front, side, and rear yard setbacks; maximum height limit; and the combined side\nand rear setback planes. See Figures 10 and 11.\n\n![Figure 10: Buildable Area (Combination of Yard Setbacks, Maximum Height Limit, and Setback Planes)](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig10.png)\n\nFigure 10: Buildable Area (Combination of Yard Setbacks, Maximum Height Limit, and\nSetback Planes)\n\nThe heavy blue line indicates the \"tent\" formed by the side and rear setback planes.\nThe buildable area is the smallest area included within the front, side, and rear\nyard setbacks; maximum height limit; and the combined side and rear setback planes\n(shown here as the green area).\n\n![Figure 11: Buildable Area on Corner Lot](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig11.png)\n\nFigure 11: Buildable Area on Corner Lot\n\nThis figure shows the same concept illustrated in Figure 10 but for a corner lot that\nhas a greater street side yard setback requirement. In this example, the minimum required\nstreet side yard setback in the underlying zoning district is 15 feet. Because the\nside setback plane is measured from the side property line, the height of the setback\nplane is 30 feet at the 15-foot street side yard setback line.\n\nD.\n\nSide and Rear Setback Plane Exceptions for Existing One-Story Buildings.\n\n1.\n\nExcept as provided in paragraph 3 below, an applicant proposing to add a second story\nto a one-story building may choose either of the following side setback planes for\nthe portion of the project that is within the building footprint originally constructed,\nor permitted for original construction, before October 1, 2006:\n\na.\n\nThe side setback plane required under subsection A.\n\nb.\n\nThe inwardly sloping 45-degree angle side setback plane that begins at a horizontal\nline directly above the outermost side wall at a height equal to the height of the\nfirst floor wall plate that was originally constructed or received a building permit\nbefore October 1, 2006, plus 10 and one-half feet. See Figure 12. The wall plate is\nthe lowest point of the existing first floor ceiling framing that intersects the exterior\nwall.\n\n2.\n\nExcept as provided in paragraph 3 below, an applicant proposing to add a second story\nto a one-story building may choose either of the following rear setback planes for\nthe portion of the project that is within the building footprint originally constructed,\nor permitted for original construction, before October 1, 2006:\n\na.\n\nThe rear setback plane required under subsection B.\n\nb.\n\nAn inwardly sloping 45-degree angle rear setback plane that begins at a horizontal\nline directly above the rear property line at a height equal to the height of the\nfirst floor wall plate that was originally constructed or received a building permit\nbefore October 1, 2006, plus 10 and one-half feet.\n\n3.\n\nThe side setback plane required under subsection A, and the rear setback plane required\nunder subsection B, apply to:\n\na.\n\nany portion of the proposed construction that is outside of the building footprint\noriginally constructed, or permitted for original construction, before October 1,\n2006; and\n\nb.\n\nthe entire project, if any portion of the proposed construction requires the removal\nor demolition of exterior walls.\n\n![Figure 12: Side Setback Plane Exception for Existing Single-Story Buildings](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig12.png)\n\nFigure 12: Side Setback Plane Exception for Existing Single-Story Buildings\n\nThe side setback planes for an existing single-story building are determined based\non the height of the sidewall. In this example, the horizontal line that forms the\nbase of the setback plane is placed ten feet and six inches above the sidewall height\n(12 feet). The revised plane rises above the standard setback plane within the area\nof the building footprint. The standard setback planes created in Sections 2.6. A.\nand B. apply outside of the existing footprint.\n\nE.\n\nExceptions. A structure may not extend beyond a setback plane, except for:\n\n1.\n\nA roof overhang or eave, up to two feet beyond the setback plane;\n\n2.\n\nA chimney, vent, antenna, or energy conservation or production equipment or feature\nnot designed for occupancy; and\n\n3.\n\nEither:\n\na.\n\n30-Foot Side-Gabled Roof Exception. A side-gabled roof structure on each side of the building, with a total horizontal\nlength of not more than 30 feet, measured from the building line along the intersection\nwith the side setback plane (See Figure 13.); or\n\nb.\n\nGables Plus Dormers Exception.\n\n(i)\n\nGables or a shed roof, with a total horizontal length of not more than 18 feet on\neach side of the building, measured along the intersection with the setback plane\n(See Figures 14 and 17.); and\n\n(ii)\n\nDormers, with a total horizontal length of not more than 15 feet on each side of the\nbuilding, measured along the intersection with the setback plane. (See Figures 15\nand 16.)\n\n![Figure 13: Side-Gabled Rood Exception](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig13.png)\n\nFigure 13: Side-Gabled Rood Exception\n\nA side-gabled roof may project through the side setback plane for a horizontal distance\nof up to a maximum of 30 feet, measured from the building line. In this example, the\ngable intrudes into the setback plane beginning 9 feet behind the building line. Therefore,\nthe maximum length of the gable intrusion would be 21 feet.\n\n![Figure 14: 18-foot Exception for Shed Roof](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig14.png)\n\nFigure 14: 18-foot Exception for Shed Roof\n\n![Figure 15: Dormer Exception (Gable or Shed)](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig15.png)\n\nFigure 15: Dormer Exception (Gable or Shed)\n\nOne or more dormers with a combined width of 15 feet or less on each side of the roof\nmay extend beyond the setback plane. The width of the dormer is measured at the point\nthat it intersects the setback plane.\n\n![Figure 16: Dormer Exception (Gable or Shed)](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig16.png)\n\nFigure 16: Dormer Exception (Gable or Shed)\n\nOne or more dormers with a combined width of 15 feet or less on each side of the roof\nmay extend beyond the setback plane. The width of the dormer is measured at the point\nthat it intersects the setback plane.\n\n![Figure 17: Combination of Roof and Dormer Exceptions](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig17.png)\n\nFigure 17: Combination of Roof and Dormer Exceptions\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093; Ord. No. 20150507-042, Pt. 2, 5-18-15.\n\n2.7.1.\n\nExcept as provided in subsection 2.7.2, if a side wall of a building is more than\n15 feet high and is an average distance of less than nine feet from an interior lot\nline, the sidewall may not extend in an unbroken plane for more than 36 feet along\na side lot line without a sidewall articulation that meets the requirements of this\nsection.\n\nA.\n\nTo beak the plane, a sidewall articulation must:\n\n1.\n\nbe perpendicular to the side property line, at least four feet deep, and extend along\nthe side property line for at least 10 feet, as shown in Figures 18 through 20;\n\n2.\n\nextend the entire height of the first floor of an addition to, or remodel of, an existing\none-story building;\n\n3.\n\nextend the entire height of the second story of an addition to, or remodel of, a two\nor more story building;\n\n4.\n\nextend to the height of the top floor of a newly constructed building; and\n\n5.\n\nextend evenly upward for its entire height.\n\nB.\n\nA sidewall articulation cannot:\n\n1.\n\ncreate patios or decks or be screened from view; or\n\n2.\n\nserve as an eave or gutter.\n\nC.\n\nSidewall articulation required under this section may be satisfied by horizontal articulation,\nsuch that each story above the first story is setback further from the property line\nby at least nine feet and extends along the side property line for at least 10 feet.\n\nD.\n\nFor purposes of subsection 2.7.1, wall height:\n\n1.\n\nexcludes side gables; and\n\n2.\n\nis measured from the lower of natural or finished grade adjacent to the structure\nup to the first floor wall plate, which is the lowest point of the existing first\nfloor ceiling framing that intersects the exterior wall.\n\n2.7.2.\n\nThe requirements of this section do not apply to:\n\nA.\n\nAny side of a structure that is adjacent to a commercial use, unless the commercial\nuse is occupying a residential structure.\n\nB.\n\nAn addition to or remodel of an existing principal structure, or the construction\nof a new principal structure, provided that the resulting structure is less than 2,000\nsquare feet in net building coverage and less than or equal to 32 feet in height.\n\nC.\n\nAn addition to or remodel of an existing second structure, or the construction of\na new second structure, provided that the principal structure is exempt under subsection\n2.7.2.B and the resulting second structure:\n\n1.\n\ndoes not exceed 550 square feet;\n\n2.\n\ndoes not exceed the maximum height allowed in the base zoning district; and\n\n3.\n\nis either detached from the principal structure or connected by a covered breezeway\nthat is open on all sides, with a walkway of no more than six (6) feet in width that\nis covered by a roof of no more than eight (8) feet in width.\n\nD.\n\nThe addition of a second story to an existing one-story structure if the addition\nis directly above a portion of the existing one-story structure that was originally\nconstructed, or received a permit for construction, before October 1, 2006.\n\nE.\n\nAn extension of the second floor of an existing two-story structure, provided that\nthe building footprint of the structure is not increased.\n\n![Figure 18: Side Wall Articulation (Existing Side Wall Exceeds 36 Feet)](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig18.png)\n\nFigure 18: Side Wall Articulation (Existing Side Wall Exceeds 36 Feet)\n\nArticulation is required for side walls on additions or new construction that are\n15 feet or taller and located within 9 feet of the side lot line. No wall may extend\nfor more than 36 feet without a projection or recession of at least 4 feet in depth\nand 10 feet in length.\n\n![Figure 19: Side Wall Articulation (Existing Side Wall Less Than or Equal to 36 feet)](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig19.png)\n\nFigure 19: Side Wall Articulation (Existing Side Wall Less Than or Equal to 36 feet)\n\nAn addition to an existing building may extend a side wall up to a maximum of 36′\nin total length without articulation.\n\n![Figure 20: Side Wall Articulation (New Construction)](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig20.png)\n\nFigure 20: Side Wall Articulation (New Construction)\n\nAll new construction must meet the sidewall articulation standards.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093.\n\n**Editor's note—**\nOrd. No. 20150507-042, Pt. 3, effective May 18, 2015, repealed § 2.8, which pertained to modifications by the residential design and compatibility\ncommission. See Code Comparative Table for complete derivation.\n\nUnder Section 25-2-1406 of the Code, an ordinance zoning or rezoning property as a neighborhood plan (NP)\ncombining district may modify certain development standards of this Subchapter.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022.\n\nIn this Subchapter, BUILDABLE AREA means the area in which development subject to\nthis Subchapter may occur, and which is defined by the side and rear setback planes\nrequired by this Subchapter, together with the area defined by the front, side, and\nrear yard setbacks and the maximum height limit.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022.\n\nIn this Subchapter, BUILDING LINE means a line that is parallel to the front lot line\nand that intersects the principal residential structure at the point where the structure\nis closest to the front lot line, including any allowed projections into the front\nyard setback. See Figure 21.\n\n![Figure 21: Building Line](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-Fig21.png)\n\nFigure 21: Building Line\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022.\n\nIn this Subchapter, GROSS FLOOR AREA has the meaning assigned by Section 25-1-21 (Definitions), with the following modifications:\n\n3.3.1.\n\nIn this Subchapter, GROSS FLOOR AREA means all enclosed space, regardless of its dimensions,\nthat is not exempted under subsections 3.3.2, 3.3.3, or 3.3.4.\n\n3.3.2.\n\nSubject to the limitations in paragraph C below, the following parking areas and structures\nare excluded from gross floor area for purposes of this Subchapter:\n\nA.\n\nUp to 450 square feet of:\n\n1.\n\nA detached rear parking area that is separated from the principal structure by not\nless than 10 feet;\n\n2.\n\nA rear parking area that is 10 feet or more from the principal structure, provided\nthat the parking area is either:\n\na.\n\ndetached from the principal structure; or\n\nb.\n\nattached by a covered breezeway that is completely open on all sides, with a walkway\nnot exceeding 6 feet in width and a roof not exceeding 8 feet in width; or\n\n3.\n\nA parking area that is open on two or more sides, if:\n\ni.\n\nit does not have habitable space above it; and\n\nii.\n\nthe open sides are clear and unobstructed for at least 80% of the area measured below\nthe top of the wall plate to the finished floor of the carport.\n\nB.\n\nUp to 200 square feet of:\n\n1.\n\nAn attached parking area if it is used to meet the minimum accessible spaces requirement;\nor\n\n2.\n\nA garage that is less than 10 feet from the rear of the principal structure, provided\nthat the garage is either:\n\na.\n\ndetached from the principal structure; or\n\nb.\n\nattached by a covered breezeway that is completely open on all sides, with a walkway\nnot exceeding 6 feet in width and a roof not exceeding 8 feet in width.\n\nC.\n\nAn applicant may receive only one 450-square foot exemption per site under paragraph\nA. An applicant who receives a 450-square foot exemption may receive an additional\n200-foot exemption for the same site under paragraph B, but only for an attached parking\narea used to meet the minimum accessible spaces requirement.\n\n3.3.3.\n\nPorches, basements, and attics that meet the following requirements shall be excluded\nfrom the calculation of gross floor area:\n\nA.\n\nA ground floor porch, including a screened porch, provided that:\n\n1.\n\nthe porch is not accessible by automobile and is not connected to a driveway; and\n\n2.\n\nthe exemption may not exceed 200 square feet if a porch has habitable space or a balcony\nabove it.\n\nB.\n\nA habitable portion of a building that is below grade if:\n\n1.\n\nThe habitable portion does not extend beyond the first-story footprint and is:\n\na.\n\nBelow natural or finished grade, whichever is lower; and\n\nb.\n\nSurrounded by natural grade for at least 50% of its perimeter wall area, if the habitable\nportion is required to be below natural grade under Paragraph 1.a.\n\n2.\n\nThe finished floor of the first story is not more than three feet above the average\nelevation at the intersections of the minimum front yard setback line and the side\nproperty lines.\n\nC.\n\nA habitable portion of an attic, if:\n\n1.\n\nThe roof above it is not a flat or mansard roof and has a slope of 3 to 12 or greater;\n\n2.\n\nIt is fully contained within the roof structure;\n\n3.\n\nIt has only one floor;\n\n4.\n\nIt does not extend beyond the footprint of the floors below;\n\n5.\n\nIt is the highest habitable portion of the building, or a section of the building,\nand adds no additional mass to the structure; and\n\n6.\n\nFifty percent or more of the area has a ceiling height of seven feet or less.\n\n3.3.4.\n\nAn enclosed area shall be excluded from the calculation of gross floor area if it\nis five feet or less in height. For purposes of this subsection:\n\nA.\n\nArea is measured on the outside surface of the exterior walls; and\n\nB.\n\nHeight is measured from the finished floor elevation, up to either:\n\n1.\n\nthe underside of the roof rafters; or\n\n2.\n\nthe bottom of the top chord of the roof truss, but not to collar ties, ceiling joists,\nor any type of furred-down ceiling.\n\n3.3.5.\n\nAn area with a ceiling height greater than 15 feet is counted twice.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093; Ord. 20130425-105; Ord. No. 20231102-028, Pt. 33, 11-13-23.\n\nFor purposes of this Subchapter, the HEIGHT of a building or setback plane shall be\nmeasured as follows:\n\n3.4.1.\n\nHeight shall be measured vertically from the average of the highest and lowest grades\nadjacent to the building to:\n\nA.\n\nFor a flat roof, the highest point of the coping;\n\nB.\n\nFor a mansard roof, the deck line;\n\nC.\n\nFor a pitched or hip roof, the gabled roof or dormer with the highest average height;\nor\n\nD.\n\nFor other roof styles, the highest point of the building.\n\n3.4.2.\n\nThe grade used in the measurement of height for a building or setback plane shall\nbe the lower of natural grade or finished grade, except height shall be measured from\nnatural grade if the site is located in the 100-year floodplain.\n\n3.4.3.\n\nFor a stepped or terraced building, the height of each segment is determined individually.\n\n3.4.4.\n\nThe height of a structure other than a building is measured vertically from the ground\nlevel immediately under the structure to the top of the structure. The height of a\nfence on top of a retaining wall is measured from the bottom of the retaining wall.\n\n3.4.5.\n\nA maximum height is limited by both number of feet and number of stories if both measurements\nare prescribed, regardless of whether the measurements are conjoined with \"or\" or\n\"and.\"\n\n3.4.6.\n\nThe habitable portion of a basement that is below natural grade and the habitable\nportion of an attic do not count toward the number of stories for purposes of Section 25-2-773(B)(5) (Duplex, Two-Unit and Three-Unit Residential Uses) if the area satisfies the requirements for an exemption from gross floor area under\nsubsections 3.3.2.B., C. of this Subchapter.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093; Ord. No. 20191114-064, Pt. 2, 11-25-19; Ord. No. 20231207-001, Pt. 18, 12-18-23.\n\n3.5.1.\n\nIn this Subchapter, NATURAL GRADE is:\n\nA.\n\nThe grade of a site before it is modified by moving earth, adding or removing fill,\nor installing a berm, retaining wall, or architectural or landscape feature; or\n\nB.\n\nFor a site with a grade that was legally modified before October 1, 2006, the grade\nthat existed on October 1, 2006.\n\n3.5.2.\n\nNatural grade is determined by reference to an on-ground survey, City-approved topographic\nmap, or other information approved by the director. The director may require an applicant\nto provide a third-party report that shows the natural grade of a site.\n\nSource: Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022.\n\n###### APPENDIX A. - BOUNDARIES OF THE CAPITOL VIEW CORRIDORS.\n\n(A)\n\nIn this appendix:\n\n(1)\n\nTEXAS PLANE COORDINATE means the Central Zone of the Texas State Coordinate Systems\nas defined by the U.S. Coast and Geodetic Survey, dated 1945 and revised in March\n1978.\n\n(2)\n\nCAPITOL DOME means the part of the State Capitol located more than 653 feet above\nsea level at Texas Plane Coordinate X-2818555.07, Y-230595.65, being the center of\nthe dome.\n\n(B)\n\nThe capitol view corridors and boundaries are:\n\n(1)\n\nThe South Mall of the University of Texas corridor includes the area below he plane\nformed by connecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 594 feet above sea level at Texas Plane Coordinate\nX-2818794.86 Y-234376.98 and extends along a bearing of S 2° 7′ 0.0″ W for a distance\nof 3,790.248 feet to a point 100 feet from the center of the Capitol Dome and located\nat Texas Plane Coordinate X-2818654.87, Y-230589.32; and\n\n(b)\n\nthe second line begins at an elevation of 594 feet above sea level at Texas Plane\nCoordinate X-2818628.71, Y-234341.64, and extends along a bearing of S 2° 39′ 17.7″\nW for a distance of 3,748.053 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818455.09, Y-230597.61.\n\n(2)\n\nThe Waterloo Park corridor includes the area below the plane formed by connecting\nthe following two lines:\n\n(a)\n\nthe first line begins at an elevation of 496 feet above sea level at Texas Plane Coordinate\nX-2820189.70, Y-230799.91, and extends along a bearing of S 86° 21′ 3.1″ W for a distance\nof 1,650.373 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818542.67, Y-230694.87; and\n\n(b)\n\nthe second line begins at an elevation of 480 feet above sea level at Texas Plane\nCoordinate X-2820300.13, Y-229756.25, and extends along a bearing of N 67° 16′ 4.1″\nW for a distance of 1,939.019 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818511.73, Y-230505.53.\n\n(3)\n\nThe Woolridge Park corridor includes the area below the plane formed by connecting\nthe following two lines:\n\n(a)\n\nthe first line at an elevation of 515 feet above sea level at Texas Plane Coordinate\nX-2816727.54, Y-229659.96, and extends along a bearing of N 60° 5′ 58.0″ E for a distance\nof 2,055.569 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818509.50, Y-230684.66; and\n\n(b)\n\nthe second line begins at an elevation of 536 feet above sea level at Texas Plane\nCoordinate X-2816925.57, Y-229291.91, and extends along a bearing of N 54° 4′ 50.4″\nE for a distance of 2,089.263 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818617.55, Y-230517.56.\n\n(4)\n\nThe French Legation corridor includes the area below the plane formed by connecting\nthe following two lines:\n\n(a)\n\nthe first line begins at an elevation of 539 feet above sea level at Texas Plane Coordinate\nX-2821177.01, Y-227894.81, and extends along a bearing of N 42° 37′ 44.3″ W for a\ndistance of 3,765.605 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinate X-2818626.83, Y-230665.30; and\n\n(b)\n\nthe second line begins at an elevation of 539 feet above sea level at Texas Plane\nCoordinate X-2821144.99, Y-227833.18, and extends along a bearing of N 44° 39′ 68.5″\nW for a distance of 3,787.992 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818482.12, Y-230527.25.\n\n(5)\n\nThe Lamar Bridge corridor includes the area below the plane formed by connecting the\nfollowing two lines:\n\n(a)\n\nthe first line begins at an elevation of 460 feet above sea level at Texas Plane Coordinate\nX-2813589.52, Y-227457.92, and extends along a bearing of N 56° 44′ 9.5″ E for distance\nof 5,874.699 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818596.90, Y-230686.48; and\n\n(b)\n\nthe second line begins at an elevation of 460 feet above sea level at Texas Plane\nCoordinate X-2813419.55, Y-226934.03, and extends along a bearing of N 55° 25′ 10.4″\nE for a distance of 6,308.017 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818613.13, Y-230514.22.\n\n(6)\n\nThe South Congress at East Live Oak corridor includes the area below the plane formed\nby connecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 574 feet above sea level at Texas Plane Coordinate\nX-2814945.42, Y-218622.48, and extends along a bearing of N 16° 19′ 7.6″ E for a distance\nof 12,505.861 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818459.22, Y-230624.51; and\n\n(b)\n\nthe second line begins at an elevation of 574 feet above sea level at Texas Plane\nCoordinate X-2815051.19, Y-218649.13, and extends along a bearing of N 16° 48′ 23.4″\nE for a distance of 12,450.162 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818651.03, Y-230567.50.\n\n(7)\n\nThe MoPac Bridge corridor includes the area below the plane formed by connecting the\nfollowing two lines:\n\n(a)\n\nthe first line begins at an elevation of 498 feet above sea level of Texas Plane Coordinate\nX-2808602.196, Y-229824.15, and extends along a bearing of N 86° 08′ 29.3″ E for a\ndistance of 10,331.327 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinates X-2818562.808, Y-230495.95; and\n\n(b)\n\nthe second line begins at an elevation of 485 feet above sea level at Texas Plane\nCoordinate X-2808930.31, Y-230333.64, and extends along a bearing of N 87° 50′ 44.3″\nE for a distance of 9,628.852 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818552.35, Y-230695.61.\n\n(8)\n\nThe South Lamar at La Casa Drive corridor includes the area below the plane formed\nby connecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 656 feet above sea level at Texas Plane Coordinate\nX-2806422.18, Y-219725.23, and extends along a bearing of N 47° 47′ 22.8″ E for a\ndistance of 16,290.678 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinate X-2818488.35, Y-230670.13; and\n\n(b)\n\nthe second line begins at an elevation of 656 feet above sea level at Texas Plane\nCoordinate X-2806443.28, Y-219708.55, and extends along a bearing of N 48° 24′ 0.0″\nE for a distance of 16,286.017 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818621.93, Y-230521.28.\n\n(9)\n\nThe Barton Creek Pedestrian Bridge corridor includes the area below the plane formed\nby connecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 445 feet above sea level at Texas Plane Coordinate\nX-2810872.3, Y-227047.993 and extends along a bearing of N 64° 30′ 13.9″ E for a distance\nof 8,465.138 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818513.104, Y-230686.414; and\n\n(b)\n\nthe second line begins at an elevation of 460 feet above sea level at Texas Plane\nCoordinate X-2812177.38, Y-227545.58, and extends along a bearing of N 65° 15′ 5.2″\nE for a distance of 7,070.209 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818598.22, Y-230505.43.\n\n(10)\n\nThe Pleasant Valley Road at Lakeshore Drive corridor includes the area below the plane\nformed by connecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 450 feet above sea level at Texas Plane Coordinate\nX-2826332.31, Y-219396.73, and extends along a bearing of N 34° 21′ 30.0″ W for a\ndistance of 13,634.929 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinate X-2818637.21, Y-230652.69; and\n\n(b)\n\nthe second line begins at an elevation of 450 feet above sea level at Texas Plane\nCoordinate X-2826129.04, Y-218986.86, and extends along a bearing of N 33° 32′ 6.6″\nW for a distance of 13,861.422 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818471.32, Y-230541.00.\n\n(11)\n\nThe East Eleventh Street Threshold corridor includes the area below the plane formed\nby connecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 517 feet above sea level at Texas Plane Coordinate\nX-281382.21, Y-228956.12, and extends along a bearing of N 61° 38′ 31.4″ W for a distance\nof 3,269.672 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818504.91, Y-230509.14; and\n\n(b)\n\nthe second line begins at an elevation of 517 feet above sea level at Texas Plane\nCoordinate X-2821418.78, Y-228980.65 and extends along a bearing of N 58° 60′ 12.7″\nW for a distance of 3,289.227 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas plane Coordinate X-2818604.20, Y-230682.75.\n\n(12)\n\nThe North-Bound Lanes of IH-35 between the Municipal Police and Courts Building and\nWest Tenth Street corridor includes the area below the plane formed by connecting\nthe following two lines:\n\n(a)\n\nthe first line begins at an elevation of 501 feet above sea level at Texas Plane Coordinate\nX-2820624.99, Y-227858.68, and extends along a bearing of N 38° 3,433.34 feet to a\npoint 100 feet from the center of the Capitol dome and located at Texas Plane Coordinate\nX-2818475.11, Y-230535.59; and\n\n(b)\n\nthe second line begins at an elevation of 491 feet above sea level at Texas Plane\nCoordinate X-2820738.78, Y-228232.855, and extends along a bearing of N 49° 33′ 37.2″\nW for a distance of 3,219.746 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818627.946, Y-230664.138.\n\n(13)\n\nThe South-Bound Lanes of the Upper Deck of IH-35 between Concordia College and the\nMartin Luther King Boulevard Overpass corridor includes the area below the plane formed\nby connecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 618 feet above sea level at Texas Plane Coordinate\nX-2822432.77, Y-233117.96, and extends along a bearing of S 55° 43′ 8.2″ W for a distance\nof 4,627.079 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818609.48, Y-230511.74; and\n\n(b)\n\nthe second line begins at an elevation of 648 feet above sea level at Texas Plane\nCoordinate X-2823639.09, Y-235471.26, and extends along a bearing of S 47° 0′ 43.0″\nW for a distance of 7,045.415 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818485.40, Y-230667.38.\n\n(14)\n\nThe North-Bound Lanes of IH-35 between Waller Creek Plaza and the Municipal Police\nand Court Building corridor includes the area below the plane formed by connecting\nthe following two lines:\n\n(a)\n\nthe first line begins at an elevation of 498 feet above sea level of Texas Plane Coordinate\nX-2820389.72, Y-226977.21, and extends along a bearing of N 28° 17′ 53.1″ W for a\ndistance of 4,058.419 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinate X-2818465.79, Y-230550.62; and\n\n(b)\n\nthe second line begins at an elevation of 498 feet above sea level at Texas Plane\nCoordinate X-2820450.80, Y-227277.98, and extends along a bearing of N 28° 14′ 42.1″\nW for a distance of 3,823.132 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818641.53, Y-230645.90.\n\n(15)\n\nThe North-Bound Lanes of IH-35 between Third Street and the Waller Creek Plaza corridor\nincludes the area below the plane formed by connecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 482 feet above sea level at Texas Plane Coordinate\nX-2820010.77, Y-225710.94, and extends along a bearing of N 17° 43′ 6.5″ W for a distance\nof 5,098.378 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818459.13, Y-230567.46; and\n\n(b)\n\nthe second line begins at an elevation of 495 feet above sea level at Texas Plane\nCoordinate X-2820205.46, Y-226432.65, and extends along a bearing of N 20° 20′ 46.9″\nW for a distance of 4,479.853 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818647.84, Y-230632.99.\n\n(16)\n\nThe East Seventh Street Bridge Over the Texas-New Orleans Railroad corridor includes\nthe area below the plane formed by connecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 476 feet above sea level at Texas Plane Coordinate\nX-2829646.58, Y-224957.77, and extends along a bearing of N 62° 35′ 42.1″ W for a\ndistance of 12,442.553 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinate X-2818600.39, Y-230684.79; and\n\n(b)\n\nthe second line begins at an elevation of 476 feet above sea level at Texas Plane\nCoordinate X-2829633.60, Y-224932.05, and extends along a bearing of N 63° 23′ 0.0″\nW for a distance of 12,442.674 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818509.56, Y-230506.61.\n\n(17)\n\nThe Longhorn Shores corridor includes the area below the plane formed by connecting\nthe following two lines:\n\n(a)\n\nthe first line begins at an elevation of 435 feet above sea level at Texas Plane Coordinate\nX-2823082.973, Y-219866.265, and extends along a bearing of N 22° 23′ 17.7″ W for\na distance of 11,647.863 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinate X-2818646.489, Y-230636.201; and\n\n(b)\n\nthe second line begins at an elevation of 435 feet above sea level at Texas Plane\nCoordinate X-2822949.654, Y-219866.561, and extends along a bearing of N 22° 46′ 44″\nW for a distance of 11,594.666 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818462.531, Y-230557.772.\n\n(18)\n\nThe Zilker Clubhouse corridor includes the area below the plane formed by connecting\nthe following two lines:\n\n(a)\n\nthe first line begins at an elevation of 561 feet above sea level at Texas Plane Coordinate\nX-2807259.05, Y-230056.68, and extends along a bearing of N 86° 45′ 42.0″ E for a\ndistance of 11,309.321 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinate X-2818550.31, Y-230695.53; and\n\n(b)\n\nthe second line begins at an elevation of 561 feet above sea level at Texas Plane\nCoordinate X-2807248.18, Y-229969.74, and extends along a bearing of N 87° 20′ 15.0″\nE for distance of 11,324.650 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818560.60, Y-230495.80.\n\n(19)\n\nThe Red Bud Trail corridor includes the area below the plane formed by connecting\nthe following two lines:\n\n(a)\n\nthe first line begins at an elevation of 684 feet above sea level at Texas Plane Coordinate\nX-2801662.96, Y-236155.75, and extends along a bearing of S 72° 6′ 10.9″ E for a distance\nof 17,783.936 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818586.34, Y-230690.63; and\n\n(b)\n\nthe second line begins at an elevation of 684 feet above sea level at Texas Plane\nCoordinate X-2801187.25, Y-236038.78, and extends along a bearing of S 71° 35′ 16.8″\nE for a distance of 17,534.371 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818524.03, Y-230500.59.\n\n(20)\n\nThe Enfield Road corridor includes the area below the plane formed by connecting the\nfollowing two lines:\n\n(a)\n\nthe first line begins at an elevation of 534 feet above sea level at Texas Plane Coordinate\nX-2814317.00, Y-232540.28, and extends along a bearing of S 64° 7′ 24.8″ E for a distance\nof 4,664.000 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818513.37, Y-230504.76; and\n\n(b)\n\nthe second line begins at an elevation of 534 feet above sea level at Texas Plane\nCoordinate X-2814166.24, Y-23616.36, and extends along a bearing of S 66° 27′ 47.8″\nE for a distance of 4,8 2.718 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas plane Coordinate X-2818596.90, Y-230686.48.\n\n(21)\n\nThe Capitol of Texas Highway corridor includes the area below the plane formed by\nconnecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 850 feet above sea level at Texas Plane Coordinate\nX-2793153.22, Y-246055.75, and extends along a bearing of S 58° 62′ 1.6″ E for a distance\nof 29,736.832 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818607.06, Y-230681.07; and\n\n(b)\n\nthe second line begins at an elevation of 850 feet above sea level at Texas Plane\nCoordinate X-2792663.44, Y-245928.13, and extends along a bearing of S 59° 10′ 35.3″\nE for a distance of 30,091.057 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818504.12, Y-230509.60.\n\n(22)\n\nThe 38th Street at Red River corridor includes the area below the plane formed by\nconnecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 609 feet above sea level at Texas Plane Coordinate\nX-2823695.84, Y-238333.37, and extends along a bearing of S 34° 12′ 57.2″ W for a\ndistance of 9,290.302 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinate X-2818471.78, Y-230650.98; and\n\n(b)\n\nthe second line begins at an elevation of 609 feet above sea level at Texas Plane\nCoordinate X-2823785.05, Y-238418.94, and extends along a bearing of S 33° 9′ 15.9″\nW for a distance of 9,410.983 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818638.21, Y-230540.07.\n\n(23)\n\nThe Robert Mueller Airport corridor includes the area below the plane formed by connecting\nthe following two lines:\n\n(a)\n\nthe first line begins at an elevation of 603 feet above sea level at Texas Plane Coordinate\nX-2831475.74, Y-237087.29, and extends along a bearing of S 62° 55′ 39.9″ W for a\ndistance of 14,460.117 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinate X-2818599.97, Y-230506.29; and\n\n(b)\n\nthe second line begins at an elevation of 603 feet above sea level at Texas Plane\nCoordinate X-2831203.80, Y-237067.65, and extends along a bearing of S 63° 18′ 20.5″\nW for a distance of 14,208.702 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818509.52, Y-230684.67.\n\n(24)\n\nThe Martin Luther King Jr. Boulevard at IH-35 corridor includes the area below the\nplane formed by connecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 570 feet above sea level at Texas Plane Coordinate\nX-2821822.13, Y-232059.98, and extends along a bearing of S 64° 15′ 51.7″ W for a\ndistance of 3,582.5 feet to a point 100 feet from the center of the Capitol dome and\nlocated at Texas Plane Coordinate X-2818595.97, Y-230504.39; and\n\n(b)\n\nthe second line begins at an elevation of 570 feet above sea level at Texas Plane\nCoordinate X-2821665.89, Y-232039.68, and extends along a bearing of S 66° 46′ 10.3″\nW for a distance of 3,431.901 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818512.97, Y-230686.35.\n\n(25)\n\nThe Oakwood Cemetery corridor includes the area below the plane formed by connecting\nthe following two lines:\n\n(a)\n\nthe first line begins at an elevation of 662 feet above sea level at Texas Plane Coordinate\nX-2823518.05, Y-231483.66, and extends along a bearing of S 78° 43′ 9.6″ W for a distance\nof 5,042.788 feet to a point 100 feet from the center of the Capitol dome and located\nat Texas Plane Coordinate X-2818572.69, Y-230497.21; and\n\n(b)\n\nthe second line begins at an elevation of 662 feet above sea level at Texas Plane\nCoordinate X-2823496.42, Y-231576.82, and extends along a bearing of S 79° 54′ 22.8″\nW for a distance of 5,038.813 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818535.60, Y-230693.73.\n\n(26)\n\nThe East 12th Street at IH-35 corridor includes the area below the plane formed by\nconnecting the following two lines:\n\n(a)\n\nthe first line begins at an elevation of 525 feet above sea level at Texas Plane Coordinate\nX-2821503.64, Y-229689.85, and extends along a bearing of N 74° 46′ 47.0″ W for a\ndistance of 3,086.184 feet to a point 100 feet from the center of the Capitol dome\nand located at Texas Plane Coordinate X-2818525.71, Y-230500.05; and\n\n(b)\n\nthe second line begins at an elevation of 523 feet above sea level at Texas Plane\nCoordinate X-2821304.47, Y-229769.21, and extends along a bearing of N 71° 16′ 29.8″\nW for a distance of 2,872.654 feet to a point 100 feet from the center of the Capitol\ndome and located at Texas Plane Coordinate X-2818583.86, Y-230691.41.\n\nSource: Section 13-2-145(b) and (c); Ord. 990225-70; Ord. 031211-11.\n\n###### APPENDIX B. - BOUNDARIES OF THE WATERFRONT OVERLAY DISTRICT.\n\nThe Waterfront Overlay district includes the property located in the following subdistricts:\n\n(1)\n\nUniversity/Deep Eddy subdistrict, which includes the property bounded by Lake Austin\nBoulevard on the north, the Town Lake shoreline on the south, MoPac Boulevard on the\neast, and Tom Miller Dam on the west;\n\n(2)\n\nLamar subdistrict, which includes the property bounded by the Missouri Pacific rail\nlines on the north, the Town Lake shoreline on the south, Lamar Boulevard on the east,\nand MoPac Boulevard on the west;\n\n(3)\n\nNorth Shore Central subdistrict, which includes the property within the following\nboundaries:\n\n(a)\n\nEastern Area: beginning at the intersection of Cesar Chavez Street and Waller Creek,\nsouth along Waller Creek to Town Lake, west along Town Lake to a point due south of\nColorado Street, north to and along Colorado Street to Second Street, east along Second\nStreet to Trinity Street, south along Trinity Street to Cesar Chavez Street, and east\nalong Cesar Chavez Street to the point of beginning; and\n\n(b)\n\nWestern Area: beginning at the intersection of the Town Lake shoreline and Lamar Boulevard,\nnorth along Lamar Boulevard to the Missouri Pacific rail lines, east along the Missouri\nPacific rail lines to Nueces Street, south and east along Nueces Street to San Antonio\nStreet, south along San Antonio Street to Cesar Chavez Street, due south to the Town\nLake shoreline, and west along the Town Lake shoreline to the point of beginning;\n\n(4)\n\nRainey Street subdistrict, which includes the property bounded by First Street on\nthe north, the Town Lake shoreline on the south, IH-35 on the east, and Waller Creek\non the west;\n\n(5)\n\nFestival Beach subdistrict, which includes the property bounded by the Town Lake shoreline\non the south, Pleasant Valley Road on the east, IH-35 on the west, and Holly Street\nfrom IH-35 to Canadian Street, then north on Canadian Street to Willow Street, then\neast on Willow Street to Pleasant Valley Road on the north;\n\n(6)\n\nRed Bluff subdistrict, which includes the property bounded by East First Street on\nthe north, the Colorado River shoreline on the south, US 183 on the east, and Pleasant\nValley Road on the west, except the portion of the property described as Lots 1 through\n11 of the Bridgeview Business and Industrial Plaza subdivision, as shown on the plat\nrecorded in Volume 77, pages 361-363, of the Plat Records of Travis County, Texas;\n\n(7)\n\nMontopolis/River Terrace subdistrict, which includes the property bounded by the Colorado\nriver shoreline on the north, the extension of Lakeshore Boulevard on the south, Highway\n183 on the east, and Pleasant Valley Road on the west;\n\n(8)\n\nSouth Lakeshore subdistrict, which includes the property bounded by the Town Lake\nshoreline on the north, the various and respective southern boundaries of all legal\nlots existing as of July 16, 1986, that abut the south public right-of-way of South\nLakeshore Boulevard on the south, Pleasant Valley Road on the east, and the extension\nof Parker Lane on the west;\n\n(9)\n\nEast Riverside subdistrict, which includes the property bounded by the Town Lake shoreline\non the north, Riverside Drive on the south, the extension of Parker Lane on the east,\nand IH-35 on the west;\n\n(10)\n\nTravis Heights subdistrict, which includes the property bounded by the Town Lake shoreline\non the north, the various and respective southern boundaries of all legal lots existing\nas of July 17, 1986, that abut the south public right-of-way of East Riverside Drive\non the south, IH-35 on the east, and East Bouldin Creek on the west;\n\n(11)\n\nSouth Shore Central subdistrict, which includes the property bounded by the Town Lake\nshoreline on the north, East Bouldin Creek on the south and east, and South First\nStreet on the west;\n\n(12)\n\nAuditorium Shores subdistrict, which includes the property bounded by the Town Lake\nshoreline on the north, the various and respective southern boundaries of all legal\nlots existing as of July 17, 1986, that abut the south public right-of-way of Barton\nSprings Road on the south, South First Street on the east, and Lee Barton Drive on\nthe west;\n\n(13)\n\nButler Shores Subdivision which includes the property bounded by the Town Lake shoreline\non the north, the various and respective southern boundaries of all legal lots existing\nas of July 17, 1986, that abut the south public right-of-way of Barton Springs Road\non the south, Lee Barton Drive on the east, and the centerline of Barton Creek on\nthe west;\n\n(14)\n\nZilker Park subdistrict, which includes the property located within the boundaries\nof Zilker Park;\n\n(15)\n\nBalcones Rock Cliff subdistrict, which includes the property bounded by the Town Lake\nshoreline on the north, Stratford Drive and Bee Creek Preserve on the south, Zilker\nPark on the east, and Tom Miller Dam on the west; and\n\n(16)\n\nCity Hall subdistrict, which includes the property bounded on the south by the Town\nLake shoreline, on the north by Second Street, on the east by Colorado Street and\na line extending south from Colorado Street to Town Lake, and on the west by San Antonio\nStreet and a line extending south from San Antonio Street to Town Lake.\n\nSource: 13-2-160(b); Ord. 990225-70; Ord. 990715-115; Ord. 031211-11.\n\n###### APPENDIX C. - UNIVERSITY NEIGHBORHOOD OVERLAY DISTRICT BOUNDARIES, SUBDISTRICT BOUNDARIES, HEIGHT LIMITS, AND ADDITIONAL HEIGHT AND AFFORDABILITY University Neighborhood Overlay District Boundaries\n\nThe university neighborhood overlay district is indicated on the subdistrict boundaries\nmap and includes the area bounded:\n\n(1)\n\non the north by a line along West 29th Street from Rio Grande Street to Guadalupe\nStreet;\n\n(2)\n\non the east by a line along Guadalupe Street from West 29th Street to West 21st Street;\nWest 21st Street from Guadalupe Street to the eastern ally of University Avenue; the\neastern alley of University Avenue from West 21st Street to West MLK Jr. Boulevard;\n\n(3)\n\non the south by a line along West MLK Jr. Boulevard from the eastern alley of University\nAvenue to San Gabriel Street; and\n\n(4)\n\non the west by a line along San Gabriel Street to West 24th Street; west along West\n24th Street to the western lot line of lot One of the Resubdivision of a Portion of\nOutlot Forty-Three; north along the western lot line of lot One of the Resubdivision\nof a Portion of Outlot Forty-Three to the alley between Lamar Boulevard and Longview\nStreet; north along the alley to West 25th Street; east along West 25th Street to\nLongview Street; north along Longview Street to the northern lot line of lot Fifteen,\nBlock Five of the Subdivision of Outlots Forty-Three, Forty-Four, Forty-Five and Fifty-Five;\neast along the northern lot line of lot Fifteen, Block Five of the Subdivision of\nOutlots Forty-Three, Forty-Four, Forty-Five and Fifty-Five to the alley between Longview\nStreet and Leon Street; north along the ally to the northern lot line of lot Twenty-Three,\nBlock Four of the Subdivision of Outlots Forty-Three, Forty-Four, Forty-Five and Fifty-Five;\neast along the northern lot line of lot Twenty-Three, Block Four of the Subdivision\nof Outlots Forty-Three, Forty-Four, Forty-Five and Fifty-Five to the northern lot\nlines of lots Twenty-Nine, Thirty, Thirty-One, Thirty-Two, and Three of the Harwood\nSubdivision; along the northern lot lines of lots Twenty-Nine, Thirty, Thirty-One,\nThirty-Two, and Three of the Harwood Subdivision to San Gabriel Street; north along\nSan Gabriel Street to the northern lot line of the Graham Subdivision of Outlots Fifty-Nine,\nSixty, Sixty-Four, and the North Half of Fifty-Two; along the northern lot line of\nthe Graham Subdivision of Outlots Fifty-Nine, Sixty, Sixty-Four, and the North Half\nof Fifty-Two to a point 160' east of San Pedro Street of the southern lot line of\nlot One of the Gortons Addition; from this point north to a point 160' east of San\nPedro Street on the northern lot line of lot Four of the Gortons Addition; east along\nthe northern lot line of lot Four of the Gortons Addition to San Pedro Street; north\nalong San Pedro Street to West 28th Street; west along 28th Street to Salado Street;\nnorth along Salado Street to an alley on the northern lot line of Outlot 67, Division\nD of the Graham Subdivision; east along the alley to Rio Grande Street; north along\nRio Grande Street to West 29th Street.\n\nSource: Ord. 040902-58; Ord. 20080925-039; Ord. No. 20191114-067, Pt. 5, 11-25-19.\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-AppC-1.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2AppC.png)\n\nSource: Ord. No. 20190523-041, Pt. 1, 6-3-19.\n\nUniversity Neighborhood Overlay\nAdditional Height & Affordability\n![University Neighborhood Overlay Additional Height & Affordability](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2AppC1.png)\n\n(Ord. No. 20191114-067, 11-25-19)\n\n###### APPENDIX D. - TRANSIT ORIENTED DEVELOPMENT DISTRICTS\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-AppD-1a.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-AppD-2.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-AppD-3.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-AppD-4.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-AppD-5.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/SubCHF-AppD-6.png)\n\nSource: Ord. 20050519-008.\n\nExhibit 7\n\nOak Hill TOD District Boundaries And Zones\n\nThe boundaries and zones of the Oak Hill TOD district have not been established. After\nCapital Metropolitan Transportation Authority selects a transit center site, the boundaries\nand zones of the TOD district are to be determined through the neighborhood planning\nprocess and established by council.\n\nSource: Ord. 20060309-057.\n\nExhibit 8\n\nHighland Mall TOD District Boundaries And Zones\n\nThe boundaries and zones of the Highland Mall TOD district have not been established.\nThe boundaries and zones of the TOD district are to be determined during the preparation\nof the station area plan and established by council.\n\nSource: Ord. 20061005-052.\n\nExhibit 9\n\nSouth IH-35 Park and Ride TOD District Boundaries and Zones\n\nThe boundaries and zones of the South IH-35 Park and Ride TOD District have not been\nestablished. The boundaries and zones of the TOD district are to be determined during\nthe preparation of the station area plan and established by council.\n\nSource: Ord. 20061005-052; Ord. 20061207-003.\n\n###### APPENDIX E. - NORTH BURNET/GATEWAY (NBG) ZONING DISTRICT BOUNDARIES SUBDISTRICT MAP.\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2AppE.png)\n\nSource: Ord. 20071101-052; Ord. No. 20190808-101, Pts. 1, 2, 8-19-19.\n\n###### APPENDIX F. - CENTRAL URBAN REDEVELOPMENT (CURE) COMBINING DISTRICT BOUNDARIES.\n\n## APPENDIX F. - CENTRAL URBAN REDEVELOPMENT (CURE) COMBINING DISTRICT BOUNDARIES.\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2AppF.png)\n\n(Ord. No. 20180322-096, Pt. 3(Exh. A), 4-2-18)\n\n###### APPENDIX G. - ETOD BOUNDARIES\n\n## APPENDIX G. - ETOD BOUNDARIES\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2AppG.png)\n\nSource: Ord. No. 20240516-005, Pt. 6, 7-15-24.\n",
  "start_line": 39067,
  "end_line": 40832,
  "subsections": []
}