{
  "id": "25-2-739",
  "title": "RAINEY STREET SUBDISTRICT REGULATIONS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "(C)(4) of Section 25-2-739 (Rainey Street Subdistrict Regulations) of the City Code.\n\n(3)\n\nThe amount of floor-to-area ratio or height that may be achieved by a downtown density\nbonus for a site is limited by the maximum height or Floor-to-Area Ratio identified\non Figure 2.\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2a.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2b.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2c.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2d.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2e.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2f.png)\n\n(4)\n\nThe maximum heights and maximum floor-to-area ratios on Figure 2 do not modify a site's\nprimary entitlement. If the maximum height or maximum floor-to-area ratio allowed\nunder a primary entitlement exceeds the height or floor-to-area ratio on Figure 2,\nthe bonus area is calculated by using the site's primary entitlement that does not\nexceed the maximums shown on Figure 2.\n\n(5)\n\nThe development bonus fee may vary by use and downtown district. The applicable development\nbonus fee within each of the nine districts is established by ordinance.\n\n(6)\n\nNotwithstanding the limitation provided for in Subsection (B)(3) of this section,\nthe city council may grant to an applicant floor-to-area ratio that exceeds the maximum\nfloor-to-area ratio in Figure 2 if:\n\n(a)\n\nThe applicant has already achieved the maximum floor-to-area ratio in Figure 2 by\nparticipating in the Downtown Density Bonus Program;\n\n(b)\n\nThe applicant submits a written request and rationale for the additional floor-to-area\nratio to the director;\n\n(c)\n\nThe director makes a written recommendation on the application and then submits the\nrecommendation to the Planning Commission for its review and recommendation; and\n\n(d)\n\nThe city council determines that the additional floor-to-area ratio should be granted\nbecause:\n\n(i)\n\nThe applicant has offered additional community benefits described in Subsections (E)(1)—(12)\nabove and beyond those offered to achieve the floor-to-area ratio in Figure 2;\n\n(ii)\n\nThe applicant agrees to use the same methodology and bonus area granted for each community\nbenefit as described in the downtown density bonus program to achieve the desired\nbonus area;\n\n(iii)\n\nThe city council determines that awarding the additional floor-to-area ratio substantially\nfurthers the goals and objectives of the Downtown Austin Plan and the Imagine Austin\nComprehensive Plan; and\n\n(iv)\n\nthe applicant has agreed that any residential parking space shall be offered separately\nfrom the dwelling unit.\n\n(7)\n",
  "start_line": 16553,
  "end_line": 16635,
  "subsections": []
}