{
  "id": "25-2-815",
  "title": "LARGE RETAIL USES",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "in Section 25-2-815 (Large Retail Uses).\n\n(1)\n\nIn addition to the notice required by Subsection (B), the director shall give notice\nto all:\n\n(a)\n\nregistered neighborhood associations with boundaries located within one mile of the\nsite; and\n\n(b)\n\nutility service addresses located within 500 feet of the site, as shown in the City\nutility records as of the date of the filing of the application.\n\n(2)\n\nThe applicant shall post a sign on the site in a location that is within 25 feet of\nand visible from the public right-of-way. The sign must be at least four feet by eight\nfeet in size with lettering at least four inches high. The sign must include the following\ninformation:\n\n(a)\n\na statement that an application for approval of a conditional use site plan has been\nfiled;\n\n(b)\n\nthe city file number;\n\n(c)\n\nthe name, address, and telephone number of the applicant or agent; and\n\n(d)\n\na description of the proposed development, including the size and use of the building.\n\n(D)\n\nThe director shall schedule a site plan application for public hearing by the Land\nUse Commission on the first available meeting for which notice of the public hearing\ncan be timely provided after:\n\n(1)\n\nthe applicant responds to staff review comments and makes necessary changes, if any;\n\n(2)\n\nthe applicant delivers to the director a written request to schedule the site plan\nfor public hearing; or\n\n(3)\n\nthe 180th day from the date the application for site plan approval was filed.\n\n(E)\n\nThe director shall extend the 180 day period described in Subsection (D)(3) of this\nsection for an additional 180 days if the applicant delivers to the director a written\nrequest for an extension before the expiration of the initial 180 day period.\n\nSource: Section 13-1-661; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 20070215-072;\nOrd. 20110804-008.\n\n(A)\n\nThe Land Use Commission shall determine whether the proposed development or use of\na conditional use site plan complies with the requirements of this section.\n\n(B)\n\nA conditional use site plan must:\n\n(1)\n\ncomply with the requirements of this title;\n\n(2)\n\ncomply with the objectives and purposes of the zoning district;\n\n(3)\n\nhave building height, bulk, scale, setback, open space, landscaping, drainage, access,\ntraffic circulation, and use that is compatible with the use of an abutting site;\n\n(4)\n\nprovide adequate and convenient off-street loading facilities;\n\n(5)\n\nreasonably protect persons and property from erosion, flood, fire, noise, glare, and\nsimilar adverse effects; and\n\n(6)\n\nfor a conditional use located within the East Austin Overlay district, comply with\nthe goals and objectives of a neighborhood plan adopted by the city council for the\narea in which the use is proposed.\n\n(C)\n\nA conditional use site plan may not:\n\n(1)\n\nmore adversely affect an adjoining site than would a permitted use;\n\n(2)\n\nadversely affect the safety or convenience of vehicular or pedestrian circulation,\nincluding reasonably anticipated traffic and uses in the area;\n\n(3)\n\nadversely affect an adjacent property or traffic control through the location, lighting,\nor type of a sign; or\n\n(4)\n\nfor a large retail use described in Section 25-2-815 (Large Retail Uses), adversely affect the future redevelopment of the site.\n\n(D)\n\nA site plan may not adversely affect the public health, safety, or welfare, or materially\ninjure property. If the Land Use Commission determines that a site plan has an adverse\neffect or causes a material injury under this subsection, the Land Use Commission\nshall identify the adverse effect or material injury.\n\nSource: Section 13-1-663(a); Ord. 990225-70; Ord. 990520-70; Ord. 010607-8; Ord. 031211-11;\nOrd. 20070215-072; Ord. 20110804-008; Ord. No. 20231102-028, Pt. 38, 11-13-23.\n\n(A)\n\nTo make a determination required for approval under Section 25-5-145 (Evaluation of Conditional Use Site Plan), the Land Use Commission may require that a conditional use site plan comply with\na condition of approval that includes a requirement for:\n\n(1)\n\na special yard, open space, buffer, fence, wall, or screen;\n\n(2)\n\nlandscaping or erosion;\n\n(3)\n\na street improvement or dedication, vehicular ingress and egress, or traffic circulation;\n\n(4)\n\nsigns;\n\n(5)\n\ncharacteristics of operation, including hours;\n\n(6)\n\na development schedule; or\n\n(7)\n\nother measures that the Land Use Commission determines are required for compatibility\nwith surrounding uses or the preservation of public health, safety, or welfare.\n\n(B)\n\nAs a condition of approval for a conditional use site plan, a parking area for a cocktail\nlounge or a restaurant with a late-hours permit must be separated from a property\nused or zoned townhouse and condominium residence (SF-6) district or more restrictive\nby not less than 200 feet unless:\n\n(1)\n\nthe lounge or restaurant is located within an enclosed shopping center; or\n\n(2)\n\nthe Land Use Commission grants a variance from this requirement when the Land Use\nCommission approves the site plan.\n\nSource: Section 13-1-665; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe Land Use Commission shall act on a site plan application not later than the 14th\nday after it closes the public hearing.\n\n(B)\n\nFor a conditional use site plan, the Land Use Commission may:\n\n(1)\n\napprove the site plan as proposed by the applicant if the site plan complies with\nthe requirements of Section 25-5-145 (Evaluation Of Conditional Use Site Plan);\n\n(2)\n\napprove the site plan pending compliance with the requirements of this title or conditions\nrequired by the Land Use Commission under Section 25-5-146 (Conditions Of Approval); or\n\n(3)\n\ndeny the site plan application.\n\n(C)\n\nThe Land Use Commission shall approve a site plan for development in a Hill Country\nRoadway Corridor if the Land Use Commission determines that the proposed development\ncomplies with the requirements of this title.\n\n(D)\n\nThe director shall notify the applicant of the Land Use Commission's decision by mail.\n\nSource: Sections 13-1-663(b) and 13-1-664; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nIf the Land Use Commission, or the council on appeal, imposes a condition of approval\non a conditional use site plan, the applicant shall file with the director an update\nthat satisfies the condition not later than 20 business days after the site plan approval\ndate. A site plan expires if the applicant does not comply with the deadline.\n\n(B)\n\nAfter receiving the update, the director shall notify the applicant of review comments\nto an updated conditional use site plan not later than the deadline established by",
  "start_line": 46387,
  "end_line": 46622,
  "subsections": [
    "25-2-815-D",
    "25-2-815-E",
    "25-2-815-A",
    "25-2-815-B",
    "25-2-815-C",
    "25-2-815-D",
    "25-2-815-A",
    "25-2-815-B",
    "25-2-815-A",
    "25-2-815-B",
    "25-2-815-C",
    "25-2-815-D",
    "25-2-815-A",
    "25-2-815-B"
  ]
}