{
  "id": "25-2-835",
  "title": "SCHOOL DISTRICT DEVELOPMENT AGREEMENTS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Except as provided in Section 25-2-835\n(School District Development Agreements), this section applies to development of a public primary or secondary educational\nfacility.\n\n(B)\n\nThis subsection specifies the minimum setback required from a public primary or secondary\neducational facility and an adjoining residential, intensive recreational, or activity\ncenter use.\n\n(1)\n\nWithin the boundaries of the Austin Independent School District, a public primary\nor secondary educational facility must be constructed within the setbacks required\nunder the applicable regulations of this chapter.\n\n(2)\n\nOutside the boundaries of the Austin Independent School District, a public primary\nor secondary educational facility may not be constructed closer than 25 feet from\nan adjoining residential use.\n\n(C)\n\nThis subsection specifies maximum height of a public primary or secondary educational\nfacility.\n\n(1)\n\nWithin the boundaries of the Austin Independent School District, the height of a public\nprimary or secondary educational facility may not exceed the lesser of:\n\n(a)\n\n60 feet;\n\n(b)\n\n30 feet, if the facility is located within 50 feet of a single-family residential\nbase district or a single-family use; or\n\n(c)\n\n40 feet, if the facility is located within 100 feet of a single-family residential\ndistrict or a single-family use.\n\n(2)\n\nOutside the boundaries of the Austin Independent School District, the height of a\npublic primary or secondary educational facility may not exceed the lesser of:\n\n(a)\n\ntwo stories or 30 feet, if the facility is located within 50 feet of a single-family\nresidential base district or single-family use; or\n\n(b)\n\nthree stories or 40 feet, if the facility is located within 100 feet of a single family\nresidential base district or single family use.\n\n(D)\n\nA public primary or secondary educational facility:\n\n(1)\n\nis exempt from requirements of this chapter limiting floor-to-area ratio;\n\n(2)\n\nis subject to Chapter 25-2, Subchapter C, Article 10 (Compatibility) within the boundaries of the Austin Independent School District, except that no\nopaque fencing or screening around any building or shielding for security lighting\nis required; and\n\n(3)\n\nis exempt from Chapter 25-2, Subchapter C, Article 10 (Compatibility) outside the boundaries of the Austin Independent School District, but must comply\nthe standards specified under this subsection.\n\n(a)\n\nAn intensive recreational use associated with a public primary or secondary educational\nfacility, excluding a multi-use trail and including a swimming pool, tennis court,\nball court, or playground, may not be constructed 50 feet or less from adjoining property:\n\n(i)\n\nin an SF-5 or more restrictive zoning district; or\n\n(ii)\n\non which a use permitted in an SF-5 or more restrictive zoning district is located.\n\n(b)\n\nExterior lighting must be hooded or shielded so that the light source is not directly\nvisible from adjacent property:\n\n(i)\n\nin an urban family residence (SF-5) or more restrictive zoning district; or\n\n(ii)\n\non which a use permitted in an SF-5 or more restrictive zoning district is located.\n\nSource: Ord. No. 20160623-090, Pt. 4, 7-4-16.\n\n**Editor's note—**\nOrd. No. 20160623-090, Pt. 4, effective July 4, 2016, repealed the former § 25-2-833,",
  "start_line": 26913,
  "end_line": 27023,
  "subsections": [
    "25-2-835-B",
    "25-2-835-C",
    "25-2-835-D"
  ]
}