{
  "id": "25-2-715",
  "title": "REVIEW AND RECOMMENDATION OF THE SMALL AREA PLANNING JOINT COMMITTEE OF THE PLANNING COMMISSION AND THE ZONING AND PLATTING COMMISSION",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "hearing. If the Board fails to make a recommendation as required under Section 25-2-715 (Review and Recommendation of the Small Area Planning Joint Committee of the Planning\nCommission and the Zoning and Platting Commission), the Land Use Commission or accountable official may act on the application without\na recommendation from the Board.\n\n(B)\n\nThe Land Use Commission shall make a recommendation to the council on a zoning or\nrezoning application not later than the 14th day after the Land Use Commission closes\nthe public hearing on the application.\n\n(C)\n\nThe Land Use Commission may recommend that the council:\n\n(1)\n\napprove the application as proposed;\n\n(2)\n\napprove a more restrictive zoning classification than requested;\n\n(3)\n\napprove the proposed classification or a more restrictive classification subject to\nconditions; or\n\n(4)\n\ndeny the application.\n\n(D)\n\nIf the Land Use Commission does not adopt a recommendation on an application, the\ndirector of the Neighborhood Planning and Zoning Department shall forward the application\nto council without a Land Use Commission recommendation.\n\n(E)\n\nIf the Land Use Commission does not hold a public hearing in accordance with Subsection\n(A), the applicant may file a written request for a hearing with the director of the\nNeighborhood Planning and Zoning Department or Land Use Commission.\n\n(1)\n\nIf requested, the director of the Neighborhood Planning and Zoning Department shall\nschedule a public hearing before the Land Use Commission on the first Land Use Commission\nmeeting after the date the request is received for which the director of the Neighborhood\nPlanning and Zoning Department can provide notice under Section 25-1-132(A) (Notice Of Public Hearing) of this title.\n\n(2)\n\nThe following procedures apply to a public hearing scheduled under this subsection:\n\n(a)\n\nthe Land Use Commission shall conduct the public hearing before other business scheduled\nfor the same meeting is considered;\n\n(b)\n\nif more than one public hearing scheduled under this subsection is on an agenda, the\nLand Use Commission shall conduct the public hearings in the order in which the written\nrequests for the public hearings were received; and\n\n(c)\n\nif a public hearing is not completed on the date it is scheduled, the Land Use Commission\nshall continue the public hearing to the next and successive meetings of the Land\nUse Commission until completed.\n\n(3)\n\nThe Land Use Commission shall make a recommendation on an application considered under\nthis subsection at the same meeting that the Land Use Commission closes the public\nhearing on the application, except that, the Land Use Commission may postpone its\ndecision on the application for not more than 14 days with the consent of the applicant.\n\n(F)\n\nThe director of the Neighborhood Planning and Zoning Department shall report the Land\nUse Commission's recommendation on each zoning or rezoning application to the council.\n\nSource: Section 13-1-405; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11;\nOrd. 20090611-074; Ord. No. 20141211-204, Pt. 25, 7-1-15.\n\n(A)\n\nThe council shall hold a public hearing on a zoning or rezoning application not later\nthan the 40th day after the date of the Land Use Commission recommendation.\n\n(B)\n\nThe director of the Neighborhood Planning and Zoning Department shall give notice\nunder Section 25-1-132(B) (Notice of Public Hearing) of a public hearing held under this section.\n\n(C)\n\nUnless the council votes to deny a postponement request, a postponement of the public\nhearing on a zoning or rezoning application is automatically granted on the first\nrequest made by each of the following: staff, the applicant, or one interested party\nin opposition to the application.\n\n(1)\n\nA postponement request must be written and submitted to the director of the Neighborhood\nPlanning and Zoning Department not later than the seventh day before the scheduled\npublic hearing. The request must specify the reasons for the postponement. The director\nof the Neighborhood Planning and Zoning Department shall provide a recommendation\non the validity of the postponement request.\n\n(2)\n\nThe city clerk shall enter an automatic postponement in the minutes with a notation\nof the identity of the party requesting the postponement.\n\n(3)\n\nUnless otherwise approved by council, an interested party is limited to one postponement\nfor a period of not more than 60 days from the date of the scheduled public hearing.\n\n(4)\n\nThe council shall set the time and date of the new hearing at the time a postponement\nis granted.\n\n(D)\n\nAfter a public hearing on a zoning or rezoning application, the council may:\n\n(1)\n\napprove the zoning or rezoning application as requested;\n\n(2)\n\napprove a more restrictive zoning classification than requested;\n\n(3)\n\napprove the requested classification or a more restrictive classification subject\nto conditions; or\n\n(4)\n\ndeny the proposed zoning or rezoning.\n\n(E)\n\nThe council may approve the zoning or rezoning of property if the council determines\nthat the zoning or rezoning is consistent with the Comprehensive Plan and the purposes\nof this title.\n\n(F)\n\nUnless authorized by a resolution of the council, the director of the Planning and\nZoning Department may not schedule a zoning or rezoning ordinance for third reading\nby the council until:\n\n(1)\n\nthe city attorney determines that requirements of the City Code have been met and\nthat required documents protect the interests of the City and have been executed.\nThe city attorney shall make a determination regarding the documents not later than\nthe 14th day after the documents are submitted; and\n\n(2)\n\nfor an application to rezone a property within the mobile home residence (MH) district\ndesignation that contains an existing mobile home park, no earlier than the 270th",
  "start_line": 12166,
  "end_line": 12335,
  "subsections": [
    "25-2-715-B",
    "25-2-715-C",
    "25-2-715-D",
    "25-2-715-E",
    "25-2-715-F",
    "25-2-715-A",
    "25-2-715-B",
    "25-2-715-C",
    "25-2-715-D",
    "25-2-715-E",
    "25-2-715-F"
  ]
}