{
  "id": "25-2-article-8",
  "title": "NONCOMPLYING STRUCTURES",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 8. - NONCOMPLYING STRUCTURES.\n\nNONCOMPLYING means a building, structure, or area, including off-street parking or\nloading areas, that does not comply with currently applicable site development regulations\nfor the district in which it is located, but did comply with applicable regulations\nat the time it was constructed.\n\nSource: Section 13-2-331; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA structure that complied with the site development regulations in effect on March\n1, 1984, is a complying structure notwithstanding the requirements of this chapter.\n\n(B)\n\nA structure that complies with the site development regulations does not become a\nnoncomplying structure as the result of a change in the use, zoning, or development\nof adjacent property.\n\nSource: Section 13-2-820; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsections (B), (C), and (D) of this section, a person may\nmodify or maintain a noncomplying structure.\n\n(B)\n\nThe following requirements must be met in order to modify, maintain, or alter a non-complying\nresidential structure:\n\n(1)\n\nDemolition or removal of walls must comply with the following requirements:\n\n(a)\n\nNo more than fifty percent of exterior walls and supporting structural elements of\nthe existing structure may be demolished or removed, including load bearing masonry\nwalls, and in wood construction, studs, sole plate, and top plate. For purposes of\nthis subsection, exterior walls and supporting structural elements are measured in\nlinear feet and do not include the roof of the structure or interior or exterior finishes.\n\n(b)\n\nReplacement or repair of structural elements, including framing, is permitted if required\nby the building official to meet minimum health and safety requirements.\n\n(2)\n\nReplacement or alteration of an original foundation may not change the finished floor\nelevation by more than one foot vertically, in either direction.\n\n(3)\n\nFor any residential use other than a single-family use in an SF-3 or more restrictive\nzoning district, the following requirements must be met in order to add square footage\nor convert accessory space into conditioned or habitable space:\n\n(a)\n\nIf the lot is non-complying with current lot size or lot width requirements, the cost\nof improvements may not exceed 20 percent of the value of the structure before the\nimprovements.\n\n(b)\n\nCompliance with current parking and occupancy regulations is required.\n\n(4)\n\nIf a noncomplying portion of a structure is demolished, it loses its noncomplying\nstatus and may only be rebuilt in compliance with current code.\n\n(C)\n\nExcept as provided in Subsections (E) and (F), a person may not modify or maintain\na noncomplying structure in a manner that increases the degree to which the structure\nviolates a requirement that caused the structure to be noncomplying.\n\n(D)\n\nThe following requirements must be met in order to repair, reinforce, modify, or maintain\na non-complying dock, bulkhead, or shoreline access as defined in Section 25-2-1172 (Definitions):\n\n(1)\n\nthe use must be an accessory use in compliance with Section 25-2-893(G) (Accessory Uses for a Principal Residential Use);\n\n(2)\n\nexcept as allowed under Section 25-8-652 (Restrictions on Development Impacting Lake Austin, Lady Bird Lake, and Lake Walter\nE. Long):\n\n(a)\n\nthe location and footprint may not be altered; and\n\n(b)\n\nthe degree of noncompliance may not be increased;\n\n(3)\n\na survey of existing conditions must be included with the site plan or building permit\napplication and must depict current elevations, contours, trees, and any other information\nrequired by the building official;\n\n(4)\n\ndemolition is subject to the limitation in Subsection (B)(4) of this section;\n\n(5)\n\ndock structural components, including load bearing beams, walls, piers, and roofs,\nmay be altered or replaced without reducing the legally existing length, height, or\nhorizontal footprint of the dock, provided that the dock complies with:\n\n(a)\n\nthe limitation in Subsections (D)(7)—(8) of this section; and\n\n(b)\n\nall other applicable regulations of Article 13 (Docks, Bulkheads, and Shoreline Access) and Section 25-2-893 (Accessory Uses for a Principal Residential Use);\n\n(6)\n\nno increase is allowed to:\n\n(a)\n\nthe number of walls;\n\n(b)\n\nthe height, width or depth; or\n\n(c)\n\nthe number of slips or mooring capacity; and\n\n(7)\n\nfor a dock, bulkhead, or shoreline access constructed after January 1, 1984, the applicant\nmust provide evidence of a prior permit authorizing the construction; and\n\n(8)\n\nfor a dock, bulkhead, or shoreline access constructed prior to January 1, 1984, no\nunpermitted additions or alterations that occurred after January 1, 1984 are allowed.\n\n(E)\n\nA person may increase the height of a building that is a noncomplying structure based\non a height requirement of this title if:\n\n(1)\n\nthe increase is made to a portion of the building that:\n\n(a)\n\ndoes not exceed the existing maximum height of the building; and\n\n(b)\n\ncomplies with the yard setback requirements of this title;\n\n(2)\n\nthe increase does not exceed 15 percent of the existing maximum height of the building;\nand\n\n(3)\n\nafter modification, the height of the modified portion of the building does not exceed\nthe existing maximum height of the building.\n\n(F)\n\nA person may modify a building that is a noncomplying structure based on a yard setback\nrequirement of this title if:\n\n(1)\n\nthe modified portion of the building:\n\n(a)\n\ndoes not extend further into the required yard setback than the existing noncomplying\nportion of the building, except for a vertical change in finished floor elevation\nallowed under Subsection (B)(2) of this section;\n\n(b)\n\nunless located in a street side yard, is not greater in height than the existing noncomplying\nportion of the building, except for a vertical change in finished floor elevation\nallowed under Subsection (B)(2) of this section; and\n\n(c)\n\ncomplies with the height requirements of this title; and\n\n(2)\n\nthe additional length of a modified portion of the building does not exceed the lesser\nof 50 percent of the length of the noncomplying portion of the building or 25 feet\nmeasured from the existing building and parallel to the lot line.\n\n(G)\n\nSubsection (F) applies to each yard setback requirement with which the existing building\ndoes not comply.\n\n(H)\n\nA person may modify a noncomplying building once under Subsection (E) and once under\nSubsection (F). This section does not prohibit a person from modifying a building\nalong more than one yard setback as part of a single project.\n\nSource: Sections 13-2-820 and 13-2-823; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-043;\nOrd. 20060309-058; Ord. 20060622-022; Ord. 20060928-022; Ord. 20100624-149; Ord. 20101209-075;\nOrd. No. 20140626-113, Pt. 4, 7-7-14.\n\n(A)\n\nA person may restore a noncomplying structure that is damaged or destroyed by fire,\nexplosion, flood, tornado, riot, act of the public enemy, or accident of any kind\nif the restoration begins not later than 12 months after the date the damage or destruction\noccurs.\n\n(B)\n\nExcept as provided in Section 25-2-963 (Modification and Maintenance of Noncomplying Structures):\n\n(1)\n\na structure restored under this section is limited to the same building footprint,\ngross floor area, and interior volume as the damaged or destroyed structure; and\n\n(2)\n\na noncomplying portion of the structure may be restored only in the same location\nand to the same degree of noncompliance as the damaged or destroyed structure.\n\n(C)\n\nThis section does not apply to loss of land resulting from wave action behind a bulkhead\non Lake Austin.\n\nSource: Section 13-2-821; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-043; Ord.\n20060309-058; Ord. 20060622-022; Ord. 20060928-022; Ord. No. 20140626-113, Pt. 5, 7-7-14.\n",
  "start_line": 29166,
  "end_line": 29420,
  "subsections": []
}