{
  "id": "25-2-774",
  "title": "RESERVED",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Ord. No. 20231207-001, Pt. 9, effective December 18, 2023, repealed ยง 25-2-774, which pertained to Two-Family\nResidential Use and derived from Section 13-2-255; Ord. 990225-70; Ord. 000511-108;\nOrd. 000831-65; Ord. 031211-11; Ord. 041118-59; Ord. No. 20151119-080, Pt. 1, 11-30-15.\n\n(A)\n\nNot more than one townhouse is permitted on a townhouse lot.\n\n(B)\n\nThe minimum lot width for a townhouse is 20 feet.\n\n(C)\n\nAt least 3,600 square feet of site area is required for each townhouse.\n\n(D)\n\nAt least two connected townhouses are required on a townhouse site.\n\n(E)\n\nA townhouse lot must include a private yard that complies with the zoning district\nopen space requirement. A wall or solid fence, not less than five feet in height,\nis required along a side lot line that adjoins a required private yard.\n\n(F)\n\nThe width of a driveway that serves only one townhouse and that is located in the\nfront yard of the townhouse lot may not exceed 50 percent of the lot width.\n\n(G)\n\nA driveway that serves more than one townhouse may include not more than 50 percent\nof the combined area of the required street yards of the townhouses served by the\ndriveway. The driveway may have not more than two points of vehicular access to a\npublic street.\n\n(H)\n\nThis subsection applies in an SF-5 district.\n\n(1)\n\nA townhouse group with access to a local residential street:\n\n(a)\n\nmust be located at least 100 feet from other townhouse groups with access to a local\nresidential street; and\n\n(b)\n\nmay include not more than six townhouses.\n\n(2)\n\nA townhouse group with access to a street other than a local residential street:\n\n(a)\n\nmust be located at least 300 feet from other townhouse groups with access to a street\nother than a local residential street; and\n\n(b)\n\nmay include not more than ten townhouses.\n\nSource: Section 13-2-256; Ord. 990225-70; Ord. 000309-39; Ord. 031211-11.",
  "start_line": 24262,
  "end_line": 24330,
  "subsections": []
}