{
  "id": "25-2-840",
  "title": "SPECIAL REQUIREMENTS FOR TELECOMMUNICATION TOWERS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "(A)\n\nA tower used by a public agency exclusively for police, fire, emergency medical services,\n911 or other public emergency communications is exempt from the requirements of this\nsection and Section 25-2-840 (Special Requirements For Telecommunication Towers).\n\n(B)\n\nA telecommunication tower may exceed the height restrictions of the base zoning district\nand the compatibility standards in Article 10 (Compatibility Standards).\n\n(C)\n\nA telecommunication tower must be constructed in accordance with the most recent American\nNational Standard Institute structural standards for steel antenna towers.\n\n(D)\n\nNotwithstanding the requirements of Subsections (E), (F), and (G), a telecommunication\ntower that complies with the requirements of this subsection is permitted in any zoning\ndistrict.\n\n(1)\n\nThe tower must be a replacement for a functioning:\n\n(a)\n\nutility pole or light standard within a utility easement or public right of way;\n\n(b)\n\nrecreation facility light pole; or\n\n(c)\n\ntelecommunication tower.\n\n(2)\n\nThe tower, including antenna array, may not exceed the height of:\n\n(a)\n\nthe original utility pole, light standard, or recreation facility pole by more than\n10 feet; or\n\n(b)\n\nthe original telecommunication tower and antenna array.\n\n(3)\n\nThe tower may not obstruct a public sidewalk, public alley, or other public right\nof way.\n\n(4)\n\nThe tower must be similar in appearance and function to the pole, standard, or tower\nthat it replaces, except for the antennae.\n\n(E)\n\nA telecommunication tower described in Subsection (F) or (G) must comply with the\nrequirements of this subsection.\n\n(1)\n\nThe tower may not be located:\n\n(a)\n\non or within 300 feet of property that is zoned as a historic landmark (H) or historic\narea (HD) combining district or included in a National Register District;\n\n(b)\n\nwithin 50 feet of a day care services (commercial) use; or\n\n(c)\n\nwithin 50 feet of a dwelling unit.\n\n(2)\n\nThe tower must be of monopole construction and designed to accommodate at least two\nantenna array.\n\n(3)\n\nThe antenna array may not exceed tower height by more than 10 feet.\n\n(4)\n\nGuys and guy anchors must be at least 20 feet from adjoining property.\n\n(5)\n\nThe tower must be:\n\n(a)\n\nenclosed by security fencing; and\n\n(b)\n\nscreened from street view by landscaping at least six feet high.\n\n(6)\n\nThe tower must be identified by a sign visible from outside the screening. The sign\nmust state in letters at least two inches high the name and telephone number of the\ntower manager and the Federal Communications Commission license number.\n\n(F)\n\nA telecommunication tower that complies with the requirements of this subsection is\na permitted use in an SF-6 or less restrictive district, except for an MH district.\n\n(1)\n\nThe tower must be at least 200 feet from an MH district or use or an SF-5 or more\nrestrictive district or use.\n\n(2)\n\nThe tower, excluding antenna array, may not exceed the following height:\n\n(a)\n\n75 feet, for a tower less than 250 feet from an MH district or use or SF-5 or more\nrestrictive district or use;\n\n(b)\n\n100 feet, for a tower at least 250, but less than 540, feet from an MH district or\nuse or an SF-5 or more restrictive district or use; or\n\n(c)\n\n120 feet, for a tower 540 feet or more from an MH district or use or an SF-5 or more\nrestrictive district or use.\n\n(3)\n\nThe director may waive a requirement of this subsection for a minimum separation distance\nbetween a tower and an MH use or an SF-5 or more restrictive use if the director determines\nthat:\n\n(a)\n\nthe tower will be located in a GO or less restrictive district;\n\n(b)\n\nnot more than two uses that are MH uses or SF-5 or more restrictive uses are less\nthan the prescribed separation distance from the tower base;\n\n(c)\n\nthe MH uses or SF-5 or more restrictive uses that are less than the prescribed separation\ndistance from the tower base, if any, are located in SF-6 or less restrictive zoning\ndistricts; and\n\n(d)\n\nthe proposed tower location will not negatively affect a residential neighborhood.\n\n(G)\n\nA telecommunications tower that is not a permitted use under Subsection (F) is a conditional\nuse in an SF-6 or less restrictive district, except for an MH district, if the tower\ncomplies with the requirements of this subsection.\n\n(1)\n\nThe tower must be at least 75 feet from an MH district or use or an SF-5 or more restrictive\ndistrict or use.\n\n(2)\n\nThe tower, excluding antenna array, may not exceed the following height:\n\n(a)\n\n75 feet for a tower less than 100 feet from an MH district or use or an SF-5 or more\nrestrictive district or use;\n\n(b)\n\n100 feet, for a tower at least 100, but less than 200, feet from an MH district or\nuse or an SF-5 or more restrictive district or use;\n\n(c)\n\n120 feet, for a tower at least 200, but less than 300, feet from an MH district or\nuse or an SF-5 or more restrictive district or use; or\n\n(d)\n\na height set by the Land Use Commission, for a tower 300 feet or more from an MH district\nor use or SF-5 or more restrictive district or use.\n\n(3)\n\nThe Land Use Commission may waive a requirement of this subsection for a minimum separation\ndistance between a tower and an MH use or an SF-5 or more restrictive use if the Land\nUse Commission determines that:\n\n(a)\n\nthe tower will be located in a GO or less restrictive district;\n\n(b)\n\nnot more than two uses that are MH uses or SF-5 or more restrictive uses are less\nthan the prescribed separation distance from the tower base;\n\n(c)\n\nthe MH uses or SF-5 or more restrictive uses that are less than the prescribed separation\ndistance from the tower base, if any, are located in SF-6 or less restrictive zoning\ndistricts; and\n\n(d)\n\nthe proposed tower location will not negatively affect a residential neighborhood.\n\n(H)\n\nThe distance from a tower to a zoning district or use is measured:\n\n(1)\n\nalong a straight line from the center of the tower base to the nearest property line\nof the zoning district or use; or\n\n(2)\n\nfor a distance prescribed by Paragraph (E)(1)(c), along a straight line from the center\nof the tower base to the nearest exterior wall of the dwelling unit.\n\n(I)\n\nIn this section, a reference to an MH district or use or SF-5 or more restrictive\nzoning district or use does not include property that is:\n\n(1)\n\nvacant and unplatted;\n\n(2)\n\nused for a public or private primary or secondary educational facility;\n\n(3)\n\nused for a college or university educational facility;\n\n(4)\n\nowned by the United States, the State of Texas, a county, or the City, and not used\nfor an MH or SF-5 or more restrictive residential use;\n\n(5)\n\nused primarily for religious assembly;\n\n(6)\n\nused for a cemetery;\n\n(7)\n\nused for a non-residential, nonconforming use; or\n\n(8)\n\ndetermined by the director to be used in a manner similar to the uses described in\nthis subsection.\n\nSource: Sections 13-2-235 and 13-2-273; Ord. 990225-70; Ord. 000302-36; Ord. 010607-8;",
  "start_line": 27099,
  "end_line": 27380,
  "subsections": []
}