{
  "id": "25-2-article-13",
  "title": "DOCKS, BULKHEADS, AND SHORELINE ACCESS",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 13. - DOCKS, BULKHEADS, AND SHORELINE ACCESS.\n\n(A)\n\nThis article applies to a structure or development:\n\n(1)\n\nin Lake Austin, Lady Bird Lake, or Lake Walter E. Long;\n\n(2)\n\nalong the shore of Lake Austin in the area below 504.9 feet above mean sea level;\n\n(3)\n\nalong the shore of Lady Bird Lake below 435 feet above mean sea level;\n\n(4)\n\nalong the shore of Lake Walter E. Long; or\n\n(5)\n\nused for access to areas described in this Subsection.\n\n(B)\n\nThe director of the Planning and Development Review Department shall implement and\nenforce this article.\n\nSource: Section 13-2-791(a) and (d); Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075;\nOrd. 20131017-079; Ord. No. 20140626-113, Pt. 6, 7-7-14.\n\nIn this article:\n\n(1)\n\nBULKHEAD means a revetment or wall constructed for the purpose of stabilizing or modifying\nthe shoreline.\n\n(2)\n\nCLUSTER DOCK means a dock not used for commercial purposes that is associated with:\n\n(a)\n\ndwelling units in a multifamily development with lake frontage; or\n\n(b)\n\nprincipal residential structures in a subdivision with perpetual use rights to a common\narea that fronts a lake.\n\n(3)\n\nCONSTRUCT includes placing or replacing a structure and structurally altering an existing\nstructure.\n\n(4)\n\nDOCK includes a wharf, pier, float, floating dock, island, boat dock, boat slip, boat\nlift, stationary platform, or other similar structure.\n\n(5)\n\nMOTORBOAT means a watercraft propelled by an internal combustion engine or electric\nmotor.\n\n(6)\n\nNORMAL POOL ELEVATION means:\n\n(a)\n\nfor Lake Austin, 492.8 feet above mean sea level;\n\n(b)\n\nfor Lady Bird Lake, 429 feet above mean sea level; and\n\n(c)\n\nfor Lake Walter E. Long, 554.5 feet above mean sea level.\n\n(7)\n\nPERSONAL WATERCRAFT includes jet skis and means a type of motorboat specifically designed\nto be operated by a person or persons sitting, standing or kneeling on the vessel\nrather than in the conventional manner of sitting or standing inside the vessel and\nthat is less than 13 feet in length.\n\n(8)\n\nSHORELINE means the line where the edge of the water meets the land at normal pool\nelevation.\n\n(9)\n\nSHORELINE ACCESS means improvements constructed to provide a means of approaching\nthe shoreline such as stairs, lifts, trams, incline elevators or escalators.\n\n(10)\n\nSHORELINE FRONTAGE means the total linear distance of the shoreline.\n\nSource: Section 13-2-790; Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075; Ord. No. 20140626-113, Pt. 7, 7-7-14; Ord. No. 20160922-048, Pt 2, 10-3-16.\n\n(A)\n\nA person may not modify a shoreline or construct or modify a dock, bulkhead, or shoreline\naccess unless the person first obtains a site plan, except as otherwise allowed under\nSection 25-5-2 (Site Plan Exemptions), and building permit and pays the applicable fees established by ordinance. A site\nplan required under this section must be signed and sealed by a licensed professional\nengineer and must include all information required by the director responsible for\nadministering this chapter.\n\n(B)\n\nA permit obtained under this section shall be prominently displayed at the construction\nsite until the final inspection and approval by the building official.\n\n(C)\n\nIf a permit is required under this section and is not obtained before construction\nbegins, the required fee is increased by an amount established by ordinance. Payment\nof the additional fee does not relieve a person from complying with the requirements\nof this title.\n\n(D)\n\nWhere an inspection is required by state law, neither a Certificate of Compliance\nnor a final inspection may be issued for shoreline access unless the applicant has\nsubmitted an inspection report, signed by a QEI-1 inspector registered with the Texas\nDepartment of Licensing and Regulation, stating that all applicable state regulations\nhave been met.\n\nSource: Sections 13-2-791 and 13-2-794; Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075;\nOrd. 20131017-079; Ord. No. 20140626-113, Pt. 8, 7-7-14.\n\n(A)\n\nIn addition to other applicable requirements of this title, a dock must:\n\n(1)\n\ncomply with the requirements of\nChapter 25-12\n(Technical Codes), including Article 1 (Building Code), Article 7 (Fire Code), and the Building Criteria Manual;\n\n(2)\n\nbe designed and constructed in a manner that does not pose a hazard to navigation\nsafety;\n\n(3)\n\nbe braced to withstand pressure of wind and water when boats are tied to the dock;\nand\n\n(4)\n\nif the dock is a floating dock, be supported by solid displacement flotation devices,\nwith durable nonferrous protective coverings that are securely attached to the dock\nand capable of withstanding prolonged exposure to wave action and weather.\n\n(B)\n\nA bulkhead with a greater than 45 degree vertical slope for any portion greater than\none foot in height is not permitted on or adjacent to the shoreline of a lake that\nis subject to this article, unless the shoreline is located within an existing man-made\nchannel.\n\nSource: Section 13-2-792; Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075; Ord.\n20121018-024; Ord. No. 20140626-113, Pt. 9, 7-7-14.\n\n(A)\n\nA dock must be lighted as provided in this section and in compliance with\nChapter 25-12, Article 4\n(Electrical Code). This section does not apply to a dock located on an inlet or slough, unless the\ndock is on Bee Creek or Bull Creek.\n\n(B)\n\nThis subsection applies to a dock that extends more than eight feet from the shoreline.\nIn this subsection, the distance that a dock extends from a shoreline is measured\nperpendicular to the shoreline.\n\n(1)\n\nA dock must be continuously lighted with amber lights between sunset and sunrise each\nday.\n\n(2)\n\nA dock must have at least one light station. Except as otherwise provided in this\nsubsection, the light station must be located on the end of the dock and on the side\nthat is farthest from and parallel to the shoreline. The light must be visible to\na properly approaching watercraft.\n\n(3)\n\nA dock that extends 30 feet or more from the shoreline, or that has a shoreline frontage\nof 25 feet or more, must have at least one light station on each side of the dock\nthat does not face the shoreline.\n\n(4)\n\nThe requirements of this paragraph apply if the director determines that a dock described\nin Subsection (B)(3) may be a navigational hazard between sunset and sunrise.\n\n(a)\n\nA dock that extends less than 50 feet from the shoreline must have a light station\nhalfway between the shoreline and the end of the dock that is farthest from the shoreline.\n\n(b)\n\nA dock that extends 50 feet or more from the shoreline must have light stations from\nthe shoreline to the end of the dock at intervals of not more than 25 feet, except\nthat a light station may not be located within 8 feet of the shoreline.\n\n(c)\n\nA dock that has a shoreline frontage of at least 25 feet but less than 50 feet must\nhave a light station located at each end of the dock on the side farthest from the\nshoreline.\n\n(d)\n\nA dock that has a shoreline frontage of 50 feet or more must have light stations located\nat intervals of not more than 25 feet along its frontage.\n\n(e)\n\nLight stations are required at each end of the dock on the side farthest from the\nshoreline.\n\n(C)\n\nA light station required by this section must have a two-bulb fixture, with two working\nlight bulbs that emit at least 112 lumens and not more than 400 lumens. Light bulbs\nor bulb covers must be amber, and white light may not radiate from the fixture. Weatherproof\nlamp holders and junction boxes are required. Each light fixture must be wired with\na switch operated by a photoelectric cell so that the lights will operate automatically\nduring the hours that the dock is required to be lighted by this section.\n\n(D)\n\nWiring on a dock must be enclosed in rigid conduit or weatherproof flexible conduit\nwith appropriate fittings.\n\n(E)\n\nIf lights other than those required by this section are installed on a dock, only\nan amber navigation light may cast a beam of light outward from the dock.\n\n(F)\n\nA dock that requires lights under this section must provide temporary navigation lights\nthat meet the requirements of this section during construction and until the permanent\nnavigation lights installed on the dock are working.\n\n(G)\n\nIf a dock does not comply with this section, the building official or other authorized\ncity official shall post notice on the dock and shall notify the owner by mail of\nthe violation. An offense under this section is punishable by a fine of not less than\n$200.\n\nSource: Section 13-2-793; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-079; Ord. No. 20140626-113, § 10, 7-7-14; Ord. No. 20160922-048, Pt. 3, 10-3-16.\n\n(A)\n\nA dock or similar structure must comply with the requirements of this subsection.\n\n(1)\n\nA dock may extend up to 30 feet from the shoreline, except that the director may require\na dock to extend a lesser or greater distance from the shoreline if deemed necessary\nto ensure navigation safety.\n\n(2)\n\nNo portion of a dock shall extend more than 20% of a channel width as measured by\na line that is perpendicular to the centerline of the channel and that extends from\nthe shoreline where the dock is located to the opposite shoreline.\n\n(3)\n\nA dock may not be constructed closer than 10 feet to the side property line, regardless\nof the side-yard setback generally applicable within the base zoning district.\n\n(4)\n\nThe width of a dock measured parallel to the shoreline of the lot or tract where the\ndock is proposed, and including all access and appurtenances, may not exceed:\n\n(a)\n\n20 percent of the shoreline frontage, if the shoreline width exceeds 70 feet;\n\n(b)\n\n14 feet, if the shoreline frontage is no greater than 70 feet.\n\n(5)\n\nThe footprint of a dock, including the portion of a cut-in slip, attached access structures,\nor roof overhang, may not exceed:\n\n(a)\n\n1,200 square feet for a dock that is accessory to a principal residential use;\n\n(b)\n\nfor a cluster dock, 600 square feet multiplied by:\n\n(i)\n\nthe number of dwelling units in a multifamily development; or\n\n(ii)\n\nthe number of principal residential structures in a subdivision, if:\n\nthe dock will be located in a common area that fronts Lake Austin or Lady Bird Lake;\nand\n\nlots within the subdivision have perpetual use rights to the common area.\n\n(6)\n\nA dock may not exceed 30 feet in height as measured from the highest point of the\nstructure above the normal pool elevation of the lake.\n\n(7)\n\nNo portion of a dock may be enclosed, except for an enclosed storage closet that is:\n\n(a)\n\nlimited to no more than 48 square feet for each principal residential use associated\nwith the dock; and\n\n(b)\n\noriented to minimize cross sectional area perpendicular to flow.\n\n(8)\n\nThe dock must be designed and constructed to meet the following requirements:\n\n(a)\n\nexcept for storage closets permitted under Paragraph (7), all solid structural supports\nand other materials used for enclosure, including lattice, wire panels, seat walls,\nand screening, must be at least 66 percent open, except that mesh for insect screening\nthat is at least 66 percent open will not count toward the total enclosure percentage;\n\n(b)\n\nno framing materials that are capable of being converted to support walls or windows\nmay be used; and\n\n(c)\n\npercentage of required openness is calculated per side, with the assumed height of\neight feet per floor when no roof is proposed.\n\n(9)\n\nThe number of motorboats anchored, moored, or stored on a dock may not exceed:\n\n(a)\n\ntwo, for a principal residential use utilizing an individual dock that is not part\nof a cluster dock; or\n\n(b)\n\nthe number of single-family or multifamily residential units that:\n\n(i)\n\nhave a perpetual right to use of a cluster dock located in a common area of the residential\nsubdivision or multi-family development; and\n\n(ii)\n\ndo not utilize a dock other than a cluster dock.\n\n(10)\n\nFor purposes of determining the total number of motorboats that may be anchored, moored,\nor stored on a dock or over water, one personal watercraft is equivalent to one-half\nof a motorboat.\n\n(B)\n\nA marina area or cluster dock must comply with the requirements of this subsection.\n\n(1)\n\nA parking lot or permanent structure, other than a dock or a combined storage area\non the water's edge, must be set back at least 100 feet from the shoreline.\n\n(2)\n\nSanitation facilities must be provided in accordance with the following requirements.\n\n(a)\n\nPermanent sanitation facilities are required for a marina or common area with 10 or\nmore boat slips.\n\n(b)\n\nTemporary or permanent sanitation facilities are required for a marina or common area\nwith fewer than 10 boat slips.\n\n(3)\n\nA facility operator must:\n\n(a)\n\nremove garbage in a timely manner and provide for the on-site collection of garbage\nat a marina or common area; and\n\n(b)\n\nprovide at least one garbage can with a capacity of at least 32 gallons for each four\npicnic units and for each four boat slips.\n\n(C)\n\nA fence may not extend into the water beyond the shoreline unless the fence:\n\n(1)\n\nwas part of a commercial livestock operation, other than raising domestic pets, existing\non April 17, 1994:\n\n(2)\n\nis constructed of smooth wire or mesh;\n\n(3)\n\nextends no more than 40 feet beyond the shoreline;\n\n(4)\n\nincludes a navigation buoy indicating \"DANGER\", in accordance with the Texas Water\nSafety Act, installed at the end of the fence, unless the fence does not extend further\nbeyond the shoreline than an immediately adjacent dock; and\n\n(5)\n\nmust be removed if the livestock operation ceases.\n\n(D)\n\nConstruction of a boat ramp is prohibited, unless the boat ramp is constructed on\npublic land and dedicated for public use.\n\n(E)\n\nA person constructing shoreline access, as that term is defined in Section 25-2-1172 (Definitions), shall screen the shoreline access from the view of a property with at least one\ndwelling unit but less than four dwelling units and is zoned urban family residence\n(SF-5) district or more restrictive.\n\n(1)\n\nA person may comply with this subsection by providing vegetation and tree canopy as\nprescribed by rule and may supplement compliance with other screening methods prescribed\nby rule.\n\n(2)\n\nThe owner must maintain the screening required by this section.\n\nSource: Section 13-2-795; Ord. 990225-70; Ord. 031120-44; Ord. 031211-11; Ord. 20101209-075;\nOrd. 20131017-079; Ord. No. 20140626-113, Pt. 11, 7-7-14; Ord. No. 20160922-048, Pt. 4, 10-3-16; Ord. No. 20240516-004, Pt. 3, 7-15-24.\n\n(A)\n\nA license agreement from the City is not required for a dock located along Lake Austin,\nLady Bird Lake, or Lake Walter E. Long, regardless of any easements or other ownership\nrights held by the City.\n\n(B)\n\nNo living quarters or business, including a marina, may be constructed into or above\na lake that is subject to this article, unless the city council approves a license\nagreement for the use after receiving a recommendation from the Land Use Commission.\n\nSource: Section 13-2-796; Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075; Ord. No. 20140626-113, Pt. 12, 7-7-14.\n\n**Editor's note—**\nOrd. No. 20140626-113, Pt. 13, effective July 7, 2014, repealed § 25-2-1178, which pertained to fire protection. See References to Ordinances\nfor complete derivation.\n\n(A)\n\nIn addition to other applicable requirements of this title, a dock, bulkhead, or shoreline\naccess must be designed, constructed, and maintained in accordance with the applicable\nrequirements of this subsection.\n\n(B)\n\nA marine fuel facility or service station must comply with the requirements of Chapter\n6-2 (Hazardous Materials) and shall be designed, maintained, and operated in a manner that prevents the spilling\nor leaking of fuel or petroleum products into the water.\n\n(C)\n\nThe maintenance and repair of watercraft shall be performed in a manner that prevents\ndischarge of fuel, oil, or other pollutants into the water.\n\n(D)\n\nContainers of hazardous materials, fuel, oil, herbicides, insecticides, fertilizers\nor other pollutants may not be stored on docks extending into or above Lake Austin,\nLady Bird Lake, or Lake Walter E. Long.\n\n(E)\n\nConstruction of shoreline access structures must minimize disturbance to woody and\nherbaceous vegetation, preserve the tree canopy, and replace herbaceous ground cover\nto the extent practicable.\n\n(F)\n\nA marina or marine fuel service facility or service station must provide adequate\nfire protection approved by the Fire Chief of the Austin Fire Department in accordance\nwith the Fire Code and National Fire Protection Association standards for marinas\nand boatyards.\n\nSource: Section 13-2-798; Ord. 990225-70; Ord. 031211-11; Ord. 20101209-075; Ord. No. 20140626-113, Pt. 13, 7-7-14; Ord. No. 20221027-045, Pt. 3, 11-7-22.\n\n(A)\n\nOn a determination by a city official or employee that a dock has become or is in\nimminent danger of becoming structurally unsound, the building official:\n\n(1)\n\nshall take action to declare the dock a hazard;\n\n(2)\n\nshall abate the hazard under\nChapter 25-12, Article 9\n(Property Maintenance Code), at the owner's expense; and\n\n(3)\n\nmay impose a lien on the affected property to recover the cost of abatement.\n\n(B)\n\nAn applicant must place a registration tag on a boat dock in a manner prescribed by\nthe director of the Code Compliance Department. A person may not remove a tag required\nto be placed on a dock under this subsection.\n\n(C)\n\nIn addition to the actions authorized under this section, the building official may\ntake any other authorized action to enforce the requirements of this article.\n\nSource: Ord. No. 20140626-113, Pt. 14, 7-7-14.\n",
  "start_line": 31165,
  "end_line": 31740,
  "subsections": []
}