{
  "id": "25-2-article-3",
  "title": "ADDITIONAL REQUIREMENTS FOR CERTAIN DISTRICTS",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 3. - ADDITIONAL REQUIREMENTS FOR CERTAIN DISTRICTS.\n\n(A)\n\nIn this section:\n\n(1)\n\nSHORELINE means the 492.8 topographic contour line along the shores of Lake Austin.\n\n(2)\n\nSHORELINE SETBACK means a line parallel to the shoreline and at a distance from the\nshoreline that is prescribed in this section.\n\n(3)\n\nSHORELINE SETBACK AREA means an area between the shoreline and the shoreline setback.\n\n(B)\n\nThis subsection specifies shoreline setbacks in a Lake Austin (LA) district.\n\n(1)\n\nThe shoreline setback is:\n\n(a)\n\n75 feet; or\n\n(b)\n\n25 feet, if:\n\n(i)\n\nthe lot is located in a subdivision plat recorded before April 22, 1982, or is a legal\ntract exempt from the requirement to plat; and\n\n(ii)\n\nthe distance between the shoreline and the front lot line, or the property line of\na legal tract, is 200 feet or less.\n\n(2)\n\nA shoreline setback area is excluded from impervious cover calculations.\n\n(3)\n\nNo structures are allowed in a shoreline setback area, except that:\n\n(a)\n\na bulkhead, retaining wall, fence, dock, public boat ramp, non-mechanized pedestrian\naccess facility, or marina may be constructed and maintained in accordance with applicable\nregulations of this title; and\n\n(b)\n\nan on-site sewage facility may be constructed and maintained in accordance with the\napplicable regulations of Chapter 15-5 (Private Sewage Facilities).\n\n(C)\n\nThis subsection specifies lot width and impervious cover restrictions in a Lake Austin\n(LA) district.\n\n(1)\n\nIf a lot fronts on a cul-de-sac and is included in a subdivision plat recorded after\nApril 22, 1982 or is exempt from the requirement to plat it must have:\n\n(a)\n\na chord width of not less than 33 feet at the front lot line;\n\n(b)\n\na width of not less than 60 feet at the front yard setback line; and\n\n(c)\n\na width of not less than 100 feet at all points 100 feet or more behind the front\nlot line.\n\n(2)\n\nFor a lot included in a subdivision plat recorded after April 22, 1982, impervious\ncover may not exceed:\n\n(a)\n\n20 percent, on a slope with a gradient of 25 percent or less;\n\n(b)\n\n10 percent, on a slope with a gradient of more than 25 percent and not more than 35\npercent; or\n\n(c)\n\nif impervious cover is transferred under Subsection (D), 30 percent.\n\n(3)\n\nFor a lot included in a subdivision plat recorded before April 22, 1982, or a tract\nthat is not required to be platted, impervious cover may not exceed:\n\n(a)\n\n35 percent, on a slope with a gradient of 15 percent or less;\n\n(b)\n\n10 percent, on a slope with a gradient of more than 15 percent and not more than 25\npercent;\n\n(c)\n\n5 percent, on a slope with a gradient of more than 25 percent and not more than 35\npercent; or\n\n(d)\n\n40 percent, if impervious cover is transferred under Subsection (D).\n\n(D)\n\nThis subsection authorizes the transfer of impervious cover in a Lake Austin (LA)\ndistrict.\n\n(1)\n\nImpervious cover may be transferred only:\n\n(a)\n\nbetween tracts within an LA district; and\n\n(b)\n\nfrom land with a gradient of 35 percent or less, to land with a gradient of 15 percent\nor less.\n\n(2)\n\nLand from which impervious cover is transferred must remain undisturbed, if the land\nexists in a natural condition, or be restored to a natural condition as prescribed\nby the Environmental Criteria Manual.\n\n(3)\n\nA transfer of impervious cover must be documented in a manner approved by the director\nand documented in the county deed records.\n\n(E)\n\nThis subsection specifies additional development standards based on slope gradient\nin a Lake Austin (LA) district.\n\n(1)\n\nOn a slope with a gradient of more than 15 percent:\n\n(a)\n\nvegetation must be restored with native vegetation, as prescribed by the Environmental\nCriteria Manual, if it is disturbed or removed as a result of construction; and\n\n(b)\n\nconstruction uphill or downhill from the slope must comply with the Environmental\nCriteria Manual.\n\n(2)\n\nOn a slope with a gradient of more than 35 percent, development is prohibited except\nfor the construction of a fence, driveway, road or utility that cannot be reasonably\nplaced elsewhere, or a non-mechanized pedestrian facility, such as a foot path, sidewalk,\nor stairs.\n\n(F)\n\nIn an LA district, a person may transfer impervious cover in accordance with this\nsubsection.\n\n(1)\n\nImpervious cover may be transferred only:\n\n(a)\n\nbetween tracts within an LA district; and\n\n(b)\n\nfrom land with a gradient of 35 percent or less, to land with a gradient of 15 percent\nor less.\n\n(2)\n\nLand from which impervious cover is transferred may not be developed. The land must\neither remain undisturbed or be restored to a natural state.\n\n(3)\n\nA transfer of impervious cover must be described in a restrictive covenant that runs\nwith the land, is approved by the city attorney, and is recorded in the county deed\nrecords.\n\nSource: Section 13-2-631; Ord. 990225-70; Ord. 031211-11; Ord. No. 20140626-113, Pt. 2, 7-7-14; Ord. No. 20160922-048, Pt. 1, 10-3-16.\n\n(A)\n\nThis section applies in a rural residence (RR) district.\n\n(B)\n\nA lot that fronts on a cul-de-sac must have:\n\n(1)\n\na chord width of not less than 33 feet at the front lot line;\n\n(2)\n\na width of not less than 60 feet at the front yard setback line; and\n\n(3)\n\na width of not less than 100 feet at all points 100 feet or more behind the front\nlot line.\n\n(C)\n\nThis subsection applies to lot clustering.\n\n(1)\n\nLot clustering is a conditional use that requires Land Use Commission approval before\na final plat may be approved.\n\n(2)\n\nLot clustering requires a minimum of five lots.\n\n(3)\n\nAn average lot size of not less than one acre is required.\n\n(4)\n\nEach lot must contain a building site not less than 3,000 square feet in area that\nis located on land with a gradient of not more than 25 percent.\n\n(5)\n\nDevelopment on land with a gradient greater than 35 percent is prohibited.\n\n(6)\n\nThe subdivider shall provide for maintenance of common areas. The maintenance provisions\nmust be included in a homeowners association agreement, unless the Land Use Commission\napproves a different method when the subdivision is approved.\n\nSource: Sections 13-2-222 and 13-2-632; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nIn a single-family residence large lot (SF-1) district, the rear yard setback is five\nfeet for an accessory building that is not more than one story or 15 feet in height.\n\nSource: Section 13-2-633; Ord. 990225-70; Ord. 031211-11.\n\nIn a single-family residence standard lot (SF-2) district, the rear yard setback is\nfive feet for an accessory building that is not more than one story or 15 feet in\nheight.\n\nSource: Section 13-2-634(a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in a family residence (SF-3) district.\n\n(B)\n\nThe rear yard setback is five feet for an accessory building that is not more than\none story or 15 feet in height.\n\n(C)\n\nFor a retirement housing (small site) use:\n\n(1)\n\nthe minimum site area is 18,675 square feet;\n\n(2)\n\na site may be developed with not more than 122 dwelling units;\n\n(3)\n\nat least 6,225 square feet of site area is required for each dwelling unit; and\n\n(4)\n\nexcept for a parking space in a driveway, a parking space may not be located in a\nfront street yard.\n\nSource: Section 13-2-635; Ord. 99025-70; Ord. 030605-49; Ord. 031211-11; Ord. No. 20231207-001, Pt. 7, 12-18-23.\n\n(A)\n\nIn a single-family standard lot (SF-2) or family residence (SF-3) district, the building\nofficial may approve impervious cover of up to 55 percent on a lot after determining\nthat the requirements of this section are satisfied.\n\n(B)\n\nThe principal use of the lot must be a residential use.\n\n(C)\n\nThe lot must be included in a plat that was recorded before January 2, 1989.\n\n(D)\n\nThe lot must adjoin open space, including a golf course or regional park, and the\nopen space:\n\n(1)\n\nmust not contain a significant amount of impervious cover;\n\n(2)\n\nmust not be likely to be developed with a significant amount of impervious cover;\n\n(3)\n\nmust contain at least twice the area of the adjacent lots; and\n\n(4)\n\nmust not be separated from the lot by an impervious barrier, including street pavement\nor a paved plaza.\n\n(E)\n\nA variance from a required building setback on the lot must not have been granted\nor requested, and the owner of the lot must agree not to request a variance from a\nrequired building setback.\n\n(F)\n\nA development intensity transfer affecting the open space must not have been granted.\n\nSource: Sections 13-2-634(b) and 635(d); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in a single-family residence condominium site (SF-4B) district.\n\n(B)\n\nA site must be not less than one acre and not more than five acres.\n\n(C)\n\nFor the portion of a site facing a public right-of-way on one side, at least 40 feet\nof site width is required for each building.\n\n(D)\n\nFor the portion of a site facing a public right-of-way on two sides, at least 50 feet\nof site width is required for each building.\n\n(E)\n\nAt least 3,600 square feet of site area is required for each dwelling unit.\n\n(F)\n\nAt least 2,800 square feet of site area is required for each building.\n\n(G)\n\nExcept as provided in Subsection (H), the maximum height of a building is two stories.\nA story may not exceed a plate height of 10 feet.\n\n(H)\n\nAttic living space is permitted above a second floor if:\n\n(1)\n\nthe attic walls along the building perimeter do not exceed a height of three feet;\nand\n\n(2)\n\nthe floor area of the attic does not exceed 50 percent of the floor area of the second\nfloor.\n\n(I)\n\nIf a building faces a public right-of-way:\n\n(1)\n\nthe minimum front yard setback is 25 feet; and\n\n(2)\n\nthe minimum side street yard setback is 15 feet.\n\n(J)\n\nThe minimum distance between structures is 10 feet.\n\n(K)\n\nThe minimum rear yard setback is 15 feet.\n\n(L)\n\nThe minimum setback between a rear access easement and a building or fence is 10 feet.\n\nSource: Section 13-2-637; Ord. 990225-70; Ord. 031120-44; Ord. 031211-11; Ord. 041118-57.\n\n(A)\n\nIn an urban family residence (SF-5) or townhouse and condominium residence (SF-6)\ndistrict, a retirement housing use must comply with the requirements of this section.\n\n(B)\n\nThe minimum site area is 10,500 square feet.\n\n(C)\n\nAt least 3,500 square feet of site area is required for each dwelling unit.\n\n(D)\n\nExcept for a parking space in a driveway, a parking space may not be located in a\nfront street yard.\n\nSource: Section 13-2-639; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in a multifamily residence limited density (MF-1) district.\n\n(B)\n\nThe minimum site area for each dwelling unit is:\n\n(1)\n\n2,500 square feet, for an efficiency dwelling unit;\n\n(2)\n\n3,000 square feet, for a one bedroom dwelling unit; and\n\n(3)\n\n3,500 square feet, for a dwelling unit with two or more bedrooms.\n\nSource: Section 13-2-638; Ord. 990225-70; Ord. 031211-11; Ord. 20111215-096.\n\n(A)\n\nThis section applies in a multifamily residence low density (MF-2) district.\n\n(B)\n\nThe minimum site area for each dwelling unit is:\n\n(1)\n\n1,600 square feet, for an efficiency dwelling unit;\n\n(2)\n\n2,000 square feet, for a one bedroom dwelling unit; and\n\n(3)\n\n2,400 square feet, for a dwelling unit with two or more bedrooms.\n\nSource: Section 13-2-640; Ord. 990225-70; Ord. 031211-11; Ord. 20111215-096.\n\n(A)\n\nThis section applies in an MF-3 district.\n\n(B)\n\nThe minimum site area for each dwelling unit is:\n\n(1)\n\n1,200 square feet, for an efficiency dwelling unit;\n\n(2)\n\n1,500 square feet, for a one bedroom dwelling unit; and\n\n(3)\n\n1,800 square feet, for a dwelling unit with two or more bedrooms.\n\nSource: Section 13-2-641; Ord. 990225-70; Ord. 031211-11; Ord. 20111215-096.\n\n(A)\n\nThis section applies in a multifamily residence moderate-high density (MF-4) or multifamily\nresidence high density (MF-5) district.\n\n(B)\n\nThe minimum site area for each dwelling unit is:\n\n(1)\n\n800 square feet, for an efficiency dwelling unit;\n\n(2)\n\n1,000 square feet, for a one bedroom dwelling unit; and\n\n(3)\n\n1,200 square feet, for a dwelling unit with two or more bedrooms.\n\nSource: Sections 13-2-642 and 13-2-643; Ord. 990225-70; Ord. 031211-11; Ord. 20111215-096.\n\n(A)\n\nThis section applies to a lot that is located in a rural residence (RR), single-family\nlarge lot (SF-1), single-family standard lot (SF-2), family residence (SF-3), single-family\nresidence small lot (SF-4A), single-family residence condominium site (SF-4B), urban\nfamily (SF-5), or townhouse and condominium residence (SF-6) district that:\n\n(1)\n\nwas annexed after December 1, 1997; and\n\n(2)\n\nis included in a plat that:\n\n(a)\n\nwas recorded when the lot was outside the zoning jurisdiction; or\n\n(b)\n\nbefore September 7, 1998.\n\n(B)\n\nIf the plat establishes a front yard setback, the minimum front yard setback is the\ngreater of:\n\n(1)\n\nthe setback established on the plat; or\n\n(2)\n\n15 feet.\n\n(C)\n\nIf the plat establishes a street side yard setback, the minimum street yard setback\nis the greater of:\n\n(1)\n\nthe setback established on the plat; or\n\n(2)\n\n10 feet.\n\nSource: Section 13-2-645; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in a single family residence standard lot (SF-2) district or\nfamily residence (SF-3) district.\n\n(B)\n\nA development may comply with single-family residence small lot (SF-4A) district site\ndevelopment regulations if:\n\n(1)\n\nthe development is on three or more acres of previously unsubdivided land; and\n\n(2)\n\nthe director of the Neighborhood Housing and Community Development Department certifies\nthat the development complies with the City's S.M.A.R.T. Housing Program.\n\nSource: Ord. 20080131-132.\n\n(A)\n\nThis section applies in a multifamily residence low density (MF-2) district, multifamily\nresidence medium density (MF-3) district, multifamily residence moderate-high density\n(MF-4) district, or multifamily residence high density (MF-5) district on property\nthat either has not been developed or that has been developed only with an agricultural\nuse.\n\n(B)\n\nExcept as provided in Subsection (C), a development may comply with multifamily residence\nhighest density (MF-6) district site development regulations if the director of the\nNeighborhood Housing and Community Development Department certifies that the development\ncomplies with the City's S.M.A.R.T. Housing Program, and:\n\n(1)\n\nfor a rental development, ten percent of the residential units in the development\nare reserved as affordable for a minimum of 40 years following the issuance of a certificate\nof occupancy for rental by a household earning not more that 60 percent of the median\nfamily income for the Austin metropolitan statistical area; or\n\n(2)\n\nfor an owner-occupied development:\n\n(a)\n\nfive percent of the residential units in the development are reserved as affordable\nfor a minimum of 99 years following the issuance of a certificate of occupancy for\nownership and occupancy by a household earning not more than 80 percent of the median\nfamily income for the Austin metropolitan statistical area; and\n\n(b)\n\nfive percent of the residential units in the development are reserved as affordable\nfor a minimum of 99 years following the issuance of a certificate of occupancy for\nownership and occupancy by a household earning not more than 100 percent of the median\nfamily income for the Austin metropolitan statistical area.\n\n(C)\n\nDevelopment under this section must comply with the height regulations established\nin other provisions of this code.\n\nSource: Ord. 20080131-132.\n\n(A)\n\nThis section applies in a central business (CBD) district.\n\n(B)\n\nNotwithstanding any other provision of this chapter, the requirements of Article 10\n(Compatibility Standards) do not apply.\n\n(C)\n\nThis subsection applies to a convention center use.\n\n(1)\n\ncouncil approval is required for a site plan for a convention center use. Approval\nof a site plan:\n\n(a)\n\nestablishes the site development regulations; and\n\n(b)\n\nwaives regulations that are inconsistent with the site plan, if any.\n\n(2)\n\nA public hearing is required for each site plan considered under this subsection.\n\n(3)\n\nThe director shall give notice of a public hearing required by this subsection in\naccordance with Section 25-1-132(C) (Notice of Public Hearing).\n\n(D)\n\nCommercial off-street parking is a permitted use when it constitutes less than 50\npercent of the parking spaces in a parking structure.\n\nSource: Section 13-2-661; Ord. 990225-70; Ord. 031211-11; Ord. 20130411-061.\n\n(A)\n\nThis section applies in a commercial highway (CH) district.\n\n(B)\n\nExcept as provided in Subsection (C), the maximum height permitted for a building\nis:\n\n(1)\n\n60 feet, if the impervious cover on the site is more than 80 percent and not more\nthan 85 percent;\n\n(2)\n\n80 feet, if the impervious cover on the site is more than 75 percent and not more\nthan 80 percent;\n\n(3)\n\n100 feet, if the impervious cover on the site is more than 70 percent and not more\nthan 75 percent;\n\n(4)\n\n110 feet, if the impervious cover on the site is more than 65 percent and not more\nthan 70 percent; and\n\n(5)\n\n120 feet, if the impervious cover on the site is not more than 65 percent.\n\n(C)\n\nThis subsection applies in a zoning district that combines a CH base district with\na PDA combining district. If there is a conflict between the requirements of Subsection\n(B) and the zoning ordinance establishing the CH-PDA district, the zoning ordinance\ngoverns.\n\nSource: Section 13-2-663; Ord. 990225-70; Ord. 031211-11; Ord. No. 20230518-058, Pt. 2, 5-29-23.\n\n(A)\n\nThis section applies in a commercial recreation (CR) district.\n\n(B)\n\nIn this section, SHORELINE means:\n\n(1)\n\nfor Lake Austin, the 492.8 topographic contour line along the shores of Lake Austin;\nand\n\n(2)\n\nfor Lake Travis, the 681 topographic contour line along the shores of Lake Travis.\n\n(C)\n\nThis subsection applies to property located within 1000 feet horizontally of the shoreline\nof Lake Austin.\n\n(1)\n\nThe areas within 75 feet of the shoreline are excluded from impervious cover calculations.\n\n(2)\n\nDevelopment is prohibited on land with a gradient that exceeds 35 percent. This prohibition\ndoes not apply to a fence, driveway, road or utility that cannot be reasonably placed\nelsewhere, or a pedestrian facility.\n\n(3)\n\nImpervious cover may not exceed:\n\n(a)\n\n20 percent, on a slope with a gradient of 25 percent or less;\n\n(b)\n\n10 percent, on a slope with a gradient of more than 25 percent and less than 35 percent;\nor\n\n(c)\n\nif impervious cover is transferred under Subsection (C)(4), 30 percent.\n\n(4)\n\nA person may transfer impervious cover in accordance with this subsection.\n\n(a)\n\nImpervious cover may be transferred only:\n\n(i)\n\nbetween tracts within a CR district; and\n\n(ii)\n\nfrom land with a gradient of 35 percent or less, to land with a gradient of 15 percent\nor less.\n\n(b)\n\nLand from which impervious cover is transferred may not be developed. The land must\neither remain undisturbed or be restored to a natural state.\n\n(c)\n\nA transfer of impervious cover must be described in a restrictive covenant that runs\nwith the land, is approved by the city attorney, and is recorded in the county deed\nrecords.\n\n(D)\n\nA permanent improvement is prohibited within 75 feet of the shoreline of Lake Austin\nor Lake Travis, except for a retaining wall, pier, wharf, boathouse, or marina, or\na driveway to the structures.\n\n(E)\n\nOutdoor storage of merchandise, material, or equipment is permitted if:\n\n(1)\n\nthe outdoor storage is incidental to a use located on the premises;\n\n(2)\n\nthe storage area is located on the rear 50 percent of the site;\n\n(3)\n\nthe storage area does not exceed:\n\n(a)\n\n20 percent of the site; or\n\n(b)\n\nfor a marina use, recreational equipment sales use, or recreational equipment maintenance\nand storage use, 50 percent of the site; and\n\n(4)\n\nthe storage area is screened in accordance with the Environmental Criteria Manual\nand, except for watercraft, the stored items do not exceed the height of the screen.\n\n(F)\n\nExcept along a property line of a lot zoned for a residential use, the following merchandise\nmay be displayed outdoors:\n\n(1)\n\nartwork or pottery;\n\n(2)\n\nflowers or plants;\n\n(3)\n\nfood products;\n\n(4)\n\nhandcrafted goods; and\n\n(5)\n\nrecreational equipment, including roller skates, bicycles, windsurf boards, and watercraft.\n\n(G)\n\nMerchandise other than that described in Subsection (F) may be displayed outdoors\nduring business hours if screened from view off-premises.\n\n(H)\n\nAt least 40 percent of a site, excluding dedicated right-of-way, must be left in a\nnatural state. Up to 25 percent of a natural area may be used as a sewage disposal\nfield. A natural critical area identified in the Comprehensive Plan must be left in\na natural state.\n\n(I)\n\nLandscaped areas at least ten feet wide are required adjacent to public streets and\nproperty zoned for residential use. Landscaped areas must contain trees, shrubs, and\nground cover.\n\n(J)\n\nMedians at least 5 feet wide are required between rows of parking spaces. Each median\nmust contain either existing native trees or densely massed installed trees.\n\n(K)\n\nThe noise level of live music may not exceed 70 decibels, measured at the property\nline.\n\nSource: Section 13-2-660; Ord. 990225-70; Ord. 031211-11; Ord. 20090521-017.\n\n(A)\n\nThis section applies in a warehouse/limited office (W/LO) district.\n\n(B)\n\nThe building must include an office use. The minimum floor area for the office use\nis the lesser of:\n\n(1)\n\n20 percent; or\n\n(2)\n\n1,000 square feet.\n\n(C)\n\nA truck loading dock may not be located on the same building face as an office entrance.\n\n(D)\n\nAn office use must face the street that provides primary access.\n\n(E)\n\nA construction sales and service use may not exceed 10,000 square feet of gross floor\narea.\n\n(F)\n\nThe Land Use Commission may approve, in accordance with the applicable provisions\nof Chapter 25-5, Article 3 (Land Use Commission Approved Site Plans), the following modifications to the site development regulations:\n\n(1)\n\na lot that contains at least 21,780 square feet, but less than 43,560 square feet;\n\n(2)\n\na structure with a height greater than 25 feet, but not more than 35 feet; or\n\n(3)\n\na structure with a floor area ratio of more than 0.25, but not more than 0.50.\n\nSource: Section 13-2-662; Ord. 990225-70; Ord. 991104-46; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThis section applies to a building in a general office (GO), neighborhood commercial\n(LR), general commercial services (CS), or commercial services - liquor sales (CS-1)\ndistrict that:\n\n(1)\n\nis located on property adjacent to an Lake Austin residence (LA), rural residence\n(RR), or single-family residence large lot (SF-1) district; and\n\n(2)\n\nexceeds a height of 35 feet.\n\n(B)\n\nA building's exterior glass is required to be either clear or lightly tinted.\n\n(C)\n\nExterior light illuminating a building above the second floor is prohibited.\n\nSource: Section 13-2-607; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDefinitions. In this section:\n\n(1)\n\nBONUS AREA means the greater of:\n\n(a)\n\nThe gross floor area that exceeds the maximum allowable floor-to-area ratio allowed\nwith the site's primary entitlements; or\n\n(b)\n\nThe gross floor area contained within the portion of a structure that exceeds the\nmaximum height allowed under the site's primary entitlements.\n\n(2)\n\nCOMMUNITY BENEFIT is a public amenity that exceeds the Gatekeeper Requirements of\nthe Downtown Density Bonus Program as described in (C)(1) of this section and that\nis provided by an applicant in order to obtain bonus area.\n\n(3)\n\nCULTURAL USES are uses that are eligible to participate in the City of Austin Core\nCultural Funding Program.\n\n(4)\n\nDAY CARE SERVICES is the provision of one of the adult or child care services defined\nin Section 25-2-6 (Civic Uses Described) of the City Code.\n\n(5)\n\nDEVELOPMENT BONUS FEE means the dollar amount an applicant pays to the City per square\nfoot of bonus area.\n\n(6)\n\nDIRECTOR means director of the Planning and Development Review Department.\n\n(7)\n\nDWELLING UNIT means a single unit providing complete, independent living facilities\nfor one or more persons, including permanent provisions for living, sleeping, eating,\ncooking and sanitation.\n\n(8)\n\nFAMILY-FRIENDLY ELIGIBLE BEDROOM is any bedroom over one bedroom within a dwelling\nunit that provides on-site affordable housing that complies with all of the affordability\nrequirements of Subsection (G) of this section.\n\n(9)\n\nGREAT STREETS STREETSCAPE STANDARDS means design standards for streets within the\nboundaries of the Great Streets Master Plan.\n\n(10)\n\nLIVE MUSIC USE is the performance of live music at least four days a week in an indoor\npublic or private facility of at least 2,500 square feet that is open to the general\npublic and readily equipped with sound, staging, lighting and safety accoutrements\nto accommodate professional and semi-professional live music needs on a daily basis.\n\n(11)\n\nMIXED-USE PROJECT means a project that has 25 percent or more of its floor area in\na use different from a predominant use.\n\n(12)\n\nNON-RESIDENTIAL PROJECT means a project for which the predominant use is not listed\nin Section 25-2-3 (Residential Uses Described), and which has less than 25 percent of its floor area devoted to uses described\nin Section 25-2-3 (Residential Uses Described).\n\n(13)\n\nPRIMARY ENTITLEMENT means the height and floor-to-area ratio entitlement that a site\nderives from its current zoning. That entitlement may be derived from the base zoning\nor from a previous modification to the base zoning.\n\n(14)\n\nPUBLICLY ACCESSIBLE ON-SITE PLAZA is a publicly-accessible area provided by an applicant\nas a community benefit that complies with the Downtown Public Plaza Standards adopted\nby administrative rule.\n\n(15)\n\nRESIDENTIAL PROJECT means a project for which the predominant use is within one or\nmore of the classifications described in Section 25-2-3 (Residential Uses Described).\n\n(16)\n\nURBAN DESIGN GUIDELINES means guidelines for public streetscapes, plazas, open space\nand buildings in a dense area, adopted by City Council.\n\n(B)\n\nDowntown Density Bonus Maps and Table.\n\n(1)\n\nThe downtown district boundaries are shown on the Downtown Districts Map (Figure 1).\nProperties in the downtown district that are eligible for density bonuses under this\nsection are shown on the Eligibility, Floor-to-Area Ratio and Height Maps (Figure\n2).\n\n(2)\n\nProperties in the Rainey Street Subdistrict may participate in the Downtown Density\nBonus Program only for floor-to-area ratio that exceeds 8:1. To achieve floor-to-area\nratio up to 8:1, properties in the Rainey Street Subdistrict must comply with Subsection\n(C)(4) of Section 25-2-739 (Rainey Street Subdistrict Regulations) of the City Code.\n\n(3)\n\nThe amount of floor-to-area ratio or height that may be achieved by a downtown density\nbonus for a site is limited by the maximum height or Floor-to-Area Ratio identified\non Figure 2.\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2a.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2b.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2c.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2d.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2e.png)\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/25-2-586Fig2f.png)\n\n(4)\n\nThe maximum heights and maximum floor-to-area ratios on Figure 2 do not modify a site's\nprimary entitlement. If the maximum height or maximum floor-to-area ratio allowed\nunder a primary entitlement exceeds the height or floor-to-area ratio on Figure 2,\nthe bonus area is calculated by using the site's primary entitlement that does not\nexceed the maximums shown on Figure 2.\n\n(5)\n\nThe development bonus fee may vary by use and downtown district. The applicable development\nbonus fee within each of the nine districts is established by ordinance.\n\n(6)\n\nNotwithstanding the limitation provided for in Subsection (B)(3) of this section,\nthe city council may grant to an applicant floor-to-area ratio that exceeds the maximum\nfloor-to-area ratio in Figure 2 if:\n\n(a)\n\nThe applicant has already achieved the maximum floor-to-area ratio in Figure 2 by\nparticipating in the Downtown Density Bonus Program;\n\n(b)\n\nThe applicant submits a written request and rationale for the additional floor-to-area\nratio to the director;\n\n(c)\n\nThe director makes a written recommendation on the application and then submits the\nrecommendation to the Planning Commission for its review and recommendation; and\n\n(d)\n\nThe city council determines that the additional floor-to-area ratio should be granted\nbecause:\n\n(i)\n\nThe applicant has offered additional community benefits described in Subsections (E)(1)—(12)\nabove and beyond those offered to achieve the floor-to-area ratio in Figure 2;\n\n(ii)\n\nThe applicant agrees to use the same methodology and bonus area granted for each community\nbenefit as described in the downtown density bonus program to achieve the desired\nbonus area;\n\n(iii)\n\nThe city council determines that awarding the additional floor-to-area ratio substantially\nfurthers the goals and objectives of the Downtown Austin Plan and the Imagine Austin\nComprehensive Plan; and\n\n(iv)\n\nthe applicant has agreed that any residential parking space shall be offered separately\nfrom the dwelling unit.\n\n(7)\n\nA property described in the downtown district boundary (Figure 1) and subject to Section 25-2-161 (Capitol Dominance Overlay District) is elibile for density bonuses shown on the Eligibility, Floor-to-Area Ratio and\nHeight Maps (Figure 2).\n\n(8)\n\nA property described in the downtown district boundary (Figure 1) and subject to Section 25-2-162 (Capitol View Corridor Overlay District) is eligible for density bonuses shown on the Eligibility, Floor-to-Area Ratio and\nHeight Maps (Figure 2) that do not conflict with the height limitations established\nin Section 25-2-642 (Capitol View Corridor Overlay District Regulations).\n\n(C)\n\nProgram Requirements.\n\n(1)\n\nGatekeeper Requirements.\n\n(a)\n\nTo receive bonus area, the director must determine that the project substantially\ncomplies with the Urban Design Guidelines.\n\n(i)\n\nThe applicant must submit to the director a schematic level site plan, building elevations,\nand other drawings, simulations or other documents necessary to fully describe the\nurban design character of the project and relationship of the project to its surroundings.\n\n(ii)\n\nThe Design Commission shall evaluate and make recommendations regarding whether the\nproject complies with the Urban Design Guidelines and the director shall consider\ncomments and recommendations of the Design Commission.\n\n(b)\n\nExcept as provided in Subsection (C)(1)(c), the applicant shall execute a restrictive\ncovenant committing to provide streetscape improvements along all public street frontages,\nconsistent with the Great Streets Standards.\n\n(c)\n\nFor a property located on a Texas Department of Transportation frontage, an applicant\nprovides for Great Streets streetscape improvements along all public street frontages\nif the applicant pays a fee-in-lieu set by separate ordinance and a one-time maintenance\nobligation fee set by separate ordinance. The director of the Transportation and Public\nWorks Department may spend a fee paid under this subsection for Great Streets capital\nimprovement projects within the Downtown area.\n\n(d)\n\nThe applicant shall execute a restrictive covenant committing to achieve a minimum\ntwo star rating under the Austin Energy Green Building program using the ratings in\neffect at the time the project is registered with the Austin Energy Green Building\nprogram. The applicant shall also provide the director with a copy of the project's\nsigned Austin Energy Green Building Letter of Intent before the director may approve\nbonus area for a site.\n\n(2)\n\nAfter the director determines the applicant meets the gatekeeper requirements, the\napplicant shall provide sufficient written information so that the director can determine:\n\n(a)\n\nthe site's primary entitlement;\n\n(b)\n\nthe amount of bonus area that the applicant is requesting;\n\n(c)\n\nthe total dollar amount the applicant will pay if the applicant chooses to obtain\nthe entire bonus area exclusively by paying a development bonus fee, and the amount\nof the fee to be dedicated to each community benefit; and,\n\n(d)\n\nthe community benefits the applicant proposes to provide to obtain bonus area if the\nbonus area will not be obtained exclusively by paying a development bonus fee.\n\n(D)\n\nChanges in Design of Proposed Building. If the design of a building changes after a bonus is granted under this section,\nthe director shall review the new design for substantial compliance with the Urban\nDesign Guidelines prior to building permit approval. A building permit for a final\ndesign will not be approved until the design substantially complies with the gatekeeper\nrequirements and the restrictive covenants are amended to reflect new or revised community\nbenefits.\n\n(E)\n\nCommunity Benefits. A person may achieve bonus area by providing community benefits outlined in this\nsubsection. If the applicant chooses to achieve 100 percent of the desired bonus area\nby providing community benefits described in Subsections (E)(1)—(12), the director\nmay approve the bonus area administratively.\n\n(1)\n\nAffordable Housing Community Benefits.\n\n(a)\n\nAffordable Housing Community Benefit. An applicant may use one or more of the following.\n\n(i)\n\nOn-site affordable housing. A project may achieve bonus area by providing on-site affordable housing within the\nproject. The amount of bonus area that may be achieved for each one square foot of\ndwelling unit space that is devoted to on-site affordable housing is established by\nordinance.\n\n(ii)\n\nFamily-friendly housing. A project providing on-site affordable housing may achieve additional bonus area\nby providing one or more family-friendly eligible bedrooms. The amount of bonus area\nthat may be achieved for each family-friendly eligible bedroom is established by ordinance.\n\n(iii)\n\nDevelopment bonus fee for affordable housing. The project may achieve bonus area by paying a development bonus fee at the dollar\nper square foot amount set by ordinance. The fee will be paid into the Affordable\nHousing Trust Fund.\n\n(b)\n\nAffordable housing community benefit percentages.\n\n(i)\n\nA project must achieve at least 50 percent of the desired bonus area by providing\naffordable housing community benefits.\n\n(ii)\n\nFor any portion of the desired bonus area not achieved by providing affordable housing\nbenefits, the applicant shall achieve bonus area by providing one or more of the community\nbenefits described in Subsections (E)(2)—(12) below.\n\n(2)\n\nRainey Street Subdistrict Historic Preservation Community Benefit.\n\n(a)\n\nA project may achieve bonus area for each historically significant building that is:\n\n(i)\n\nrehabilitated; and\n\n(ii)\n\npreserved on site, relocated to a site within the Rainey Street Subdistrict, or relocated\nto a location within the city limits as determined appropriate by the Historic Landmark\nCommission.\n\n(b)\n\nThe amount of bonus area that may be achieved for on-site improvements for Rainey\nStreet Subdistrict historic preservation is established by ordinance.\n\n(c)\n\nBuildings eligible for this community benefit include those buildings within the Rainey\nStreet National Historic Register District that the City's historic preservation officer\nhas determined contribute to the historic character of the Rainey Street National\nHistoric Register District.\n\n(d)\n\nRequirements:\n\n(i)\n\nDevelopment using this community benefit option shall maintain the architectural integrity\nof the building as determined by the Historic Landmark Commission (HLC) whether or\nnot the building is zoned H-Historic or HD-Local Historic District.\n\n(ii)\n\nThe HLC must review and approve modifications to a building before the City may grant\na density bonus.\n\n(iii)\n\nDevelopment may use this option only in cases where a substantial percentage of the\nexternal walls and internal structure remain intact at project completion.\n\n(iv)\n\nAn applicant must provide a description of the rehabilitation that describes the existing\nconditions of the building and the proposed work. The applicant must submit photographs\nshowing the major character-defining features of the building prior to the start of\nwork.\n\n(v)\n\nBefore the director may issue any type of certificate of occupancy, an applicant must\nsubmit documentation verifying that the work has been completed as proposed. The documentation\nmust be submitted in a format similar to the Description of Rehabilitation portion\nof the United States Department of the Interior National Park Service Historic Preservation\nCertification Application.\n\n(vi)\n\nAn applicant who cannot complete restoration as proposed must pay into the Historic\nPreservation Fund the applicable development bonus fee for the bonus area initially\ngranted for this community benefit. The applicant's payment will be based on the development\nbonus fee in effect at the time the applicant pays the fee.\n\n(3)\n\nDay Care Services Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing day care services within the project.\nThe amount of bonus area that may be achieved for each square foot of day care services\nthat are provided is established by ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nThe applicant must execute a restrictive covenant that requires compliance with all\nrelevant requirements of this section and that ensures continuation of operations\nand maintenance of the facility with the specified community benefit use for a period\nof at least 10 years, which is the life of the agreement.\n\n(ii)\n\nCity of Austin must approve of the operator and the lease terms, which shall be for\nno less than ten years.\n\n(iii)\n\nThe facility must comply with applicable state and local codes.\n\n(iv)\n\nThe facility must be open during normal business hours at least five days each week\nand fifty weeks each calendar year.\n\n(v)\n\nThe facility must be maintained and kept in a good state of repair throughout the\nlife of the agreement.\n\n(vi)\n\nIf the day care services use is non-operational for more than 180 consecutive days\nor for 180 days in any 365 day period, the owner must pay into the Affordable Housing\nTrust Fund the applicable development bonus fee for the bonus area initially granted\nfor this community benefit. The payment will be a pro-rated amount based on the time\nleft in the term of the agreement and based on the development bonus fee in effect\nwhen the owner pays.\n\n(4)\n\nCultural Uses Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing on-site cultural uses within the project.\nThe amount of bonus area that may be achieved for each square foot of cultural uses\nprovided is established by ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nThe applicant must execute a restrictive covenant that requires compliance with all\nrequirements of this section and that ensures continuation of operations and maintenance\nof the facility with the specified community benefit use for a period of at least\n10 years, which is the life of the agreement.\n\n(ii)\n\nCity of Austin must approve of the operator and the lease terms, which shall be for\nno less than ten years.\n\n(iii)\n\nUse must meet the definition of cultural uses and the space must be leased to a 501(c)\norganization.\n\n(iv)\n\nIf the required use is non-operational for more than 180 consecutive days or for 180\ndays in any 365 day period, the owner must pay into the Affordable Housing Trust Fund\nthe applicable development bonus fee for the bonus area initially granted for this\ncommunity benefit. The payment will be a pro-rated amount based on the time left in\nthe term of the agreement and based on the development bonus fee in effect when the\nowner pays.\n\n(5)\n\nLive Music Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing an on-site live music use. The amount\nof bonus area that may be achieved for each square foot of live music use is established\nby ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nThe applicant must ensure continuation of operations and maintenance of the facility\nwith the specified community benefit use for a period of at least 10 years, which\nis the life of the agreement.\n\n(ii)\n\nCity of Austin must approve of the operator and the lease terms, which shall be for\nno less than ten years.\n\n(iii)\n\nThe operator of the facility must maintain proper permitting and documentation to\nplay amplified music in said space.\n\n(iv)\n\nThe space must meet the City of Austin's sound-proofing specifications.\n\n(v)\n\nIf the required use is non-operational for more than 180 consecutive days or for 180\ndays in any 365 day period, the owner must pay into the Affordable Housing Trust Fund\nthe applicable development bonus fee for the bonus area initially granted for this\ncommunity benefit. The payment will be a pro-rated amount based on the time left in\nthe term of the agreement and based on the development bonus fee in effect when the\nowner pays.\n\n(vi)\n\nVenues may not charge an up-front fee to performing artists for the use of their facilities\nor require performing artists to guarantee a minimum attendance through pre-show ticket\nsales.\n\n(6)\n\nOn-Site Improvements for Historic Preservation Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing on-site improvements for historic preservation.\nThe amount of bonus area that may be achieved for on-site improvements for historic\npreservation is established by ordinance.\n\n(b)\n\nBuildings Eligible for On-Site Improvements for Historic Preservation Community Benefit\ninclude:\n\n(i)\n\nBuildings designated as City landmarks, Recorded Texas Historic Landmarks, State Antiquities\nLandmarks, or listed on the National Register of Historic Places;\n\n(ii)\n\nContributing properties within National Register or Local Historic Districts;\n\n(iii)\n\nBuildings determined by the City's Historic Preservation Officer to be historically\nsignificant; or\n\n(iv)\n\nBuildings determined eligible for listing on the National Register of Historic Places\nby the State Historic Preservation Officer.\n\n(c)\n\nRequirements:\n\n(i)\n\nDevelopment using this community benefit option for on-site improvements shall maintain\nthe architectural integrity of the building, as determined by the Historic Landmark\nCommission (HLC) whether or not the building is zoned H-Historic or HD-Local Historic\nDistrict.\n\n(ii)\n\nThe HLC must review and approve modifications to a building before the City may grant\na density bonus.\n\n(iii)\n\nA project may be granted bonus area for on-site improvements for historic preservation\nonly in cases where a substantial percentage of the external walls and internal structure\nremain intact at project completion.\n\n(iv)\n\nApplicant must provide a description of rehabilitation that describes the existing\ncondition of the building and the proposed work. The applicant must submit photographs\nshowing the major character-defining features of the building prior to the start of\nwork.\n\n(v)\n\nBefore the director may issue any type of Certificate of Occupancy, an applicant must\nsubmit documents verifying that the work has been completed as proposed. The documents\nmust be submitted in a format similar to the Description of Rehabilitation portion\nof the United States Department of the Interior National Park Service Historic Preservation\nCertification Application.\n\n(vi)\n\nIf restoration cannot be completed as proposed, the owner must pay into the Historic\nPreservation Fund the applicable development bonus fee for the bonus area initially\ngranted for this community benefit. The owner's payment will be based on the development\nbonus fee in effect at the time the owner pays the fee.\n\n(7)\n\nDevelopment Bonus Fee for Off-Site Historic Preservation Community Benefit.\n\n(a)\n\nThe project may achieve bonus area by paying a development bonus fee at the dollar\nper square foot amount set by ordinance based on the district in which the proposed\ndevelopment is located. The fee will be paid into the Historic Preservation Fund.\n\n(b)\n\nRequirements:\n\n(i)\n\nThe City of Austin will administer the Historic Preservation Fund.\n\n(ii)\n\nThis option cannot be used if developer is proposing to demolish all or a substantial\npercentage of a building the Historic Preservation Officer deems historically significant.\n\n(8)\n\nGreen Building Community Benefit.\n\n(a)\n\nAn applicant may achieve bonus area by constructing a project to green building standards\nthat exceed the Gatekeeper requirements. The amount of bonus area that may be achieved\nfor constructing a project to green building standards is established by ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nThe applicant shall execute a restrictive covenant committing to achieve a specified\nrating under the Austin Energy Green Building (AEGB) program using the ratings in\neffect at the time the ratings application is submitted for the project or Leadership\nin Energy & Environmental Design (LEED) program using the most recently launched version\nof the LEED for New Construction rating at the time of the project's registration.\n\n(ii)\n\nThe applicant shall also provide the director with a copy of the project's signed\nAustin Energy Green Building Letter of Intent for projects seeking AEGB rating or\na copy of the completed LEED registration for projects seeking LEED rating before\nthe director may approve bonus area for a site.\n\n(iii)\n\nAn applicant must submit an AEGB or LEED checklist indicating the measures the project\nintends to complete to meet the applicable green building requirement before the director\nmay approve bonus area for a site.\n\n(iv)\n\nA project seeking an AEGB rating will be subject to at least one inspection during\nconstruction and an inspection at substantial completion. A project seeking LEED certification\nmust submit the LEED design review results and an updated LEED checklist or scorecard\nindicating the project will be able to obtain LEED certification by substantial completion.\n\n(v)\n\nIf the specified AEGB rating or LEED certification is not achieved within nine months\nfrom time of occupancy, an owner must pay into the Affordable Housing Trust Fund the\napplicable development bonus fee for the bonus area initially granted for this community\nbenefit. The owner's payment will be based on the development bonus fee in effect\nwhen the owner pays.\n\n(9)\n\nPublicly Accessible On-Site Plaza Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing a publicly accessible on-site plaza.\nThe amount of bonus area that may be achieved by providing a publicly accessible on-site\nplaza is established by ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nIf the required plaza is non-operational for more than 180 consecutive days or for\n180 days in any 365 day period, the owner must pay into the Downtown Open Space Fund\nthe applicable development bonus fee for the bonus area initially granted for this\ncommunity benefit. The payment will be based on the development bonus fee in effect\nwhen the owner pays.\n\n(10)\n\nOff-Site Open Space Development Bonus Fee Community Benefit.\n\n(a)\n\nThe project may achieve bonus area by paying a development bonus fee for off-site\nopen space at the dollar per square foot amount set by ordinance based on the district\nin which the proposed development is located. The fee will be paid into the Downtown\nOpen Space Fund.\n\n(b)\n\nRequirements:\n\n(i)\n\nCity will administer the Downtown Open Space Fund.\n\n(ii)\n\nThe development bonus fee option is only available for open space beyond what is already\nrequired by City Code.\n\n(iii)\n\nThe applicant must deposit a nonrefundable cash payment with the City.\n\n(11)\n\nGreen Roof Community Benefit.\n\n(a)\n\nA project may achieve bonus area by providing green roofs. The amount of bonus area\nthat may be achieved for the construction of green roofs is established by ordinance.\n\n(b)\n\nRequirements:\n\n(i)\n\nGreen Roofs must be built to the Vegetated (\"Green\") Roof Performance Standards in\nAppendix W of the Environmental Criteria Manual. The percent of vegetated roof cover\nis calculated as a portion of total roof area excluding mechanical equipment, photovoltaic\npanels, swimming pools, and skylights.\n\n(ii)\n\nIf the green roof fails to meet the Vegetated (\"Green\") Roof Performance Standards\nfor more than 180 consecutive days or for 180 days in any 365 day period, the owner\nmust pay into the Downtown Open Space Fund the applicable development bonus fee for\nthe bonus area initially granted for this community benefit. The payment will be based\non the development bonus fee in effect when the owner pays.\n\n(iii)\n\nGreen roof areas used to achieve bonus area through the Green Roof Community Benefit\nmay not be used to achieve bonus area through the Publicly Accessible On-Site Plaza\nCommunity Benefit.\n\n(12)\n\nOther Community Benefits.\n\n(a)\n\nAn applicant may offer to provide other community benefits not described in (E)(1)\n- (11). The applicant must provide sufficient information about the other community\nbenefits for the director to determine whether the other community benefits serve\na public and municipal purpose considering the criteria listed below.\n\n(b)\n\nThe director will consider the following to make a determination:\n\n(i)\n\nif members of the general public will be able to enjoy the proposed other community\nbenefit without paying for its access, use or enjoyment;\n\n(ii)\n\nif the proposed other community benefit will connect to and be accessible from public\nright-of-way or other publicly-accessible space;\n\n(iii)\n\nif the proposed other community benefit will provide a public amenity that is particularly\nlacking in the proposed location;\n\n(iv)\n\nif the proposed other community benefit will impose a significant burden on public\nresources for maintenance, management, policing, or other reasons; and,\n\n(v)\n\nany other information provided by the applicant that shows the other community benefit\nserves a public and municipal purpose and furthers the City's comprehensive planning\ngoals.\n\n(c)\n\nIf a proposed other community benefit provides a partial benefit to a project, it\nwill not be disqualified; the director will allocate only the cost of the public portion\nof the benefit to the other community benefits.\n\n(d)\n\nIf the director determines that the proposed benefit qualifies as a community benefit,\nthe director shall:\n\n(i)\n\nquantify the monetary cost for the proposed other community benefit by using standard\nindustry sources as well as locally based data on development costs to quantify the\nmonetary cost, without mark-up, for the proposed other community benefit; and,\n\n(ii)\n\ndetermine the cost to be applied towards achieving the desired bonus area.\n\n(e)\n\nThe amount determined by the director may be applied to achieve bonus area on the\nsame basis as the development bonus fee applicable to the type and location of the\nproject.\n\n(f)\n\nThe director's recommendation concerning the proposed other community benefit and\nthe monetary value that is applied to achieve the bonus area shall be presented to\nthe planning commission for recommendation and the city council for approval.\n\n(g)\n\nIf the applicant proposes to achieve bonus area by providing other community benefits,\nthe value of the public portion of the proposed other community benefits must be equal\nto or greater than the total dollar amount the applicant would pay if the payment\nwere based on the applicable development bonus fee required to earn that requested\nbonus area.\n\n(F)\n\nCommunity Benefit Calculations for Mixed-Use Projects. Mixed-use projects shall provide community benefits in proportion to the amount of\nfloor area in the project that is devoted to different use categories.\n\n(G)\n\nAffordability Requirements. For purposes of this section, a unit is affordable for purchase or rental if, in\naddition to the other requirements of this section, the household is required to spend\nno more than 30 percent of its gross monthly income on mortgage or rental payments\nfor the unit.\n\n(1)\n\nAffordability requirements for owner-occupied units.\n\n(a)\n\nOn-site for sale affordable housing units shall be reserved, sold and transferred\nto an income eligible buyer subject to a resale restricted, shared equity agreement\napproved by the director of Neighborhood Housing and Community Development, for not\nless than 99 years from the date a certificate of occupancy is issued.\n\n(b)\n\nThe units shall be made available for ownership and occupancy by households earning\nno more than 120 percent of the Annual Median Family Income for the City of Austin\nMetropolitan Statistical Area as determined by the director of Neighborhood Housing\nand Community Development.\n\n(2)\n\nAffordability requirements for rental units.\n\n(a)\n\nOn-site rental affordability housing units shall be reserved as affordable for a minimum\nof 40 years following the issuance of the certificate of occupancy.\n\n(b)\n\nThe units shall be made available for rental by households earning no more than 80\npercent of the annual median family income for the City of Austin metropolitan statistical\narea as determined by the director of Neighborhood Housing and Community Development.\n\n(c)\n\nAn applicant may not deny a prospective tenant affordable rental housing based solely\non the prospective tenant's participation in the Housing Choice Voucher Program or\nin any other housing voucher program that provides rental assistance.\n\n(3)\n\nRules. The Neighborhood Housing and Community Development Office shall conduct compliance\nand monitoring of the affordability requirements of this ordinance. The director of\nNeighborhood Housing and Community Development shall establish compliance and monitoring\nrules and criteria for implementing the affordability requirements of this ordinance.\n\n(H)\n\nApplicant's obligation. Before the director may issue any type of Certificate of Occupancy, an applicant\nmust fulfill all obligations including but not limited to the payment of all fees\nand execution of restrictive covenants in order to ensure that the applicant provides\nall required community benefits. All approvals must be obtained and evidence of the\napprovals must be provided to the director prior to site plan submittal.\n\n(I)\n\nDirector's approval. Once an applicant meets the submission requirements of the downtown density bonus\nprogram and executes the necessary restrictive covenants to ensure that the applicant\nprovides all required community benefits, the director will issue a written notice\nof approval that indicates the project's allowable floor-to- area ratio and height.\n\n(J)\n\nAppeal.\n\n(1)\n\nAn applicant may appeal to the city council the director's determination that the\ngatekeeper requirements have not been met.\n\n(2)\n\nAn applicant must appeal the determination within 30 days from the date of the director's\ndenial.\n\n(3)\n\nAn appeal is subject to the procedures set forth in Section 25-2-282 (Land Use Commission Public Hearing and Recommendation) and Section 25-2-283 (City Council Zoning Hearing and Action) of the City Code.\n\nSource: Ord. 20080131-132; Ord. 20130627-105; Ord. 20140227-054, Pts. 1, 3, 3-10-14; Ord. No. 20191031-037, Pt. 1, 11-11-19; Ord. No. 20230504-030, Pt. 1, 5-15-23; Ord. No. 20230504-031, Pt. 1, 5-15-23; Ord. No. 20231019-052, Pt. 4, 10-30-23.\n\n(A)\n\nThis section applies in a neighborhood commercial (LR) district.\n\n(B)\n\nA personal improvement services use may not exceed 5,000 square feet of gross floor\narea.\n\n(C)\n\nThis subsection applies to a general retail sales (general) use.\n\n(1)\n\nThe gross floor area may not exceed 5,000 square feet.\n\n(2)\n\nAccess to the site from a local street is prohibited.\n\n(D)\n\nThis subsection applies to a restaurant (general) use.\n\n(1)\n\nThe gross indoor floor area may not exceed 4,000 square feet.\n\n(2)\n\nA restaurant (general) use may operate only after 7:00 a.m. and before 11:00 p.m.\n\n(3)\n\nAn outdoor seating area may not:\n\n(a)\n\nexceed 500 square feet of area; or\n\n(b)\n\nbe located within 50 feet of property with a single-family use or property zoned as\na townhouse and condominium residence (SF-6) or more restrictive district.\n\n(4)\n\nOutdoor entertainment as an accessory use is prohibited.\n\n(5)\n\nOutdoor amplified sound is prohibited.\n\n(6)\n\nA drive-through facility is prohibited.\n\nSource: Ord. 20080131-135; Ord. 20090521-017; Ord. 20120614-055.\n\n(A)\n\nThis section applies in a limited office (LO) district.\n\n(B)\n\nA personal services use may not exceed 1,000 square feet of gross floor area.\n\nSource: Ord. 20111110-107.\n\nIn the downtown mixed use (DMU) zoning district, commercial off-street parking is\na permitted use when it constitutes less than 50 percent of the parking spaces in\na parking structure.\n\nSource: Ord. 20130411-061\n\nThis subpart applies to property zoned central business (CBD) or downtown mixed use\n(DMU).\n\nSource: Ord. 030612-93; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA business that offers a drive-in service must provide a similar service for a pedestrian\nthat does not require the pedestrian to stand or walk in a vehicle lane.\n\n(B)\n\nFor a drive-in service, the total width of the curb cuts on a block face may not exceed\n30 feet.\n\nSource: Ord. 990225-70; Ord. 030612-93; Ord. 031211-11.\n\n(A)\n\nA site plan may not be approved unless the development complies with this section.\n\n(B)\n\nA building must achieve at least a one star rating under the Austin Green Building\nprogram, as prescribed by a rule adopted in accordance with Chapter 1-2 (Adoption of Rules).\n\n(C)\n\nA surface parking facility must be at least partially and periodically obscured from\nthe street by landscaping, a berm, a wall, decorative fencing, or another structure.\n\n(D)\n\nThis subsection prescribes screening requirements for a parking structure.\n\n(1)\n\nThe headlights of automobiles in a parking structure may not be directly visible from\nan adjacent building or a building across a street, other than an alley, from the\nparking structure.\n\n(2)\n\nAutomobiles in a parking structure must be screened from public view.\n\n(3)\n\nThe building code requirements for an open parking garage supersede the requirements\nof this subsection to the extent of conflict.\n\n(E)\n\nThis subsection prescribes additional screening requirements for all land uses except\na major utility facilities use or a local utility services use.\n\n(1)\n\nA trash receptacle, air conditioning or heating equipment, loading area, or external\nstorage must be screened from public view.\n\n(2)\n\nEquipment located on a roof must be screened from the view of a person standing on\nthe farthest edge of an adjacent public street, other than an alley. The director\nof the Watershed Protection and Development Review Department may waive this requirement\nafter determining that screening is not practical.\n\nSource: Ord. 030612-93; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), a site plan may not be approved unless the development\ncomplies with this section.\n\n(B)\n\nThis section does not apply to a site plan for:\n\n(1)\n\nproperty zoned as a historic landmark (H) or historic area (HD) combining district;\n\n(2)\n\nproperty designated as a historic landmark by the state or federal government;\n\n(3)\n\nproperty located in a National Register Historic District established by the federal\ngovernment;\n\n(4)\n\nremodeling of or addition to an existing structure;\n\n(5)\n\nrestoration of a damaged structure within one year of the date of damage;\n\n(6)\n\na change of use;\n\n(7)\n\nproperty located in the area bounded by Seventh Street from San Antonio Street to\nShoal Creek, Shoal Creek from Seventh Street to Fifteenth Street, Fifteenth Street\nfrom Shoal Creek to West Avenue, West Avenue from Fifteenth Street to Martin Luther\nKing, Jr. Boulevard, Martin Luther King, Jr. Boulevard from West Avenue to San Antonio\nStreet, San Antonio Street from Martin Luther King, Jr. Boulevard to Eleventh Street,\nEleventh Street from San Antonio Street to Guadalupe Street, Guadalupe Street from\nEleventh Street to Tenth Street, Tenth Street from Guadalupe Street to San Antonio\nStreet, and San Antonio Street from Tenth Street to Seventh Street; or\n\n(8)\n\nthe following uses:\n\n(a)\n\ncarriage stable;\n\n(b)\n\nfamily home;\n\n(c)\n\ngroup home;\n\n(d)\n\nlocal utility services;\n\n(e)\n\nmajor utility facilities;\n\n(f)\n\noutdoor entertainment;\n\n(g)\n\noutdoor sports and recreation;\n\n(h)\n\npark and recreation services;\n\n(i)\n\nreligious assembly;\n\n(j)\n\nsafety services;\n\n(k)\n\ntransitional housing; or\n\n(l)\n\ntransportation terminal.\n\n(C)\n\nExcept as provided in Subsection (D), for the first four stories of a building that\nare above grade:\n\n(1)\n\nthe maximum front yard setback is ten feet; and\n\n(2)\n\nthe maximum street side yard setback is ten feet.\n\n(D)\n\nThe maximum setbacks prescribed by Subsection (C) do not apply to the portion of a\nbuilding adjacent to a plaza or protected tree.\n\nSource: Ord. 030612-93; Ord. 031211-11; Ord. 041202-16.\n\n(A)\n\nThis section applies in an industrial park (IP), major industry (MI), or limited industrial\nservices (LI) district.\n\n(B)\n\nThe minimum interior yard setback and rear yard setback is:\n\n(1)\n\n50 feet, if adjacent to property zoned as or used for a use permitted in an LA, RR,\nSF-1, SF-2, SF-3, SF-4, SF-5, or SF-6 district;\n\n(2)\n\n25 feet, if adjacent to property zoned as or used for a use permitted in an MF-1,\nMF-2, MF-3, MF-4, MF-5, MF-6, or MH district;\n\n(3)\n\n15 feet, if adjacent to property zoned as or used for a use permitted in an NO, LO,\nGO, CR, LR, or GR district; and\n\n(4)\n\n10 feet, if adjacent to property zoned as or used for a use permitted in an L or less\nrestrictive district.\n\n(C)\n\nWithin the Limited Industrial Service (LI) District, public secondary educational\nfacilities are limited to the senior high school level.\n\nSource: Section 13-2-675; Ord. 990225-70; Ord. 031211-11; Ord. No. 20160623-090, Pt. 3, 7-4-16.\n\nUses permitted in a research and development (R&D) district are established by the\nzoning ordinance establishing the district.\n\nSource: Section 13-2-225; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in a research and development (R&D) district.\n\n(B)\n\nA site must be developed as a campus.\n\n(C)\n\nThe minimum lot size is 5 acres.\n\n(D)\n\nThe maximum lot size is 25 acres.\n\n(E)\n\nThe maximum floor to area ratio is .25 to 1 in the following areas:\n\n(1)\n\nthe Barton Creek watershed, as defined in Ordinance No. 810430-C;\n\n(2)\n\nthe aquifer-related Williamson Creek watershed, as defined in Ordinance No. 801218-W;\n\n(3)\n\nthe Lake Austin watershed, as defined in Ordinance No. 840301-G;\n\n(4)\n\nthe Lake Austin watershed, as defined in Ordinance No. 840308-K; and\n\n(5)\n\nthe Northwest Area, as defined in Ordinance No. 841206-H.\n\n(F)\n\nThe maximum height is 45 feet, except that the height of a building may exceed 45\nfeet by one foot for each additional two feet that the building is set back beyond\n100 feet from the front and side lot lines and beyond 50 feet from the rear lot line,\nup to a maximum height of 90 feet.\n\n(G)\n\nFor the portion of a site within 100 feet of property zoned as or used for a use permitted\nin an LA, RR, SF-1, SF-2, SF-3, SF-4, SF-5, or SF-6 district:\n\n(1)\n\nthe minimum street side yard setback is 100 feet;\n\n(2)\n\nthe minimum interior side yard setback is 100 feet; and\n\n(3)\n\nthe minimum rear yard setback is 50 feet.\n\n(H)\n\nFor the portion of a site within 100 feet of property zoned as or used for a use permitted\nin an MF-1, MF-2, MF-3, MF-4, MF-5, MF-6, or MH district:\n\n(1)\n\nthe minimum street side yard setback is 25 feet;\n\n(2)\n\nthe minimum interior side yard setback is 25 feet; and\n\n(3)\n\nthe minimum rear yard setback is 25 feet.\n\n(I)\n\nFor the portion of a site within 100 feet of property zoned as or used for a use permitted\nin an NO, LO, GO, LR, or GR district:\n\n(1)\n\nthe minimum interior side yard setback is 15 feet; and\n\n(2)\n\nthe minimum rear yard setback is 15 feet.\n\n(J)\n\nFor the portion of a site within 100 feet of property zoned as or used for a use permitted\nin an L or less restrictive district, the minimum rear yard setback is 10 feet.\n\n(K)\n\nThe maximum impervious cover is 50 percent on land with a gradient of 15 percent or\nless. Impervious cover is prohibited on land with a gradient greater than 15 percent.\n\nSource: Section 13-2-676; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in an agricultural (AG) district.\n\n(B)\n\nFor a permitted use, the minimum front, side, and rear yard setbacks are 100 feet.\n\n(C)\n\nThis subsection applies to a conditional use.\n\n(1)\n\nThe minimum lot area is one acre.\n\n(2)\n\nThe maximum lot area is 1.5 acres.\n\n(3)\n\nThe minimum lot width is 100 feet.\n\n(4)\n\nNot more than one dwelling unit is permitted on each lot.\n\n(5)\n\nOne lot for each 10 acres of site area may be approved for a conditional use.\n\n(6)\n\nThe maximum distance from a rear lot line to the centerline of the nearest public\nroad is 400 feet.\n\n(7)\n\nThe minimum distance between driveways that serve conditional uses on the same site\nand on the same side of the road is 100 feet.\n\n(8)\n\nThe maximum height is the lesser of three stories or 35 feet.\n\n(9)\n\nThe minimum front yard setback is 40 feet.\n\n(10)\n\nThe minimum street side yard setback is 25 feet.\n\n(11)\n\nThe minimum interior side yard setback is 10 feet.\n\n(12)\n\nThe minimum rear yard setback is 20 feet.\n\n(13)\n\nThe maximum building cover is the lesser of 10,000 square feet or 20 percent of the\nlot area.\n\n(14)\n\nThe maximum impervious cover is the lesser of 12,500 square feet or 25 percent of\nthe lot area.\n\nSource: Section 13-2-681; Ord. 990225-70; Ord. 031211-11.\n\nIn an aviation services (AV) district, the following are permitted uses if located\non public property and conditional uses if located on private property:\n\n(1)\n\naviation facilities;\n\n(2)\n\ncommercial or industrial uses that are related to aviation and require direct access\nto an airport facility or aviation services, including assembly or sale of aircraft,\nair frames, air craft engines, aircraft parts or associated components, radios or\nnavigational equipment, and similar products or services;\n\n(3)\n\ncommercial or industrial uses that provide services to airport customers or aviation\nrelated uses, including passenger terminal facilities, air freight services, automobile\nservice stations, automobile rental agencies, restaurants, lounges, convenience shopping,\nbanking services, personal services, hotels and motels, and similar uses;\n\n(4)\n\nagricultural, recreational, or open space uses located within clear zones, approach\nareas, or lands reserved for future airport operations or related services;\n\n(5)\n\ncommunication service facilities; and\n\n(6)\n\ngovernmental, civic, public service, or public institutional uses, and related accessory\nuses.\n\nSource: Section 13-2-226; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nFor publicly owned land in an aviation services (AV) district, this title does not\nprescribe site development regulations.\n\n(B)\n\nFor privately owned land in an AV district:\n\n(1)\n\nsite development regulations are established by the approval of a conditional use\nsite plan; and\n\n(2)\n\napproval of an aviation-related use may not be granted until the owner obtains an\nairport use operating agreement for the intended activity.\n\nSource: Section 13-2-680; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn a public (P) district, the following are permitted uses:\n\n(1)\n\ngovernmental, civic, public service, and public institutional uses;\n\n(2)\n\nresidential uses associated with educational, military, medical, or similar public\nuses;\n\n(3)\n\ncommercial or industrial uses that are accessory to or in support of a principal public\nuse on the same site;\n\n(4)\n\nagricultural uses; and\n\n(5)\n\ntemporary uses.\n\n(B)\n\nA telecommunication tower use is a permitted or conditional use, as determined in\naccordance with Section 25-2-839 (Telecommunication Towers).\n\nSource: Section 13-2-227; Ord. 990225-70; Ord. 000302-36; Ord. 031211-11.\n\n(A)\n\nThis section applies in a public (P) district, except for a community events use.\n\n(B)\n\nEntities described in Section 25-2-145 (Public (P) District Designation) must comply with the requirements of this section.\n\n(C)\n\nFor a residential use, the site development regulations of the most comparable residential\nzoning district apply.\n\n(D)\n\nExcept as provided in Subsection (E), this subsection applies to a nonresidential\nuse.\n\n(1)\n\nFor a site less than one acre, the site development regulations of an adjoining zoning\ndistrict apply for a distance of 100 feet into the site. The minimum lot size requirement\nof an adjoining zoning district does not apply to a use by the City.\n\n(2)\n\nFor a site of one acre or more, the site development regulations are established by\nthe approval of a conditional use site plan.\n\n(E)\n\nThis subsection applies to a parks and recreation services (special) use.\n\n(1)\n\nThe minimum site area is 10 acres.\n\n(2)\n\nExcept for the requirement of Subsection (D)(1), the site development regulations\nare established by the approval of a conditional use site plan.\n\n(3)\n\nLocations for the sale of beer or wine, if any, must be identified on the site plan.\n\n(4)\n\nThe Land Use Commission may not consider a site plan until it receives a recommendation\nfrom the Parks and Recreation Board.\n\nSource: Section 13-2-682; Ord. 990225-70; Ord. 990902-57; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThis section applies in the Capitol dominance (CD) combining district.\n\n(B)\n\nThe maximum height of a structure is the lesser of:\n\n(1)\n\nthe base district maximum height; or\n\n(2)\n\na height that coincides with the 653 foot elevation above sea level, plus 0.04366\nfeet of height for each foot horizontally that the measurement point is separated\nfrom the center of the Capitol dome.\n\nSource: Section 13-2-716; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn the Capitol view corridor (CVC) combining district, the maximum height permitted\nis the lesser of:\n\n(1)\n\nthe base district maximum height; or\n\n(2)\n\nthe maximum height provided in this section.\n\n(B)\n\nIn a Capitol view corridor, a structure may not exceed the elevation of the plane\ndelineating the corridor. The height limitation exceptions of Section 25-2-531 (Height Limitation Exceptions) do not apply to this subsection.\n\nSource: Section 13-2-710; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-043; Ord.\n20060309-058; Ord. 20060622-022; Ord. 20060928-022.\n\n(A)\n\nIn the Congress Avenue (CA), East Sixth/Pecan Street (PS), downtown parks (DP), and\ndowntown creeks (DC) combining districts:\n\n(1)\n\nglass used on the first floor of a structure must have a visible transmittance rating\nof 0.6 or higher; and\n\n(2)\n\nreflective surface building materials must not produce glare.\n\n(B)\n\nThis subsection applies to new development on Congress Avenue or East 6th Street,\non streets adjacent to a downtown park or Town Lake, and along a downtown creek.\n\n(1)\n\nSurface parking lots, curb cuts, and unscreened garage openings are prohibited.\n\n(2)\n\nThe Land Use Commission may waive the prohibition of this subsection after determining\nthat:\n\n(a)\n\ncompliance with the prohibition is impractical;\n\n(b)\n\nthe proposed project will not unreasonably impair pedestrian or vehicular movement;\nand\n\n(c)\n\nadequate precautions have been made for public safety, convenience, and the aesthetic\nvalues of the combining district.\n\n(C)\n\nThis section applies to the PS overlay district.\n\n(1)\n\nExcept as otherwise provided in this subsection, a structure may not exceed a height\nof 45 feet.\n\n(2)\n\nA structure located west of Brazos Street is subject to the height limit of the base\nzoning district.\n\n(3)\n\nAn exterior sign must comply with the standards adopted by the Landmark Commission\nfor the Sixth Street Historic District.\n\n(4)\n\nA structure may develop to a maximum height of 140 feet if:\n\n(a)\n\nlocated on the 500 block or 600 block of East Sixth Street between Neches Street and\nSabine Streets; and\n\n(b)\n\ncomplying with the design standards established in Ordinance No. 20230720-160, as determined by the Historic Landmark Commission.\n\n(D)\n\nIn the DP combining district:\n\n(1)\n\na structure may not exceed a height of 120 feet; and\n\n(2)\n\nat least one entrance to a new development must face the park unless the new development\nis located diagonally across an intersection from the park.\n\n(E)\n\nIn the DC combining district:\n\n(1)\n\na structure may not exceed a height of 60 feet; and\n\n(2)\n\nstorage, trash collection, loading, and associated facilities must be screened from\nview from a creek.\n\n(F)\n\nIn the Congress Avenue (CA) combining district:\n\n(1)\n\nOn the west side of Congress Avenue within 60 feet of Congress Avenue:\n\n(a)\n\nthe minimum structure height is 30 feet; and\n\n(b)\n\nthe maximum structure height is 90 feet.\n\n(2)\n\nOn the east side of Congress Avenue within 40 feet of Congress Avenue:\n\n(a)\n\nthe minimum structure height is 30 feet; and\n\n(b)\n\nthe maximum structure height is 90 feet.\n\nSource: Section 13-2-717; Ord. 990225-70; Ord. 010607-8; Ord. 030612-93; Ord. 031211-11;\nOrd. 20080618-097; Ord. No. 20141211-201, Pt. 1, 12-22-14; Ord. No. 20230720-160, Pt. 1, 7-31-23.\n\n(A)\n\nCommercial off-street parking is prohibited in the convention center (CC) combining\ndistrict east of IH-35.\n\n(B)\n\nThis subsection applies in the CC combining district to development for which an application\nfor approval of commercial off-street parking is filed after November 18, 1990.\n\n(1)\n\nA commercial off-street parking use must be contained entirely within a structure\nand be screened.\n\n(2)\n\nA commercial off-site parking use must be separated at ground level from an adjacent\nstreet by an enclosed space designed for a pedestrian-oriented use described in Section 25-2-691 (Waterfront (WO) Overlay District Uses).\n\n(3)\n\nFor a site that is less than one city block in length on a side, the Land Use Commission\nmay waive the requirement of this subsection after determining that:\n\n(a)\n\ncompliance with the regulation is physically impractical; or\n\n(b)\n\nthe proposed project is located in an area that is not pedestrian-oriented.\n\nSource: Sections 13-2-230.1 and 13-2-718; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThis section applies to a use in the East Austin (EA) overlay district.\n\n(B)\n\nA use in a community commercial (GR), general commercial services (CS), commercial\n-liquor sales (CS-1), or limited industrial service (LI) base district is a conditional\nuse if, under Section 25-2-491 (Permitted, Conditional, and Prohibited Uses) of the City Code, the use is:\n\n(1)\n\npermitted in the district; and\n\n(2)\n\nnot permitted in a neighborhood commercial (LR) base district.\n\n(C)\n\nA medical office (not exceeding 5,000 square feet of gross floor area) use is a conditional\nuse in a GR, CS, CS-1, and LI base district.\n\n(D)\n\nA service station use is a conditional use in a GR, CS, CS-1, and LI base district.\n\n(E)\n\nA guidance services use and a communication service facilities use are conditional\nuses in all base districts.\n\n(F)\n\nA pawn shop services use is prohibited in a GR, CS, CS-1, and LI base district.\n\nSource: Section 13-2-191; Ord. 990225-70; Ord. 990520-70; Ord. 990520-70; Ord. 031211-11.\n\nDevelopment within the Lake Austin (LA) overlay district must comply with the regulations\napplicable to the LA zoning district under Section 25-2-551 (Lake Austin (LA) District Regulations) and the minimum lot size, minimum lot width, and setbacks applicable to the LA zoning\ndistrict under section 25-2-491 (Site Development Regulations).\n\nSource: Ord. No. 20140626-114, Pt. 2, 7-7-14.\n\n(A)\n\nThis section applies to a planned development area agreement or zoning district. The\nrequirements of this section supersede conflicting provisions of a planned development\narea agreement or ordinance, if any. This section does not apply to a planned development\narea that does not contain an industrial use.\n\n(B)\n\nA planned area development may not produce a dangerous or objectionable element, as\ndescribed in this section or a City administrative rule.\n\n(C)\n\nDangerous or objectionable elements include dangerous, injurious, noxious, or objectionable\nnoise, smoke, dust, odor, air pollution, heat, humidity, liquid or solid refuse or\nwaste, light or glare, or other substance, condition, radiation, or element that adversely\naffects property or the use of property in the vicinity. This excludes resource recovery\nsystems using solid waste.\n\n(D)\n\nA dangerous or objectionable element is measured in the manner prescribed by this\nsubsection.\n\n(1)\n\nNoise, vibration, light, glare, odor, or radiation is measured at the point on the\nsource property line that has the highest readings, or at any other point where the\nexistence of the elements may be more apparent. Noise levels are determined in accordance\nwith Information on Levels of Environmental Noise Requisite to Protect Public Health\nand Welfare with an Adequate Margin of Safety, Environmental Protection Agency, 1974.\n\n(2)\n\nSmoke or toxic or noxious matter is measured at the place of emission into the atmosphere.\n\n(3)\n\nFor open industrial operations described in Subsection (E)(6), dust concentration\nis measured at ground level or a habitable elevation, and either at the property line\nor beyond it, whichever results in the highest measurement.\n\n(E)\n\nA dangerous or objectionable element may not exceed the limits prescribed by this\nsubsection.\n\n(1)\n\nExcept for noise from a transportation facility or construction work, noise may not\nexceed 55 decibels LAN during daylight hours and 45 decibels LAN during night time\nhours.\n\n(2)\n\nEarth borne vibrations may not exceed:\n\n(a)\n\nthe limits in Column I below; or\n\n(b)\n\nif the point of measurement is a residential area boundary line or within 80 feet\nof a residential area boundary line that is located in a street right-of-way, the\nlimits in Column II below.\n\n|  | Column I | Column II |\n| --- | --- | --- |\n| Frequency Cycles Per Second | Displacement (inches) | Displacement (inches) |\n| 0 to 1 | .0020 | .0008 |\n| 1 to 10 | .0010 | .0004 |\n| 10 to 20 | .0008 | .0002 |\n| 20 to 30 | .0005 | .0001 |\n| 30 to 40 | .0004 | .0001 |\n| 40 and over | .0003 .0001 |\n\n(3)\n\nA light or direct welding flash may not exceed 0.4 foot candles across the source\nproperty line. Light from these sources must be screened from an adjoining property.\n\n(4)\n\nSmoke may not be:\n\n(a)\n\nas dark or darker in shade as that designated as No. 0 on the Ringlemann Chart, as\npublished by the United States Bureau of Mines; or\n\n(b)\n\nof an opacity that obscures an observer's view to a degree equal to or greater than\nsmoke described in Subsection (E)(4)(a).\n\n(5)\n\nAn emission of particulates for each one acre of property in a planned development\narea may not exceed:\n\n(a)\n\nfor particulates that are 44 microns or smaller, one pound during any one hour; and\n\n(b)\n\nfor particulates that are larger than 44 microns, 0.05 pounds during any one hour.\n\n(6)\n\nOpen industrial operations that involve dust-producing equipment, including sandblasting,\npaint spraying, gravel and concrete batching, and similar operations, may not produce\ndust in a concentration that exceeds one million particles for each cubic foot at\nthe point of measurement.\n\n(F)\n\nA planned development area must comply with the requirements for the storage, use,\nand manufacturing of explosives and hazardous materials in Chapter 6-2 (Hazardous Materials) and\nChapter 25-12,\nArticle 7 (Uniform Fire Code).\n\nSource: Section 13-2-269; Ord. 990225-70; Ord. 000309-39; Ord. 031211-11; Ord. No.\n20190523-042, Pt 1, 6-3-19.\n\n(A)\n\nA planned development area approved before January 1, 1985, is a PDA combining district\nand is subject to the regulations in effect on the date of approval.\n\n(B)\n\nThe director of the Neighborhood Planning and Zoning Department shall identify the\narea as a PDA combining district on the zoning map.\n\nSource: Section 13-2-154; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\nIn the criminal justice center overlay district:\n\n(1)\n\na bail bond services use, cocktail lounge use, or liquor sales use that would otherwise\nbe a permitted use is a conditional use; and\n\n(2)\n\na pawn shop services use is prohibited.\n\nSource: Ord. 010426-48; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), this section applies in the Barton Springs Zone\n(BSZ) overlay district.\n\n(B)\n\nThis section does not apply to a retail use on property:\n\n(1)\n\nsubject to a settlement agreement adopted by council before December 6, 2003 that\nprescribes development regulations;\n\n(2)\n\nzoned as a planned unit development before December 6, 2003; or\n\n(3)\n\nsubject to a site plan approved as a condition of zoning before December 6, 2003.\n\n(C)\n\nIn this section, RETAIL USE means:\n\n(1)\n\nagricultural sales and services use;\n\n(2)\n\nart gallery use;\n\n(3)\n\nart workshop use;\n\n(4)\n\nautomotive repair services use;\n\n(5)\n\nautomotive sales use;\n\n(6)\n\nconstruction sales and services use;\n\n(7)\n\nequipment sales use;\n\n(8)\n\nfood sales use;\n\n(9)\n\ngeneral retail services (convenience) use;\n\n(10)\n\ngeneral retail sales (general) use;\n\n(11)\n\nliquor sales use;\n\n(12)\n\nmonument retail sales use;\n\n(13)\n\npawn shop services use;\n\n(14)\n\npet services use;\n\n(15)\n\nplant nursery use;\n\n(16)\n\nrecreational equipment sales use;\n\n(17)\n\nrestaurant (drive-in, fast food) use;\n\n(18)\n\nrestaurant (general) use;\n\n(19)\n\nrestaurant (limited) use;\n\n(20)\n\nservice station use;\n\n(21)\n\nspecial use historic use; or\n\n(22)\n\nveterinary services use.\n\n(D)\n\nExcept as provided in Subsections (E) and (F), a principal retail use and its accessory\nuses may not exceed 50,000 square feet of gross floor area.\n\n(E)\n\nExcept as provided in Subsection (F), a principal food sales use and its accessory\nuses may not exceed 100,000 square feet of gross floor area.\n\n(F)\n\nA principal retail use that exceeded the limitations of Subsection (D) or (E) on December\n16, 2003 may be changed to another retail use if the existing impervious cover and\ngross floor area are not increased.\n\n(G)\n\nSubsections (C)(2) and (3) of Section 25-2-947 (Nonconforming Use Regulation Groups) do not apply to a use that exceeds the limitations in Subsections (D) or (E) on\nthe effective date of the ordinance.\n\nSource: Ord. 031204-57; Ord. 031211-11; Ord. 040617-Z-1.\n\n(A)\n\nThis section establishes the applicable regulations for DB90 zoning.\n\n(B)\n\nThis section governs over a conflicting provision of this title or other ordinance.\n\n(C)\n\nPre-Requisites.\n\n(1)\n\nTo utilize the regulations described in Subsections (F) and (G), the site's zoning\nmust include DB90 and an applicant must comply with Subsection (E).\n\n(2)\n\nTo preserve reserved dwelling units, an applicant must comply with Division 1 (General Provisions), Article 2 (Density Bonus and Incentive Programs) of Chapter 4-18 and, when applicable, Section 4-18-32(A)(2)—(5) (Existing Multi-Family Structure) before applying for a building permit or site plan that relies on the regulations\ndescribed in Subsections (F) and (G).\n\n(3)\n\nAn applicant can request a waiver of the replacement requirement in accordance with\nSection 4-18-33 (Waiver of Replacement Requirement).\n\n(D)\n\nA DB90 combining district may be combined with the following base districts:\n\n(1)\n\nCommercial Liquor Sales (CS-1);\n\n(2)\n\nGeneral Commercial Services (CS);\n\n(3)\n\nCommunity Commercial (GR);\n\n(4)\n\nNeighborhood Commercial (LR);\n\n(5)\n\nGeneral Office (GO); and\n\n(6)\n\nLimited Office (LO).\n\n(E)\n\nAffordability Requirements.\n\n(1)\n\nAffordability Minimums - Ownership Units. If an applicant develops dwelling units\nfor sale, this subdivision applies.\n\n(a)\n\nAn applicant must reserve a minimum of 12 percent of the residential units as affordable\nfor ownership and occupancy by households earning 80 percent or less of the current\nAustin-Round Rock Metropolitan Statistical Area Median Family Income as determined\nby the Housing Director.\n\n(b)\n\nAn applicant for a proposed owner-occupied housing development may elect to meet the\naffordability requirement without providing income-restricted units onsite by paying\na fee in-lieu to the Housing Trust Fund. At a minimum the fee-in-lieu shall be equivalent\nto the required percentage of the total residential units, including the mix of bedrooms\nrequired, at the rate set in the fee schedule at the time of final site plan submission.\n\n(2)\n\nAffordability Minimums - Rental Units. If an applicant develops dwelling units for\nlease, this subdivision applies. An applicant must reserve:\n\n(a)\n\na minimum of 12 percent of the residential units as affordable for lease and occupancy\nby households earning 60 percent or less of the current Austin-Round Rock Metropolitan\nStatistical Area Median Family Income as determined by the Housing director; or\n\n(b)\n\na minimum of ten percent of the residential units as affordable for lease and occupancy\nby households earning 50 percent or less of the current Austin-Round Rock Metropolitan\nStatistical Area Median Family Income as determined by the Housing director.\n\n(F)\n\nDevelopment Standards and Mixed Use.\n\n(1)\n\nIn a DB90 combining district, the following uses are permitted:\n\n(a)\n\nuses that are permitted in the base zoning district unless the use is restricted by\na conditional overlay that applies to the property;\n\n(b)\n\nresidential uses; and\n\n(c)\n\nin general office (GO) and limited office (LO) base zoning districts, the following\nadditional uses are allowed:\n\n(i)\n\nconsumer convenience services;\n\n(ii)\n\nfood sales;\n\n(iii)\n\ngeneral retail sales (convenience or general); and\n\n(iv)\n\nrestaurant (limited or general) without drive-in service.\n\n(2)\n\nA development must comply with Article 2 (Site Development Standards) and Article 3 (Building Design Standards) in Subchapter E (Design Standards and Mixed Use) of this chapter except when those provisions conflict with this section.\n\n(3)\n\nMix of Uses.\n\n(a)\n\nIn this subdivision, PRINCIPAL STREET has the same meaning as principal street in\nand is applied consistent with Article 5 (Definitions) of Subchapter E (Design Standards and Mixed Use).\n\n(b)\n\nPedestrian-Oriented Commercial and Civic Spaces. At least 75 percent of the building\nfrontage along the principal street and on the ground floor of the building must be\ndesigned for one or more commercial or civic uses and must comply with the dimensional\nrequirements found in Section 4.3.3.C in Subchapter E (Design Standards and Mixed Use) of this chapter. A lobby serving a use other than a pedestrian-oriented commercial\nor civic space is not counted as a pedestrian-oriented commercial or civic place.\n\n(c)\n\nIf a building includes a mix of uses, a non-residential use:\n\n(i)\n\nmay not be located above a residential use; and\n\n(ii)\n\nmay not be located on or above the third story of the building.\n\n(d)\n\nAn on-site amenity is a residential use when provided solely for use by the occupant,\nor the occupant's guests.\n\n(e)\n\nThe ordinance zoning or rezoning a site as DB90 may modify the requirements in Subdivision\n(3)(b) if the site abuts one of the following roadways defined in Article 5 (Definitions) of Subchapter E (Design Standards and Mixed Use).\n\n(i)\n\nurban roadway;\n\n(ii)\n\nsuburban roadway;\n\n(iii)\n\nhighway; or\n\n(iv)\n\nhill country.\n\n(4)\n\nA building may exceed the maximum building height in the base zoning district by a\nmaximum of 30 feet except that no building may exceed 90 feet in height.\n\n(5)\n\nA site is not required to comply with the base zoning district's:\n\n(a)\n\nminimum site area requirements (if applicable);\n\n(b)\n\nmaximum floor area ratio;\n\n(c)\n\nmaximum building coverage;\n\n(d)\n\nminimum street side yard setback and interior yard setback; and\n\n(e)\n\nminimum front yard setback; provided, however, that if the right-of-way is less than\n60 feet in width, the minimum front yard setback for buildings three or more stories\nin height shall be 30 feet from the centerline of the street to ensure adequate Fire\nDepartment access.\n\n(6)\n\nSection 1.4 (Minor Modifications) and Section 1.5 (Alternative Equivalent Compliance) in Subchapter E (Design Standards and Mixed Use) of this chapter apply to a site developed under this section.\n\n(G)\n\nCompatibility Requirements.\n\n(1)\n\nA building is not required to comply with Article 10 (Compatibility Standards), Subchapter C.\n\n(2)\n\nIn this subsection, a triggering property:\n\n(a)\n\nincludes at least one dwelling unit but less than four dwelling units; and\n\n(b)\n\nis zoned Urban Family Residence (SF-5) or more restrictive.\n\n(3)\n\nCompatibility Buffer. A compatibility buffer is required along a site's property line\nthat is shared with a triggering property.\n\n(a)\n\nThe minimum width of a compatibility buffer is 25 feet.\n\n(b)\n\nA compatibility buffer must comply with Section 25-8-700 (Minimum Requirements for a Compatibility Buffer).\n\n(4)\n\nExterior lighting must be hooded or shielded so that the light source is not visible\nfrom the site's property line or alleyway that is shared with a triggering property.\n\n(5)\n\nMechanical equipment may not produce sound in excess of 70 decibels measured at the\nsite's property line or alleyway that is shared with a triggering property.\n\n(6)\n\nA concrete slab used for a refuse receptacle may not be placed within 15 feet of triggering\nproperty.\n\n(7)\n\nExcept for a multi-use trail, an on-site amenity that is available only to residents\nand occupants of the site and their guests may not be located within 25 feet of a\ntriggering property.\n\n(8)\n\nScreening Requirements. Except when visible from or through a pedestrian or bicycle\naccess point, the following objects shall be screened and may not be visible at the\nsite's property line or alleyway that is shared with a triggering property:\n\n(a)\n\nvehicle lights from vehicles that use or are parked on a parking lot or in a parking\nstructure located on the site;\n\n(b)\n\nground floor and rooftop mechanical equipment;\n\n(c)\n\noutdoor storage;\n\n(d)\n\nrefuse receptacles and collection areas; or\n\n(e)\n\ncommon areas for amenities, including outdoor decks, patios, or pools.\n\n(9)\n\nThe screening required in Subdivision (8) may not impede pedestrian or bicycle access\npoints.\n\n(10)\n\nRooftop mechanical equipment may be screened by a parapet.\n\nSource; Ord. No. 20240229-073, Pt. 3, 3-11-24; Ord. No. 20240829-158, Pt. 1, 9-9-24.\n\n(A)\n\nThis section applies to a property with equitable transit-oriented development (ETOD)\ncombining district zoning.\n\n(B)\n\nThis section governs over a conflicting provision of this title or other ordinance\nunless the conflicting provision is more restrictive.\n\n(C)\n\nAn ETOD combining district may not be combined with any special purpose base districts\nor with any of the following zoning districts:\n\n(1)\n\nLake Austin residence (LA);\n\n(2)\n\nrural residence (RR);\n\n(3)\n\nsingle-family residence large lot (SF-1);\n\n(4)\n\nsingle-family residence standard lot (SF-2);\n\n(5)\n\nfamily residence (SF-3);\n\n(6)\n\nsingle-family residence small lot (SF-4A);\n\n(7)\n\nsingle-family residence condominium site (SF-4B);\n\n(8)\n\nurban family residence (SF-5);\n\n(9)\n\ntownhouse and condominium residence (SF-6);\n\n(10)\n\nmobile home residence (MH);\n\n(11)\n\nplanned development area (PDA);\n\n(12)\n\nEast Sixth/Pecan Street Overlay (PS); or\n\n(13)\n\nUniversity Neighborhood Overlay (UNO).\n\n(D)\n\nThe uses included in Table (D) are prohibited uses on a property with equitable transit-oriented\ndevelopment (ETOD) combining district zoning:\n\nTABLE D. PROHIBITED USES\n\n|  |  |\n| --- | --- |\n| COMMERCIAL USES: | Recreational Equipment Sales |\n| Agricultural Sale and Services | Research Assembly Services |\n| Automotive Sales | Research Testing Services |\n| Automotive Rentals | Research Warehousing Services |\n| Automotive Repair Services | Scrap and Salvage |\n| Building Maintenance Services | Service Station |\n| Campground | Stables |\n| Carriage Stable | Vehicle Storage |\n| Convenience Storage | INDUSTRIAL USES: |\n| Drop-off Recycling Collection Facility | Basic Industry |\n| Electronic Prototype Assembly | General Warehousing and Distribution |\n| Electronic Testing | Recycling Center |\n| Equipment Repair Services | Resource Extraction |\n| Equipment Sales | AGRICULTURAL USES: |\n| Exterminating Services | Animal Production |\n| Funeral Services | Crop Production |\n| Marina | Indoor Crop Production |\n| Recreational Equipment Maintenance & Storage |  |\n\n(E)\n\nConditional Uses.\n\n(1)\n\nThe uses included in Table (E) are conditional uses on property with equitable transit-oriented\ndevelopment (ETOD) combining district zoning if the use is permitted by the zoning\nthat applies to the property.\n\n(2)\n\nIf electric vehicle charging is permitted by the zoning that applies to the property,\nelectric vehicle charging is a conditional use on a site that is not:\n\n(a)\n\nan existing service station use; or\n\n(b)\n\na discontinued service station use, if a subsequent use on the site did not include\na restaurant (general) use, a restaurant (limited) use, or a residential use.\n\nTABLE E. CONDITIONAL USES\n\n|  |  |\n| --- | --- |\n| COMMERCIAL USES: | Off-Site Accessory Parking |\n| Alternative Financial Services | Pawn Shop Services |\n| Automotive Washing | Pedicab Storage and Dispatch |\n| Bail Bond Services | Special Use Historic |\n| Commercial Blood Plasma Center | INDUSTRIAL USES: |\n| Commercial Off-Street Parking | Custom Manufacturing |\n| Communications Services | Light Manufacturing |\n| Construction Sales and Services | Limited Warehousing and Distribution |\n| Kennels | AGRICULTURAL USES: |\n| Monument Retail Sales | Horticulture |\n\n(Ord. No. 20240516-005, Pt. 3, 7-15-24\n\n(A)\n\nThis section applies to a property with density bonus ETOD (DBETOD) combining district\nzoning.\n\n(B)\n\nThis section governs over a conflicting provision of this title or other ordinance.\n\n(C)\n\nPre-Requisites.\n\n(1)\n\nTo utilize the regulations described in Subsections (G) and (H), the site's zoning\nmust include density bonus ETOD (DBETOD) combining district zoning and applicant must\ncomply with Subsections (E) and (F).\n\n(2)\n\nTo preserve reserved dwelling units and existing non-residential spaces, an applicant\nmust comply with Article 2 (Density Bonus and Incentive Programs) of Chapter 4-18 before applying for a building permit or site plan that relies on\nthe regulations described in Subsections (G) and (H).\n\n(D)\n\nDensity bonus ETOD (DBETOD) combining district may only be combined with equitable\ntransit-oriented development (ETOD) combining district.\n\n(E)\n\nAffordability Requirements - Dwelling Units.\n\n(1)\n\nAffordability Minimums - Ownership Units. If an applicant develops dwelling units\nfor sale, this subdivision applies.\n\n(a)\n\nA development must provide a minimum of 12 percent of the residential units as affordable\nfor ownership and occupancy by households earning 80 percent or less of the current\nAustin-Round Rock Metropolitan Statistical Area Median Family Income as determined\nby the director of the Housing Department.\n\n(b)\n\nAn applicant for a proposed owner-occupied housing development may elect to meet the\naffordability requirement without providing income-restricted units onsite by paying\na fee in-lieu to the Housing Trust Fund. At a minimum, the fee-in-lieu shall be equivalent\nto 125 percent of the required percentage of the total residential units, including\nthe mix of bedrooms required. The fee-in-lieu shall be set by separate ordinance.\nThe amount of fee-in-lieu due is determined using the fee schedule ordinance in effect\nat site plan submittal.\n\n(2)\n\nAffordability Minimums - Rental Units. If an applicant develops dwelling units for\nlease, this subdivision applies.\n\n(a)\n\nTo achieve 60 feet or to utilize a development standard under DBETOD that is not height-related,\na development must provide a minimum of 10 percent of the residential units as affordable\nfor lease and occupancy by households earning 60 percent or less of the current Austin-Round\nRock Metropolitan Statistical Area Median Family Income as determined by the director\nof the Housing Department.\n\n(b)\n\nTo utilize 90 feet in height, a development must provide:\n\n(i)\n\na minimum of 12 percent of the residential units as affordable for lease and occupancy\nby households earning 60 percent or less of the current Austin-Round Rock Metropolitan\nStatistical Area Median Family Income as determined by the director of the Housing\nDepartment; or\n\n(ii)\n\na minimum of 10 percent of the residential units as affordable for lease and occupancy\nby households earning 50 percent or less of the current Austin-Round Rock Metropolitan\nStatistical Area Median Family.\n\n(c)\n\nTo utilize 120 feet in height, a development must provide:\n\n(i)\n\na minimum of 15 percent of the residential units as affordable for lease and occupancy\nby households earning 60 percent or less of the current Austin-Round Rock Metropolitan\nStatistical Area Median Family Income as determined by the director of the Housing\nDepartment; or\n\n(ii)\n\na minimum of 12 percent of the residential units as affordable for lease and occupancy\nby households earning 50 percent or less of the current Austin-Round Rock Metropolitan\nStatistical Area Median Family.\n\n(3)\n\nTransit Supportive Infrastructure.\n\n(a)\n\nIn this subdivision, TRANSIT SUPPORTIVE INFRASTRUCTURE includes appurtenances, facilities,\nand amenities related to a transit system project as defined in Ordinance No. 20221115-048.\n\n(b)\n\nIf an applicant provides transit supportive infrastructure, the affordability requirement\nis reduced by two percent.\n\n(c)\n\nIt is presumed that the value of the transit supportive infrastructure equals at least\ntwo percent of the minimum affordability.\n\n(i)\n\nThe director of the Housing Department is authorized to reduce the affordability requirement\nby more than two percent if the director of the Housing Department and the Project\nConnect mobility officer agree that the value of the transit supportive infrastructure\nis greater than or equal to the value of the reduction.\n\n(ii)\n\nThe director of the Housing Department may not reduce the affordability requirement\nto less than one residential unit or the equivalent of the fee-in-lieu for one ownership\nunit.\n\n(d)\n\nAn applicant must submit a written request to the Project Connect mobility officer\nto provide transit supportive infrastructure.\n\n(e)\n\nIf the applicant proposes transit supportive infrastructure that serves a community\nbenefit, the Project Connect mobility officer must approve a request.\n\n(f)\n\nBefore approving a request to provide transit supportive infrastructure, the Project\nConnect mobility officer must adopt rules under Chapter 1-2 (Administrative Rules) that establish when transit supportive infrastructure serves a community benefit.\n\n(F)\n\nExisting Non-Residential Spaces.\n\n(1)\n\nIn this subsection,\n\n(a)\n\nCREATIVE SPACE means a use described in Chapter 25-2 (Zoning) that allows one or more of the following occupancies:\n\n(i)\n\nart gallery;\n\n(ii)\n\nart workshop;\n\n(iii)\n\nperformance venue; or\n\n(iv)\n\ntheater.\n\n(b)\n\nEXISTING NON-RESIDENTIAL SPACE means a:\n\n(i)\n\nadult care services use (general or limited) that has operated for a minimum of 12\ncontinuous months;\n\n(ii)\n\nchild care services use (general or limited) that has operated for a minimum of 12\ncontinuous months;\n\n(iii)\n\ncocktail lounge use that has operated for a minimum of 10 continuous years;\n\n(iv)\n\ncreative space use that has operated for a minimum of three continuous years;\n\n(v)\n\nfood sales use that has operated for a minimum of 10 continuous years with a gross\nfloor area of 20,000 square feet or less; or\n\n(vi)\n\nsmall format use that has operated for a minimum of 10 continuous years with a gross\nfloor area of 5,000 square feet or less.\n\n(c)\n\nSMALL FORMAT USE means a use described in Chapter 25-2 (Zoning) that allows one or more of the following occupancies:\n\n(i)\n\ngeneral retail sales;\n\n(ii)\n\npersonal services;\n\n(iii)\n\nrestaurant (general or limited).\n\n(2)\n\nIf a site includes an existing non-residential space, the proposed development must\nreplace each existing non-residential space with a space that is comparable in size\nfor a period of 5 years.\n\n(3)\n\nThis subsection establishes an existing non-residential space subject to Division\n2 (Redevelopment Requirements), Article 2 of City Code Chapter 4-18.\n\n(4)\n\nA non-conforming use is not discontinued or abandoned under Section 25-2-945 (Abandonment of Nonconforming Use) if the non-conforming use qualifies as an existing non-residential space and is\nrequired to be replaced under this subsection.\n\n(G)\n\nDevelopment Standards and Mixed Use.\n\n(1)\n\nThe following uses are permitted on a property with density bonus ETOD (DBETOD) combining\ndistrict zoning:\n\n(a)\n\nuses permitted by the zoning that applies to the property;\n\n(b)\n\nuses not prohibited by the equitable transit-oriented development (ETOD) combining\ndistrict zoning; and\n\n(c)\n\nresidential uses.\n\n(2)\n\nA development must comply with Article 2 (Site Development Standards) and Article 3 (Building Design Standards) in Subchapter E (Design Standards and Mixed Use) except when those provisions conflict with this section.\n\n(3)\n\nExcept as modified by this section, a site with a residential base zoning district\nshall follow development standards applicable to the site's residential base zoning\ndistrict and the residential use.\n\n(4)\n\nMix of Uses.\n\n(a)\n\nThis subdivision does not apply to a property with a residential base zoning district.\n\n(b)\n\nIn this subdivision, PRINCIPAL STREET has the same meaning as principal street in\nand is applied consistent with Article 5 (Definitions) of Subchapter E.\n\n(c)\n\nPedestrian-Oriented Commercial Spaces. When a site abuts a principal street, 75 percent\nof the building frontage along the principal street must contain one or more commercial\nor civic uses and must comply with the dimensional requirements found in Section 4.3.3.C\nin Subchapter E (Design Standards and Mixed Use).\n\n(d)\n\nLimitation on Mix of Uses.\n\n(i)\n\nThe maximum number of floors that can include non-residential uses is two.\n\n(ii)\n\nA cocktail lounge or performance venue may only be located on the first or second\nstory of the building.\n\n(iii)\n\nA residential use may not be located below a cocktail lounge or performance venue.\n\n(e)\n\nAn on-site amenity is a residential use when provided solely for use by the occupant,\nor the occupant's guests.\n\n(f)\n\nThe ordinance zoning or rezoning a site as density bonus ETOD (DBETOD) combining district\nmay modify the requirements in Subdivision (4)(c).\n\n(5)\n\nMaximum Height.\n\n(a)\n\nSubdistricts.\n\n(i)\n\nIn Subdistrict 1, a building may exceed the maximum building height in the base zoning\ndistrict by 60 feet except that no building may exceed 120 feet in height;\n\n(ii)\n\nIn Subdistrict 2, a building may exceed the maximum building height in the base zoning\ndistrict by 30 feet except that no building may exceed 90 feet in height;\n\n(b)\n\nA building may exceed the maximum building height in the base zoning district but\nno building may exceed 60 feet if the minimum affordability requirements in Subsection\n(E)(2)(a) are met;\n\n(c)\n\nA building may exceed the maximum building height in the base zoning district but\nno building may exceed 90 feet if the minimum affordability requirements in Subsection\n(E)(2)(b) are met; or\n\n(d)\n\nA building may exceed the maximum building height in the base zoning district by 60\nfeet but no building may exceed 120 feet in height if the minimum affordability requirements\nin Subsection (E)(1) or Subsection (E)(2)(c) are met.\n\n(6)\n\nA site is not required to comply with the base zoning district's:\n\n(a)\n\nminimum site area requirements (if applicable);\n\n(b)\n\nmaximum floor area ratio;\n\n(c)\n\nmaximum building coverage;\n\n(d)\n\nmaximum number of stories;\n\n(e)\n\nminimum street side yard setback and interior yard setback; and\n\n(f)\n\nminimum front yard setback; provided, however, that if the right-of-way is less than\n60 feet in width, the minimum front yard setback for buildings three or more stories\nin height shall be 30 feet from the centerline of the street to ensure adequate Fire\nDepartment access.\n\n(7)\n\nSection 1.4 (Minor Modifications) and Section 1.5 (Alternative Equivalent Compliance) in Subchapter E apply to a site developed under this section.\n\n(8)\n\nThis subsection governs over a conflicting provision of this title or other ordinance\nunless the provision is less restrictive.\n\n(H)\n\nCompatibility Requirements.\n\n(1)\n\nA building is not required to comply with Article 10 (Compatibility Standards) in Subchapter C.\n\n(2)\n\nIn this subsection,\n\n(a)\n\nTRIGGERING PROPERTY means a site:\n\n(i)\n\nwith at least one dwelling unit but less than four dwelling units; and\n\n(ii)\n\nis zoned urban family residence (SF-5) district or more restrictive; and\n\n(b)\n\nSTRUCTURE includes a portion of a structure.\n\n(3)\n\nAny structure that is located less than 50 feet from any part of a triggering property\nmay not exceed 60 feet.\n\n(4)\n\nCompatibility Buffer. A compatibility buffer is required along a site's property line\nthat is shared with a triggering property.\n\n(a)\n\nThe minimum width of a compatibility buffer is 25 feet.\n\n(b)\n\nA compatibility buffer must comply with Section 25-8-700 (Minimum Requirements for Compatibility Buffers).\n\n(5)\n\nExterior lighting must be hooded or shielded so that the light source is not visible\nfrom the site's property line or alleyway that is shared with a triggering property.\n\n(6)\n\nMechanical equipment may not produce sound in excess of 70 decibels measured at the\nsite's property line or alleyway that is shared with a triggering property.\n\n(7)\n\nA concrete slab used for a refuse receptacle may not be placed within 15 feet of triggering\nproperty.\n\n(8)\n\nExcept for a multi-use trail, an on-site amenity that is available only to residents\nand occupants of the site and their guests may not be located within 25 feet of a\ntriggering property.\n\n(9)\n\nScreening Requirements. Except when visible from or through a pedestrian or bicycle\naccess point, the following objects shall be screened and may not be visible at the\nsite's property line or alleyway that is shared with a triggering property:\n\n(a)\n\nvehicle lights from vehicles that use or are parked on a parking lot or in a parking\nstructure located on the site;\n\n(b)\n\nground floor and rooftop mechanical equipment;\n\n(c)\n\noutdoor storage;\n\n(d)\n\nrefuse receptacles and collection areas; and\n\n(e)\n\ncommon areas for amenities, including outdoor decks, patios, and pools.\n\n(10)\n\nThe screening required in Subdivision (H)(9) may not impede pedestrian or bicycle\naccess points.\n\n(11)\n\nRooftop mechanical and equipment may be screened by a parapet.\n\n(12)\n\nExcept for Subdivision (H)(4), this subsection governs over a conflicting provision\nof this title or other ordinance unless the provision is less restrictive.\n\n(Ord. No. 20240516-005, Pt. 5, 7-15-24)\n\n(A)\n\nThis section applies to a property with density bonus creative space (DBCS) combining\ndistrict zoning.\n\n(B)\n\nThis section governs over a conflicting provision of this title or other ordinance.\n\n(C)\n\nPre-requisites.\n\n(1)\n\nTo utilize the supplemental standards and regulations described in Subsections (E)\nand (F), the site's zoning must include density bonus creative spaces (DBCS) combining\ndistrict zoning and applicant must comply with Subsection (D).\n\n(2)\n\nTo reserve affordable creative spaces and to preserve existing non-residential spaces,\nan applicant must comply with Article 2 (Density Bonus and Incentive Programs) of Chapter 4-18 (General Permitting Standards) before applying for a building permit or site plan that relies on the regulations\ndescribed in Subsections (E) and (F).\n\n(D)\n\nExisting Non-Residential Spaces.\n\n(1)\n\nIn this subsection,\n\n(a)\n\nAFFORDABLE CREATIVE SPACE means the rent for the space is the lesser of 50 percent\nof the average retail space rent within the city or a fixed ratio of annual revenues.\n\n(b)\n\nCOCKTAIL LOUNGE means a cocktail lounge use described in Chapter 25-2 (Zoning) and established on or before October 31, 2024.\n\n(c)\n\nCREATIVE SPACE means a use described in Chapter 25-2 (Zoning) that allows one or more of the following occupancies:\n\n(i)\n\nart gallery;\n\n(ii)\n\nart workshop;\n\n(iii)\n\ncocktail lounge;\n\n(iv)\n\ncultural services;\n\n(v)\n\nperformance venue;\n\n(vi)\n\npersonal improvement services; or\n\n(vii)\n\ntheater.\n\n(d)\n\nEXISTING NON-RESIDENTIAL SPACE means a creative space use that has operated for a\nminimum of 12 continuous months.\n\n(2)\n\nIf a site includes an existing non-residential space, the proposed development must\nreplace each existing non-residential space with a non-residential space that is comparable\nin size for a period of 10 years.\n\n(3)\n\nAffordable Creative Spaces.\n\n(a)\n\nAt least 25 percent of the ground floor must be eligible to be leased to an operator\nof an affordable creative space.\n\n(b)\n\nThe director of the Economic Development Department determines the fixed ratio of\nannual revenues, which will be based on the annual revenues considered typical of\nand sustainable for the type of creative space.\n\n(c)\n\nRent for an affordable creative space tenant may not escalate more than 5 percent\nyear-over-year.\n\n(4)\n\nAn applicant for a proposed development may elect to meet the affordability requirements\nin Subsection (E)(3) without providing affordable creative spaces by paying a fee-in-lieu\nto a fund managed by the Economic Development Department for the purpose of preserving\nexisting creative spaces or creating affordable creative spaces. At a minimum, the\nfee-in-lieu shall be equivalent to 100 percent of the required percentage of affordable\ncreative space. The fee-in-lieu shall be set by separate ordinance. The amount of\nfee-in-lieu due is determined using the fee schedule ordinance in effect at the time\nof site plan submittal.\n\n(5)\n\nThis subsection establishes an existing non-residential space subject to Division\n2 (Redevelopment Requirements), Article 2 of Chapter 4-18 (General Permitting Standards).\n\n(6)\n\nA non-conforming use is not discontinued or abandoned under Section 25-2-945 (Abandonment of Nonconforming Use) if the non-conforming use qualifies as an existing non-residential space and is\nrequired to be replaced under this subsection.\n\n(E)\n\nDevelopment Standards and Mixed Use.\n\n(1)\n\nThe following uses are permitted on a property with density bonus creative spaces\n(DBCS) combining district zoning:\n\n(a)\n\nuses permitted by the zoning ordinance that applies to the property; and\n\n(b)\n\ncreative spaces permitted in the ordinance designating the district.\n\n(2)\n\nA development must comply with Article 2 (Site Development Standards) and Article 3 (Building Design Standards) of Subchapter E (Design Standards and Mixed Use) except when those provisions conflict with this section.\n\n(3)\n\nMix of Uses.\n\n(a)\n\nIn this subdivision, PRINCIPAL STREET has the same meaning as principal street in\nand is applied consistent with Article 5 (Definitions) of Subchapter E (Design Standards and Mixed Use).\n\n(b)\n\nPedestrian-Oriented Creative Spaces. When a site abuts a principal street, 30 percent\nof the building frontage along the principal street and on the ground floor must be\ndesigned for creative spaces and must comply with the requirements of Section 4.3.3.C\n(Pedestrian-Oriented Commercial Spaces) of Subchapter E (Design Standards and Mixed Use).\n\n(4)\n\nA building may exceed the maximum building height in the base zoning district by a\nmaximum of 30 feet except that no building may exceed 90 feet in height.\n\n(5)\n\nA site is not required to comply with the base zoning district's:\n\n(a)\n\nminimum site area requirements (if applicable);\n\n(b)\n\nmaximum floor area ratio;\n\n(c)\n\nmaximum building coverage;\n\n(d)\n\nmaximum number of stories;\n\n(e)\n\nminimum street side yard setback and interior yard setback; and\n\n(f)\n\nminimum front yard setback; provided, however, that if the right-of-way is less than\n60 feet in width, the minimum front yard setback for buildings three or more stories\nin height shall be 30 feet from the centerline of the street to ensure adequate Fire\nDepartment access.\n\n(6)\n\nSection 1.4 (Minor Modifications) and Section 1.5 (Alternative Equivalent Compliance) of Subchapter E (Design Standards and Mixed Use) apply to a site developed under this section.\n\n(7)\n\nA site developed under this section shall comply with the supplemental standards that\nare established in the ordinance that created the applicable density bonus creative\nspaces (DBCS) combining district.\n\n(F)\n\nCompatibility Requirements.\n\n(1)\n\nA building is not required to comply with Article 10 (Compatibility Standards) in Subchapter C (Use and Development Regulations).\n\n(2)\n\nIn this subsection,\n\n(a)\n\nTRIGGERING PROPERTY means a site:\n\n(i)\n\nwith at least one dwelling unit but less than four dwelling units; and\n\n(ii)\n\nis zoned urban family residence (SF-5) district or more restrictive; and\n\n(b)\n\nSTRUCTURE includes a portion of a structure.\n\n(3)\n\nCompatibility Buffer. A compatibility buffer is required along a site's property line\nthat is shared with a triggering property.\n\n(a)\n\nThe minimum width of a compatibility buffer is 25 feet.\n\n(b)\n\nA compatibility buffer must comply with Section 25-8-700 (Minimum Requirements for Compatibility Buffers).\n\n(4)\n\nExterior lighting must be hooded or shielded so that the light source is not visible\nfrom the site's property line or alleyway that is shared with a triggering property.\n\n(5)\n\nMechanical equipment may not produce sound in excess of 70 decibels measured at the\nsite's property line or alleyway that is shared with a triggering property.\n\n(6)\n\nA concrete slab used for a refuse receptacle may not be placed within 15 feet of triggering\nproperty.\n\n(7)\n\nExcept for a multi-use trail, an on-site amenity that is available only to residents\nand occupants of the site and their guests may not be located within 25 feet of a\ntriggering property.\n\n(8)\n\nScreening Requirements. Except when visible from or through a pedestrian or bicycle\naccess point, the following objects shall be screened and may not be visible at the\nsite's property line or alleyway that is shared with a triggering property:\n\n(a)\n\nvehicle lights from vehicles that use or are parked on a parking lot or in a parking\nstructure located on the site;\n\n(b)\n\nground floor and rooftop mechanical equipment;\n\n(c)\n\noutdoor storage;\n\n(d)\n\nrefuse receptacles and collection areas; and\n\n(e)\n\ncommon areas for amenities, including outdoor decks, patios, and pools.\n\n(9)\n\nThe screening required in Subdivision (F)(9) may not impede pedestrian or bicycle\naccess points.\n\n(10)\n\nRooftop mechanical equipment may be screened by a parapet.\n\nSource: Ord. No. 20241010-034, Pt. 4, 10-21-24.\n\nIn Section 25-2-672 (Town Lake Park Regulations):\n\n(1)\n\nCOMMUNITY PARK means a portion of Town Lake Park that is intended for city wide use\nand designed to accommodate large numbers of people involved in a variety of activities.\nThe following areas in Town Lake Park are community parks:\n\n(a)\n\ntracts S-1, S-2, S-3A, S-4, S-6, S-7, S-8, S-9, N-1, N-2, N-3, N-4, N-5A, N-6, N-7,\nN-8, N-9, N-10, N-11, N-15, N-16A, and N-17A on the park classification map;\n\n(b)\n\npark land in the area bounded on the north by the Colorado River, on the west by Pleasant\nValley Road, on the south by the proposed extension of Lakeshore Boulevard, and on\nthe east by the crest of the bluff of Country Club Creek;\n\n(c)\n\npark land in the area bounded on the north by Lake Austin Boulevard, on the south\nby Town Lake, on the east by the MoPac Freeway, and on the west by the extension of\nthe western boundary of Eilers Park;\n\n(d)\n\nthe Holly Street Power Plant, when its current use ceases and it is dedicated as park\nland; and\n\n(e)\n\npark land within 50 feet of the shoreline of Town Lake.\n\n(2)\n\nCULTURAL PARK means a portion of Town Lake Park that is intended for cultural facilities,\nincluding museums, botanical gardens, and performance areas. The following areas in\nTown Lake Park are cultural parks:\n\n(a)\n\ntracts S-2D, S-3, S-4A, S-5, S-5A, S-5B, and S-5C on the park classification map;\n\n(b)\n\npark land in the area bounded on the east by Dawson Road, on the west by Lamar Boulevard,\non the south by Barton Springs Road, and on the north by Riverside Drive;\n\n(c)\n\npark land in the area bounded on the north by Town Lake, on the south by Barton Springs\nRoad, Barton Boulevard, and the westward extension of Linscomb Avenue, on the east\nby Lamar Boulevard, and on the west by Robert E. Lee Road and the hike and bike trail;\n\n(d)\n\npark land north of the intersection of River Street and Bierce Street, known as the\nCity of Austin Street and Bridge Yard; and\n\n(e)\n\nthe Seaholm Power Plant and the Green Water Treatment Plant, including the water intake\nstructures, when the current uses cease and the plants are dedicated as park land.\n\n(3)\n\nNEIGHBORHOOD PARK means a portion of Town Lake Park that is small, informal, is less\nintensely used than the developed areas of Town Lake Park, and serves adjacent neighborhoods.\nThe following areas in Town Lake Park are neighborhood parks:\n\n(a)\n\ntracts S-2A, S-10, N-5, N-16, and N-17 on the Park Classification Map;\n\n(b)\n\npark land in the area bounded on the north by Town Lake, on the west by East Bouldin\nCreek, on the east by Blunn Creek, and on the south by Riverside Drive; and\n\n(c)\n\npark land in the area bounded on the north by the Colorado River, on the east by Montopolis\nDrive, on the south by the extension of Grove Boulevard, and on the west by the crest\nof the bluff of Country Club Creek.\n\n(4)\n\nPARK CLASSIFICATION MAP means the map that is on file with the Parks and Recreation\nDepartment and that is Exhibit \"B\" to Ordinance No. 890126-P.\n\n(5)\n\nNATURAL AREA means that portion of Town Lake Park that is preserved as a natural environment\nwith limited human activity. The following areas in Town Lake Park are natural areas:\n\n(a)\n\ntracts W-1, S-2B, S-2C, N-3A, and N-18 on the Park Classification Map;\n\n(b)\n\npark land located between the Colorado River shoreline and the crest of the bluff\nnorth of the Colorado River, from Longhorn Dam to U.S. 183 (Montopolis Bridge); and\n\n(c)\n\npark land northeast of Town Lake from Tom Miller Dam to the west boundary of Eilers\nPark and southwest of Town Lake from Tom Miller Dam to the Austin Nature Center.\n\n(6)\n\nTOWN LAKE PARK PLAN means the Town Lake Park Plan adopted by Ordinance No. 890126-P.\n\n(7)\n\nTOWN LAKE PARK means all the dedicated park land in the waterfront overlay zoning\ndistrict.\n\n(8)\n\nURBAN WATERFRONT means that portion of Town Lake Park that is adjacent to high-density\nurban development. Tracts N-12, N-13, and N-14 on the park classification map are\nurban waterfront areas.\n\nSource: Section 13-2-228.1; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDevelopment of a natural area described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nnature trails with interpretive signs and facilities;\n\n(2)\n\nsurface parking with pervious material;\n\n(3)\n\nmaintenance and improvement of environmental quality, including fencing and wildlife\nand vegetation management; and\n\n(4)\n\ngeneral park support and maintenance.\n\n(B)\n\nDevelopment of a neighborhood park described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nwalking, exercise, and bicycle trails;\n\n(2)\n\nsurface parking and access roads;\n\n(3)\n\npicnic facilities;\n\n(4)\n\ngeneral neighborhood park uses, including playing fields, ball courts, swimming pools,\nand playscapes;\n\n(5)\n\nconcessions primarily serving an adjacent neighborhood, including food vending, bicycle\nrentals, and sports equipment rentals;\n\n(6)\n\ncultural facilities primarily serving an adjacent neighborhood;\n\n(7)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(8)\n\ngeneral park support and maintenance.\n\n(C)\n\nDevelopment of a community park described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\ndevelopment permitted in a neighborhood park;\n\n(2)\n\nmunicipal swimming pools and associated facilities;\n\n(3)\n\nconcessions designed to attract individuals from throughout the city, including boat\nrentals, food vending, dining facilities, special sports facilities, and special recreational\nfacilities;\n\n(4)\n\nsurface parking and parking structures;\n\n(5)\n\nperformance and special events facilities;\n\n(6)\n\nspecialized facilities, including facilities that serve the handicapped, private nonprofit\nrecreational facilities that serve the general public, and private park enhancement\nfacilities;\n\n(7)\n\nan internal park road system, with grade-separated intersections if required;\n\n(8)\n\nathletic facilities, including multipurpose sports fields and exercise courses;\n\n(9)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(10)\n\ngeneral park support and maintenance.\n\n(D)\n\nDevelopment of a cultural park described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\ncultural facilities and special event and performance areas;\n\n(2)\n\nparking structures and limited surface parking;\n\n(3)\n\nconcessions that are designed to attract people from throughout the city, that are\nmobile, temporary, or located in a building described in the Town Lake Park Plan,\nand that require a small amount of space, including pushcarts selling food or flowers,\ntemporary vending stands for special events, and museum gift shops;\n\n(4)\n\nwalking, exercise, and bicycle paths;\n\n(5)\n\nan internal park transportation system;\n\n(6)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(7)\n\ngeneral park support and maintenance.\n\n(E)\n\nDevelopment of an urban waterfront described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nplazas for performances and special events;\n\n(2)\n\nwide sidewalks for walking, exercising, and bicycle riding;\n\n(3)\n\nconcessions that are designed to attract people from throughout the city, are mobile,\ntemporary, or located in a building described in the Town Lake Park Plan, and require\na small amount of space, including pushcarts selling food or flowers, temporary vending\nstands for special events, and museum gift shops;\n\n(4)\n\nrowing facilities, boathouses, and similar water-related activities;\n\n(5)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(6)\n\ngeneral park support and maintenance.\n\n(F)\n\nDevelopment of an area of Town Lake Park not included in a natural area, neighborhood\npark, community park, cultural park, or urban waterfront described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nwalking, exercise, and bicycle trails;\n\n(2)\n\npicnic facilities;\n\n(3)\n\nsurface parking of pervious material and park access roads; and\n\n(4)\n\ngeneral park support and maintenance.\n\n(G)\n\nThis section does not apply to a community events use.\n\nSource: Section 13-2-228.1; Ord. 990225-70; Ord. 990902-57; Ord. 031211-11.\n\n(A)\n\nThis section applies to the waterfront overlay (WO) district, except for a community\nevents use.\n\n(B)\n\nA residential use that is permitted in an MF-6 or more restrictive base district is\nalso permitted in an NO or less restrictive base district.\n\n(C)\n\nA pedestrian-oriented use is a use that serves the public by providing goods or services\nand includes:\n\n(1)\n\nart gallery;\n\n(2)\n\nart workshop;\n\n(3)\n\ncocktail lounge;\n\n(4)\n\nconsumer convenience services;\n\n(5)\n\ncultural services;\n\n(6)\n\nday care services (limited, general, or commercial);\n\n(7)\n\nfood sales;\n\n(8)\n\ngeneral retail sales (convenience or general);\n\n(9)\n\npark and recreation services;\n\n(10)\n\nresidential uses;\n\n(11)\n\nrestaurant (limited or general) without drive-in service; and\n\n(12)\n\nother uses as determined by the Land Use Commission.\n\n(D)\n\nPedestrian oriented uses in an MF-1 or less restrictive base district:\n\n(1)\n\nare permitted on the ground floor of a structure; and\n\n(2)\n\nmay be permitted by the Land Use Commission above the ground floor of a structure.\n\n(E)\n\nA determination by the Land Use Commission under Subsection (D)(1) may be appealed\nto the council. For the City Hall subdistrict, a determination by the Land Use Commission\nunder Subsection (C)(11) may be appealed to council.\n\nSource: Section 13-2-228; Ord. 990225-70; Ord. 990715-115; Ord. 990902-57; Ord. 010607-8;\nOrd. 031211-11; Ord. 031211-41; Ord. 040617-Z-1.\n\n(A)\n\nThis subsection applies to the University/Deep Eddy subdistrict.\n\n(1)\n\nThe following uses are prohibited:\n\n(a)\n\nautomotive rentals;\n\n(b)\n\nautomotive repair services;\n\n(c)\n\nautomotive sales;\n\n(d)\n\nautomotive washing;\n\n(e)\n\ncommercial off-street parking; and\n\n(f)\n\na use with a drive-in service.\n\n(2)\n\nThe following are conditional uses:\n\n(a)\n\nhotel-motel;\n\n(b)\n\nservice station;\n\n(c)\n\nlocal utility services.\n\n(B)\n\nIn the North Shore Central subdistrict, not less than 50 percent of the net usable\nfloor area of the ground level of a structure adjacent to Town Lake must be used for\npedestrian-oriented uses. The Land Use Commission may allow an applicant up to five\nyears from the date a certificate of occupancy is issued to comply with this requirement.\n\n(C)\n\nThis subsection applies to the Red Bluff subdistrict.\n\n(1)\n\nThe following uses are prohibited:\n\n(a)\n\nlight manufacturing;\n\n(b)\n\nbasic industry;\n\n(c)\n\nstockyards;\n\n(d)\n\nlaundry services; and\n\n(e)\n\nresource extraction.\n\n(2)\n\nThe following are conditional uses:\n\n(a)\n\nautomotive rentals;\n\n(b)\n\nautomotive repair services;\n\n(c)\n\nautomotive sales;\n\n(d)\n\nautomotive washing;\n\n(e)\n\ncommercial off-street parking;\n\n(f)\n\na use with a drive-in service; and\n\n(g)\n\nwarehousing and distribution.\n\n(D)\n\nThis subsection applies to the East Riverside subdistrict.\n\n(1)\n\nThe following uses are prohibited:\n\n(a)\n\nautomotive rentals;\n\n(b)\n\nautomotive repair services;\n\n(c)\n\nautomotive sales;\n\n(d)\n\nautomotive washing;\n\n(e)\n\nbasic industry;\n\n(f)\n\ncommercial off-street parking;\n\n(g)\n\na use with a drive-in service;\n\n(h)\n\nlaundry services;\n\n(i)\n\nlight manufacturing;\n\n(j)\n\nstockyards; and\n\n(k)\n\nwarehousing and distribution.\n\n(2)\n\nThe following are conditional uses:\n\n(a)\n\nhotel-motel;\n\n(b)\n\nservice station; and\n\n(c)\n\nlocal utility service.\n\n(E)\n\nThis subsection applies to the Travis Heights subdistrict.\n\n(1)\n\nThe following uses are prohibited:\n\n(a)\n\nautomotive rentals;\n\n(b)\n\nautomotive repair services;\n\n(c)\n\nautomotive sales;\n\n(d)\n\nautomotive washing;\n\n(e)\n\nbasic industry;\n\n(f)\n\ncommercial off-street parking;\n\n(g)\n\nlaundry services;\n\n(h)\n\nlight manufacturing;\n\n(i)\n\nstockyards; and\n\n(j)\n\nwarehousing and distribution.\n\n(2)\n\nThe following are conditional uses:\n\n(a)\n\nhotel-motel;\n\n(b)\n\nservice station; and\n\n(c)\n\nlocal utility service.\n\n(F)\n\nIn the South Shore Central subdistrict, not less than 50 percent of the net usable\nfloor area of the ground level of a structure adjacent to Town Lake must be used for\npedestrian-oriented uses. The Land Use Commission may allow an applicant up to five\nyears from the date a certificate of occupancy is issued to comply with this requirement.\n\n(G)\n\nThis subsection applies to the Auditorium Shores subdistrict, except for a community\nevents use.\n\n(1)\n\nNot less than 50 percent of the net usable floor area of the ground level of a structure\nadjacent to Town Lake must be used for pedestrian-oriented uses. The Land Use Commission\nmay allow an applicant up to five years from the date a certificate of occupancy is\nissued to comply with this requirement.\n\n(2)\n\nUse of the area between the primary setback line and the secondary setback line is\nlimited to:\n\n(a)\n\ncultural services;\n\n(b)\n\nday care services;\n\n(c)\n\npark and recreation services;\n\n(d)\n\nfood sales; and\n\n(e)\n\nrestaurant (limited) without drive-in service.\n\n(H)\n\nIn the Butler Shores subdistrict, not less than 50 percent of the net usable floor\narea of the ground level of a structure adjacent to Town Lake must be used for pedestrian-oriented\nuses. The Land Use Commission may allow an applicant up to five years from the date\na certificate of occupancy is issued to comply with this requirement.\n\n(I)\n\nUse of the Zilker Park subdistrict is limited to park-related structures.\n\n(J)\n\nIn the City Hall subdistrict, at least 50 percent of the net usable floor area of\nthe ground level of a structure adjacent to Town Lake must be used for pedestrian-oriented\nuses. The Land Use Commission may allow an applicant up to five years from the date\na certificate of occupancy is issued to comply with this requirement. This requirement\ndoes not apply to a building used by the City for a governmental function.\n\n(K)\n\nCocktail lounge is a conditional use within the Rainey Street subdistrict.\n\nSource: Section 13-2-229; Ord. 990225-70; Ord. 990715-115; Ord. 990902-57; Ord. 010607-8;\nOrd. 031211-11; Ord. 031211-41; Ord. 20130228-076.\n\nDecisions by the accountable official and city boards regarding implementation of\nthis Division shall be guided at all stages by the goals and policies of the Town\nLake Corridor Study, including but not limited to the following:\n\n(A)\n\nEnsure that zoning decisions in the Colorado River corridor achieve the highest degree\nof land use compatibility by:\n\n1.\n\neliminating industrial uses from the confluence of Longhorn Dam;\n\n2.\n\nphasing out resource extraction;\n\n3.\n\nproviding the pubic visual and physical access to the Colorado River.\n\n(B)\n\nProtect, enhance, and interpret natural values and environmentally sensitive areas\nof the Colorado River Corridor through:\n\n1.\n\nappropriate mitigation for new development affecting identified landforms; and\n\n2.\n\nmaintenance of natural shorelines and bluffs along the waterfront, except where otherwise\nrequired by subdistrict regulations or for necessary stabilization.\n\n(C)\n\nRecognize the potential of the waterfront as an open space connector, form-shaper\nof urban development, and focal point for lively pedestrian-oriented mixed uses as\ndefined by the subdistrict goals of the Town Lake Corridor Study.\n\nSource: Ord. 20090611-074.\n\n(A)\n\nThis division applies in the waterfront overlay (WO) combining district.\n\n(B)\n\nThe requirements of this division do not apply to:\n\n(1)\n\na community events use; or\n\n(2)\n\nthe construction or reconstruction of existing or proposed development for which:\n\n(a)\n\na building permit was issued before July 18, 1986;\n\n(b)\n\na certificate of occupancy was issued before July 18, 1986;\n\n(c)\n\na site plan was approved before July 17, 1986, including a phased project or a special\npermit site plan;\n\n(d)\n\na site plan was filed with the City before July 17, 1986 as a condition of zoning,\nand the site plan was previously approved by the council or Town Lake Task Force;\nor\n\n(e)\n\nbuilding plans were filed with the City before July 17, 1986.\n\n(C)\n\nThe requirements of this division supersede the other provisions of this title, to\nthe extent of conflict.\n\nSource: Sections 13-2-700 and 13-2-701; Ord. 990225-70; Ord. 990902-57; Ord. 031211-11.\n\nIn this part:\n\n(1)\n\nBASEWALL means the vertical surface of a building beginning at the finished grade\nup to a level defined by a setback or an architectural treatment, including a cornice\nline or similar projection or demarcation, that visually separates the base of the\nbuilding from the upper portion of the building.\n\n(2)\n\nBOARD means the Small Area Planning Joint Committee of the Planning Commission and\nthe Zoning and Platting Commission.\n\n(3)\n\nPRIMARY SETBACK AREA means the area between a primary setback line and the centerline\nof an identified creek, the shoreline of Town Lake, the shoreline of the Colorado\nRiver, or the boundary of an identified street, as applicable.\n\n(4)\n\nPRIMARY SETBACK LINE means a line that is a prescribed distance from and parallel\nto the centerline of an identified creek, the shoreline of Town Lake, the shoreline\nof the Colorado River, or the boundary of an identified street, as applicable.\n\n(5)\n\nSECONDARY SETBACK AREA means the area between a primary setback line and a secondary\nsetback line.\n\n(6)\n\nSECONDARY SETBACK LINE means a line that is a prescribed distance from and parallel\nto a primary setback line.\n\n(7)\n\nTOWN LAKE CORRIDOR STUDY means the planning document published by the City of Austin\nin 1985 and formally approved by City Council Resolution No. 851031-19.\n\nSource: Section 13-2-1; Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074; Ord. No. 20141211-204, Pt. 25, 7-1-15.\n\n(A)\n\nAn applicant may submit a request for a variance from the following requirements to\nthe Small Area Planning Joint Committee of the Planning Commission and the Zoning\nand Platting Commission for review:\n\n(1)\n\nSection 25-2-692 (Waterfront Overlay (WO) Subdistrict Uses);\n\n(2)\n\nSection 25-2-721 (Waterfront Overlay (WO) Combining District Regulations); or\n\n(3)\n\nSubpart C (Subdistrict Regulations), except that no variance may be granted from restrictions on maximum height.\n\n(B)\n\nThe board may recommend approval of the variance after determining that:\n\n(1)\n\nthe proposed project and variance are consistent with the goals and policies of the\nTown Lake Corridor Study, including environmental protection, aesthetic enhancement,\nand traffic; and\n\n(2)\n\nthe variance is the minimum required by the peculiarities of the tract.\n\n(C)\n\nThe following requirements apply if the board recommends approval of a variance under\nSubsection (B) of this section:\n\n(1)\n\nThe director shall forward the board's recommendation to the Land Use Commission,\nwhich shall consider the recommendation and the variance application at the next regularly\nscheduled meeting for which notice can be timely provided.\n\n(2)\n\nThe Land Use Commission shall grant or deny the variance based on the criteria in\nSubsection (B) of this section.\n\n(3)\n\nAn interested party may appeal the Land Use Commission's grant or denial of a variance\nto the council under the requirements of Chapter 25-1, Article 7, Division 1 (Appeals).\n\n(D)\n\nThe following requirements apply if the Board recommends denial of a variance under\nSubsection (B) of this section:\n\n(1)\n\nThe applicant may appeal the Board's recommendation to the city council under the\nrequirements of Chapter 25-1, Article 7, Division 1 (Appeals). The council shall consider the Board's recommendation and the variance application\nat the next regularly scheduled meeting for which notice can be timely provided.\n\n(2)\n\nThe council shall grant or deny the variance based on the criteria in Subsection (B)\nof this section.\n\nSource: Section 13-2-704; Ord. 990225-70; Ord. 990715-115; Ord. 010607-8; Ord. 031211-11;\nOrd. 20070607-096; Ord. 20090611-074; Ord. No. 20141211-204, Pt. 25, 7-1-15.\n\n(A)\n\nIn the WO combining district, a structure may exceed the maximum floor area permitted\nin the base district as provided by this section.\n\n(1)\n\nAdditional floor area under Subsection (B) is limited to 60 percent of the base district\nmaximum.\n\n(2)\n\nAdditional floor area under Subsection (C), (D), (E), (F), (G), (H), or (I) is limited\nto 20 percent of the base district maximum.\n\n(3)\n\nTotal additional floor area under this section is limited to 60 percent of the base\ndistrict maximum.\n\n(B)\n\nFor a structure in a neighborhood office (NO) or less restrictive base district, floor\narea for a residential use is permitted in addition to the maximum floor area otherwise\npermitted.\n\n(C)\n\nFor a structure in a multifamily residence limited density (MF-1) or less restrictive\nbase district, floor area for pedestrian-oriented uses is permitted in addition to\nthe maximum floor area otherwise permitted, if the pedestrian-oriented uses are on\nthe ground floor of the structure and have unimpeded public access from a public right-of-way\nor park land. The pedestrian-oriented uses required under Sections 25-2-692 (Waterfront Overlay (WO) Subdistrict Uses) and Subpart C (Subdistrict Regulations) are excluded from the additional floor area permitted under this subsection.\n\n(D)\n\nExcept in the North Shore Central subdistrict:\n\n(1)\n\nan additional one-half square foot of gross floor area is permitted for each one square\nfoot of gross floor area of a parking structure that is above grade; and\n\n(2)\n\nan additional one square foot of gross floor area is permitted for each one square\nfoot of a parking structure that is below grade.\n\n(E)\n\nAdditional gross floor area is permitted for each existing Category A tree, as determined\nby the Watershed Protection and Development Review Department's tree evaluation system,\nthat is either left undisturbed or transplanted under the supervision of the city\narborist.\n\n(1)\n\nA tree is considered undisturbed under this subsection if the area within a circle\ncentered on the trunk with a circumference equal to the largest horizontal circumference\nof the tree's crown is undisturbed.\n\n(2)\n\nA tree may be transplanted off-site if the Land Use Commission determines that the\ncharacter of the site is preserved and approves the transplanting.\n\n(3)\n\nThe permitted additional gross floor area is calculated by multiplying the undisturbed\narea described in Subsection (E)(1) by the base district height limitation and dividing\nthe product by 12.\n\n(F)\n\nAdditional gross floor area is permitted for land or an easement dedicated to the\nCity for public access to Town Lake or the Colorado River. The additional gross floor\narea is calculated by multiplying the square footage of the access area by the height\nlimitation applicable to the property and dividing the product by 12.\n\n(G)\n\nAdditional gross floor area is permitted for land that is restricted to create a side\nyard or restricted public access to Town Lake, the Colorado River, or a creek. The\nadditional gross floor area is calculated by multiplying the square footage of the\nrestricted area by the height limitation applicable to the property and dividing the\nproduct by 12.\n\n(H)\n\nAn additional one square foot of gross floor area is permitted for each one square\nfoot of area restricted to create a scenic vista of Town Lake, the Colorado River,\nor a creek.\n\n(I)\n\nFor a proposal to develop less than the maximum allowable impervious cover, an additional\none square foot of gross floor area is permitted for each one square foot of impervious\ncover less than the allowable maximum.\n\nSource: Section 13-2-703; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe Small Area Planning Joint Committee of the Planning Commission and the Zoning\nand Platting Commission shall provide a recommendation to the Land Use Commission\nregarding each of the following approvals required for a proposed development within\nthe Waterfront Overlay combining district:\n\n(1)\n\na site plan under Subsection 25-2-721(A) (Waterfront Overlay (WO) Combining District Regulations) or 25-5-142(1) (Land Use Commission Approval);\n\n(2)\n\na zoning or rezoning application under Section 25-2-282 (Land Use Commission Public Hearing and Recommendation);\n\n(3)\n\na proposed amendment to Title 25 that directly impacts the Waterfront Overlay combining district; and\n\n(4)\n\na proposed amendment to the comprehensive plan that directly impacts the Waterfront\nOverlay combining district.\n\n(B)\n\nThe board shall consider a request for review and recommendation under Subsection\n(A) at the earliest meeting for which notice can be timely provided and shall base\nits recommendation on the goals and policies of the Town Lake Corridor Study.\n\n(C)\n\nCopies of administrative site plans submitted within the Waterfront Overlay shall\nbe provided to the board to assist in maintaining a comprehensive understanding of\nall development activity affecting the waterfront. Review and recommendation under\nSubsection (A) is not required for administrative site plans.\n\n(D)\n\nThe board shall review a request for a variance from regulations applicable to the\nWaterfront Overlay combining district as required under Section 25-2-713 (Variances).\n\nSource: Ord. 20090611-074; Ord. No. 20141211-204, Pt. 25, 7-1-15.\n\n(A)\n\nThis subsection provides requirements for review and approval of site plans.\n\n(1)\n\nApproval of a site plan by the Land Use Commission is required if an applicant requests\na waiver from a requirement of this part under Section 25-2-713 (Variances).\n\n(2)\n\nReview of a site plan by the director of the Parks and Recreation Department is required\nbefore the site plan may be approved. The director of the Parks and Recreation Department\nshall determine:\n\n(a)\n\nwhether the site plan is compatible with adopted park design guidelines; and\n\n(b)\n\nif significant historic, cultural, or archaeological sites are located on the property.\n\n(3)\n\nThe Land Use Commission shall request a recommendation from the Small Area Planning\nJoint Committee of the Planning Commission and the Zoning and Platting Commission\nbefore approving or denying a site plan within the Waterfront Overlay combining district\nand shall consider the recommendation provided by the board. If the board fails to\nmake a recommendation as required under Section 25-2-715 (Review and Recommendation of the Small Area Planning Joint Committee of the Planning\nCommission and the Zoning and Platting Commission), the Land Use Commission may approve or deny the site plan without a recommendation.\n\n(4)\n\nThe Land Use Commission shall request a recommendation from the Environmental Board\nbefore approving or denying a site plan within the Waterfront Overlay combining district\nand shall consider the recommendation provided by the board. If the Environmental\nBoard fails to make a recommendation, the Land Use Commission may approve or deny\nthe site plan without a recommendation.\n\n(B)\n\nIn a primary setback area:\n\n(1)\n\nexcept as otherwise provided in this subsection, parking areas and structures are\nprohibited; and\n\n(2)\n\npark facilities, including picnic tables, observation decks, trails, gazebos, and\npavilions, are permitted if:\n\n(a)\n\nthe park facilities are located on public park land; and\n\n(b)\n\nthe impervious cover does not exceed 15 percent.\n\n(C)\n\nIn a secondary setback area:\n\n(1)\n\nfountains, patios, terraces, outdoor restaurants, and similar uses are permitted;\nand\n\n(2)\n\nimpervious cover may not exceed 30 percent.\n\n(D)\n\nThis subsection provides requirements for parking areas.\n\n(1)\n\nSurface parking:\n\n(a)\n\nmust be placed along roadways, if practicable; and\n\n(b)\n\nmust be screened from views from Town Lake, the Colorado River, park land, and the\ncreeks named in this part.\n\n(2)\n\nA parking structure that is above grade:\n\n(a)\n\nmust be on a pedestrian scale and either architecturally integrated with the associated\nbuilding or screened from views from Town Lake, the Colorado River, park land, and\nthe creeks named in this part; and\n\n(b)\n\nif it is adjacent to Town Lake, the Colorado River, park land, or a creek named in\nthis part, it must incorporate pedestrian oriented uses at ground level.\n\n(3)\n\nSetback requirements do not apply to a parking structure that is completely below\ngrade.\n\n(E)\n\nThis subsection provides design standards for buildings.\n\n(1)\n\nExterior mirrored glass and glare producing glass surface building materials are prohibited.\n\n(2)\n\nExcept in the City Hall subdistrict, a distinctive building top is required for a\nbuilding that exceeds a height of 45 feet. Distinctive building tops include cornices,\nsteeped parapets, hipped roofs, mansard roofs, stepped terraces, and domes. To the\nextent required to comply with the requirements of Chapter 13-1, Article 4 (Heliports and Helicopter Operations), a flat roof is permitted.\n\n(3)\n\nExcept in the City Hall subdistrict, a building basewall is required for a building\nthat fronts on Town Lake, Shoal Creek, or Waller Creek, that adjoins public park land\nor Town Lake, or that is across a street from public park land. The basewall may not\nexceed a height of 45 feet.\n\n(4)\n\nA building façade may not extend horizontally in an unbroken line for more than 160\nfeet.\n\n(F)\n\nUnderground utility service is required, unless otherwise determined by the utility\nprovider.\n\n(G)\n\nTrash receptacles, air conditioning or heating equipment, utility meters, loading\nareas, and external storage must be screened from public view.\n\nSource: Section 13-2-700; Ord. 990225-70; Ord. 990715-115; Ord. 010607-8; Ord. 031211-11;\nOrd. 20090611-074; Ord. No. 20141211-204, Pt. 25, 7-1-15.\n\n(A)\n\nDevelopment of public works in Town Lake Park, including utility construction, flood\ncontrol channels, and bridge improvements, must be consistent with the Town Lake Park\nPlan.\n\n(B)\n\nThe Watershed Protection and Development Review Department shall review an application\nfor development of public works in Town Lake Park and shall work with the Parks and\nRecreation Department to implement applicable recommendations by the Comprehensive\nWatershed Ordinance Task Force that were approved by the council on May 22, 1986.\n\n(C)\n\nThe Environmental Board shall review a project if the director determines that the\nproject offers an opportunity for a major urban water quality retrofit. If Land Use\nCommission review is required, the Environmental Board shall forward its comments\nto the Land Use Commission.\n\nSource: Section 13-2-700.1; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nFor a right-of-way described in Subsection (B), development of the right-of-way, including\nstreet, sidewalk, and drainage construction, must be compatible with the development\nof adjacent park land and consistent with the Town Lake Park Plan. Factors to be considered\nin determining consistency with the Town Lake Park Plan include park land access,\nroad alignment, utility placement, sidewalk design, railing design, sign design and\nplacement, landscaping, and stormwater filtration.\n\n(B)\n\nSubsection (A) applies to:\n\n(1)\n\npublic rights-of-way within or adjoining the boundaries of the WO combining district,\nincluding public rights-of-way for streets designated in the Transportation Plan;\n\n(2)\n\nTrinity Street, from Cesar Chavez Street to Fifth Street; and\n\n(3)\n\nGuadalupe Street and Lavaca Street, from Cesar Chavez Street to Fifth Street.\n\n(C)\n\nFor a street described in Subsection (D), streetscape improvements that are consistent\nwith the Town Lake Park Plan are required. A streetscape improvement is an improvement\nto a public right-of-way, and includes sidewalks, trees, light fixtures, signs, and\nfurniture.\n\n(D)\n\nSubsection (C) applies to:\n\n(1)\n\nBarton Springs Road, from Congress Avenue to MoPac Freeway;\n\n(2)\n\nCesar Chavez Street, from MoPac Freeway to IH-35;\n\n(3)\n\nCongress Avenue, from Riverside Drive to First Street;\n\n(4)\n\nGrove Boulevard, from Pleasant Valley Road to Montopolis Drive;\n\n(5)\n\nGuadalupe Street, from Cesar Chavez Street to Fifth Street;\n\n(6)\n\nLakeshore Boulevard, from Riverside Drive to Montopolis Drive;\n\n(7)\n\nLamar Boulevard, from the Union Pacific railroad overpass to Barton Springs Road;\n\n(8)\n\nLavaca Street, from Cesar Chavez Street to Fifth Street;\n\n(9)\n\nSouth First Street, from Town Lake to Barton Springs Road; and\n\n(10)\n\nTrinity Street, from Cesar Chavez Street to Fifth Street.\n\nSource: Section 13-2-700.2; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in the Auditorium Shores subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback line is located:\n\n(1)\n\n1,200 feet landward from the Town Lake shoreline for all properties located east of\nthe Union Pacific Railroad; and\n\n(2)\n\nfor all property located west of the Union Pacific Railroad with frontage on Riverside\nDrive, the primary setback covers the entire property.\n\n(C)\n\nThe secondary setback line is the northern boundary of public right-of-way of Barton\nSprings Road for all properties located east of the Union Pacific Railroad.\n\n(D)\n\nThis subsection applies to a nonresidential use in a building adjacent to park land\nadjoining Town Lake.\n\n(1)\n\nFor a ground level wall that is visible from park land or a public right-of-way that\nadjoins park land, at least 60 percent of the wall area that is between 2 and 10 feet\nabove grade must be constructed of clear or lightly tinted glass. The glass must allow\npedestrians a view of the interior of the building.\n\n(2)\n\nEntryways or architectural detailing is required to break the continuity of nontransparent\nbasewalls.\n\n(E)\n\nThe maximum gross floor area at ground level is:\n\n(1)\n\nfor a structure in the primary setback area, 2,000 square feet; and\n\n(2)\n\nfor a structure in the secondary setback area, 75,000 square feet.\n\n(F)\n\nThe maximum height is:\n\n(1)\n\nfor structures located in the primary setback, the lower of 25 feet or the maximum\nheight allowed in the base zoning district; and\n\n(2)\n\nfor structures located in the secondary setback, the lower of 60 feet or the maximum\nheight allowed in the base zoning district.\n\nSource: Section 13-2-702(l); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074; Ord.\n20130425-103.\n\n(A)\n\nThis section applies in the Balcones Rock Cliff subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback line is located:\n\n(1)\n\n75 feet landward from Town Lake shoreline; or\n\n(2)\n\n50 feet landward from the Town Lake shoreline, for a single-family lot platted before\nJuly 17, 1986 that is either zoned RR or at least 20,000 square feet in size.\n\n(C)\n\nFor an area not included in a primary setback area or a secondary setback area, the\nmaximum impervious cover is 30 percent.\n\n(D)\n\nFor the exterior of a building visible from park land adjacent to Town Lake, natural\nbuilding materials are required.\n\n(E)\n\nFor the portion of a structure that is visible from the Town Lake shoreline, at least\n75 percent of the structure at grade level must be screened with trees and shrubs\nnative to the Balcones Cliff subdistrict and approved by the city arborist.\n\n(F)\n\nThe maximum height is the lower of 35 feet or the maximum height allowed in the base\nzoning district.\n\nSource: Section 13-2-702(o); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the Butler Shores subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n100 feet landward from the Town Lake shoreline;\n\n(2)\n\n35 feet south of the southern boundary of Toomey Road;\n\n(3)\n\n35 feet south of the southern boundary of Barton Springs Road;\n\n(4)\n\n35 feet north of the northern boundary of Barton Springs Road; and\n\n(5)\n\n100 feet from the Barton Creek centerline.\n\n(C)\n\nThe secondary setback line is located 100 feet from the primary setback line of Town\nLake.\n\n(D)\n\nImpervious cover is prohibited on land with a gradient that exceeds 25 percent.\n\n(E)\n\nThis subsection applies to a nonresidential use in a building adjacent to park land\nadjoining Town Lake.\n\n(1)\n\nFor a ground level wall that is visible from park land or a public right-of-way that\nadjoins park land, at least 60 percent of the wall area that is between 2 and 10 feet\nabove grade must be constructed of clear or lightly tinted glass. The glass must allow\npedestrians a view of the interior of the building.\n\n(2)\n\nEntryways or architectural detailing is required to break the continuity of nontransparent\nbasewalls.\n\n(3)\n\nExcept for transparent glass required by this subsection, natural building materials\nare required for an exterior surface visible from park land adjacent to Town Lake.\n\n(F)\n\nFor a structure on property adjacent to and oriented toward Barton Springs Road, a\nbuilding basewall is required, with a maximum height of:\n\n(1)\n\n45 feet, if north of Barton Springs Road; or\n\n(2)\n\n35 feet, if south of Barton Springs Road.\n\n(G)\n\nThat portion of a structure built above the basewall and oriented towards Barton Springs\nRoad must fit within an envelope delineated by a 70 degree angle starting at a line\nalong the top of the basewall with the base of the angle being a horizontal plane\nextending from the line parallel to and away from the surface of Barton Springs Road.\n\n(H)\n\nThe maximum height is:\n\n(1)\n\nfor structures located north of Barton Springs Road, the lower of 96 feet or the maximum\nheight allowed in the base zoning district; and\n\n(2)\n\nfor structures located south of Barton Springs Road, the lower of 60 feet or the maximum\nheight allowed in the base zoning district.\n\nSource: Section 13-2-702(m); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the East Riverside subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback line is located 100 feet landward from the Town Lake shoreline.\n\n(C)\n\nFor an area not included in a primary setback area or a secondary setback area, the\nmaximum impervious cover is 50 percent.\n\n(D)\n\nThe maximum height is the lower of 96 feet or the maximum height allowed in the base\nzoning district.\n\nSource: Section 13-2-702(i); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the Festival Beach subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback line is located 100 feet landward from the Town Lake shoreline.\n\n(C)\n\nThe secondary setback line is located 50 feet landward from the primary setback line.\n\n(D)\n\nFor an area not included in a primary setback area or a secondary setback area, the\nmaximum impervious cover is:\n\n(1)\n\n40 percent; or\n\n(2)\n\n70 percent, for a site that:\n\n(a)\n\ncontains congregate care and retail uses on 15 or more acres;\n\n(b)\n\nis adjacent to 1.5 or more acres of parkland or publically accessible open space;\n\n(c)\n\nincludes, within the congregate care use, at least:\n\n(i)\n\n310 rental housing units that serve residents earning at or below 60% of area median\nfamily income;\n\n(ii)\n\n40 rental housing units that serve residents earning at or below 30% of area median\nfamily income; and\n\n(iii)\n\n100 rental housing units that serve residents which are either:\n\n• earning at or below 30% of the area median family income and receiving a rent subsidy;\nor\n\n• earning at or below 50% of area median family income, without a rent subsidy, or\nwith a rent subsidy that is required to be available under federal law to residents\nearning up to 50% of area median family income.\n\n(d)\n\ncontains the following enhanced water quality features:\n\n(i)\n\nwater quality treatment utilizing green water quality controls sized at ½-inch or\ngreater, based on assumed impervious cover of 68%;\n\n(ii)\n\nat least 30,000 square feet of porous pavement for pedestrian areas;\n\n(iii)\n\nat least 8,126 cubic feet of rainwater harvesting sufficient to capture 1.3 inches\nof runoff from 75,000 square feet of impervious cover; and\n\n(iv)\n\nonsite water quality ponds sufficient to treat a minimum of 6,200 cubic feet of off-site\ndrainage.\n\n(E)\n\nFor purposes of Subsection (D)(2) of this section, the term \"rent subsidy\" means a\nproject-based voucher issued by, or under the auspices of, an agency of the United\nStates Government that provides a rental subsidy to the landlord for a particular\nrental housing unit in an amount equal to or exceeding the difference between 30%\nof the resident's income and the market rate for the residential housing unit.\n\n(F)\n\nIf an applicant elects to develop a site at greater than 40% impervious cover, as\nauthorized under Subsection (D)(2) of this section, a restrictive covenant or other\nlegal instrument approved by the director must be executed prior to site plan release\nin order to ensure that the conditions in Subsection (D)(2)(a)—(d) are binding on\nthe site plan and enforceable by the City.\n\n(G)\n\nThe maximum height is the lower of 60 feet or the maximum height allowed in the base\nzoning district.\n\nSource: Section 13-2-702(e); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074; Ord. No. 20160623-101, Pt. 1, 7-4-16.\n\n(A)\n\nThis section applies in the Lamar subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n100 feet landward from the Town Lake shoreline; and\n\n(2)\n\n90 feet from the Johnson Creek centerline.\n\n(C)\n\nThe secondary setback line is located 100 feet landward from the primary setback line\nthat is parallel to the Town Lake shoreline.\n\n(D)\n\nFor a structure located within 140 feet of the Johnson Creek centerline, the maximum\nheight is the lower of 35 feet or the maximum height allowed in the base zoning district.\nFor all other structures, the maximum height is the lower of 60 feet or the maximum\nheight allowed in the base zoning district.\n\n(E)\n\nSurface parking is prohibited, except for a parking area for buses, van pooling, the\nhandicapped, or public access to park land.\n\n(F)\n\nA garage access point or curb cut is prohibited if the pattern or alignment of the\nsurrounding, existing sidewalks would be disrupted.\n\nSource: Section 13-2-702(b); Ord. 990225-70; Ord. 000309-39; Ord. 031211-11; Ord.\n20090611-074.\n\n(A)\n\nThis section applies in the Montopolis/Riverside Terrace subdistrict of the WO combining\ndistrict.\n\n(B)\n\nThe primary setback line is located 150 feet landward from the 430 foot contour line\nalong the Colorado River.\n\n(C)\n\nThe secondary setback line is located 100 feet landward from the primary setback line.\n\n(D)\n\nThe maximum height in the secondary setback is the lower of 60 feet or the maximum\nheight allowed in the base zoning district.\n\nSource: Section 13-2-702(g); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis subsection applies in the North Shore Central subdistrict of the WO combining\ndistrict.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n100 feet landward from the Town Lake shoreline;\n\n(2)\n\n60 feet from the Shoal Creek centerline; and\n\n(3)\n\n50 feet from the Waller Creek centerline.\n\n(C)\n\nSurface parking is prohibited, except for a parking area for buses, van pooling, taxis,\ndelivery services, commercial loading, public transportation, the handicapped, or\npublic access to park land.\n\n(D)\n\nThe location of a garage access point or curb cut must minimize the disruption of\npedestrian traffic on existing sidewalks.\n\n(E)\n\nA structure must fit within an envelope delineated by a 70 degree angle starting at\na line 45 feet above the property boundary line nearest Town Lake, Shoal Creek, or\nWaller Creek, with the base of the angle being a horizontal plane extending from the\nline parallel to and away from the surface of Town Lake, Shoal Creek, or Waller Creek.\n\n(F)\n\nThis subsection applies to a nonresidential use in a building adjacent to Town Lake.\n\n(1)\n\nFor a ground level wall that is visible from park land or a public right-of-way that\nadjoins park land, at least 60 percent of the wall area that is between 2 and 10 feet\nabove grade must be constructed of clear or lightly tinted glass. The glass must allow\npedestrians a view of the interior of the building.\n\n(2)\n\nEntry ways or architectural detailing is required to break the continuity of nontransparent\nbasewalls.\n\n(3)\n\nExcept for transparent glass required by this subsection, natural building materials\nare required for an exterior surface visible from park land adjacent to Town Lake.\n\n(G)\n\nA building may not be constructed within 80 feet of the existing east curb line of\nCongress Avenue south of First Street.\n\nSource: Section 13-2-702(c); Ord. 990225-70; Ord. 000309-39; Ord. 031211-11.\n\n(A)\n\nThis section applies in the Rainey Street subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n150 feet landward from the Town Lake shoreline; and\n\n(2)\n\n50 feet from the Waller Creek centerline.\n\n(C)\n\nThis subsection applies to property in the Rainey Street Subdistrict zoned central\nbusiness district (CBD) after April 17, 2005.\n\n(1)\n\nFor a building located on Red River Street from Cesar Chavez Street to Driskill Street\nor River Street from I-35 to River Street's western terminus, the development must\nhave sidewalks not less than ten feet wide along the street frontage.\n\n(2)\n\nA use with a drive-in service is prohibited.\n\n(3)\n\nExcept as provided in Subsection (C)(4) below, for a residential or mixed-use building\nthe maximum building height is forty (40) feet.\n\n(4)\n\nAn applicant may exceed the forty foot height limit and achieve a floor-to-area ratio\nof 8:1 if at least five percent of the square footage of dwelling units developed\nwithin that floor-to-area ratio of 8:1 is available to house persons whose household\nincome is eighty percent or below the median family income in the Austin statistical\nmetropolitan area, as determined by the director of the Neighborhood Housing and Community\nDevelopment Office.\n\n(a)\n\nIn meeting the five percent requirement, mixed-use projects shall provide on-site\naffordable housing in proportion to the amount of floor area in the project that is\ndevoted to residential uses.\n\n(b)\n\nThe affordability period for housing units shall be forty years for rental housing\nand ninety-nine years for on-site for sale housing. The affordability period begins\non the date a certificate of occupancy is issued.\n\n(c)\n\nOn-site affordable housing units offered for sale shall be reserved, sold, and transferred\nto an income eligible buyer subject to a resale restricted, shared equity agreement\napproved by the director of Neighborhood Housing and Community Development.\n\n(d)\n\nAn applicant may not deny a prospective tenant affordable rental housing based solely\non the prospective tenant's participation in the Housing Choice Voucher Program or\nin any other housing voucher program that provides rental assistance.\n\n(e)\n\nThe bedroom count mix for the affordable units must be proportional to the overall\nbedroom count mix within an overall development.\n\n(f)\n\nA unit is affordable for purchase or rental if, in addition to the other requirements\nof this section, the household is required to spend no more than 30 percent of its\ngross monthly income on mortgage or rental payments for the unit.\n\n(5)\n\nDevelopment in the Rainey Street Subdistrict may participate in the Downtown Density\nBonus Program as provided below.\n\n(a)\n\nIn order to achieve bonus area exceeding the floor-to-area ratio of 8:1 in the Rainey\nStreet Subdistrict, development must comply with the requirements of Section 25-2-586 (Downtown Density Bonus Program) of the City Code. The requirements of the Downtown Density Bonus Program apply only\nto that portion of development that exceeds a floor-to-area ratio of 8:1.\n\n(b)\n\nThe maximum height and maximum floor-to-area ratio that development in the Rainey\nStreet Subdistrict may achieve by participating in the Downtown Density Bonus Program\nare shown on Figure 2 of Section 25-2-586 (Downtown Density Bonus Program) of the City Code.\n\n(c)\n\nThe Neighborhood Housing and Community Development Office will conduct compliance\nand monitoring of the affordability requirements of this ordinance. The director of\nNeighborhood Housing and Community Development shall establish compliance and monitoring\nrules and criteria for implementing the affordability requirements of this ordinance.\n\nSource: Section 13-2-702(d); Ord. 990225-70; Ord. 031211-11; Ord. 20050407-063; Ord.\n20130523-106; Ord. 20140227-054, Pt. 2, 3-10-14.\n\n(A)\n\nThis section applies in the Red Bluff subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n40 feet from the 450 foot contour line, from Pleasant Valley road to the extension\nof Shady Lane; and\n\n(2)\n\n40 feet from the 440 foot contour line from the extension of Shady Lane to US 183.\n\n(C)\n\nA secondary setback line is located 110 feet from the corresponding primary setback\nline.\n\n(D)\n\nFor the exterior of a building adjacent to Town Lake, natural building materials are\nrequired on the exterior surface.\n\n(E)\n\nThe maximum height within the secondary setback is the lower of 35 feet or the maximum\nheight allowed in the base zoning district.\n\nSource: Section 13-2-702(f); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the South Lakeshore subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n65 feet landward from the Town Lake shoreline; and\n\n(2)\n\n50 feet south of Lakeshore Boulevard.\n\n(C)\n\nThe maximum height is the lower of 60 feet or the maximum height allowed in the base\nzoning district.\n\nSource: Section 13-2-702(h); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the South Shore Central subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n150 feet landward from the Town Lake shoreline;\n\n(2)\n\n80 feet from the East Bouldin Creek centerline; and\n\n(3)\n\n35 feet north of the northern public right-of-way boundary of Riverside Drive.\n\n(C)\n\nThe secondary setback lines are located:\n\n(1)\n\n50 feet landward from the primary setback line parallel to the Town Lake shoreline;\nand\n\n(2)\n\n130 feet from the primary setback line parallel to the East Bouldin Creek centerline.\n\n(D)\n\nThis subsection applies to a nonresidential use in a building adjacent to park land\nadjoining Town Lake.\n\n(1)\n\nFor a ground level wall that is visible from park land or a public right-of-way that\nadjoins park land, at least 60 percent of the wall area that is between 2 and 10 feet\nabove grade must be constructed of clear or lightly tinted glass. The glass must allow\npedestrians a view of the interior of the building.\n\n(2)\n\nEntryways or architectural detailing is required to break the continuity of nontransparent\nbasewalls.\n\n(3)\n\nExcept for transparent glass required by this subsection, natural building materials\nare required for an exterior surface visible from park land adjacent to Town Lake.\n\n(E)\n\nFor a structure property adjacent to and oriented toward Riverside Drive, a building\nbasewall is required, with a maximum height of:\n\n(1)\n\n45 feet, if north of Riverside Drive; or\n\n(2)\n\n35 feet, if south of Riverside Drive.\n\n(F)\n\nThat portion of a structure built above the basewall and oriented toward Riverside\nDrive must fit within an envelope delineated by a 70 degree angle starting at a line\nalong the top of the basewall with the base of the angle being a horizontal plane\nextending from the line parallel to and away from the surface of Riverside Drive.\n\n(G)\n\nThe maximum height is:\n\n(1)\n\nfor structures located between the primary and secondary setback lines, the lower\nof 35 feet or the maximum height allowed in the base zoning district;\n\n(2)\n\nfor structures located south of Riverside Drive between South Congress Avenue and\nEast Bouldin Creek, the lower of 45 feet or the maximum height allowed in the base\nzoning district;\n\n(3)\n\nfor structures located within 100 feet of the right-of-way of South Congress Avenue\nor South First Street, the lower of 60 feet or the maximum height allowed in the base\nzoning district; and\n\n(4)\n\nfor structures located in all other areas of the subdistrict, the lower of 96 feet\nor the maximum height allowed in the base zoning district.\n\nSource: Section 13-2-702(k); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the Travis Heights subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n100 feet landward from the Town Lake shoreline;\n\n(2)\n\n80 feet from the East Bouldin Creek centerline; and\n\n(3)\n\n80 feet from the Blunn Creek centerline.\n\n(C)\n\nSection 25-2-714 (Additional Floor Area) applies only to structures located between Bouldin and Blunn Creeks.\n\n(D)\n\nFor an area not included in a primary setback area or a secondary setback area, the\nmaximum impervious cover is 50 percent.\n\n(E)\n\nThe maximum height is:\n\n(1)\n\nfor structures located between the shoreline of Lady Bird Lake and Riverside Drive,\nthe lower of 45 feet or the maximum height allowed in the base zoning district; and\n\n(2)\n\nfor structures located elsewhere in the subdistrict, the lower of 60 feet or the maximum\nheight allowed in the base zoning district.\n\nSource: Section 13-2-702(j); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the University/Deep Eddy subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n200 feet landward from the Town Lake shoreline, between Tom Miller Dam and Red Bud\nTrail; and\n\n(2)\n\n300 feet landward from the Town Lake shoreline, between Red Bud Trail and MoPac Boulevard.\n\n(C)\n\nThe secondary setback lines are located:\n\n(1)\n\n50 feet landward from the primary setback line, between Tom Miller Dam and Red Bud\nTrail; and\n\n(2)\n\n100 feet landward from the primary setback line, between Red Bud Trail and MoPac Boulevard.\n\n(D)\n\nFor a primary setback area, a secondary setback area, or an area within 50 feet of\na secondary setback line:\n\n(1)\n\nthe maximum building height is 35 feet; and\n\n(2)\n\nthe floor to area ratio may not be increased under Section 25-2-714 (Additional Floor Area).\n\n(E)\n\nFor an area not included in a primary setback area or a secondary setback area, the\nmaximum impervious cover is 40 percent.\n\n(F)\n\nThe maximum height is the lower of 60 feet or the maximum height allowed in the base\nzoning district.\n\nSource: Section 13-2-702(a); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the Zilker Park subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback line is located 100 feet landward from the Town Lake shoreline.\n\n(C)\n\nThe secondary setback line is located 700 feet landward from the primary setback line.\n\n(D)\n\nFor an area not included in a primary setback area or a secondary setback area, the\nmaximum impervious cover is 40 percent.\n\n(E)\n\n(Reserved)\n\n(F)\n\nThe maximum height is the lower of 45 feet or the maximum height allowed in the base\nzoning district.\n\nSource: Section 13-2-702(n); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the City Hall subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback line is located 100 feet landward from the Town Lake shoreline.\n\n(C)\n\nA surface parking area located at or above grade is prohibited, except for a parking\narea for buses, van pooling, taxis, delivery services, commercial loading, public\ntransportation, the handicapped, or public access to park land.\n\n(D)\n\nThe location of a garage access point or curb cut must minimize the disruption of\npedestrian traffic on existing sidewalks.\n\n(E)\n\nA structure:\n\n(1)\n\nmust fit within an envelope delineated by a 70 degree angle starting at a line 45\nfeet above the property boundary line nearest Town Lake, with the base of the angle\nbeing a horizontal plane extending from the line parallel to and away from the surface\nof Town Lake; or\n\n(2)\n\nmay not exceed a height of 100 feet.\n\n(F)\n\nThis subsection applies to a nonresidential use in a building adjacent to Town Lake.\n\n(1)\n\nFor a ground level wall that is visible from park land or a public right-of-way that\nadjoins park land, at least 60 percent of the wall area that is between 2 and 10 feet\nabove grade must be constructed of clear or lightly tinted glass. The glass must allow\npedestrians a view of the interior of the building.\n\n(2)\n\nEntry ways or architectural detailing is required to break the continuity of nontransparent\nbasewalls.\n\n(3)\n\nExcept for transparent glass required by this subsection, natural building materials\nare required for an exterior surface visible from park land adjacent to Town Lake.\n\nSource: Ord. 990715-115; Ord. 031211-11.\n\nThis division applies to property in the university neighborhood overlay (UNO) district\nif the property owner files a site plan and an election for the property to be governed\nby this division.\n\nSource: Ord. 040902-58.\n\nFor property governed by this division, this division supersedes the other provisions\nof this title to the extent of conflict.\n\nSource: Ord. 040902-58.\n\n(A)\n\nIn this division:\n\n(1)\n\nOCCUPANT SPACE means space in a building used for a use other than a parking facility\nor a mechanical facility.\n\n(2)\n\nSTREET WALL AREA means the portion of an exterior wall of a building adjacent to a\npublic street other than an alley and accessible from a pedestrian path that extends\nfrom the base of street level:\n\n(a)\n\nto a maximum height of 65 feet; or\n\n(b)\n\nfor an accessory parking structure, to a maximum height of two stories.\n\n(B)\n\nIn this division, a local use is a use that serves the public by providing goods or\nservices in a manner readily accessible by pedestrians or the occupants of the structure\nin which the uses are located. Local uses include:\n\n(1)\n\nadministrative and business offices;\n\n(2)\n\nart and craft studio;\n\n(3)\n\nart gallery;\n\n(4)\n\nart workshop;\n\n(5)\n\nbusiness and trade school;\n\n(6)\n\nconsumer convenience services;\n\n(7)\n\nconsumer repair services;\n\n(8)\n\ncounseling services;\n\n(9)\n\ncustom manufacturing;\n\n(10)\n\nday care services (commercial, general, or limited);\n\n(11)\n\nfinancial services;\n\n(12)\n\nfood preparation, in conjunction with food sales, general restaurant or limited restaurant\naccessory use;\n\n(13)\n\nfood sales;\n\n(14)\n\ngeneral retail sales (convenience or general);\n\n(15)\n\nguidance services;\n\n(16)\n\nindoor sports and recreation;\n\n(17)\n\nmedical offices (under 5,000 square feet);\n\n(18)\n\npersonal improvement services;\n\n(19)\n\npersonal services;\n\n(20)\n\npet services;\n\n(21)\n\nprinting and publishing services;\n\n(22)\n\nprofessional office;\n\n(23)\n\nreligious assembly;\n\n(24)\n\nrestaurant (general or limited);\n\n(25)\n\ntheater; and\n\n(26)\n\na conditional use in the base zoning district that is approved by the land use commission.\n\n(C)\n\nA local use may not include a drive-through facility.\n\nSource: Ord. 040902-58; Ord. 20050519-Z001; Ord. 20080925-039.\n\n(A)\n\nIn a nonresidential zoning base district, residential uses are permitted.\n\n(B)\n\nIn any base zoning district, a hotel-motel use, a multifamily use, or a group residential\nuse is permitted.\n\n(C)\n\nThis subsection applies to a multifamily residential use.\n\n(1)\n\nEach building must achieve at least a one star rating under the Austin Green Building\nprogram.\n\n(2)\n\nAll ground floor dwelling units must be:\n\n(a)\n\nadaptable for use by a person with a disability; and\n\n(b)\n\naccessible by a person with a disability from the on-site parking and common facility,\nif any.\n\n(3)\n\nAt least 10 percent of the dwelling units must be accessible for a person with a mobility\nimpairment.\n\n(4)\n\nAt least two percent of the dwelling units must be accessible for a person with a\nhearing or visual disability.\n\n(5)\n\nEach multistory building must be served by an elevator, unless:\n\n(a)\n\nat least 25 percent of the site's dwelling units are located on the ground floor;\nor\n\n(b)\n\nfor a site with fewer than 20 dwelling units, at least five percent of the site's\ndwelling units are located on the ground floor.\n\n(6)\n\nA parking space must be leased separately from a dwelling unit.\n\n(D)\n\nLocal uses are permitted in any base district, subject to the limitations of this\nsubsection.\n\n(1)\n\nIn the outer west campus subdistrict, local uses are not permitted in a residential\nbase district unless the property:\n\n(a)\n\nhas a permitted building height of 50 feet or greater; or\n\n(b)\n\nis zoned historic and has a permitted building height of 65 feet or greater.\n\n(2)\n\nExcept as provided in Paragraph (3), up to 20 percent of the gross floor area of a\nsite may be used for local uses. At least one-half of the gross floor area of the\nlocal uses must be located at street level and accessible from a pedestrian path.\nIn determining these percentages, a nonresidential use that is accessory to the principal\nresidential use or located in a historic landmark is excluded from the gross floor\narea of the local uses.\n\n(3)\n\nUp to 100 percent of the gross floor area of a structure may be used for local uses\nif the structure:\n\n(a)\n\nis a historic landmark and is located entirely in a subdistrict having a permitted\nbuilding height of 65 feet or greater;\n\n(b)\n\nwas constructed before September 13, 2004, contains less than 10,000 square feet of\ngross floor area, is less than 65 feet in height, and is located in the inner west\ncampus or Guadalupe subdistricts; or\n\n(c)\n\nis less than 65 feet in height and located on:\n\n(i)\n\nGuadalupe Street between Martin Luther King, Jr. Blvd. and 29th Street;\n\n(ii)\n\nMartin Luther King, Jr. Blvd. between Guadalupe Street and Rio Grande Street; or\n\n(iii)\n\n24th Street between Guadalupe Street and Rio Grande Street.\n\n(E)\n\nThis subsection applies to commercial off-street parking.\n\n(1)\n\nCommercial off-street parking on a surface lot is prohibited.\n\n(2)\n\nCommercial off-street parking in a structure is:\n\n(a)\n\npermitted in any base zoning district in the Guadalupe, Dobie, or inner west campus\nsubdistrict; and\n\n(b)\n\nprohibited in the outer west campus subdistrict.\n\n(3)\n\nThe street level portion of a commercial off-street parking structure that is accessible\nfrom a pedestrian path must contain local uses for a depth of at least 18 feet. This\nrequirement does not apply to a portion of the structure used for an entrance or exit.\n\n(F)\n\nA cocktail lounge is a conditional use if it is accessory to a hotel-motel use with\nat least 50 rooms.\n\n(G)\n\nOn-site surface parking is prohibited, unless the director determines that:\n\n(1)\n\nthe only building on the site has 6,000 or fewer square feet of gross floor area,\nand the building was constructed before September 13, 2004; and\n\n(2)\n\nthe parking area is screened from the street by an six foot tall solid wall.\n\n(H)\n\nThis subsection prescribes requirements for the ground floor of a building, including\na parking garage.\n\n(1)\n\nThe ground floor must include occupant space along not less than 75 percent of the\nnet length of street frontage. Net length of street frontage is calculated by determining\nthe cumulative length of the building at ground level adjacent to each street other\nthan an alley, and then deducting the cumulative length of driveways, exit stairs,\nelevators, and utility equipment space.\n\n(2)\n\nFor a site with frontage on more than one street, driveways, exit stairs and elevators\nmust be located on a street that runs north and south, unless the director of the\nNeighborhood Planning and Zoning Department determines that those features cannot\nreasonably be located along that street because of topographical conditions.\n\n(3)\n\nThe ground floor of a building may not be more than five feet higher or lower than\nan adjacent public street sidewalk. This does not apply to the ground floor adjacent\nto an alley.\n\n(4)\n\nThe minimum distance between the finished ground floor of the building and the structural\nportion of the ceiling is 10 feet.\n\n(5)\n\nThe minimum depth of occupant space is 18 feet, measured from the outside face of\nthe front exterior wall to the outside face of the rear interior wall.\n\n(I)\n\nOff-site temporary construction staging is allowed within 500 feet of the construction\nsite. The director may allow a staging area to be located more than 500 feet from\nthe construction site if the director determines that a closer staging area is not\nreasonably available and that the location does not adversely affect public health\nor safety.\n\n(J)\n\nA hotel/motel use is treated as a local use under this division if it meets the following\nrequirements:\n\n(1)\n\nThe hotel-motel use must be located on property that:\n\n(a)\n\nhas frontage on Martin Luther King, Jr. Blvd. and is located between Pearl Street\nand Guadalupe Street; or\n\n(b)\n\nhas frontage on Guadalupe Street and is located between 22nd Street and Martin Luther\nKing, Jr. Blvd.\n\n(2)\n\nThe maximum height must be no greater than 85 feet, unless a greater height is allowed\nunder Appendix C (University Neighborhood Overlay District Boundaries, Subdistrict Boundaries, and Height\nLimits) of this chapter.\n\n(3)\n\nIf a new hotel-motel use includes, shares, or incorporates adjacent existing property,\nthen both the new hotel-motel use and the adjacent property must be:\n\n(a)\n\nincluded in a single site plan; and\n\n(b)\n\ncompliant with the streetscape requirements in Section 25-2-760 (Streetscape Improvements).\n\n(4)\n\nThe hotel-motel use must comply with the affordability requirements for multi-family\nhousing under Section 25-2-765 (Affordable Housing), with each square foot of net rentable floor area counted towards the fee provided\nfor under Subsection (B) of that section.\n\n(K)\n\nA hotel/motel use may associated condominium residential, multifamily residential,\nretirement housing (small site), or retirement housing (large site) uses.\n\n(L)\n\nExisting structures constructed under the provisions of this division may convert\nnon-accessible parking spaces to:\n\n(1)\n\na multi-family residential use;\n\n(2)\n\na group residential use;\n\n(3)\n\nlocal uses located above or adjacent to the street wall area;\n\n(4)\n\nan art gallery use and an art workshop use are limited to 1,500 square feet of floor\narea; and\n\n(5)\n\nan indoor crop production use or convenience storage use not located in or above a\nstreet wall area.\n\nSource: Ord. 040902-58; Ord. 20050519-Z001; Ord. 20080925-039; Ord. 20121108-090; Ord. No. 20191114-067, Pts. 1, 2, 11-25-19.\n\nThe minimum lot area is 2,500 square feet.\n\nSource: Ord. 040902-58.\n\n(A)\n\nExcept as provided in Subsection (B), maximum heights for structures are prescribed\nby Appendix C (University Neighborhood Overlay District Boundaries, Subdistrict Boundaries, Height\nLimits, and Additional Height and Affordability).\n\n(B)\n\nThis subsection applies in the outer west campus subdistrict, Guadalupe subdistrict,\nand inner west campus subdistrict.\n\n(1)\n\nExcept as provided in Paragraph (2), a structure with a multi-family residential use\nor group residential use may exceed by 25 feet in the outer west campus subdistrict\nor the Guadalupe subdistrict the maximum height prescribed by Appendix C (University Neighborhood Overlay District Boundaries, Subdistrict Boundaries, Height\nLimits, and Additional Height and Affordability) if the structure is located in an area with a maximum height of at least 50 feet;\nor\n\n(2)\n\nA structure with a multi-family residential use or group residential use may exceed\nby 125 feet in the inner west campus subdistrict the maximum height prescribed by\nAppendix C (University Neighborhood Overlay District Boundaries, Subdistrict Boundaries, Height\nLimits, and Additional Height and Affordability) if the multi-family residential use or group residential use, for a period of not\nless than 40 years from the date a certificate of occupancy is issued, sets aside\nat least:\n\n(a)\n\n10 percent of the dwelling units or bedrooms on the site to house persons whose household\nincome is at or below 60 percent of the median income in the Austin statistical metropolitan\narea, as determined by the director of the Neighborhood Housing and Community Development\nOffice;\n\n(b)\n\n10 percent of the dwelling units or bedrooms on the site to house persons whose household\nincome is at or below 50 percent of the median income in the Austin statistical metropolitan\narea, as determined by the director of the Neighborhood Housing and Community Development\nOffice; and\n\n(c)\n\nThe applicant:\n\n1.\n\nPays into the University Neighborhood District Housing Trust Fund a fee of $0.50 for\neach square foot of net rentable floor area in the multi-family residential use or\ngroup residential use development; or,\n\n2.\n\nProvides an additional 10 percent of the dwelling units or bedrooms on the site to\nhouse persons whose household income is at or below 50 percent of the median income\nin the Austin statistical metropolitan area as determined by the director of the Neighborhood\nHousing and Community Development Office.\n\n(3)\n\nA building on a lot in the outer west campus subdistrict that has a common side lot\nline with a historic property may not exceed by more than 20 feet the maximum building\nheight of the base district in which the historic property is located.\n\n(4)\n\nThe fee in Subsection (b)(2)(c) above will be adjusted annually in accordance with\nthe Consumer Price Index all Urban Consumers, US City Average, All Items (1982-84=100),\nas published by the Bureau of Labor Statistics of the United States Department of\nLabor or in accordance with any other similar, applicable standard as defined by the\ndirector of the Neighborhood Housing and Community Development Office. The city manager\nshall annually determine the new fee amounts for each fiscal year, beginning October\n1, 2014 and report the new fee amounts to the city council.\n\nSource: Ord. 040902-58; Ord. 20080925-039; Ord. 20140213-056, Pt. 1, 2-25-14; Ord. No. 20191114-067, Pt. 3, 11-25-19.\n\n(A)\n\nThere are no minimum front yard or street side yard setbacks, except the minimum setbacks\nare 10 feet along Martin Luther King, Jr. Blvd. between Rio Grande Street and San\nGabriel Street.\n\n(B)\n\nThe maximum front yard setback and the maximum street side yard setback are 10 feet,\nexcept:\n\n(1)\n\nthe maximum setbacks are 15 feet along 24th Street or along Martin Luther King, Jr.\nBlvd. between Rio Grande Street and San Gabriel Street;\n\n(2)\n\nthe maximum setbacks are 45 feet for a public plaza or private common open space;\n\n(3)\n\nthere are no maximum setbacks for a pedestrian entry court or an outdoor café;\n\n(4)\n\nthe director of the Watershed Protection and Development Review Department may modify\na maximum setback if the director determines that the modification is required to\nprotect a historic structure or a tree designated as significant by the city arborist;\nand\n\n(5)\n\nas otherwise provided in Subsection (E).\n\n(C)\n\nThere is no minimum or maximum interior side yard setback.\n\n(D)\n\nThere is no minimum or maximum rear yard setback.\n\n(E)\n\nA building must be at least 12 feet from the front face of the curb of the adjacent\nstreet and at least 30 feet from the centerline of the adjacent street.\n\n(F)\n\nThis subsection applies to the portion of a site that is subject to compatibility\nstandards, as described in Section 25-2-763(A)(1) (Certain Regulations Inapplicable or Superseded) and Article 10 (Compatibility Standards). A building or a solid masonry wall that is at least six feet high is required between\na public or common open space and the property that triggers the compatibility standards.\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nAn exterior building wall that faces a street must be at least 24 feet high.\n\n(B)\n\nExcept as provided in Subsection (C):\n\n(1)\n\nif an exterior wall of a building is adjacent to a street other than an alley, at\na height of 65 feet, the upper portion of the wall must be set back from the property\nline by a distance of at least 12 feet; and\n\n(C)\n\nA parapet may not extend more than five feet above the 65 foot stepback height described\nin Subsection (B) or more than five feet above the total building height.\n\n(D)\n\nInstead of complying with Subsections (A) and (B), a hotel/motel use in the outer\nwest campus subdistrict must comply with the requirements of this subsection.\n\n(1)\n\nOn property fronting Martin Luther King, Jr. Blvd., all buildings must fit with in\nan envelope delineated by a 45 degree angle starting at a height of 60 feet above\nthe grade of the property line adjacent to Martin Luther King, Jr. Blvd. and extending\nto a maximum height of 85 feet.\n\n(2)\n\nIf the property abuts a historic property as defined in Section 25-2- 756(B)(3), the property must have open space measuring at least 50 feet deep for\nat least 50 feet along the street frontage beginning at the common boundary with the\nhistoric property. The open space shall contain no buildings, but may contain paving,\nparking, fountains, fences, patios, terraces, canopies, trellises, and landscaping.\n\n(3)\n\nIf parking is provided on the site, 75 percent of the spaces must be below grade.\n\nSource: Ord. 040902-58; Ord. 20080925-039; Ord. No. 20191114-067, Pt. 4, 11-25-19.\n\n(A)\n\nAt least 42 percent of the street wall area of a building must contain occupant space.\n\n(B)\n\nIf a building has street wall areas on more than one street, at least 70 percent of\nthe required occupant space must be on a street that runs east and west.\n\n(C)\n\nThis section does not apply to a commercial off-street parking structure.\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nA site owner shall install a sidewalk not less than 12 feet wide along each street\nfrontage adjacent to the site.\n\n(B)\n\nSidewalks must be level with the top of the curb of the adjacent street, except to\nthe minimum degree necessary to provide for drainage.\n\n(C)\n\nA site owner shall plant and maintain trees along an adjacent street right-of-way.\n\n(1)\n\nTrees must be spaced to create a nearly contiguous canopy when the trees reach maturity.\n\n(2)\n\nA tree must be in scale with the adjacent building.\n\n(3)\n\nA tree planted in a sidewalk area must have a tree grating.\n\n(D)\n\nA site owner shall provide pedestrian-scale lighting and street furnishings along\nan adjacent street right-of-way.\n\n(E)\n\nThe director of the Neighborhood Planning and Zoning Department shall adopt rules\nprescribing the requirements for tree planting and maintenance and the provision of\npedestrian-scale lighting and street furnishings.\n\n(F)\n\nThe director of the Watershed Protection and Development Review Department may require\nfiscal security to ensure compliance with this section.\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nUtility equipment, mechanical equipment, and large trash receptacles:\n\n(1)\n\nare prohibited in the area between a building and a street; and\n\n(2)\n\nmust not be visible from a street.\n\n(B)\n\nThis subsection applies to a site with frontage on an alley 20 feet or more wide.\n\n(1)\n\nA transformer room or utility vault must be adjacent to and accessible from the alley.\n\n(2)\n\nA pump room, sprinkler room, or other utility or mechanical room must be adjacent\nto and accessible from the alley unless the Fire Chief determines that placing the\nroom in another location is required because of a fire safety issue.\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nVehicular access to a site from a public street that runs east and west is limited\nto one curb cut for each 140 feet of street frontage.\n\n(B)\n\nVehicular access to a site from a public street that runs north and south is limited\nto two curb cuts.\n\n(C)\n\nVehicular access to a corner lot must be from a public street or alley that runs north\nand south.\n\n(D)\n\nA site with access to an alley must use the alley or a parking structure for service\nand delivery access.\n\n(E)\n\nA site that does not have access to an alley must provide a service and delivery area\nthat is at least 30 feet deep, measured from the front setback line or side setback\nline, as applicable.\n\n(F)\n\nA driveway turn radius may not exceed 15 feet unless the Fire Chief determines that\na larger radius is required because of a fire safety issue.\n\n(G)\n\nThe director of the Watershed Protection and Development Review Department may waive\nor modify a requirement of this section if the director determines that the waiver\nor modification is necessary for adequate traffic circulation or public safety.\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nThe following provisions of this subchapter do not apply:\n\n(1)\n\nmaximum floor-to-area ratios;\n\n(2)\n\nmaximum building coverage percentages;\n\n(3)\n\nArticle 9 (Landscaping); and\n\n(4)\n\nArticle 10 (Compatibility Standards), if the property is at least 75 feet from the boundary of the university neighborhood\noverlay district.\n\n(B)\n\nImpervious cover limitations of this subchapter are superseded by this subsection.\nMaximum impervious cover is:\n\n(1)\n\n100 percent in the inner west campus and Guadalupe subdistricts;\n\n(2)\n\nthe greater of 90 percent or the percentage permitted in the base zoning district\nin the outer west campus subdistrict; and\n\n(3)\n\nthe greater of 85 percent or the percentage permitted in the base zoning district\nin the Dobie subdistrict.\n\n(C)\n\nFor a multi-family residential use, minimum site area and open space requirements\nof this subchapter do not apply.\n\n(D)\n\nSpecial regulations governing signs in university neighborhood overlay district are\nin Section 25-10-133 (University Neighborhood Overlay Zoning District Signs).\n\nSource: Ord. 040902-58; Ord. 20070726-132.\n\n(A)\n\nA site plan must comply with the design guidelines prescribed by administrative rule.\nAn applicant shall file with the site plan drawings of all building elevations and\nstreetscapes that demonstrates substantial compliance with the design guidelines.\n\n(B)\n\nThe director of the Neighborhood Planning and Zoning Department shall determine whether\na site plan substantially complies with the design guidelines.\n\n(C)\n\nThe director of the Neighborhood Planning and Zoning Department may waive a provision\nof the design guidelines if the director determines that the provision is unreasonable\nor impractical as applied to the site plan and that, with the waiver, the site plan\nwill still substantially comply with the design guidelines. A waiver under this subsection\nmust be the minimum departure from the provision necessary to avoid an unreasonable\nor impractical result.\n\n(D)\n\nAn interested party may appeal to the land use commission:\n\n(1)\n\na determination by the director of the Neighborhood Planning and Zoning Department\nthat a site plan substantially complies with the design guidelines; or\n\n(2)\n\na decision by the director of the Neighborhood Planning and Zoning Department granting\nor denying a waiver under Subsection (C).\n\nSource: Ord. 040902-58; Ord. 20080925-039.\n\n(A)\n\nA multi-family residential use or a group residential use established after February\n24, 2014 must, for a period of not less than 40 years from the date a certificate\nof occupancy is issued, set aside at least:\n\n(1)\n\n10 percent of the dwelling units or bedrooms on the site to house persons whose household\nincome is at or below 60 percent of the median income in the Austin statistical metropolitan\narea, as determined by the director of the Neighborhood Housing and Community Development\nOffice; and\n\n(2)\n\nexcept as provided in Subsection (B), an additional 10 percent of the dwelling units\nor bedrooms on the site to house persons whose household income is at or below 50\npercent of the median income in the Austin statistical metropolitan area, as determined\nby the director of the Neighborhood Housing and Community Development Office.\n\n(B)\n\nThe University Neighborhood District Housing Trust Fund is established. Instead of\ncomplying with Paragraph (A)(2), a person may pay into the fund a fee of $1.00 for\neach square foot of net rentable floor area in the multi-family residential use or\ngroup residential use development and the fee will be adjusted annually in accordance\nwith the Consumer Price Index all Urban Consumers, US City Average, All Items (1982-84=100),\nas published by the Bureau of Labor Statistics of the United States Department of\nLabor or in accordance with any other similar, applicable standard as defined by the\ndirector of the Neighborhood Housing and Community Development Office. The city manager\nshall annually determine the new fee amounts for each fiscal year, beginning October\n1, 2014 and report the new fee amounts to the city council.\n\n(C)\n\nThe director of the Neighborhood Housing and Community Development Office may allocate\nmoney from the University Neighborhood District Housing Trust Fund for housing development\nin the university neighborhood overlay district that provides at least 30 percent\nof its dwelling units or bedrooms to persons whose household income is at or below\n50 percent of the median income in the statistical metropolitan area, as determined\nby the director of the Neighborhood Housing and Community Development Office, for\na period of not less than 40 years from the date a certificate of occupancy is issued.\n\nProjects qualifying for the University Neighborhood Overlay Affordable Trust Funds\nshall receive a 100 percent fee waiver as set forth in the S.M.A.R.T. Housing Policy.\n\n(D)\n\nRents will be established annually by the director of Neighborhood Housing and Community\nDevelopment Office as follows:\n\n(1)\n\nRents for single occupancy rental units for households who are at or below 60 percent\nof the median family income may not exceed the Low HOME Rent Limit for one bedroom\nas established annually by the Texas Department of Housing and Community Affairs.\n\n(2)\n\nRents for single occupancy rental units for households who are at or below 50 percent\nmedian family income households may not exceed the 40 percent Median Family Income\nHOME Rent Limit for an efficiency as established annually by the Texas Department\nof Housing and Community Affairs.\n\n(3)\n\nFor existing UNO developments that opt in to leasing by the bedroom for the remainder\nof their commitment:\n\n(a)\n\nrents for single occupancy rental units for households who are at or below 60 percent\nof the median family income may not exceed the high HOME rent limit for a one bedroom\nas established annually by the Texas Department of Housing and Community Affairs;\nand\n\n(b)\n\nrents for single occupancy rental units for households who are at or below 50 percent\nof the median family income may not exceed the 40 percent MFI HOME rent limit for\nan efficiency as established annually by the Texas Department of Housing and Community\nAffairs.\n\n(c)\n\nThe director may adopt administrative rules necessary to enforce these provisions.\n\n(E)\n\nFor a hotel/motel use that has an associated condominium residential use, multifamily\nresidential use, group residential use, retirement housing (small site) use, or retirement\nhousing (large site) use, instead of complying with Subsection (A) a person may pay\ninto the University Neighborhood Housing Trust Fund a fee of $2.00 for each square\nfoot of the combined net square footage of the residential units and the hotel/motel\nunits, if:\n\n(1)\n\nthe number of residential units associated with a hotel/motel use does not exceed\n40% of the number of hotel/motel units; and\n\n(2)\n\nthe net square footage of the residential units does not exceed 45% of the net square\nfootage of hotel/motel units.\n\nSource: Ord. 040902-58; Ord. 20080925-039; Ord. 20140213-056, Pt. 2, 2-25-14.\n\n(A)\n\nThis division supersedes other requirements of Title 25 (Land Development) to the extent of conflict.\n\n(B)\n\nThis division does not apply to property governed by a development plan approved by\na special board of review, as prescribed by Natural Resources Code Sections 31.161\nthrough 31.167.\n\nSource: Ord. 20050519-008.\n\n(A)\n\nA transit oriented development (TOD) district is classified according to its location,\nas described below.\n\n(B)\n\nA neighborhood center TOD district is located at the commercial center of a neighborhood.\nThe average density is approximately 15 to 25 dwelling units for each acre. Typical\nbuilding height is one to six stories. Uses include small lot single-family residential\nuse, single-family residential use with an accessory dwelling unit, townhouse residential\nuse, low-rise condominium residential use and multifamily residential use, neighborhood\nretail and office uses, and mixed-use buildings.\n\n(C)\n\nA town center TOD district is located at a major commercial, employment, or civic\ncenter. The average density is approximately 25 to 50 dwelling units for each acre.\nTypical building height is two to eight stories. Uses include townhouse residential\nuse, low- and mid-rise condominium residential use and multifamily residential use,\nretail and office uses, and mixed-use buildings.\n\n(D)\n\nA regional center TOD district is located at the juncture of regional transportation\nlines or at a major commuter or employment center. The average density is more than\n50 dwelling units for each acre. Typical building height is three to ten stories.\nUses include mid-rise condominium residential use and multifamily residential use,\nmajor retail and office uses, and mixed-use buildings.\n\n(E)\n\nA downtown TOD district is located in a highly urbanized area. The average density\nis more than 75 dwelling units for each acre. Typical building height is six stories\nor more. Uses include mid- and high-rise condominium residential use and multifamily\nresidential use, large retail and office uses, and mixed use buildings.\n\nSource: Ord. 20050519-008.\n\n(A)\n\nA transit oriented development (TOD) district may be divided into zones of varying\ndevelopment intensity, as described in this section.\n\n(B)\n\nA gateway zone is the area immediately surrounding the station platform, where passengers\nenter or exit transit vehicles. Typically, this area includes land that is about 300\nto 500 feet from the edge of the station platform. This zone has a high level of transit\nintegration, including streetscapes that connect the station platform with the surrounding\nbuildings, and buildings that are oriented toward the station platform and provide\nground floor pedestrian-oriented uses and employment or residential uses in the upper\nfloors. A gateway zone has the highest density and building height in a TOD district.\n\n(C)\n\nA midway zone is the area between a gateway zone and a transition zone, beginning\nat the outer boundary of the gateway zone and ending approximately 1,000 to 1,500\nfeet from the edge of the station platform. This zone is predominately residential,\nbut it may also contain retail and office uses. The zone includes a variety of building\ntypes. A midway zone has density and building height that are lower than a gateway\nzone but higher than a transition zone.\n\n(D)\n\nA transition zone is the area at the periphery of the TOD district. Development intensity\nis compatible with the existing or anticipated future development adjacent to the\nTOD district. A transition zone has the lowest density and building height in a TOD\ndistrict.\n\nSource: Ord. 20050519-008.\n\n(A)\n\nTransit oriented development (TOD) districts are established and classified as follows:\n\n(1)\n\nThe Convention Center TOD district is established as a downtown TOD district.\n\n(2)\n\nThe Plaza Saltillo TOD district is established as a neighborhood center TOD district.\n\n(3)\n\nThe Martin Luther King, Jr. Blvd. TOD district is established as a neighborhood center\nTOD district.\n\n(4)\n\nThe Lamar Blvd./Justin Lane TOD district is established as a neighborhood center TOD\ndistrict.\n\n(5)\n\nThe Northwest Park and Ride TOD district is established as a town center TOD district.\n\n(6)\n\nThe North IH-35 Park and Ride TOD district is established as a town center TOD district.\n\n(7)\n\nThe Oak Hill TOD district is established as a town center TOD district.\n\n(8)\n\nThe Highland Mall TOD district is established as a town center TOD district.\n\n(9)\n\nThe South IH-35 Park and Ride TOD district is established as a town center TOD district.\n\n(B)\n\nThe initial boundaries and zones of each TOD district are described in Appendix D\n(Transit Oriented District Boundaries And Zones). The final boundaries and zones of a TOD district are established by the ordinance\nadopting the station area plan, as provided in Section 25-2-766.22 (Adoption Of Station Area Plan). The official maps of the districts are on file with the director, who shall resolve\nuncertainty regarding the boundary of a district.\n\n(C)\n\nCouncil may establish additional TOD districts by amending Subsection (A) and Appendix\nD (Transit Oriented District Boundaries And Zones).\n\nSource: Ord. 20050519-008; Ord. 20060309-057; Ord. 20061005-052; Ord. 20071108-120.\n\n(A)\n\nUntil council approves a station area plan in accordance with Subpart C (Station Area Plan):\n\n(1)\n\na transit oriented development (TOD) district functions as an overlay district; and\n\n(2)\n\nproperty within the TOD district:\n\n(a)\n\nis subject to Subpart B (Initial District Regulations); and\n\n(b)\n\nretains its base district zoning.\n\n(B)\n\nThe approval by council of a station area plan in accordance with Subpart C (Station Area Plan) is a rezoning of the property as a TOD base district. After the rezoning, Subpart\nB (Initial District Regulations) does not apply.\n\nSource: Ord. 20050519-008.\n\nThis subpart applies in a transit oriented development (TOD) district until council\nadopts a station area plan.\n\nSource: Ord. 20050519-008.\n\n(A)\n\nIn a TOD district, the following uses are prohibited:\n\n(1)\n\nautomotive sales;\n\n(2)\n\nautomotive washing;\n\n(3)\n\nbasic industry;\n\n(4)\n\nconvenience storage;\n\n(5)\n\nequipment repair services;\n\n(6)\n\nequipment sales;\n\n(7)\n\nrecycling center;\n\n(8)\n\nscrap and salvage services; and\n\n(9)\n\nvehicle storage.\n\n(B)\n\nIn a gateway zone, the following uses are prohibited:\n\n(1)\n\nsingle-family residential;\n\n(2)\n\nsingle-family attached residential;\n\n(3)\n\nsmall lot single-family residential;\n\n(4)\n\nduplex residential;\n\n(5)\n\ntwo-family residential;\n\n(6)\n\nsecondary apartment;\n\n(7)\n\nurban home; and\n\n(8)\n\ncottage.\n\n(C)\n\nIn a midway zone, the following uses are prohibited:\n\n(1)\n\nsingle-family residential;\n\n(2)\n\nsingle-family attached residential;\n\n(3)\n\nduplex residential; and\n\n(4)\n\ntwo-family residential.\n\n(D)\n\nA use with a drive-in service is prohibited.\n\n(E)\n\nA transportation terminal use is a permitted use if:\n\n(1)\n\nit is operated by a governmental entity; and\n\n(2)\n\nthe director determines that the transportation terminal:\n\n(a)\n\nuses urban design to enhance the community identity of the station area and to make\nit an attractive, safe, convenient, and interesting place;\n\n(b)\n\ncreates convenient connections to and within the station area to promote pedestrian\nand bicycling activity;\n\n(c)\n\nenhances the existing transportation network to promote access to transit and other\ndestinations within the station area;\n\n(d)\n\nmanages the amount and location of parking so that it does not dominate the station\narea or create an unattractive environment or unsafe situation; and\n\n(e)\n\nmakes the station area a unique place.\n\n(F)\n\nAn automotive repair services use, automotive rentals use, or commercial off-street\nparking use that would otherwise be a permitted use is a conditional use.\n\n(G)\n\nA residential use is permitted above the first floor of a commercial building.\n\nSource: Ord. 20050519-008; Ord. 20071108-120.\n\n(A)\n\nThis section applies to:\n\n(1)\n\na new building; or\n\n(2)\n\nan addition to a building, if the addition:\n\n(a)\n\nexceeds 5,000 square feet of gross floor area; or\n\n(b)\n\nincreases the gross floor area on the site by more than 50 percent.\n\n(B)\n\nThe maximum front yard and street side yard setbacks are 15 feet, except the director\nof the Neighborhood Planning and Zoning Department may modify a maximum setback if\nthe director determines that:\n\n(1)\n\nthe modification is required to protect a historic structure or a tree designated\nas significant by the city arborist; or\n\n(2)\n\nthe modification allows an alternative development design that is compatible with\nand supportive of public transit and a pedestrian-oriented environment and that complies\nwith the TOD district principles and best practices established by administrative\nrule.\n\n(C)\n\nThe minimum front yard and street side yard setbacks are the lesser of:\n\n(1)\n\n10 feet; or\n\n(2)\n\nthe setbacks prescribed by Section 25-2-492 (Site Development Regulations).\n\n(D)\n\nThis subsection applies in a gateway zone.\n\n(1)\n\nBuilding entrances are required:\n\n(a)\n\non the principal street; and\n\n(b)\n\non a street with transit service, if any.\n\n(2)\n\nThis paragraph applies to a building that is constructed along a front yard or street\nside yard setback line.\n\n(a)\n\nFor a depth of at least 20 feet, the minimum distance between the finished ground\nfloor of the building and the structural portion of the ceiling is 15 feet.\n\n(b)\n\nThis requirement does not apply if the building is subject to Article 10 (Compatibility Standards) or if the director of the Neighborhood Planning and Zoning Department determines\nthat the requirement is impractical because of site constraints.\n\n(c)\n\nThe director of the Neighborhood Planning and Zoning Department may modify this requirement\nif the director determines that the modification allows an alternative development\ndesign that is compatible with and supportive of public transit and a pedestrian-oriented\nenvironment and that complies with the TOD district principles and best practices\nestablished by administrative rule.\n\n(3)\n\nThis paragraph applies to a commercial or mixed-use building.\n\n(a)\n\nFor a ground level wall that faces a public street, at least 50 percent of the wall\narea that is between two and ten feet above grade must be constructed of glass with\na visible transmittance rating of 0.6 or higher.\n\n(b)\n\nThe director of the Neighborhood Planning and Zoning Department may modify this requirement\nif the director determines that the modification allows an alternative development\ndesign that is compatible with and supportive of public transit and a pedestrian-oriented\nenvironment and that complies with the TOD district principles and best practices\nestablished by administrative rule.\n\nSource: Ord. 20050519-008; Ord. 20061005-052; Ord. 20061116-015; Ord. 20061214-080.\n\n(A)\n\nFor a building with a front yard setback of 15 feet or less, parking is prohibited\nin the area between the front lot line and the building. The director of the Neighborhood\nPlanning and Zoning Department may modify this requirement if the director determines\nthat:\n\n(1)\n\nthe modification is required to protect a historic structure or a tree designated\nas significant by the city arborist; or\n\n(2)\n\nthe modification allows an alternative development design that is compatible with\nand supportive of public transit and a pedestrian-oriented environment and that complies\nwith the TOD district principles and best practices established by administrative\nrule.\n\n(B)\n\nFor a rear parking lot on a site larger than three acres, the parking lot must be\ndesigned to permit future driveway and sidewalk connections with adjacent non-residential\nproperty. The director may waive this requirement if the director determines:\n\n(1)\n\nthe connections are impractical because of site constraints;\n\n(2)\n\nthe connections are inappropriate because of traffic safety issues; or\n\n(3)\n\nthe site's land use is incompatible with the land use of the adjacent property.\n\nSource: Ord. 20050519-008; Ord. 20061005-052; Ord. 20061116-015; Ord. 20061214-080;\nOrd. No. 20231102-028, Pt. 10, 11-13-23.\n\n(A)\n\nThe director shall prepare a station area plan for each transit oriented development\n(TOD) district. Capital Metropolitan Transportation Authority, Austin San Antonio\nInter-municipal Commuter Rail District, the neighborhood plan contact team, if any,\nneighborhood organizations, business-owners and property owners, and other affected\npersons may participate in the preparation of a station area plan.\n\n(B)\n\nThe director may recommend that council modify the initial boundaries of a TOD district\nand may prepare a station area plan with the proposed boundary modification. In that\nevent, the director must allow the persons affected by the proposed boundary modification\nto participate in the preparation of the plan.\n\n(C)\n\nA station area plan must be included in an adopted neighborhood plan, if any. An amendment\nto an adopted neighborhood plan to include a station area plan must be reviewed and\napproved in accordance with the neighborhood plan amendment process established by\ncouncil, except that the director may propose and the council may enact an amendment\nto an adopted neighborhood plan to include a station area plan at any time.\n\n(D)\n\nThis subsection applies in the Plaza Saltillo TOD district. A station area plan may\nnot include a gateway zone or create a midway zone outside the approximately 11 acres\nincluded in the Saltillo District Redevelopment Master Plan.\n\nSource: Ord. 20050519-008; Ord. 20071108-120.\n\n(A)\n\nCouncil by zoning ordinance may adopt a station area plan for a transit oriented development\n(TOD) district.\n\n(B)\n\nThe council may modify the initial boundaries of a TOD district in the ordinance adopting\nthe station area plan.\n\n(C)\n\nA station area plan:\n\n(1)\n\nestablishes the permitted and conditional uses;\n\n(2)\n\nprescribes site development regulations, including maximum and minimum development\nparameters;\n\n(3)\n\nprescribes requirements for street, streetscape, and other public area improvements;\n\n(4)\n\nmay modify or waive an identified requirement of this title;\n\n(5)\n\nmay establish standards for administrative modification of the station area plan;\n\n(6)\n\nmay change the location of or omit a gateway, midway, or transition zone depicted\non Appendix D (Transit Oriented District Boundaries and Zones);\n\n(7)\n\noutside a community preservation and revitalization zone, shall include a housing\naffordability analysis and feasibility review that describes potential strategies\nfor achieving a goal of:\n\n(a)\n\nat least 25 percent of new housing in each TOD to serve households at the following\nincome levels: home ownership opportunities for households at or below 80 percent\nof median family income and rental housing opportunities for households at or below\n60 percent of median family income;\n\n(b)\n\nfor home ownership residential units, a goal of providing 10 percent of the units\nto households with an income of not more than 70 to 80 percent of median family income,\n10 percent of the units to households with an income of not more than 60 to 70 percent\nof median family income, and five percent of the units to households with an income\nof not more than 60 percent of median family income; or\n\n(c)\n\nfor rental residential units, a goal of providing 10 percent of the units to households\nwith an income of not more than 40 to 60 percent of median family income, 10 percent\nof the units to households with an income of not more than 30 to 40 percent of median\nfamily income, and five percent of the units to households with an income of not more\nthan 30 percent of median family income;\n\n(8)\n\nin a community preservation and revitalization zone established by council, shall\ninclude a housing affordability analysis and feasibility review that describes potential\nstrategies for achieving an affordable housing goal of providing at least 25 percent\nof new housing to households at the following income levels:\n\n(a)\n\nhome ownership residential units to households with an income of not more than 60\npercent of median family income for the Austin area; and\n\n(b)\n\nfor rental residential units, a goal of providing 10 percent of the units to households\nwith an income of not more than 40 to 50 percent of median family income, 10 percent\nof the units to households with an income of not more than 30 to 40 percent of median\nfamily income, and five percent of the units to households with an income of not more\nthan 30 percent of median family income;\n\n(9)\n\nshall include an analysis of the need for public parking; and\n\n(10)\n\nmay include consideration of public and civic art in or near transit stations.\n\nSource: Ord. 20050519-008; Ord. 20071108-120; Ord. 20090212-070.\n\n(A)\n\nCouncil may, by zoning ordinance, amend a station area plan at any time.\n\n(B)\n\nAmendments to a station area plan may be proposed by land owners at any time.\n\n(C)\n\nFor a station area plan that is within an adopted neighborhood plan area, an amendment\nto the station area plan must be reviewed and approved in accordance with the neighborhood\nplan amendment process established by council.\n\n(D)\n\nThe director may not accept an application to amend a station area plan until one\nyear after adoption of the plan. After that date, the director may accept an application\nto amend the plan relating to an individual property at any time.\n\nSource: Ord. 20050519-008; Ord. No. 20231214-078, Pt. 1, 12-25-23.\n\nThis division applies in the North Burnet/Gateway (NBG) district.\n\nSource: Ord. 20071101-052; Ord. 20090312-035.\n\n(A)\n\nCouncil by ordinance shall adopt and may at any time amend a regulating plan for the\nNBG district that:\n\n(1)\n\nestablishes the permitted and conditional uses;\n\n(2)\n\nprescribes site development regulations, including maximum and minimum development\nparameters;\n\n(3)\n\nprescribes requirements for street, streetscape, and other public area improvements;\nand\n\n(4)\n\nestablishes other appropriate regulations or modifies or waives a requirement of this\ntitle.\n\n(B)\n\nFor property governed by this division, this division and a regulating plan adopted\nunder this section supersedes the other provisions of this title to the extent of\nconflict.\n\n(C)\n\nThe site development standards in Section 4.2 (General Development Standards) of the Regulating Plan are the only parts of the regulating plan that are requirements\nof Chapter 25-2 (Zoning) of the City Code for purposes of Section 25-2-472 (Board of Adjustment Variance Authority) of the City Code.\n\n(D)\n\nExcept for amendments to Figure 1-2 (NBG Zoning District Subdistrict Map), amendments\nto the regulating plan are subject to the procedures prescribed by Section 25-1-502 (Amendment; Review) for amendments to Title 25 and not the procedures prescribed by Chapter 25-2, Subpart B (Zoning Procedures).\n\n(E)\n\nAmendments to Figure 1-2 (NBG Zoning District Subdistrict Map) of the regulating plan\nare subject to the procedures prescribed by Chapter 25-2, Subchapter B (Zoning Procedures). Approved amendments to Figure 1-2 will also be reflected as necessary in Figure\n4-3 (Maximum Floor-to Area-Ratio (FAR) with Development Bonus) and Figure 4-5 (Maximum\nHeight with Development Bonus) of the regulating plan.\n\nSource: Ord. 20071101-052; Ord. 20090312-035; Ord. 20130425-102.\n\nThis division applies in the East Riverside Corridor (ERC) district.\n\nSource: Ord. 20130509-039.\n\n(A)\n\nCouncil by ordinance shall adopt and may at any time amend a regulating plan for the\nERC district that:\n\n(1)\n\nestablishes the permitted and conditional uses;\n\n(2)\n\nprescribes site development regulations, including maximum and minimum development\nparameters;\n\n(3)\n\nprescribes requirements for street, streetscape, and other public area improvements;\nand\n\n(4)\n\nestablishes other appropriate regulations or modifies or waives a requirement of this\ntitle.\n\n(B)\n\nFor property governed by this division, this division and a regulating plan adopted\nunder this section supersedes the other provisions of this title to the extent of\nconflict.\n\n(C)\n\nThe site development standards in Article 4.2 (General Development Standards) of the Regulating Plan are the only parts of the regulating plan that are requirements\nof Chapter 25-2 (Zoning) of the City Code for purposes of Section 25-2-472 (Board of Adjustment Variance Authority) of the City Code.\n\n(D)\n\nExcept for amendments to Figure 1-2 (East Riverside Corridor Subdistrict Map), amendments\nto the regulating plan are subject to the procedures prescribed by Section 25-1-502 (Amendment: Review) for amendments to Title 25 and not the procedures prescribed by Chapter 25-2, Subpart B (Zoning Procedures).\n\n(E)\n\nAmendments to Figure 1-2 (East Riverside Corridor Subdistrict Map) of the regulating\nplan are subject to the procedures prescribed by Chapter 25-2, Subpart B (Zoning Procedures). Approved amendments to Figure 1-2 will also be reflected as necessary in Figure\n1-7 (East Riverside Corridor Height Map) and Figure 1-8 (East Riverside Corridor Development\nBonus Height Map) of the regulating plan.\n\n(F)\n\nThe following process is applicable to amendments to Figure 1-1 (East Riverside Corridor\nZoning Map), Figure 1-2 (East Riverside Corridor Subdistrict Map), Figure 1-6 (East\nRiverside Corridor Hub Map), Figure 1-7 (East Riverside Corridor Height Map), or Figure\n1-8 (East Riverside Corridor Development Bonus Height Map) regarding an individual\nproperty.\n\n(1)\n\nThe director shall provide notice of the filing of an application for amendment under\nSection 25-1-133 (Notice of Applications and Administrative Decisions).\n\n(2)\n\nThe director shall conduct a community meeting on a proposed amendment prior to the\ndate upon which the Planning Commission is scheduled to consider the amendment. The\ndirector shall give notice of the meeting under Section 25-1-132(A) (Notice of Public Hearing).\n\n(3)\n\nBefore the date on which the Planning Commission is scheduled to consider a proposed\namendment, the Neighborhood Plan Contact Team may submit a letter to the director\nstating its recommendation on the proposed amendment. The director shall provide a\nletter to the Planning Commission and to council prior to action on the proposed amendment.\n\n(4)\n\nBefore the date on which the Planning Commission is scheduled to consider a proposed\namendment, the Neighborhood Plan Contact Team may submit a letter to the director\nstating its recommendation on the proposed amendment. The director shall provide a\nletter to the Planning Commission and to council prior to action on the proposed amendment.\n\n(5)\n\nFor a hearing before council, the director shall give notice under Section 25-1-132(B) (Notice of Public Hearing).\n\n(6)\n\nThe applicant is responsible for the cost of the notice.\n\nSource: Ord. 20130509-039; Ord. No. 20151015-086, Pt. 1, 10-26-15.\n\nFootnotes:\n\n--- (**1**) ---\n\n**Editor's note—**\nOrd. No. 20240229-070, Pt. 1, effective March 11, 2024, repealed §§ 25-2-769.01—25-2-769.06,\nwhich pertained to Corridor Overlay and derived from Ord. No. 20221201-056, Pt. 3, 12-12-22; Ord. No. 20230608-088, Pts. 1, 2, 6-19-23.\n",
  "start_line": 15452,
  "end_line": 23792,
  "subsections": []
}