{
  "id": "25-2-586",
  "title": "DOWNTOWN DENSITY BONUS PROGRAM",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "\n(A)\n\nThis section applies in the Rainey Street subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n150 feet landward from the Town Lake shoreline; and\n\n(2)\n\n50 feet from the Waller Creek centerline.\n\n(C)\n\nThis subsection applies to property in the Rainey Street Subdistrict zoned central\nbusiness district (CBD) after April 17, 2005.\n\n(1)\n\nFor a building located on Red River Street from Cesar Chavez Street to Driskill Street\nor River Street from I-35 to River Street's western terminus, the development must\nhave sidewalks not less than ten feet wide along the street frontage.\n\n(2)\n\nA use with a drive-in service is prohibited.\n\n(3)\n\nExcept as provided in Subsection (C)(4) below, for a residential or mixed-use building\nthe maximum building height is forty (40) feet.\n\n(4)\n\nAn applicant may exceed the forty foot height limit and achieve a floor-to-area ratio\nof 8:1 if at least five percent of the square footage of dwelling units developed\nwithin that floor-to-area ratio of 8:1 is available to house persons whose household\nincome is eighty percent or below the median family income in the Austin statistical\nmetropolitan area, as determined by the director of the Neighborhood Housing and Community\nDevelopment Office.\n\n(a)\n\nIn meeting the five percent requirement, mixed-use projects shall provide on-site\naffordable housing in proportion to the amount of floor area in the project that is\ndevoted to residential uses.\n\n(b)\n\nThe affordability period for housing units shall be forty years for rental housing\nand ninety-nine years for on-site for sale housing. The affordability period begins\non the date a certificate of occupancy is issued.\n\n(c)\n\nOn-site affordable housing units offered for sale shall be reserved, sold, and transferred\nto an income eligible buyer subject to a resale restricted, shared equity agreement\napproved by the director of Neighborhood Housing and Community Development.\n\n(d)\n\nAn applicant may not deny a prospective tenant affordable rental housing based solely\non the prospective tenant's participation in the Housing Choice Voucher Program or\nin any other housing voucher program that provides rental assistance.\n\n(e)\n\nThe bedroom count mix for the affordable units must be proportional to the overall\nbedroom count mix within an overall development.\n\n(f)\n\nA unit is affordable for purchase or rental if, in addition to the other requirements\nof this section, the household is required to spend no more than 30 percent of its\ngross monthly income on mortgage or rental payments for the unit.\n\n(5)\n\nDevelopment in the Rainey Street Subdistrict may participate in the Downtown Density\nBonus Program as provided below.\n\n(a)\n\nIn order to achieve bonus area exceeding the floor-to-area ratio of 8:1 in the Rainey\nStreet Subdistrict, development must comply with the requirements of Section 25-2-586 (Downtown Density Bonus Program) of the City Code. The requirements of the Downtown Density Bonus Program apply only\nto that portion of development that exceeds a floor-to-area ratio of 8:1.\n\n(b)\n\nThe maximum height and maximum floor-to-area ratio that development in the Rainey\nStreet Subdistrict may achieve by participating in the Downtown Density Bonus Program\nare shown on Figure 2 of Section 25-2-586 (Downtown Density Bonus Program) of the City Code.\n\n(c)\n\nThe Neighborhood Housing and Community Development Office will conduct compliance\nand monitoring of the affordability requirements of this ordinance. The director of\nNeighborhood Housing and Community Development shall establish compliance and monitoring\nrules and criteria for implementing the affordability requirements of this ordinance.\n\nSource: Section 13-2-702(d); Ord. 990225-70; Ord. 031211-11; Ord. 20050407-063; Ord.",
  "start_line": 21626,
  "end_line": 21731,
  "subsections": []
}