{
  "id": "25-2-7",
  "title": "AGRICULTURAL USES DESCRIBED",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Agricultural education activities as referenced in Chapter 25-2-7 (Agricultural Uses Described) do not require a temporary use permit.\n\nSource: Ord. 000406-86; Ord. 031211-11; Ord. 20110210-018; Ord. 20131121-105, Pt. 3, 3-21-14.\n\n(A)\n\nThis section applies to a market garden use.\n\n(B)\n\nA market garden is allowed within the critical water quality zone if it meets the\nrequirements in 25-8-261 (Critical Water Quality Zone Development) for sustainable urban agriculture or a community garden.\n\n(C)\n\nA site area for a market garden shall not be more than one acre.\n\n(D)\n\nA dwelling unit must be located on the site.\n\n(E)\n\nThe number of dwellings units on a site may not exceed the number of dwelling units\nallowed under the base zoning district regulations. A market garden is a permitted\nuse in all base zoning districts.\n\n(F)\n\nRaising of fowl, rabbits, and aquatic foods using aquaponic systems is permitted in\naccordance with Chapter 3-2 (Restrictions on Animals) of the City Code. On-site slaughtering, processing or composting of animals is not\npermitted.\n\n(G)\n\nThe use of synthetic inputs is prohibited. An Integrated Pest Management Plan, developed\nin accordance with the Environmental Criteria Manual and approved by the director,\nmust be followed.\n\n(H)\n\nWater conservation practices must be followed, at minimum in accordance with Chapter\n6-4 (Water Conservation) of the City Code.\n\n(I)\n\nAgricultural products produced on-site may be sold from the site or distributed off-site\nto buyers. On-site farm stands are not permitted. Sales must be conducted out of sight\nof the general public on the property. No more than three customer-related trips per\nday are permitted.\n\n(J)\n\nEmployees are permitted. The maximum number of full-time employees is one. This does\nnot include the property owner.\n\n(K)\n\nThe residential character of the lot and dwelling must be maintained.\n\n(L)\n\nFor a market garden use, a sign is permitted in accordance with Chapter 25-10-155 (Urban Farm Sign).\n\n(M)\n\nAgricultural education activities do not require a temporary use permit.\n\nSource: Ord. 20131121-105, Pt. 4, 3-21-14.\n\n(A)\n\nThis section applies to the following uses and zoning districts, where the principal\nuse of the property is a brewery:\n\n(1)\n\nlight manufacturing use with industrial park (IP) zoning district;\n\n(2)\n\nlight manufacturing use with major industry (MI) zoning district;\n\n(3)\n\nlight manufacturing use with limited industrial service (LI) zoning district;\n\n(4)\n\nlight manufacturing use with North Burnet/Gateway (NBG) zoning district; or\n\n(5)\n\nlimited warehousing and distribution use within North Burnet/Gateway (NBG) zoning\ndistrict.\n\n(B)\n\nThe sale of beer or ale produced on-site for on-site consumption:\n\n(1)\n\nis a permitted use, if the brewery is at least 540 feet from any single family residential\nuse, as measured from lot line to lot line;\n\n(2)\n\nis a conditional use, if the brewery is less than 540 feet from any single family\nresidential use, as measured from lot line to lot line; and\n\n(3)\n\nexcept as provided in Subsections (C), (D), and (E) of this section, shall not exceed\n33 percent or 5,000 square feet of the total floor area of the principal developed\nuse, whichever is less.\n\n(C)\n\nBeer and ale sold on-site may be consumed during a brewery tour in an area exceeding\n33 percent or 5,000 square feet of the total floor area of the principal developed\nuse, whichever is less.\n\n(D)\n\nBeer and ale sold on-site may be consumed in an area exceeding 33 percent or 5,000\nsquare feet of the total floor area of the principal developed use, whichever is less,\nif the brewery is located in Airport Overlay zones AO-1, AO-2 or AO-3.\n\n(E)\n\nDuring the Conditional Use Permitting Process the Council on appeal or Planning Commission\nmay increase the square footage allowed under Subsection B(3).\n\nSource: Ord. 20140417-082, Pt. 1, 4-28-14; Ord. No. 20231102-028, Pt. 17, 11-13-23.\n\n### ARTICLE 5. - ACCESSORY USES.\n\nAn accessory use is a use that:\n\n(1)\n\nis incidental to and customarily associated with a principal use;\n\n(2)\n\nunless otherwise provided, is located on the same site as the principal use; and\n\n(3)\n\nmay include parking for the principal use.\n\nSource: Section 13-2-1; Ord. 990225-70; Ord. 031211-11.\n\nThe regulations applicable to a principal use apply to an accessory use, except as\notherwise provided in this division.\n\nSource: Section 13-2-301; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nFor a principal residential use, this section prescribes the requirements for an accessory\nuse.\n\n(B)\n\nThis subsection provides for vehicle storage as an accessory use.\n\n(1)\n\nNot more than one motor vehicle for each licensed driver residing on the premises\nmay be stored on the premises.\n\n(2)\n\nNotwithstanding the limitation of Subsection (B)(1), a private garage for the storage\nof not more than four motor vehicles is permitted.\n\n(3)\n\nExcept for an antique vehicle or recreational vehicle, a motor vehicle with a capacity\nof one ton or greater is prohibited.\n\n(4)\n\nNot more than one commercial vehicle may be stored on the premises.\n\n(5)\n\nExcept as provided in Subsection (B)(6), an inoperable motor vehicle may not be stored\non an adjacent public right-of-way. A motor vehicle is inoperable if, for more than\n72 hours, the vehicle:\n\n(a)\n\ndoes not have license plates or has license plates that have been expired for more\nthan 90 days;\n\n(b)\n\ndoes not have a motor vehicle safety inspection sticker or has a motor vehicle inspection\nsafety sticker that has been expired for more than 90 days; or\n\n(c)\n\ncannot be started or legally operated in a public right-of-way.\n\n(6)\n\nThe prohibition of Subsection (B)(5) does not apply to:\n\n(a)\n\nan antique or recreational vehicle stored at an owner's residence; or\n\n(b)\n\na vehicle under repair for less than 60 days, if not more than one other vehicle is\nalso under repair.\n\n(7)\n\nUp to two vehicles that are either antique or recreational vehicles may be stored\non the premises, if the storage area is not a health hazard and is either in an enclosed\nbuilding or screened from public view with a solid wood or masonry fence at least\nsix feet high.\n\n(C)\n\nThe following are permitted as accessory uses:\n\n(1)\n\nrecreational activities and recreational facilities for use by residents;\n\n(2)\n\nreligious study meetings;\n\n(3)\n\nplayhouses, patios, cabanas, porches, gazebos, and household storage buildings;\n\n(4)\n\nradio and television receiving antenna and dish-type satellite receivers;\n\n(5)\n\nsolar collectors;\n\n(6)\n",
  "start_line": 27612,
  "end_line": 27863,
  "subsections": [
    "25-2-7-A",
    "25-2-7-B",
    "25-2-7-C",
    "25-2-7-D",
    "25-2-7-E",
    "25-2-7-F",
    "25-2-7-G",
    "25-2-7-H",
    "25-2-7-I",
    "25-2-7-J",
    "25-2-7-K",
    "25-2-7-L",
    "25-2-7-M",
    "25-2-7-A",
    "25-2-7-B",
    "25-2-7-C",
    "25-2-7-D",
    "25-2-7-E",
    "25-2-7-A",
    "25-2-7-B",
    "25-2-7-C"
  ]
}