{
  "id": "25-2-714",
  "title": "ADDITIONAL FLOOR AREA",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Section 25-2-714 (Additional Floor Area) applies only to structures located between Bouldin and Blunn Creeks.\n\n(D)\n\nFor an area not included in a primary setback area or a secondary setback area, the\nmaximum impervious cover is 50 percent.\n\n(E)\n\nThe maximum height is:\n\n(1)\n\nfor structures located between the shoreline of Lady Bird Lake and Riverside Drive,\nthe lower of 45 feet or the maximum height allowed in the base zoning district; and\n\n(2)\n\nfor structures located elsewhere in the subdistrict, the lower of 60 feet or the maximum\nheight allowed in the base zoning district.\n\nSource: Section 13-2-702(j); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the University/Deep Eddy subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback lines are located:\n\n(1)\n\n200 feet landward from the Town Lake shoreline, between Tom Miller Dam and Red Bud\nTrail; and\n\n(2)\n\n300 feet landward from the Town Lake shoreline, between Red Bud Trail and MoPac Boulevard.\n\n(C)\n\nThe secondary setback lines are located:\n\n(1)\n\n50 feet landward from the primary setback line, between Tom Miller Dam and Red Bud\nTrail; and\n\n(2)\n\n100 feet landward from the primary setback line, between Red Bud Trail and MoPac Boulevard.\n\n(D)\n\nFor a primary setback area, a secondary setback area, or an area within 50 feet of\na secondary setback line:\n\n(1)\n\nthe maximum building height is 35 feet; and\n\n(2)\n\nthe floor to area ratio may not be increased under Section 25-2-714 (Additional Floor Area).\n\n(E)\n\nFor an area not included in a primary setback area or a secondary setback area, the\nmaximum impervious cover is 40 percent.\n\n(F)\n\nThe maximum height is the lower of 60 feet or the maximum height allowed in the base\nzoning district.\n\nSource: Section 13-2-702(a); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the Zilker Park subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback line is located 100 feet landward from the Town Lake shoreline.\n\n(C)\n\nThe secondary setback line is located 700 feet landward from the primary setback line.\n\n(D)\n\nFor an area not included in a primary setback area or a secondary setback area, the\nmaximum impervious cover is 40 percent.\n\n(E)\n\n(Reserved)\n\n(F)\n\nThe maximum height is the lower of 45 feet or the maximum height allowed in the base\nzoning district.\n\nSource: Section 13-2-702(n); Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074.\n\n(A)\n\nThis section applies in the City Hall subdistrict of the WO combining district.\n\n(B)\n\nThe primary setback line is located 100 feet landward from the Town Lake shoreline.\n\n(C)\n\nA surface parking area located at or above grade is prohibited, except for a parking\narea for buses, van pooling, taxis, delivery services, commercial loading, public\ntransportation, the handicapped, or public access to park land.\n\n(D)\n\nThe location of a garage access point or curb cut must minimize the disruption of\npedestrian traffic on existing sidewalks.\n\n(E)\n\nA structure:\n\n(1)\n\nmust fit within an envelope delineated by a 70 degree angle starting at a line 45\nfeet above the property boundary line nearest Town Lake, with the base of the angle\nbeing a horizontal plane extending from the line parallel to and away from the surface\nof Town Lake; or\n\n(2)\n\nmay not exceed a height of 100 feet.\n\n(F)\n\nThis subsection applies to a nonresidential use in a building adjacent to Town Lake.\n\n(1)\n\nFor a ground level wall that is visible from park land or a public right-of-way that\nadjoins park land, at least 60 percent of the wall area that is between 2 and 10 feet\nabove grade must be constructed of clear or lightly tinted glass. The glass must allow\npedestrians a view of the interior of the building.\n\n(2)\n\nEntry ways or architectural detailing is required to break the continuity of nontransparent\nbasewalls.\n\n(3)\n\nExcept for transparent glass required by this subsection, natural building materials\nare required for an exterior surface visible from park land adjacent to Town Lake.\n\nSource: Ord. 990715-115; Ord. 031211-11.\n\nThis division applies to property in the university neighborhood overlay (UNO) district\nif the property owner files a site plan and an election for the property to be governed\nby this division.\n\nSource: Ord. 040902-58.\n\nFor property governed by this division, this division supersedes the other provisions\nof this title to the extent of conflict.\n\nSource: Ord. 040902-58.\n\n(A)\n\nIn this division:\n\n(1)\n\nOCCUPANT SPACE means space in a building used for a use other than a parking facility\nor a mechanical facility.\n\n(2)\n\nSTREET WALL AREA means the portion of an exterior wall of a building adjacent to a\npublic street other than an alley and accessible from a pedestrian path that extends\nfrom the base of street level:\n\n(a)\n\nto a maximum height of 65 feet; or\n\n(b)\n\nfor an accessory parking structure, to a maximum height of two stories.\n\n(B)\n\nIn this division, a local use is a use that serves the public by providing goods or\nservices in a manner readily accessible by pedestrians or the occupants of the structure\nin which the uses are located. Local uses include:\n\n(1)\n\nadministrative and business offices;\n\n(2)\n\nart and craft studio;\n\n(3)\n\nart gallery;\n\n(4)\n\nart workshop;\n\n(5)\n\nbusiness and trade school;\n\n(6)\n\nconsumer convenience services;\n\n(7)\n\nconsumer repair services;\n\n(8)\n\ncounseling services;\n\n(9)\n\ncustom manufacturing;\n\n(10)\n\nday care services (commercial, general, or limited);\n\n(11)\n\nfinancial services;\n\n(12)\n\nfood preparation, in conjunction with food sales, general restaurant or limited restaurant\naccessory use;\n\n(13)\n\nfood sales;\n\n(14)\n\ngeneral retail sales (convenience or general);\n\n(15)\n\nguidance services;\n\n(16)\n\nindoor sports and recreation;\n\n(17)\n\nmedical offices (under 5,000 square feet);\n\n(18)\n\npersonal improvement services;\n\n(19)\n\npersonal services;\n\n(20)\n\npet services;\n\n(21)\n\nprinting and publishing services;\n\n(22)\n\nprofessional office;\n\n(23)\n\nreligious assembly;\n\n(24)\n\nrestaurant (general or limited);\n\n(25)\n\ntheater; and\n\n(26)\n\na conditional use in the base zoning district that is approved by the land use commission.\n\n(C)\n\nA local use may not include a drive-through facility.\n\nSource: Ord. 040902-58; Ord. 20050519-Z001; Ord. 20080925-039.\n\n(A)\n\nIn a nonresidential zoning base district, residential uses are permitted.\n\n(B)\n\nIn any base zoning district, a hotel-motel use, a multifamily use, or a group residential\nuse is permitted.\n\n(C)\n\nThis subsection applies to a multifamily residential use.\n\n(1)\n\nEach building must achieve at least a one star rating under the Austin Green Building\nprogram.\n\n(2)\n\nAll ground floor dwelling units must be:\n\n(a)\n\nadaptable for use by a person with a disability; and\n\n(b)\n\naccessible by a person with a disability from the on-site parking and common facility,\nif any.\n\n(3)\n\nAt least 10 percent of the dwelling units must be accessible for a person with a mobility\nimpairment.\n\n(4)\n\nAt least two percent of the dwelling units must be accessible for a person with a\nhearing or visual disability.\n\n(5)\n\nEach multistory building must be served by an elevator, unless:\n\n(a)\n\nat least 25 percent of the site's dwelling units are located on the ground floor;\nor\n\n(b)\n\nfor a site with fewer than 20 dwelling units, at least five percent of the site's\ndwelling units are located on the ground floor.\n\n(6)\n\nA parking space must be leased separately from a dwelling unit.\n\n(D)\n\nLocal uses are permitted in any base district, subject to the limitations of this\nsubsection.\n\n(1)\n\nIn the outer west campus subdistrict, local uses are not permitted in a residential\nbase district unless the property:\n\n(a)\n\nhas a permitted building height of 50 feet or greater; or\n\n(b)\n\nis zoned historic and has a permitted building height of 65 feet or greater.\n\n(2)\n\nExcept as provided in Paragraph (3), up to 20 percent of the gross floor area of a\nsite may be used for local uses. At least one-half of the gross floor area of the\nlocal uses must be located at street level and accessible from a pedestrian path.\nIn determining these percentages, a nonresidential use that is accessory to the principal\nresidential use or located in a historic landmark is excluded from the gross floor\narea of the local uses.\n\n(3)\n\nUp to 100 percent of the gross floor area of a structure may be used for local uses\nif the structure:\n\n(a)\n\nis a historic landmark and is located entirely in a subdistrict having a permitted\nbuilding height of 65 feet or greater;\n\n(b)\n\nwas constructed before September 13, 2004, contains less than 10,000 square feet of\ngross floor area, is less than 65 feet in height, and is located in the inner west\ncampus or Guadalupe subdistricts; or\n\n(c)\n\nis less than 65 feet in height and located on:\n\n(i)\n\nGuadalupe Street between Martin Luther King, Jr. Blvd. and 29th Street;\n\n(ii)\n\nMartin Luther King, Jr. Blvd. between Guadalupe Street and Rio Grande Street; or\n\n(iii)\n\n24th Street between Guadalupe Street and Rio Grande Street.\n\n(E)\n\nThis subsection applies to commercial off-street parking.\n\n(1)\n\nCommercial off-street parking on a surface lot is prohibited.\n\n(2)\n\nCommercial off-street parking in a structure is:\n\n(a)\n\npermitted in any base zoning district in the Guadalupe, Dobie, or inner west campus\nsubdistrict; and\n\n(b)\n\nprohibited in the outer west campus subdistrict.\n\n(3)\n\nThe street level portion of a commercial off-street parking structure that is accessible\nfrom a pedestrian path must contain local uses for a depth of at least 18 feet. This\nrequirement does not apply to a portion of the structure used for an entrance or exit.\n\n(F)\n\nA cocktail lounge is a conditional use if it is accessory to a hotel-motel use with\nat least 50 rooms.\n\n(G)\n\nOn-site surface parking is prohibited, unless the director determines that:\n\n(1)\n\nthe only building on the site has 6,000 or fewer square feet of gross floor area,\nand the building was constructed before September 13, 2004; and\n\n(2)\n\nthe parking area is screened from the street by an six foot tall solid wall.\n\n(H)\n\nThis subsection prescribes requirements for the ground floor of a building, including\na parking garage.\n\n(1)\n\nThe ground floor must include occupant space along not less than 75 percent of the\nnet length of street frontage. Net length of street frontage is calculated by determining\nthe cumulative length of the building at ground level adjacent to each street other\nthan an alley, and then deducting the cumulative length of driveways, exit stairs,\nelevators, and utility equipment space.\n\n(2)\n\nFor a site with frontage on more than one street, driveways, exit stairs and elevators\nmust be located on a street that runs north and south, unless the director of the\nNeighborhood Planning and Zoning Department determines that those features cannot\nreasonably be located along that street because of topographical conditions.\n\n(3)\n\nThe ground floor of a building may not be more than five feet higher or lower than\nan adjacent public street sidewalk. This does not apply to the ground floor adjacent\nto an alley.\n\n(4)\n\nThe minimum distance between the finished ground floor of the building and the structural\nportion of the ceiling is 10 feet.\n\n(5)\n\nThe minimum depth of occupant space is 18 feet, measured from the outside face of\nthe front exterior wall to the outside face of the rear interior wall.\n\n(I)\n\nOff-site temporary construction staging is allowed within 500 feet of the construction\nsite. The director may allow a staging area to be located more than 500 feet from\nthe construction site if the director determines that a closer staging area is not\nreasonably available and that the location does not adversely affect public health\nor safety.\n\n(J)\n\nA hotel/motel use is treated as a local use under this division if it meets the following\nrequirements:\n\n(1)\n\nThe hotel-motel use must be located on property that:\n\n(a)\n\nhas frontage on Martin Luther King, Jr. Blvd. and is located between Pearl Street\nand Guadalupe Street; or\n\n(b)\n\nhas frontage on Guadalupe Street and is located between 22nd Street and Martin Luther\nKing, Jr. Blvd.\n\n(2)\n\nThe maximum height must be no greater than 85 feet, unless a greater height is allowed\nunder Appendix C (University Neighborhood Overlay District Boundaries, Subdistrict Boundaries, and Height\nLimits) of this chapter.\n\n(3)\n\nIf a new hotel-motel use includes, shares, or incorporates adjacent existing property,\nthen both the new hotel-motel use and the adjacent property must be:\n\n(a)\n\nincluded in a single site plan; and\n\n(b)\n",
  "start_line": 21916,
  "end_line": 22472,
  "subsections": [
    "25-2-714-D",
    "25-2-714-E",
    "25-2-714-A",
    "25-2-714-B",
    "25-2-714-C",
    "25-2-714-D",
    "25-2-714-E",
    "25-2-714-F",
    "25-2-714-A",
    "25-2-714-B",
    "25-2-714-C",
    "25-2-714-D",
    "25-2-714-E",
    "25-2-714-F",
    "25-2-714-A",
    "25-2-714-B",
    "25-2-714-C",
    "25-2-714-D",
    "25-2-714-E",
    "25-2-714-F",
    "25-2-714-A",
    "25-2-714-B",
    "25-2-714-C",
    "25-2-714-A",
    "25-2-714-B",
    "25-2-714-C",
    "25-2-714-D",
    "25-2-714-E",
    "25-2-714-F",
    "25-2-714-G",
    "25-2-714-H",
    "25-2-714-I",
    "25-2-714-J"
  ]
}