{
  "id": "25-2-519",
  "title": "RESERVED",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Ord. No. 20240229-070, Pt. 1, adopted March 11, 2024, repealed ยง 25-2-519, which pertained to Commercial-Residential\nDevelopment and derived from Ord. No. 20221201-055, Pt. 2, 12-12-22; Ord. No. 20231102-028, Pt. 9, 11-13-23.\n\n(A)\n\nThis section provides exceptions to zoning district height limits.\n\n(B)\n\nSubsection (C) applies to:\n\n(1)\n\nparapet walls, chimneys, vents, and mechanical or safety features including fire towers,\nstairways, elevator penthouses, heating or cooling equipment, solar installations,\nand protective covers; and\n\n(2)\n\nornamental towers, cupolas, domes, and spires that are not designed for occupancy.\n\n(C)\n\nA structure described in Subsection (B) may exceed a zoning district height limit\nby the greater of:\n\n(1)\n\n15 percent;\n\n(2)\n\nthe amount necessary to comply with a federal or state regulation;\n\n(3)\n\nfor a stack or vent, the amount necessary to comply with generally accepted engineering\nstandards; or\n\n(4)\n\nfor a spire, 30 percent.\n\n(D)\n\nThe height of a home radio or television receiving antenna or a flagpole may not exceed\nthe lesser of:\n\n(1)\n\na 50 feet; or\n\n(2)\n\nif attached to a building, 25 feet above the building; or\n\n(3)\n\nif located on the ground, 125 percent of the zoning district height limit.\n\n(E)\n\nA radio tower operated by a licensed amateur radio operator may not exceed a height\nof 60 feet plus 15 feet for antennae. The Land Use Commission may approve a greater\nheight as a conditional use.\n\n(F)\n\nAn antenna located on a building in a non-residential zoning district may exceed the\nzoning district height limit by not more than 20 feet.\n\n(G)\n\nA fly tower that is constructed within a performing arts theater that seats 300 or\nmore people may be up to 80 feet in height, regardless of the zoning district height\nlimit, unless a lower height limit is required by City Code Chapter 25-2, Article 10 (Compatibility Standards). The fly tower must be:\n\n(1)\n\nlocated on land owned by the City of Austin; and\n\n(2)\n\ndesigned and used for moving set pieces, lights, microphones, and other equipment\non and off stage.\n\nSource: Section 13-2-608; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 040826-67;",
  "start_line": 15247,
  "end_line": 15333,
  "subsections": []
}