{
  "id": "25-2-180",
  "title": "LAKE AUSTIN (LA) OVERLAY DISTRICT",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Within the shoreline setback area defined by Section 25-2-551 (Lake Austin (LA) District Regulations) and within the overlay established by Section 25-2-180 (Lake Austin (LA) Overlay District), no more than 30 percent of the total number of shade trees of 8 inches or greater,\nas designated in the Environmental Criteria Manual, may be removed.\n\n(4)\n\nBefore a building permit may be issued or a site plan released, approval by the Watershed\nProtection Department is required for chemicals used to treat building materials that\nwill be submerged in water.\n\n(5)\n\nBank erosion above the 100-year-flood plain may be stabilized within a lakefront critical\nwater quality zone if the restoration meets the requirements of Subsection (B)(2)\nof this section.\n\n(6)\n\nA retaining wall, bulkhead, or other erosion protection device must be designed and\nconstructed to minimize wave return and wave action in compliance with the Environmental\nCriteria Manual. A shoreline modification within the wave action zone with a greater\nthan 45 degree vertical slope for any portion greater than one foot in height is not\nallowed on or adjacent to the shoreline of a lake, unless the shoreline modification\nis located within an existing man-made channel.\n\n(7)\n\nA retaining wall, bulkhead, or other erosion protection device may not capture or\nrecapture land from a lake unless doing so is required to restore the shoreline to\nwhichever of the following boundaries would encroach the least into the lake:\n\n(a)\n\nthe shoreline as it existed 10 years before the date of application, with documentation\nas prescribed by the Environmental Criteria Manual; or\n\n(b)\n\nthe lakeside boundary of the subdivided lot line.\n\n(8)\n\nA bulkhead may be replaced in front of an existing bulkhead once, if:\n\n(a)\n\nthe existing bulkhead was legally constructed;\n\n(b)\n\nconstruction of the replacement bulkhead does not change the location of the shoreline\nby more than 6 inches; and\n\n(c)\n\nthe director determines that there is no reasonable alternative to replacement of\nthe bulkhead in the location of the existing bulkhead.\n\n(9)\n\nDredging is prohibited unless:\n\n(a)\n\nthe area of dredging is less than 25 cubic yards; and\n\n(b)\n\nthe dredging is necessary for navigation safety.\n\n(D)\n\nA utility line, including a storm drain, is prohibited in the critical water quality\nzone, except as provided in Subsection (E) or for a necessary crossing. A necessary\nutility crossing may cross into or through a critical water quality zone only if:\n\n(1)\n\nthe utility line follows the most direct path into or across the critical water quality\nzone to minimize disturbance, unless boring or tunneling is the proposed method of\ninstallation for the entire crossing and all bore pits are located outside of the\ncritical water quality zone;\n\n(2)\n\nthe depth of the utility line and location of associated access shafts are not located\nwithin an erosion hazard zone, unless protective works are provided as prescribed\nin the Drainage Criteria Manual;\n\n(3)\n\nin the Barton Springs Zone, the crossing is approved by the director.\n\n(E)\n\nIn the urban and suburban watersheds, a utility line may be located parallel to and\nwithin the critical water quality zone if:\n\n(1)\n\nin an urban watershed and located not less than 50 feet from the centerline of a waterway,\nor in a watershed other than urban and located not less than 50 feet from the centerline\nof a minor waterway, 100 feet from the centerline of an intermediate waterway, and\n150 feet from the centerline of a major waterway;\n\n(2)\n\nlocated not less than 50 feet from the shoreline of Lady Bird Lake and Lake Walter\nE. Long, as defined in Section 25-8-92;\n\n(3)\n\nlocated not less than 100 feet from the ordinary high water mark of the Colorado River\ndownstream from Longhorn Dam;\n\n(4)\n\ndesigned in accordance with the Environmental Criteria Manual;\n\n(5)\n\nlocated outside the erosion hazard zone, unless protective works are provided as prescribed\nin the Drainage Criteria Manual; and\n\n(6)\n\nthe project includes either riparian restoration of an area within the critical water\nquality zone equal in size to the area of disturbance in accordance with the Environmental\nCriteria Manual, or payment into the Riparian Zone Mitigation Fund of a non-refundable\namount established by ordinance.\n\n(F)\n\nIn-channel detention basins and in-channel wet ponds are allowed in the critical water\nquality zone only if:\n\n(1)\n\nproposed as part of a public capital improvement project or public private partnership;\n\n(2)\n\nno alternative location is feasible; and\n\n(3)\n\ndesigned in accordance with the Environmental Criteria Manual.\n\n(G)\n\nFloodplain modification is prohibited in the critical water quality zone unless the\nmodification proposed:\n\n(1)\n\nis necessary to address an existing threat to public health and safety, as determined\nby the director;\n\n(2)\n\nis designed solely to improve floodplain health as determined by a functional assessment\nof floodplain health as prescribed by the Environmental Criteria Manual; or\n\n(3)\n\nis the minimum necessary for development allowed in the critical water quality zone\nunder Section 25-8-261 (Critical Water Quality Zone Development) or Section 25-8-262 (Critical Water Quality Zone Mobility Crossings) as prescribed by the Environmental Criteria Manual.\n\n(H)\n\nIn the urban and suburban watersheds, vegetative filter strips, rain gardens, biofiltration\nponds, areas used for irrigation or infiltration of stormwater, or other controls\nas prescribed by rule are allowed in the critical water quality zone if:\n\n(1)\n\nin an urban watershed and located not less than 50 feet from the centerline of a waterway,\nor in a watershed other than urban and located no less than 50 feet from the centerline\nof a minor waterway, no less than 100 feet from the centerline of an intermediate\nwaterway, and no less than 150 feet from the centerline of a major waterway;\n\n(2)\n\nlocated not less than 50 feet from the shoreline of Lady Bird Lake and Lake Walter\nE. Long, as defined in Section 25-8-92;\n\n(3)\n\nlocated not less than 100 feet from the ordinary high water mark of the Colorado River\ndownstream from Longhorn Dam;\n\n(4)\n\nlocated outside the 100-year floodplain; and\n\n(5)\n\nlocated outside the erosion hazard zone, unless protective works are provided as prescribed\nin the Drainage Criteria Manual.\n\n(I)\n\nDevelopment associated with power generation, transmission, or distribution at the\nDecker Creek Power Station is allowed in the critical water quality zone.\n\n(J)\n\nA residential lot that is 5,750 square feet or less in size may not include any portion\nof a critical water quality zone.\n\n(K)\n\nAny segment of trail that is a part of the Ann and Roy Butler Hike and Bike Trail,\nas defined by the Parks and Recreation Department, is not subject to Paragraph (B)(3)(c)\nor Subdivision (C)(2) and may be located within 50 feet of Lady Bird Lake if:\n\n(1)\n\nrestoration, as determined by a functional assessment of floodplain health as prescribed\nby the Environmental Criteria Manual, includes a restored area at a minimum ratio\nof 1:1 and a maximum ratio of 2:1 of restored area to disturbed area, or\n\n(2)\n\nalternative compliance as approved by the director is provided.\n\nSource: Sections 13-7-23(e) and (h); Ord. 990225-70; Ord. 010329-18; Ord. 010607-8;\nOrd. 031211-11; Ord. 20131017-046; Ord. No. 20140626-113, Pt. 20, 7-7-14; Ord. No. 20160922-048, Pt. 5, 10-3-16; Ord. No. 20170615-102, Pt. 17, 6-15-17; Ord. No. 20211202-056, Pt. 1, 12-13-21; Ord. No. 20221027-045, Pt. 23, 11-7-22; Ord. No. 20240307-036, Pt. 1, 3-18-24.\n\n(A)\n\nIn an urban watershed, an arterial street, collector street, residential street, or\nrail line may cross a critical water quality zone of any waterway.\n\n(B)\n\nThis subsection applies in a watershed other than an urban watershed.\n\n(1)\n\nA major waterway critical water quality zone may be crossed by a Level 3, 4, or 5\nstreet or rail line identified in the Transportation Plan.\n\n(2)\n\nAn intermediate waterway critical water quality zone may be crossed by a Level 2,\n3, 4, or 5 street or rail line, except:\n\n(a)\n\na Level 2 street crossing must be at least 2,500 feet, measured along the centerline\nof the waterway, from a Level 2, 3, 4, or 5 street crossing on the same waterway;\nor\n\n(b)\n\nin a water supply suburban or water supply rural watershed, or the Barton Springs\nZone, a Level 2 street crossing must be at least one mile, measured along the centerline\nof the waterway, from a Level 2, 3, 4, or 5 street crossing on the same waterway.\n\n(3)\n\nA minor waterway critical water quality zone may be crossed by a Level 2, 3, 4, or\n5 street or rail line, except:\n\n(a)\n\na Level 2 street crossing must be at least 900 feet, measured along the centerline\nof the waterway, from a Level 2, 3, 4, or 5 street crossing on the same waterway;\nor\n\n(b)\n\nin a water supply suburban or water supply rural watershed, or the Barton Springs\nZone, a Level 2 street crossing must be at least 2,000 feet, measured along the centerline\nof the waterway, from a Level 2, 3, 4, or 5 street crossing on the same waterway.\n\n(4)\n\nA minor waterway critical water quality zone may be crossed by a Level 1 or 2 street\nif necessary to provide access to property that cannot otherwise be safely accessed.\n\n(C)\n\nIn all watersheds, multi-use trails may cross a critical water quality zone of any\nwaterway if:\n\n(1)\n\ndesigned in compliance with the Environmental Criteria Manual; and\n\n(2)\n\nthe development demonstrates no additional adverse impact from flood or erosion potential.\n\n(D)\n\nNotwithstanding Subsections (A) and (B) and except in the Barton Springs Zone, a street\nor driveway may cross the critical water quality zone if the street or driveway is\nlocated in a center or corridor as identified on the growth concept map of the Imagine\nAustin Comprehensive Plan, as adopted by Ordinance No. 20120614-058, and if the proposed\ncrossing:\n\n(1)\n\nis necessary to facilitate the development or redevelopment of a designated corridor\nor center as recommended in the Imagine Austin Comprehensive Plan, Chapter 4 (Shaping Austin: Building the Complete Community), growth concept map and related definitions; and\n\n(2)\n\nmaintains the quality and quantity of recharge if located in a center or corridor\ndesignated as a sensitive environmental area in the Edwards Aquifer recharge zone,\nEdwards Aquifer contributing zone, or the South Edwards Aquifer recharge zone, as\ndetermined by the director of the Watershed Protection Department.\n\nSource: Sections 13-7-23(e) and (h); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11;\nOrd. 20131017-046; Ord. No. 20170615-102, Pt. 18, 6-15-17; Ord. No. 20220519-094, Pt. 7, 5-30-22; Ord. No. 20221027-045, Pt. 24, 11-7-22.\n\n(A)\n\nAll floodplain modifications must:\n\n(1)\n\nbe designed to accommodate existing and fully-vegetated hydraulic conditions;\n\n(2)\n\napply sound engineering and ecological practices, prevent and reduce degradation of\nwater quality, and demonstrate the stability and integrity of floodplains and waterways,\nas prescribed in the Environmental Criteria Manual;\n\n(3)\n\nrestore floodplain health, or provide mitigation if restoration is infeasible, to\nsupport natural functions and processes as prescribed in the floodplain modification\ncriteria in the Environmental Criteria Manual; and\n\n(4)\n\ncomply with the requirements of Chapter 25-7 (Drainage), the Drainage Criteria Manual, and the Environmental Criteria Manual.\n\n(B)\n\nFloodplain modification within a critical water quality zone is prohibited except\nas allowed under Section 25-8-261 (Critical Water Quality Zone Development).\n\n(C)\n\nFloodplain modification outside a critical water quality zone is allowed only if the\nmodification proposed:\n\n(1)\n\nis necessary to protect public health and safety by addressing an existing threat,\nas determined by the director;\n\n(2)\n\nis designed solely to improve floodplain health, as determined by a functional assessment\nof floodplain health as prescribed by the Environmental Criteria Manual;\n\n(3)\n\nis located within a floodplain area classified as in fair or poor condition, as determined\nby a functional assessment of floodplain health, and provides restoration or mitigation\nin accordance with the ratios and specifications prescribed in the Environmental Criteria\nManual; or\n\n(4)\n\nis the minimum modification necessary for development allowed under Section 25-8-261 (Critical Water Quality Development) or 25-8-262 (Critical Water Quality Zone Mobility Crossings).\n\n(D)\n\nIf on-site restoration, as prescribed in the Environmental Criteria Manual, is infeasible\nand mitigation is required under this section, it may be satisfied by:\n\n(1)\n\npaying into the Riparian Zone Mitigation Fund a nonrefundable amount established by\nordinance;\n\n(2)\n\ntransferring in fee simple or placing restrictions on mitigation land approved by\nthe director and meeting the following conditions:\n\n(a)\n\nlocated within the same watershed classification;\n\n(b)\n\nin accordance with the procedures in Subsection (H)(3) of Section 25-8-26 (Redevelopment Exception in the Barton Springs Zone);\n\n(c)\n\ndedicated to or restricted for the benefit of the City, or another entity approved\nby the director, and which the City or other approved entity accepts; and\n\n(d)\n\nan amount proportionate to the amount of area within the existing floodplain that\nis proposed to be modified, as prescribed in the Environmental Criteria Manual; or\n\n(3)\n\na combination of the mitigation methods described in Subsections (D)(1) and (D)(2),\nif approved by the director.\n\nSource: Ord. No. 20221027-045, Pt. 25, 11-7-22.\n\n(A)\n\nDrainage patterns for proposed development must be designed to protect critical environmental\nfeatures from the effects of runoff from developed areas, and to maintain the catchment\nareas of recharge features in a natural state. Special controls must be used where\nnecessary to avoid the effects of erosion, or sedimentation, or high rates of flow.\n\n(B)\n\nA residential lot may not include a critical environmental feature or a critical environmental\nfeature buffer zone and may not be located within 50 feet of a critical environmental\nfeature.\n\n(C)\n\nThis subsection prescribes the requirements for critical environmental feature buffer\nzones.\n\n(1)\n\nA buffer zone is established around each critical environmental feature described\nin this subchapter.\n\n(a)\n\nExcept as provided in Subsection (C)(1)(b), the width of the buffer zone is 150 feet\nfrom the edge of the critical environmental feature.\n\n(b)\n\nFor a point recharge feature, the buffer zone coincides with the topographically defined\ncatchment basin, except that the width of the buffer zone from the edge of the critical\nenvironmental feature is:\n\n(i)\n\nnot less than 150 feet;\n\n(ii)\n\nnot more than 300 feet; and\n\n(iii)\n\ncalculated in accordance with the Environmental Criteria Manual.\n\n(2)\n\nWithin a buffer zone described in this subsection:\n\n(a)\n\nthe natural vegetative cover must be retained to the maximum extent practicable;\n\n(b)\n\nconstruction is prohibited; and\n\n(c)\n\nwastewater disposal or irrigation is prohibited.\n\n(3)\n\nIf located at least 50 feet from the edge of the critical environmental feature, the\nprohibition of Subsection (C)(2)(b) does not apply to:\n\n(a)\n\na hiking trail;\n\n(b)\n\na recharge basin approved under Section 25-8-213 (Water Quality Control Standards) that discharges to a point recharge feature; or\n\n(c)\n\nan innovative runoff management practice approved under Section 25-8-151 (Innovative Management Practices) that is designed to address the standards of this section, enhance the recharge\nof groundwater and the discharge of springs, and maintain the function of critical\nenvironmental features.\n\n(4)\n\nPerimeter fencing with not less than one access gate must be installed at the outer\nedge of the buffer zone for all point recharge features. The fencing must comply with\nthe Standard Specifications Manual.\n\n(5)\n\nThe owner must maintain the buffer zone in accordance with standards in the Environmental\nCriteria Manual to preserve the water quality function of the buffer.\n\n(6)\n\nAll critical environmental feature locations and required setbacks must be shown on\npreliminary subdivision plans, site plans, and other permits as determined by the\ndirector.\n\n(7)\n\nAll critical environmental feature locations must be shown on final plats.\n\n(D)\n\nWhen voids in the rock substrate are uncovered during development, the following protocol\nmust be followed:\n\n(1)\n\nconstruction in the area of the void must cease while the applicant conducts a preliminary\ninvestigation of the void as prescribed by the Environmental Criteria Manual.\n\n(2)\n\nThe applicant shall contact a City of Austin Environmental Inspector to schedule further\ninvestigation by the City of the void as prescribed by the Environmental Criteria\nManual if the preliminary investigation indicates that the void:\n\n(a)\n\nis at least one square foot in total area;\n\n(b)\n\nblows air from within the substrate;\n\n(c)\n\nconsistently receives water during any rain event; or\n\n(d)\n\npotentially transmits groundwater.\n\n(3)\n\nConstruction may only proceed after mitigation measures are reviewed and approved\nby the Watershed Protection Department.\n\nSource: Section 13-7-21; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20120524-083;\nOrd. 20131017-046; Ord. No. 20221027-045, Pt. 26, 11-7-22.\n\n(A)\n\nWetlands must be protected in all watersheds except for wetlands located within the\narea bounded by Interstate 35, Riverside Drive, Barton Springs Road, Lamar Boulevard,\nand 15th Street that are not associated with the critical water quality zone of Lady\nBird Lake.\n\n(B)\n\nProtection methods for wetlands require the approval of the director, and may include:\n\n(1)\n\nappropriate setbacks that preserve the wetlands or wetland functions;\n\n(2)\n\nwetland mitigation, including wetland replacement; or\n\n(3)\n\nwetland restoration or enhancement.\n\nSource: Section 13-7-21; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20221027-045, Pt. 27, 11-7-22.\n\n(A)\n\nA person may not construct a roadway or driveway on a slope with a gradient of more\nthan 15 percent unless the construction is necessary to provide primary access to:\n\n(1)\n\nat least two contiguous acres with a gradient of 15 percent or less; or\n\n(2)\n\nbuilding sites for at least five residential units.\n\n(B)\n\nFor construction described in this section, a cut or fill must be revegetated, or\nif a cut or fill has a finished gradient of more than 33 percent, stabilized with\na permanent structure. This does not apply to a stable cut.\n\nSource: Section 13-2-590(a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA person may not construct:\n\n(1)\n\na building or parking structure on a slope with a gradient of more than 25 percent;\nor\n\n(2)\n\nexcept for a parking structure, a parking area on a slope with a gradient of more\nthan 15 percent.\n\n(B)\n\nA person may construct a building or parking structure on a slope with a gradient\nof more than 15 percent and not more than 25 percent if the requirements of this subsection\nare met.\n\n(1)\n\nImpervious cover on slopes with a gradients of more than 15 percent may not exceed\n10 percent of the total area of the slopes.\n\n(2)\n\nThe terracing techniques in the Environmental Criteria Manual are required for construction\nthat is uphill or downhill of a slope with a gradient of more than 15 percent.\n\n(3)\n\nHillside vegetation may not be disturbed except as necessary for construction, and\ndisturbed areas must be restored with native and adapted vegetation as prescribed\nin the Environmental Criteria Manual.\n\n(4)\n\nFor construction described in this section, a cut or fill must be revegetated, or\nif a cut or fill has a finished gradient of more than 33 percent, stabilized with\na permanent structure. This does not apply to a stable cut.\n\nSource: Section 13-2-590(b); Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nA preliminary subdivision plan that proposes a single family residential lot on a\nslope with a gradient of more than 15 percent must include a plan note identifying\nthe lot and describing the requirements of Subsection (B).\n\n(B)\n\nA final plat that proposes a single family residential lot on a slope with a gradient\nof more than 15 percent must include a plat note:\n\n(1)\n\nidentifying the lot; and\n\n(2)\n\nstating the impervious cover and construction requirements for the lot.\n\nSource: Section 13-2-590(c); Ord. 990225-70; Ord. 031211-11.\n\nThis division does not apply in an urban watershed.\n\nSource: Ord. 000406-84; Ord. 031211-11.\n\n(A)\n\nClearing of vegetation is prohibited unless the director determines that the clearing:\n\n(1)\n\nis in accordance with a released site plan or subdivision construction plan;\n\n(2)\n\nis permitted under this section or Section 25-8-322 (Clearing for a Roadway); or\n\n(3)\n\nis not development, as that term is defined in Chapter 25-1 (General Requirements and Procedures).\n\n(B)\n\nClearing of vegetation for agricultural operations is prohibited if an application\nto develop for a non-agricultural use has been granted or is pending. The director\nmay waive this prohibition after determining that the clearing has a bonafide agricultural\npurpose and is unrelated to the proposed development or sale of the land for non-agricultural\nuses.\n\n(C)\n\nA person may clear an area up to 15 feet wide or remove a tree with a diameter of\nnot more than eight inches to perform surveying or geologic testing in preparation\nfor site plan or final plat approval.\n\nSource: Section 13-7-15; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. No. 20170615-102, Pt. 19, 6-15-17.\n\n(A)\n\nA person may clear an area for road construction after site plan or final plat approval\nunder this section.\n\n(B)\n\nRoadway clearing width may not exceed:\n\n(1)\n\ntwice the roadway surface width, or the width of the dedicated right-of-way, whichever\nis less; or\n\n(2)\n\nfor road construction problem areas of less than 300 feet in length, two and one-half\ntimes the roadway width.\n\n(C)\n\nThe director may grant an administrative variance to Subsection (B) if required by\nunusual topographic conditions.\n\n(D)\n\nIf clearing on slopes could result in materials sliding onto areas beyond the clearing\nwidths described in Subsection (B), retaining walls or other preventative methods\nare required.\n\n(E)\n\nThe length of time between rough cutting and final surfacing of roadways may not exceed\n18 months.\n\n(F)\n\nIf the applicant does not meet the deadline described in Subsection (E), the city\nmanager shall notify the applicant in writing that the City will finish the roadways\nor revegetate the disturbed area at the applicant's expense unless the work is completed\nnot later than the 60th day after the date of the notice.\n\nSource: Section 13-7-15; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20060504-039.\n\n(A)\n\nThe site plan or subdivision construction plan must designate the areas to be cleared\nfor temporary storage of spoils or construction equipment. Areas cleared for temporary\nstorage must be located and restored in accordance with the Environmental Criteria\nManual.\n\n(B)\n\nDuring and after site grading operations, the topsoil must be protected and vegetation\nleft in place to the maximum extent practicable.\n\n(C)\n\nFor areas on the site that are to remain pervious after development, any soils that\nare compacted during site grading and construction operations must be decompacted\nin compliance with the Environmental Criteria Manual and the Standard Specifications\nManual.\n\nSource: Section 13-7-15; Ord. 990225-70; Ord. 031211-11; Ord. No. 20221027-045, Pt. 28, 11-7-22.\n\n(A)\n\nCuts on a tract of land may not exceed four feet of depth, except:\n\n(1)\n\nin an urban watershed;\n\n(2)\n\nin a roadway right-of-way;\n\n(3)\n\nfor construction of a building foundation or swimming pool;\n\n(4)\n\nfor construction of a water quality control or detention facility and appurtenances\nfor conveyance such as swales, drainage ditches, and diversion berms, if:\n\n(a)\n\nthe design and location of the facility within the site minimize the amount of cut\nover four feet;\n\n(b)\n\nthe cut is the minimum necessary for the appropriate functioning of the facility;\nand\n\n(c)\n\nthe cut is not located on a slope with a gradient of more than 15 percent or within\n100 feet of a classified waterway;\n\n(5)\n\nfor utility construction or a wastewater drain field, if the area is restored to natural\ngrade;\n\n(6)\n\nin a state-permitted sanitary landfill or a sand or gravel excavation located in the\nextraterritorial jurisdiction, if:\n\n(a)\n\nthe cut is not in a critical water quality zone;\n\n(b)\n\nthe cut does not alter a 100-year floodplain;\n\n(c)\n\nthe landfill or excavation has an erosion and restoration plan approved by the City;\nand\n\n(d)\n\nall other applicable City Code provisions are met.\n\n(7)\n\nfor any cut associated with construction of a multi-use trail, if:\n\n(a)\n\nthe cut is not located on a slope with a gradient of more than 15 percent or within\n100 feet of a classified waterway;\n\n(b)\n\nthe cut is limited to no more than eight feet in depth;\n\n(c)\n\nthe cut is located in a public right-of-way or public easement; and\n\n(d)\n\nthe trail is designed in accordance with the Environmental Criteria Manual; or\n\n(8)\n\nfor construction of a street or driveway necessary to provide primary access if:\n\n(a)\n\nthe construction complies with Division 3 (Construction on Slopes) of this article;\n\n(b)\n\nthe cut is not within a critical water quality zone;\n\n(c)\n\nthe cut is limited to no more than eight feet in depth;\n\n(d)\n\nthe cut over four feet is the minimum amount necessary to comply with safety access\nrequirements and the horizontal and vertical curve requirements of the Transportation\nCriteria Manual; and\n\n(e)\n\nthere is no other feasible alternative for the street or driveway location.\n\nSource: Subsections 13-7-16(b), (c), and (e); Ord. 990225-70; Ord. 031211-11; Ord. No. 20170615-102, Pt. 20, 6-15-17; Ord. No. 20211202-056, Pt. 2, 12-13-21; Ord. No. 20220519-094, Pt. 8, 5-30-22; Ord. No. 20221027-045, Pt. 29, 11-7-22.\n\n(A)\n\nFill on a tract of land may not exceed four feet of depth, except:\n\n(1)\n\nin an urban watershed;\n\n(2)\n\nin a roadway right-of-way or rail line right-of-way;\n\n(3)\n\nunder a foundation with sides perpendicular to the ground, or with pier and beam construction;\n\n(4)\n\nfor construction of a water quality control or detention facility and appurtenances\nfor conveyance such as swales, drainage ditches, and diversion berms, if:\n\n(a)\n\nthe design and location of the facility within the site minimize the amount of fill\nover four feet;\n\n(b)\n\nthe fill is the minimum necessary for the appropriate functioning of the facility;\nand\n\n(c)\n\nthe fill is not located on a slope with a gradient of more than 15 percent or within\n100 feet of a classified waterway;\n\n(5)\n\nfor utility construction or a wastewater drain field;\n\n(6)\n\nin a state-permitted sanitary landfill located in the extraterritorial jurisdiction,\nif:\n\n(a)\n\nthe fill is derived from the landfill operation;\n\n(b)\n\nthe fill is not placed in a critical water quality zone or a 100-year floodplain;\n\n(c)\n\nthe landfill operation has an erosion and restoration plan approved by the City; and\n\n(d)\n\nall other applicable City Code provisions are met; or\n\n(7)\n\nfor fill associated with construction of a multi-use trail, if:\n\n(a)\n\nthe fill is not located on a slope with a gradient of more than 15 percent or within\n100 feet of a classified waterway;\n\n(b)\n\nthe fill is limited to no more than eight feet in depth;\n\n(c)\n\nthe fill is located in a public right-of-way or public easement; and\n\n(d)\n\nthe trail is designed in accordance with the Environmental Criteria Manual.\n\n(8)\n\nfor construction of a street or driveway necessary to provide primary access if:\n\n(a)\n\nthe construction complies with Division 3 (Construction on Slopes) of this article;\n\n(b)\n\nthe fill is not within a critical water quality zone;\n\n(c)\n\nthe fill is limited to no more than eight feet in depth;\n\n(d)\n\nthe fill over four feet is the minimum amount necessary to comply with safety access\nrequirements and the horizontal and vertical curve requirements of the Transportation\nCriteria Manual; and\n\n(e)\n\nthere is no other feasible alternative for the street or driveway location.\n\n(B)\n\nA fill area must be restored and stabilized.\n\n(C)\n\nFill for a roadway must be contained within the roadway clearing width described in\nSection 25-8-322 (Clearing for a Roadway).\n\nSource: Subsections 13-7-16(a), (b), (c), and (e); Ord. 990225-70; Ord. 031211-11;\nOrd. No. 20170615-102, Pt. 21, 6-15-17; Ord. No. 20211202-056, Pt. 3, 12-13-21; Ord. No. 20220519-094, Pt. 9, 5-30-22; Ord. No. 20221027-045, Pt. 30, 11-7-22.\n\n(A)\n\nA spoil disposal site may not be located in a 100-year floodplain or on a slope with\na gradient of more than 15 percent.\n\n(B)\n\nThe location of a spoil disposal site must be reasonably accessible. An access route:\n\n(1)\n\nmust use existing and approved roadways, if possible; and\n\n(2)\n\nmay not be located in a waterway, unless:\n\n(a)\n\na reasonable alternative is not available; or\n\n(b)\n\nthe access route is for the construction of a water quality control.\n\n(C)\n\nA spoil disposal site and an access route shall be restored and revegetated in accordance\nwith the Environmental Criteria Manual.\n\nSource: Section 13-7-20; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nA lot in the Edwards Aquifer recharge zone with private on-site sewage facilities\nmust demonstrate compliance with City Code Chapter 15-5 (Private Sewage Facilities).\n\n(B)\n\nLand application of treated wastewater effluent is prohibited:\n\n(1)\n\non a slope with a gradient of more than 15 percent;\n\n(2)\n\nin a critical water quality zone;\n\n(3)\n\nin a 100-year floodplain;\n\n(4)\n\non the trunk of trees required to be surveyed as prescribed in the Environmental Criteria\nManual;\n\n(5)\n\nin the buffer zone established around a critical environmental feature under Section 25-8-281 (Critical Environmental Features); or\n\n(6)\n\nduring wet weather conditions.\n\nSource: Section 13-7-30; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20170615-102, Pt. 22, 6-15-17.\n\nA certificate of occupancy may not be issued for development subject to this subchapter\nunless the development is in compliance with Chapter 6-5, Article 5 (Discharges Into Storm Sewers or Watercourses).\n\nSource: Section 13-7-24; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nBlasting on property located in the Edwards Aquifer recharge zone is prohibited in\na critical water quality zone or a water quality transition zone, unless the applicant\ndemonstrates that a feasible alternative does not exist.\n\n(B)\n\nBlasting is prohibited within 300 feet of a critical environmental feature, unless\nthe applicant demonstrates that a feasible alternative does not exist.\n\nSource: Section 13-7-31; Ord. 990225-70; Ord. 031211-11.\n\n**Editor's note—**\nOrd. No. 20221027-045, Pt. 31, adopted November 7, 2022, repealed § 25-8-364, which pertained to floodplain\nmodification and derived from Ord. 20131017-046; Ord. No. 20160922-048, Pt. 6, 10-3-16; Ord. No. 20170615-102, Pt. 23, 6-15-17.\n\n(A)\n\nDevelopment may not divert stormwater from one watershed to another, except as authorized\nby this section.\n\n(B)\n\nA proposed diversion of less than 20 percent of the site based on gross site area\nor less than 1 acre, whichever is smaller, may be allowed if the applicant demonstrates\nthat:\n\n(1)\n\nexisting drainage patterns are maintained to the extent feasible; and\n\n(2)\n\nthere are no adverse environmental or drainage impacts.\n\nSource: Ord. 20131017-046.\n\n(A)\n\nThis section establishes impervious cover restrictions for development of a public\nprimary or secondary educational facility.\n\n(B)\n\nIn watersheds other than an urban watershed or the Barton Spring Zone, the maximum\nimpervious cover in an upland zone is 50 percent of net site area or 60 percent of\nnet site area, if transfer of impervious cover is authorized and used.\n\n(C)\n\nIn an urban watershed, maximum impervious cover is the greater of:\n\n(1)\n\n65 percent gross site area; or\n\n(2)\n",
  "start_line": 54701,
  "end_line": 55832,
  "subsections": [
    "25-2-180-D",
    "25-2-180-E",
    "25-2-180-F",
    "25-2-180-G",
    "25-2-180-H",
    "25-2-180-I",
    "25-2-180-J",
    "25-2-180-K",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-C",
    "25-2-180-D",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-C",
    "25-2-180-D",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-C",
    "25-2-180-D",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-C",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-C",
    "25-2-180-D",
    "25-2-180-E",
    "25-2-180-F",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-C",
    "25-2-180-A",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-C",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-C",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-A",
    "25-2-180-B",
    "25-2-180-C"
  ]
}