{
  "id": "25-2-subchapter-D",
  "title": "NEIGHBORHOOD PLAN COMBINING DISTRICTS",
  "level": 1,
  "parent_id": null,
  "content": "## SUBCHAPTER D. - NEIGHBORHOOD PLAN COMBINING DISTRICTS.\n\nThis subchapter applies to property that is:\n\n(1)\n\nlocated in a neighborhood plan (NP) combining district; and\n\n(2)\n\nused or developed as a special use described in Section 25-2-1403 (Special Uses).\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nFor property used or developed as a special use described in Section 25-2-1403, (Special Uses):\n\n(1)\n\nthe regulations prescribed by this subchapter supersede the other provisions of Title 25 (Land Development) to the extent of conflict; and\n\n(2)\n\nthe following regulations do not apply:\n\n(a)\n\nSection 25-2-514 (Open Space Standards);\n\n(b)\n\nSection 25-2-775 (Townhouses); and\n\n(c)\n\nSection 25-2-776 (Condominium Residential Use).\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nThis section describes special uses for a NP combining district.\n\n(B)\n\nIn this subchapter:\n\n(1)\n\nNEIGHBORHOOD URBAN CENTER special use is the use of a designated area within a neighborhood\nfor commercial uses and townhouse, condominium, and multifamily residential uses.\n\n(2)\n\nCORNER STORE special use is the use of a site to provide goods or services to local\nresidents.\n\n(3)\n\nCOTTAGE special use is the use of a site of limited size for a single-family residential\ndwellings on lots at least 2,500 square feet in size.\n\n(4)\n\nNEIGHBORHOOD MIXED USE BUILDING special use is the use of a building for both commercial\nand residential uses.\n\n(5)\n\nRESIDENTIAL INFILL special use is the use of a designated area within a neighborhood\nfor predominately residential uses and limited commercial uses.\n\n(6)\n\nSECONDARY APARTMENT special use is the use of a developed single-family residential\nlot for a second dwelling.\n\n(7)\n\nURBAN HOME special use is the use of a site for a single-family residential dwelling\non a lot at least 3,500 square feet in size.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nIn this subchapter:\n\n(1)\n\nCOMMUNITY OPEN SPACE means open space that is available for use by the public, and\nincludes a plaza, square, park, playground, greenbelt or similar area.\n\n(2)\n\nPRIVATE OPEN SPACE means open space that is associated with a dwelling and intended\nto be used exclusively by the dwelling's residents.\n\n(B)\n\nThis subsection prescribes community open space requirements.\n\n(1)\n\nCommunity open space must be located within the boundaries of the special use for\nwhich it is required.\n\n(2)\n\nThe portion of a drainage or water quality facility that is usable by the public for\nrecreational purposes, as determined by the director of the Neighborhood Planning\nand Zoning Department, may be designated as community open space.\n\n(3)\n\nThe community open space requirements of this subchapter are in addition to the parkland\ndedication requirement of Chapter 25-4, Article 3, Division 5 (Parkland Dedication), if applicable.\n\n(C)\n\nThis subsection prescribes private open space requirements.\n\n(1)\n\nAn area of private open space on ground level must be at least 10 feet across in each\ndirection.\n\n(2)\n\nAn area of private open space above ground level must be at least five feet across\nin each direction.\n\nSource: Ord. 000406-81; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nThe City may consolidate an application to designate a neighborhood as a NP combining\ndistrict with an application to modify the zoning base district of an individual parcel\nwithin the neighborhood.\n\n(B)\n\nThis subsection applies if the City elects to consolidate applications under Subsection\n(A).\n\n(1)\n\nThe consolidated applications are considered one application for the purposes of notice\nand hearing.\n\n(2)\n\nFor a zoning protest relating to a designation of a neighborhood as a NP combining\ndistrict, the required percentage of land area is based on the boundaries and area\nof the entire proposed district.\n\n(3)\n\nFor a zoning protest relating to a modification of the zoning base district of an\nindividual parcel, the required percentage of land area is based on the boundaries\nand area of the individual parcel.\n\n(4)\n\nA separate council vote is required for:\n\n(a)\n\na protest under Paragraph (2); and\n\n(b)\n\neach protest under Paragraph (3).\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nAn ordinance zoning or rezoning property as a NP combining district:\n\n(1)\n\nmust prescribe the special uses described in Section 25-2-1403 (Special Uses) that are permitted in the district;\n\n(2)\n\nmust describe the location of each residential infill special use, neighborhood urban\ncenter special use, or neighborhood mixed use building special use, if any;\n\n(3)\n\nmay restrict the time of day during which a business in a neighborhood mixed use building\nspecial use may be open to the public;\n\n(4)\n\nmay restrict a corner store special use, cottage special use, secondary apartment\nspecial use, or urban home special use, if any, to a designated portion of the district;\n\n(5)\n\nfor a single-family residential use on an existing legal lot platted on or before\nAugust 15, 2024 or a secondary apartment special use on an existing legal lot:\n\n(a)\n\nmay reduce the required minimum lot area to 2,500 square feet;\n\n(b)\n\nmay reduce the required minimum lot width to 25 feet;\n\n(c)\n\nfor a lot with an area of 4,000 square feet or less, may increase the maximum impervious\ncoverage to 65 percent;\n\n(d)\n\na lot that is aggregated with other property to form a site may not be disaggregated\nto satisfy this subsection; and\n\n(6)\n\nmay apply the requirements of Section 25-2-1602 (Front Porch Setback), Section 25-2-1603 (Impervious Cover and Parking Placement Requirements), or Section 25-2-1604 (Garage Placement) to the district or a designated portion of the district;\n\n(7)\n\nmay restrict front yard parking by including all or a portion of the district in the\nrestricted parking area map described in Section 12-5-29 (Front or Side Yard Parking);\n\n(8)\n\nmay apply the requirements of Section 25-2-812(N) (Mobile Food Establishments) to the district or a designated portion of the district;\n\n(9)\n\nmay modify the following requirements of Subchapter F (Residential Design And Compatibility Standards) for the district or a designated portion of the district:\n\n(a)\n\nthe maximum floor-to-area ratio and maximum square footage of gross floor area prescribed\nby Subchapter F (Residential Design And Compatibility Standards);\n\n(b)\n\nthe maximum linear feet of gables or dormers protruding from the setback plane;\n\n(c)\n\nthe height of the side and rear setback planes;\n\n(d)\n\nthe minimum front yard setback requirement; and\n\n(10)\n\nmay apply the requirements of Section 25-2-1407 (Affordable Housing) to the district or a designated portion of the district.\n\nSource: Ord. 000406-81; Ord. 020718-83; 030424-57; Ord. 030925-64; Ord. 031211-11;\nOrd. 040325-Z-1; Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-020;\nOrd. 20060928-022; Ord. 20080618-093; Ord. 20080807-091; Ord. No. 20160303-036, Pt. 2, 3-14-16; Ord. No. 20240516-006, Pt. 7, 5-27-24.\n\n(A)\n\nThis section only applies to property that is subject to a NP combining district zoning\nor rezoning ordinance that applies the requirements of this section under Section 25-2-1406 (Ordinance Requirements).\n\n(B)\n\nA provision in this section applies only if:\n\n(1)\n\nthe director of the Neighborhood Housing and Community Development Department certifies\nthat the development complies with the City's S.M.A.R.T. Housing Program; and\n\n(2)\n\nten percent or more of the dwelling units are reserved for a period of not less than\n20 years for rental or purchase by an occupant whose gross household income does not\nexceed 60 percent of the median family income for the Austin metropolitan statistical\narea.\n\n(C)\n\nThis subsection applies in a single family residence standard lot (SF-2) district\nor single family residence (SF-3) district.\n\n(1)\n\nThe maximum impervious cover is 50 percent if the director of the Watershed Protection\nand Development Review Department determines that the development will not result\nin additional identifiable adverse flooding on other property.\n\n(2)\n\nA noncomplying structure may be replaced with a new structure if the new structure\ndoes not increase the existing degree of noncompliance with yard setbacks.\n\n(D)\n\nThis subsection applies to a duplex residential use.\n\n(1)\n\nThe minimum lot area is 5,750 square feet.\n\n(2)\n\nThe maximum impervious cover is 50 percent if the director of the Watershed Protection\nand Development Review Department determines that the development will not result\nin additional identifiable adverse flooding on other property.\n\n(3)\n\nA maximum of eight bedrooms are permitted.\n\n(E)\n\nThis subsection applies to a two family residential use.\n\n(1)\n\nThe minimum lot area is 5,750 square feet.\n\n(2)\n\nThe maximum impervious cover is 50 percent if the director of the Watershed Protection\nand Development Review Department determines that the development will not result\nin additional identifiable adverse flooding on other property.\n\n(3)\n\nThe second dwelling unit may not exceed a gross floor area of 850 square feet. All\nof the allowed gross floor area may be on the second story, if any. The gross floor\narea limitation does not apply to a lot with 7,000 or more square feet of area.\n\n(F)\n\nThis subsection applies to a secondary apartment special use.\n\n(1)\n\nThe maximum impervious cover is 50 percent if the director of the Watershed Protection\nand Development Review Department determines that the development will not result\nin additional identifiable adverse flooding on other property.\n\n(2)\n\nThe second dwelling unit may not exceed a gross floor area of 850 square feet. All\nof the allowed gross floor area may be on the second story, if any. The gross floor\narea limitation does not apply to a lot with 7,000 or more square feet of area.\n\nSource: Ord. 20080807-091.\n\nThis article applies to an urban home special use.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nAn urban home special use is permitted in the following zoning districts:\n\n(1)\n\nfamily residence (SF-3) district;\n\n(2)\n\nurban family residence (SF-5) district;\n\n(3)\n\ntownhouse and condominium residence (SF-6) district;\n\n(4)\n\nmultifamily residence limited density (MF-1) district;\n\n(5)\n\nmultifamily residence low density (MF-2) district;\n\n(6)\n\nmultifamily residence medium density (MF-3) district;\n\n(7)\n\nmultifamily residence moderate-high density (MF-4) district;\n\n(8)\n\nmultifamily residence high density (MF-5) district;\n\n(9)\n\nmultifamily residence highest density (MF-6) district; and\n\n(10)\n\nmixed use (MU) combining district.\n\nSource: Ord. 000406-81; Ord. 031211-11; Ord. 041118-57.\n\nFor an urban home special use development of more than eight lots, 250 square feet\nof community open space for each lot is required.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nFor an urban home special use:\n\n(1)\n\nthe minimum lot size is 3,500 square feet;\n\n(2)\n\nthe minimum lot width is 35 feet;\n\n(3)\n\nthe maximum height of a structure is 35 feet;\n\n(4)\n\nthe minimum street side yard setback is 10 feet;\n\n(5)\n\nthe minimum interior side yard setback is 5 feet;\n\n(6)\n\nthe minimum rear yard setback is 5 feet;\n\n(7)\n\nthe maximum building coverage is 55 percent; and\n\n(8)\n\nthe maximum impervious coverage is:\n\n(a)\n\nthe percentage prescribed by the zoning base district site development regulations;\nor\n\n(b)\n\nfor a lot with an area of not more than 4,000 square feet, 65 percent.\n\n(B)\n\nExcept as otherwise provided in this subsection, the minimum front yard setback is\n20 feet.\n\n(1)\n\nIf urban home special uses are proposed for the entire length of a block face, the\nminimum front yard setback is 15 feet.\n\n(2)\n\nFor an urban home special use that adjoins a legally developed lot with a front yard\nsetback of less than 25 feet, the minimum front yard setback is equal to the average\nof the front yard setbacks applicable to adjoining lots.\n\n(C)\n\nFor an urban home special use with a front driveway:\n\n(1)\n\nthe garage, if any, must be at least five feet behind the front façade of the principal\nstructure; and\n\n(2)\n\nfor a garage within 20 feet of the front façade, the width of the garage may not exceed\n50 percent of the width of the front façade.\n\n(D)\n\nThe maximum driveway width in a front yard or street side yard is:\n\n(1)\n\n12 feet; or\n\n(2)\n\nif the driveway serves two or more dwelling units;\n\n(a)\n\n18 feet for a one-way driveway; or\n\n(b)\n\n24 feet for a two-way driveway.\n\n(E)\n\nOther than in a driveway, parking is not permitted in a front yard of an urban home\nspecial use.\n\n(F)\n\nThe main entrance of an urban home special use must face the front lot line, except\non a flag lot.\n\n(G)\n\nA covered front porch at entry level is required for an urban home special use, except\non a flag lot.\n\n(1)\n\nThe minimum depth of the porch is five feet.\n\n(2)\n\nThe minimum width of the porch is 50 percent of the width of the building façade.\n\n(H)\n\nTwo hundred square feet of private open space is required for each dwelling.\n\nSource: Ord. 000406-81; Ord. 030424-57; Ord. 031211-11.\n\nThis article applies to a cottage special use.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nA cottage special use is permitted in the following zoning districts:\n\n(1)\n\nfamily residence (SF-3) district;\n\n(2)\n\nurban family residence (SF-5) district;\n\n(3)\n\ntownhouse and condominium residence site (SF-6) district;\n\n(4)\n\nmultifamily residence limited density (MF-1) district;\n\n(5)\n\nmultifamily residence low density (MF-2) district;\n\n(6)\n\nmultifamily residence medium density (MF-3) district;\n\n(7)\n\nmultifamily residence moderate-high density (MF-4) district;\n\n(8)\n\nmultifamily residence high density (MF-5) district;\n\n(9)\n\nmultifamily residence highest density (MF-6) district; and\n\n(10)\n\nmixed use (MU) combining district.\n\nSource: Ord. 000406-81; Ord. 031211-11; Ord. 041118-57.\n\n(A)\n\nA cottage special use development may not exceed two acres in size.\n\n(B)\n\nFor a cottage special use development of more than eight lots, 250 square feet of\ncommunity open space is required for each lot. The community open space requirement\nis in addition to the parkland dedication requirement of Chapter 25-4, Article 3, Division 5 (Parkland Dedication).\n\nSource: Ord. 000406-81; Ord. 030424-57; Ord. 031211-11.\n\n(A)\n\nFor a cottage special use:\n\n(1)\n\nthe minimum lot width is 30 feet;\n\n(2)\n\nthe maximum height of a structure is 35 feet;\n\n(3)\n\nthe minimum front yard setback is 15 feet;\n\n(4)\n\nthe minimum street side yard setback is 10 feet;\n\n(5)\n\nthe minimum interior side yard setback is 5 feet;\n\n(6)\n\nthe minimum rear yard setback is 5 feet;\n\n(7)\n\nthe maximum building coverage is 55 percent; and\n\n(8)\n\nthe maximum impervious coverage is:\n\n(a)\n\nthe percentage prescribed by the base zoning district site development regulations;\nor\n\n(b)\n\nfor a lot with an area of not more than 4,000 square feet, 65 percent.\n\n(B)\n\nThe minimum lot area for a cottage special use is:\n\n(1)\n\n2,500 square feet; or\n\n(2)\n\n3,500 square feet for a lot that is located in a SF-3 district; and\n\n(a)\n\nis a corner lot; or\n\n(b)\n\nadjoins a lot that is:\n\n(i)\n\nzoned SF-3;\n\n(ii)\n\nhas a lot area of at least 5,750 square feet; and\n\n(iii)\n\nis developed as a single-family residence.\n\n(C)\n\nFor a cottage special use with a front driveway, a garage, if any, must be at least\nfive feet behind the front façade of the principal structure.\n\n(D)\n\nThe maximum driveway width in a front yard or street side yard is:\n\n(1)\n\n12 feet; or\n\n(2)\n\nif the driveway serves two or more dwelling units:\n\n(a)\n\n18 feet for a one-way driveway; or\n\n(b)\n\n24 feet for a two-way driveway.\n\n(E)\n\nOther than in a driveway, parking is not permitted in a front yard of a cottage special\nuse.\n\n(F)\n\nThe main entrance of the principal structure must face the front lot line, except\non a flag lot.\n\n(G)\n\nA covered front porch at entry level is required for a cottage special use, except\non a flag lot.\n\n(1)\n\nThe minimum depth of the porch is five feet.\n\n(2)\n\nThe minimum width of the porch is 50 percent of the width of the front façade.\n\n(H)\n\nTwo hundred square feet of private open space is required for each dwelling.\n\nSource: Ord. 000406-81; Ord. 030424-57; Ord. 031211-11.\n\nThis article applies to a secondary apartment special use.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nA secondary apartment special use is permitted in the following zoning districts:\n\n(1)\n\nsingle-family residence large lot (SF-1) district;\n\n(2)\n\nsingle-family residence standard lot (SF-2) district;\n\n(3)\n\nfamily residence (SF-3) district;\n\n(4)\n\nurban family residence (SF-5) district;\n\n(5)\n\ntownhouse and condominium residence (SF-6) district;\n\n(6)\n\nmultifamily residence limited density (MF-1) district;\n\n(7)\n\nmultifamily residence low density (MF-2) district;\n\n(8)\n\nmultifamily residence medium density (MF-3) district;\n\n(9)\n\nmultifamily residence moderate-high density (MF-4) district;\n\n(10)\n\nmultifamily residence high density (MF-5) district;\n\n(11)\n\nmultifamily residence highest density (MF-6) district; and\n\n(12)\n\nmixed use (MU) combining district.\n\nSource: Ord. 000406-81; Ord. 031211-11; Ord. 041118-57.\n\n(A)\n\nA secondary apartment is not permitted in combination with a cottage or urban home\nspecial use.\n\n(B)\n\nA secondary apartment must be located in a structure other than the principal structure.\n\n(C)\n\nThe secondary apartment:\n\n(1)\n\nmust be contained in a structure other than the principal structure;\n\n(2)\n\nmust be located:\n\n(a)\n\nat least 10 feet to the rear or side of the principal structure; or\n\n(b)\n\nabove a detached garage;\n\n(3)\n\nmay be connected to the principal structure by a covered walkway;\n\n(4)\n\nmay not exceed a height of 30 feet, and is limited to two stories;\n\n(5)\n\nmay not exceed:\n\n(a)\n\n1,100 total square feet or a floor-to-area ratio of 0.15, whichever is smaller; and\n\n(b)\n\n550 square feet on the second story, if any.\n\n(D)\n\nImpervious cover for the site may not exceed 45 percent.\n\n(E)\n\nBuilding cover for the site may not exceed 40 percent.\n\nSource: Ord. 000406-81; Ord. 031120-44; Ord. 031211-11; Ord. 041118-59; Ord. No. 20151119-080, Pt. 2, 11-30-15; Ord. No. 20250227-039, Pt. 3, 10-1-25.\n\nThis article applies to a corner store special use.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nA corner store special use is permitted in the following base districts:\n\n(1)\n\nfamily residence (SF-3) district;\n\n(2)\n\nurban family residence (SF-5) district;\n\n(3)\n\ntownhouse and condominium residence (SF-6) district;\n\n(4)\n\nmultifamily residence limited density (MF-1) district;\n\n(5)\n\nmultifamily residence low density (MF-2) district;\n\n(6)\n\nmultifamily residence medium density (MF-3) district;\n\n(7)\n\nmultifamily residence moderate-high density (MF-4) district;\n\n(8)\n\nmultifamily residence high density (MF-5) district; and\n\n(9)\n\nmultifamily residence highest density (MF-6) district.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nA corner store special use is limited to the following commercial uses:\n\n(1)\n\nart gallery;\n\n(2)\n\nconsumer convenience services;\n\n(3)\n\nconsumer repair services;\n\n(4)\n\nfood sales;\n\n(5)\n\ngeneral retail sales (convenience);\n\n(6)\n\npersonal services;\n\n(7)\n\nrestaurant (general); and\n\n(8)\n\nrestaurant (limited).\n\n(B)\n\nA maximum of one dwelling unit is permitted in a corner store structure.\n\nSource: Ord. 000406-81; Ord. 031211-11; Ord. 040617-Z-1.\n\n(A)\n\nA corner store must be located at a street intersection.\n\n(B)\n\nA corner store may not be located within 600 feet of another corner store.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nFor a corner store special use:\n\n(1)\n\nthe minimum lot area is 5,750 square feet;\n\n(2)\n\nthe minimum lot width is 50 feet;\n\n(3)\n\nthe maximum building height is 35 feet;\n\n(4)\n\nthe minimum front yard setback is 5 feet;\n\n(5)\n\nthe maximum front yard setback is 15 feet;\n\n(6)\n\nthe minimum street side yard setback is 10 feet;\n\n(7)\n\nthe minimum interior side yard setback is 5 feet;\n\n(8)\n\nthe minimum rear yard setback is 10 feet;\n\n(9)\n\nthe maximum building coverage is the lesser of 55 percent or 3,000 square feet; and\n\n(10)\n\nthe maximum impervious coverage is 65 percent.\n\n(B)\n\nA corner store may not include a drive through facility.\n\n(C)\n\nA corner store may not be open to the public between the hours of 11:00 p.m. and 6:00\na.m.\n\n(D)\n\nExterior lighting:\n\n(1)\n\nmust be hooded or shielded so that the light source is not directly visible across\nthe source property line; and\n\n(2)\n\nmay not exceed 0.4 foot candles across the source property line.\n\n(E)\n\nA building façade:\n\n(1)\n\nmay not extend horizontally in an unbroken line for more than 30 feet;\n\n(2)\n\nmust include windows, balconies, porches, stoops, or similar architectural features;\n\n(3)\n\nmust have awnings along at least 50 percent of the length of the ground floor façade;\nand\n\n(4)\n\nat least 50 percent of the wall area of the ground floor façade must consist of doors\nor clear or lightly tinted windows.\n\n(F)\n\nA street yard of 1,000 square feet or less is not required to be landscaped, and a\nparking area with 12 or fewer parking spaces is not required to have landscaped islands,\npeninsulas, or medians.\n\n(G)\n\nThe outdoor seating area, if any, for a restaurant (limited) use may not exceed 50\npercent of the indoor seating area.\n\nSource: Ord. 000406-81; Ord. 030424-57; Ord. 031211-11; Ord. 031211-41.\n\nThis article applies to a neighborhood mixed use building special use.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nA neighborhood mixed use building special use is permitted in the following zoning\nbase districts:\n\n(1)\n\nlimited office (LO) district;\n\n(2)\n\ngeneral office (GO) district;\n\n(3)\n\nneighborhood commercial (LR) district;\n\n(4)\n\ncommunity commercial (GR) district;\n\n(5)\n\ngeneral commercial services (CS) district;\n\n(6)\n\ncommercial-liquor sales (CS-1) district;\n\n(7)\n\ncommercial highway services (CH) district; and\n\n(8)\n\nlimited industrial services (LI) district.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nA neighborhood mixed use building special use must contain a residential use.\n\n(B)\n\nA residential use in a neighborhood mixed use building special use may be located:\n\n(1)\n\nabove the ground floor; and\n\n(2)\n\nin not more than 50 percent of the gross floor area of the ground floor.\n\n(C)\n\nFor a multi-story building, not less than 50 percent of the gross floor area above\nthe ground floor must be used for a residential use.\n\nSource: Ord. 000406-81; Ord. 031211-11; Ord. 20080424-029.\n\n(A)\n\nFor a neighborhood mixed use building special use:\n\n(1)\n\nthe maximum site area is one acre;\n\n(2)\n\nthe minimum lot size is 5,750 square feet;\n\n(3)\n\nthe minimum lot width is 50 feet;\n\n(4)\n\nthe minimum street side yard setback is 10 feet;\n\n(5)\n\nthe minimum front yard setback is:\n\n(a)\n\n5 feet; or\n\n(b)\n\nfor a LO or LR district, 10 feet; and\n\n(6)\n\nthe maximum front yard setback is:\n\n(a)\n\n10 feet; or\n\n(b)\n\nfor a LO or LR district, 15 feet.\n\n(B)\n\nFor a neighborhood mixed use building special use adjacent to a roadway with not more\nthan two lanes, the building height may not exceed 40 feet.\n\n(C)\n\nThe building façade of a neighborhood mixed use building:\n\n(1)\n\nmay not extend horizontally in an unbroken line for more than 30 feet;\n\n(2)\n\nmust include windows, balconies, porches, stoops, or similar architectural features;\n\n(3)\n\nmust have awnings along at least 50 percent of the length of the ground floor façade;\nand\n\n(4)\n\nat least 50 percent of the wall area of the ground floor façade must consist of doors\nor windows with a visible light transmittance rating of 0.6 or higher.\n\n(D)\n\nThis subsection prescribes parking requirements:\n\n(1)\n\nParking in front of a neighborhood mixed use building, other than on a street, is\nprohibited.\n\n(2)\n\nAt least 50 percent of any parking that is provided must be located to the rear of\nthe building.\n\n(E)\n\nExterior lighting:\n\n(1)\n\nmust be shielded so that the light source is not directly visible across the source\nproperty line; and\n\n(2)\n\nmay not exceed 0.4 foot candles across the source property line.\n\n(F)\n\nA street yard of 1,000 square feet or less is not required to be landscaped, and a\nparking area with 12 or fewer parking spaces is not required to have landscaped islands,\npeninsulas, or medians.\n\n(G)\n\nA neighborhood mixed use building may not include a drive through facility.\n\nSource: Ord. 000406-81; Ord. 030424-57; Ord. 031211-11; Ord. No. 20231102-028, Pt. 24, 11-13-23.\n\n(A)\n\nA person may not use or develop property as a residential infill or neighborhood urban\ncenter special use unless the Planning Commission approves a development plan under\nthis division.\n\n(B)\n\nA development plan must include:\n\n(1)\n\nthe locations of land uses, number of dwelling units, and approximate gross floor\narea of each use;\n\n(2)\n\nthe layout of the transportation network;\n\n(3)\n\nthe location, size, and type of each community open space area;\n\n(4)\n\nthe location and type of each drainage or water quality control facility;\n\n(5)\n\nthe location of the 100-year flood plain;\n\n(6)\n\nthe location of each critical environmental feature; and\n\n(7)\n\nadditional information required by the director of the Neighborhood Planning and Zoning\nDepartment to demonstrate compliance with this subchapter.\n\nSource: Ord. 000406-81; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nAn applicant must submit the development plan to the director of the Neighborhood\nPlanning and Zoning Department.\n\n(B)\n\nThe director of the Neighborhood Planning and Zoning Department shall review the development\nplan and make a recommendation to the Planning Commission.\n\n(C)\n\nThe Planning Commission shall approve the development plan after a determination that\nthe plan meets the requirements of Section 25-2-1523 (Development Plan Approval Criteria).\n\n(D)\n\nIf the Planning Commission denies the development plan, the commission shall identify\nthe basis of the denial.\n\nSource: Ord. 000406-81; Ord. 010329-18; Ord. 031211-11.\n\nA development plan must:\n\n(1)\n\ndemonstrate compliance with the requirements of Division 2 (Residential Infill Special\nUse) or Division 3 (Neighborhood urban center Special Use), as applicable;\n\n(2)\n\nbe designed to promote pedestrian activity and the use of mass transit;\n\n(3)\n\npropose building height, bulk, and scale that is compatible with adjacent single-family\ndevelopment, if any; and\n\n(4)\n\ninclude high quality community open space as an organizing feature.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), the approval of the Planning Commission is required\nto revise a development plan. The revision must comply with Section 25-2-1523 (Development Plan Approval Criteria).\n\n(B)\n\nThe director of the Neighborhood Planning and Zoning Department may approve a minor\nrevision to a development plan if the director of the Neighborhood Planning and Zoning\nDepartment determines that the revised plan complies with the applicable requirements\nof this subchapter. The following are minor revisions:\n\n(1)\n\na change in the location of a land use, if the director of the Neighborhood Planning\nand Zoning Department determines that the basic layout of the development plan remains\nthe same, and that the proposed change does not negatively affect existing adjacent\nland uses;\n\n(2)\n\na reduction in the number of dwelling units;\n\n(3)\n\na reduction in the total gross floor area of the commercial uses;\n\n(4)\n\na change in the mix of residential uses;\n\n(5)\n\na change in the transportation network if the director of the Neighborhood Planning\nand Zoning Department determines that the basic layout of the development plan remains\nthe same;\n\n(6)\n\na change in the size or location of community open space, if the director of the Neighborhood\nPlanning and Zoning Department determines that the quality and functionality of the\noverall community open space is not reduced;\n\n(7)\n\na change in the location or type of a drainage or water quality control facility,\nif the director of the Neighborhood Planning and Zoning Department determines that\nthe basic layout of the development plan remains the same;\n\n(8)\n\na change in the location or type of an critical environmental feature, if the director\nof the Neighborhood Planning and Zoning Department determines that the revision more\naccurately describes the feature; and\n\n(9)\n\na change in the location of a 100-year floodplain, if the director of the Neighborhood\nPlanning and Zoning Department determines that the revision more accurately describes\nthe floodplain.\n\n(C)\n\nAn interested party may appeal the director of the Neighborhood Planning and Zoning\nDepartment's decision under Subsection (B) to the Planning Commission.\n\nSource: Ord. 000406-81; Ord. 010329-18; Ord. 031211-11.\n\nThis division applies to a residential infill special use.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nA residential infill special use is permitted in the following zoning base districts:\n\n(1)\n\nfamily residence (SF-3) district;\n\n(2)\n\nurban family residence (SF-5) district;\n\n(3)\n\ntownhouse and condominium residence (SF-6) district;\n\n(4)\n\nmultifamily residence limited density (MF-1) district;\n\n(5)\n\nmultifamily residence low density (MF-2) district;\n\n(6)\n\nmultifamily residence medium density (MF-3) district;\n\n(7)\n\nmultifamily residence moderate-high density (MF-4) district;\n\n(8)\n\nmultifamily residence high density (MF-5) district;\n\n(9)\n\nmultifamily residence highest density (MF-6) district; and\n\n(10)\n\nlimited industrial services (LI) district.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nA residential infill special use is limited to the land uses prescribed by this section.\n\n(B)\n\nThe following residential uses are permitted:\n\n(1)\n\nsingle family residential;\n\n(2)\n\nduplex residential;\n\n(3)\n\ntownhouse residential;\n\n(4)\n\ncondominium residential;\n\n(5)\n\nmultifamily residential;\n\n(6)\n\nurban home special use, in accordance with Article 2 (Urban Home Special Use);\n\n(7)\n\ncottage special use, in accordance with Article 3 (Cottage Special Use); and\n\n(8)\n\nsecondary apartment special use, in accordance with Article 4 (Secondary Apartment Special Use).\n\n(C)\n\nThe following commercial uses are permitted:\n\n(1)\n\nart gallery;\n\n(2)\n\nconsumer convenience services;\n\n(3)\n\nconsumer repair services;\n\n(4)\n\nfood sales;\n\n(5)\n\ngeneral retail sales (convenience);\n\n(6)\n\npersonal services;\n\n(7)\n\nrestaurant (general) without drive-in service; and\n\n(8)\n\nrestaurant (limited) without drive-in service.\n\n(D)\n\nThe civic uses described in Section 25-2-6 (Civic Uses Described) are permitted in accordance with the requirements of the zoning base district.\n\nSource: Ord. 000406-81; Ord. 031211-11; Ord. 031211-41; Ord. 040617-Z-1.\n\n(A)\n\nA residential infill special use development must have a site area of:\n\n(1)\n\nat least one acre; and\n\n(2)\n\nnot more than 40 acres.\n\n(B)\n\nThis subsection prescribes land use allocation requirements for a residential infill\nspecial use development.\n\n(1)\n\nCommercial uses are limited to 1,000 square feet of gross floor area for each full\nacre included in the residential infill special use development.\n\n(2)\n\nAt least 40 percent, and not more than 80 percent, of the dwelling units must be a\nsingle-family residential use, cottage special use, or urban home special use.\n\n(3)\n\nNot more than 20 percent of the dwelling units may be cottage special uses.\n\n(4)\n\nNot more than 10 percent of the dwelling units may be duplex residential uses.\n\n(5)\n\nAt least 10 percent of the dwelling units must be townhouse or multifamily uses.\n\n(6)\n\nNot more than 20 percent of the dwelling units may be a multifamily use other than\na condominium use.\n\n(7)\n\nFor a development of not more than five acres, at least 10 percent of the development's\narea must be community open space.\n\n(8)\n\nFor a development of more than five acres, at least 20 percent of the development's\narea must be community open space.\n\n(C)\n\nSingle-family residential uses are required for the portion of the development that\nadjoins land that is:\n\n(1)\n\nzoned SF-3 or more restrictive; or\n\n(2)\n\nused for a use permitted in a SF-3 or more restrictive district.\n\nSource: Ord. 000406-81; Ord. 030424-57; Ord. 031211-11.\n\nFor a duplex residential use:\n\n(1)\n\nthe minimum lot area is 5,750 square feet;\n\n(2)\n\nthe minimum lot width is 50 feet;\n\n(3)\n\nthe minimum front setback is 15 feet;\n\n(4)\n\nthe minimum street side setback is 10 feet;\n\n(5)\n\nthe minimum interior side yard setback is five feet;\n\n(6)\n\nthe minimum rear yard setback is five feet;\n\n(7)\n\nthe maximum height is 35 feet;\n\n(8)\n\nthe maximum building coverage is 50 percent; and\n\n(9)\n\nthe maximum impervious coverage is 55 percent.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nFor a townhouse residential use:\n\n(1)\n\nthe minimum lot area is 2,000 square feet;\n\n(2)\n\nthe minimum lot width is 20 feet;\n\n(3)\n\nthe minimum front setback is five feet;\n\n(4)\n\nthe maximum front setback is 10 feet;\n\n(5)\n\nthe minimum street side setback is 10 feet;\n\n(6)\n\nthe minimum interior side yard setback is zero feet;\n\n(7)\n\nthe minimum rear yard setback is five feet;\n\n(8)\n\nthe maximum building height is 35 feet;\n\n(9)\n\nthe maximum building coverage is 55 percent; and\n\n(10)\n\nthe maximum impervious coverage is 65 percent.\n\n(B)\n\nThe finished floor elevation of the first floor of a townhouse must be at least 18\ninches above the elevation of the sidewalk at the front lot line.\n\n(C)\n\nA townhouse group is limited to 10 townhouses.\n\n(D)\n\nVehicular access to a townhouse group must be:\n\n(1)\n\nthrough a public alley or dedicated access easement at the rear of the group; or\n\n(2)\n\nthrough a single front driveway that provides access to the rear of the group.\n\n(E)\n\nOther than in a garage, parking is permitted only at the rear of a townhouse. A parking\narea must be screened from the street.\n\n(F)\n\nA lot may contain not more than one townhouse.\n\n(G)\n\nTwo hundred square feet of private open space is required for each townhouse.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nFor a multifamily residential use, including a condominium residential use:\n\n(1)\n\nthe minimum lot area is 5,750 square feet;\n\n(2)\n\nthe minimum lot width is 50 feet;\n\n(3)\n\nthe maximum front setback is 10 feet;\n\n(4)\n\nthe minimum front setback is five feet;\n\n(5)\n\nthe minimum street side yard setback is 10 feet;\n\n(6)\n\nthe minimum interior side yard setback is five feet;\n\n(7)\n\nthe minimum rear yard setback is 10 feet;\n\n(8)\n\nthe maximum building height is 35 feet;\n\n(9)\n\nthe maximum building coverage is 55 percent;\n\n(10)\n\nthe maximum impervious coverage is 65 percent;\n\n(11)\n\nthe maximum building footprint is 4,000 square feet; and\n\n(12)\n\na building may contain not more than 12 dwelling units.\n\n(B)\n\nOne hundred square feet of private open space is required for each multifamily dwelling.\n\n(C)\n\nTwo hundred square feet of private open space is required for each condominium dwelling.\n\n(D)\n\nParking is not permitted in a front yard.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nFor a commercial use:\n\n(1)\n\nthe minimum lot area is 2,500 square feet;\n\n(2)\n\nthe minimum lot width is 30 feet;\n\n(3)\n\nthe maximum front yard setback is 10 feet;\n\n(4)\n\nthe minimum front yard setback is five feet;\n\n(5)\n\nthe minimum street side yard setback is 10 feet;\n\n(6)\n\nthe minimum interior yard setback is five feet;\n\n(7)\n\nthe minimum rear yard setback is 10 feet;\n\n(8)\n\nthe maximum building height is 35 feet;\n\n(9)\n\nthe maximum building coverage is 55 percent;\n\n(10)\n\nthe maximum impervious cover is 65 percent; and\n\n(11)\n\nthe maximum building footprint is 5,000 square feet.\n\n(B)\n\nA commercial use may not be open to the public between the hours of 11:00 p.m. and\n6:00 a.m.\n\n(C)\n\nThe outdoor seating area, if any, for a restaurant (limited) use may not exceed 50\npercent of the indoor seating area.\n\nSource: Ord. 000406-81; Ord. 031211-11; Ord. 031211-41.\n\nNot more than 50 percent of the community open space may be plazas or squares.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nThis division applies to a neighborhood urban center special use.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nA neighborhood urban center special use is permitted in the following zoning base\ndistricts:\n\n(1)\n\nlimited office (LO) district;\n\n(2)\n\ngeneral office (GO) district;\n\n(3)\n\nneighborhood commercial (LR) district;\n\n(4)\n\ncommunity commercial (GR) district;\n\n(5)\n\ngeneral commercial services (CS) district;\n\n(6)\n\ncommercial-liquor sales (CS-1) district; and\n\n(7)\n\nlimited industrial services (LI) district.\n\nSource: Ord. 000406-81; 030424-57; Ord. 031211-11.\n\n(A)\n\nA neighborhood urban center special use is limited to the land uses prescribed by\nthis section.\n\n(B)\n\nThe following residential uses are permitted:\n\n(1)\n\ntownhouse residential;\n\n(2)\n\ncondominium residential; and\n\n(3)\n\nmultifamily residential.\n\n(C)\n\nA commercial use is permitted, conditional, or prohibited as prescribed by the base\nzoning district regulations, except that a use with a drive-in service is prohibited\nand a service station use allowed as a permitted use is a conditional use.\n\n(D)\n\nThe civic uses described in Section 25-2-6 (Civic Uses Described) are permitted in accordance with the requirements of the zoning base district.\n\nSource: Ord. 000406-81; Ord. 030424-57; Ord. 031211-11.\n\n(A)\n\nA neighborhood urban center special use development must have a site area of:\n\n(1)\n\nat least one acre; and\n\n(2)\n\nnot more than 40 acres.\n\n(B)\n\nThis subsection prescribes land use allocation requirements for a neighborhood urban\ncenter special use development.\n\n(1)\n\nAt least 10 percent of the development's gross floor area must be used for commercial\nuses.\n\n(2)\n\nAt least 25 percent of the development's gross floor area must be used for residential\nuses.\n\n(3)\n\nAt least 20 percent of the development's dwelling units must be townhouses or condominiums.\n\n(4)\n\nFor a project of not more than 5 acres, at least 10 percent of the development's area\nmust be community open space.\n\n(5)\n\nFor a development of more than 5 acres, at least 20 percent of the development's area\nmust be community open space.\n\nSource: Ord. 000406-81; Ord. 030424-57; Ord. 031211-11.\n\n(A)\n\nFor a townhouse residential use:\n\n(1)\n\nthe minimum lot area is 2,000 square feet;\n\n(2)\n\nthe minimum lot width is 20 feet;\n\n(3)\n\nthe minimum front setback is five feet;\n\n(4)\n\nthe maximum front setback is 10 feet;\n\n(5)\n\nthe minimum street side setback is 10 feet;\n\n(6)\n\nthe minimum interior side yard setback is zero feet;\n\n(7)\n\nthe minimum rear yard setback is five feet;\n\n(8)\n\nthe maximum building height is 35 feet;\n\n(9)\n\nthe maximum building coverage is 55 percent; and\n\n(10)\n\nthe maximum impervious coverage is 65 percent.\n\n(B)\n\nThe finished floor elevation of the first floor of a townhouse must be at least 18\ninches above the elevation of the sidewalk at the front lot line.\n\n(C)\n\nVehicular access to a townhouse group must be:\n\n(1)\n\nthrough a public alley or dedicated access easement at the rear of the group; or\n\n(2)\n\nthrough a single front driveway that provides access to the rear of the group.\n\n(D)\n\nOther than in a garage, parking is permitted only at the rear of a townhouse. A parking\narea must be screened from the street.\n\n(E)\n\nA lot may contain not more than one townhouse.\n\n(F)\n\nTwo hundred square feet of private open space is required for each townhouse.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nFor a multifamily residential use, including a condominium use:\n\n(1)\n\nthe minimum lot size is 3,500 square feet;\n\n(2)\n\nthe minimum lot width is 50 feet;\n\n(3)\n\nthe maximum height is 60 feet;\n\n(4)\n\nthe maximum front setback is 10 feet;\n\n(5)\n\nthe minimum front setback is five feet;\n\n(6)\n\nthe minimum street side yard setback is 10 feet;\n\n(7)\n\nthe minimum interior side yard setback is five feet;\n\n(8)\n\nthe minimum rear yard setback is 10 feet;\n\n(9)\n\nthe maximum building coverage is 70 percent;\n\n(10)\n\nthe maximum impervious coverage is 80 percent; and\n\n(11)\n\nthe maximum building footprint is 5,000 square feet.\n\n(B)\n\nOne hundred square feet of private open space is required for each multifamily dwelling.\n\n(C)\n\nTwo hundred square feet of private open space is required for each condominium dwelling.\n\n(D)\n\nParking is not permitted in a front yard.\n\nSource: Ord. 000406-81; Ord. 030424-57; Ord. 031211-11; Ord. No. 20231102-028, Pt. 25, 11-13-23.\n\nFor a commercial use:\n\n(1)\n\nthe minimum lot size is 3,500 square feet;\n\n(2)\n\nthe minimum lot width is 50 feet;\n\n(3)\n\nthe maximum height is 60 feet;\n\n(4)\n\nthe maximum front yard setback is 10 feet;\n\n(5)\n\nthe minimum front yard setback is five feet; and\n\n(6)\n\nthe minimum street side yard setback is 10 feet.\n\nSource: Ord. 000406-81; Ord. 030424-57; Ord. 031211-11.\n\nThis division prescribes additional development requirements for residential infill\nand neighborhood urban center special uses.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nIn addition to other community open space requirements prescribed by this subchapter:\n\n(1)\n\neach community open space area must be at least 500 square feet in size and at least\n20 feet across in each direction;\n\n(2)\n\nthe aggregate impervious cover for all community open spaces may not exceed 50 percent;\nand\n\n(3)\n\na plaza or square may not exceed 90 percent impervious cover.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nDrive-through facilities and other facilities that allow people to remain in vehicles\nwhile receiving products or services are prohibited. This prohibition does not apply\nto the fueling facilities of a service station.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nThe compatibility standards of Chapter 25-2, Article 10 (Compatibility Standards) apply only to property along the perimeter of an area used or developed as a residential\ninfill or neighborhood urban center special use.\n\n(B)\n\nWithin an area used or developed as a residential infill or neighborhood urban center\nspecial use, the compatibility standards of Section 25-3-86 (Compatibility Standards) apply.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\n(A)\n\nA new road within a residential infill or neighborhood urban center special use project\nmust comply with the roadway design standards of the Traditional Neighborhood District\nCriteria Manual.\n\n(B)\n\nThe director of the Neighborhood Planning and Zoning Department may approve the use\nof an innovative roadway design that is not described in the Traditional Neighborhood\nDistrict Criteria Manual.\n\nSource: Ord. 000406-81; Ord. 010329-18; Ord. 031211-11.\n\n**Editor's note—**\nOrd. No. 20231102-028, Pt. 26, effective November 13, 2023, repealed § 25-2-1566, which pertained to commercial\nuse parking requirements and derived from Ord. 000406-81; Ord. 031211-11.\n\nA residential use may be located above the ground floor of a commercial building.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nThe building façade of a commercial building or a multifamily residential building:\n\n(1)\n\nmay not extend horizontally in an unbroken line for more than 30 feet;\n\n(2)\n\nmust include windows, balconies, porches, stoops, or similar architectural features;\n\n(3)\n\nmust have awnings along at least 50 percent of the length of the ground floor building\nfaçade; and\n\n(4)\n\nat least 50 percent of the wall area of the ground floor building façade must consist\nof doors or clear or lightly tinted windows.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nA street yard of 1,000 square feet or less is not required to be landscaped, and a\nparking area with 12 or fewer parking spaces is not required to have landscaped islands,\npeninsulas, or medians.\n\nSource: Ord. 000406-81; Ord. 031211-11.\n\nA section in this article applies to a NP combining district or a designated portion\nof a district only if the ordinance establishing the district provides for applicability\nin accordance with Section 25-2-1406 (Ordinance Requirements).\n\nSource: Ord. 030925-64; Ord. 031211-11.\n\n(A)\n\nThis section applies to a single-family residential use, a duplex residential use,\nor a two-family residential use.\n\n(B)\n\nIn this section, \"porch\" means a porch that is open on three sides and that may have\na roof.\n\n(C)\n\nSubject to the limitations of this section, a porch may project into a front yard.\n\n(D)\n\nExcept as provided in Subsection (E), the porch must be at least 15 feet from the\nfront lot line.\n\n(E)\n\nA porch roof overhang or porch step must be at least 13 feet from the front lot line.\n\nSource: Ord. 030925-64; Ord. 031211-11\n\n(A)\n\nThis section applies to a single-family residential use, a duplex residential use,\nor a two-family residential use.\n\n(B)\n\nExcept as provided in Subsection (C), impervious cover in a front yard may not exceed\n40 percent.\n\n(C)\n\nThe director may waive Subsection (B) if the director determines backing a motor vehicle\nonto the adjacent roadway is unsafe and that a circular driveway or turnaround in\nthe front yard is required.\n\n(D)\n\nNot more than four parking spaces may be located in the front street yard, or for\na corner lot, not more than four parking spaces may be located in the front street\nyard and side street yard combined.\n\nSource: Ord. 030925-64; Ord. 031211-11.\n\n(A)\n\nThis section applies to a single-family residential use, a duplex residential use,\nor a two-family residential use.\n\n(B)\n\nIn this section:\n\n(1)\n\nBUILDING FAÇADE means the front-facing exterior wall or walls of the first floor of\nthe principal structure on a lot, and the term excludes the building façade of the\nportion of the principal structure designed or used as a parking structure. Projections\nfrom front-facing exterior walls, including but not limited to eaves, chimneys, porches,\nstoops, box or bay windows, and other similar features as determined by the building\nofficial, are not considered part of the building façade.\n\n(2)\n\nPARKING STRUCTURE means a garage or carport, either attached or detached from the\nprincipal structure.\n\n(C)\n\nA parking structure with an entrance that faces the front yard abutting public right-of-way:\n\n(1)\n\nmay not be closer to the front lot line than the front-most exterior wall of the first\nfloor of the building façade; and\n\n(2)\n\nif the parking structure is less than 20 feet behind the building façade, the width\nof the parking structure may not exceed 50 percent of the width of the building façade,\nmeasured parallel to the front lot line, or the line determined by the building official\nif located on an irregular lot.\n\nSource: Ord. 030925-64; Ord. 031211-11; Ord. No. 20160505-051, Pt. 1, 5-16-16.\n",
  "start_line": 32538,
  "end_line": 34814,
  "subsections": []
}