{
  "id": "25-2-2",
  "title": "DETERMINATION OF USE CLASSIFICATION",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "This section applies to a formal determination by the director under Section 25-2-2 (Determination of Use Classification) regarding the appropriate classification of a land use that is not specifically\nclassified under Chapter 25-2, Subchapter A (Zoning Uses).\n\n(B)\n\nExcept as otherwise provided by this section, a use determination may be requested\nat any time by filing an application on a form provided by the director and by paying\na fee established by separate ordinance.\n\n(C)\n\nIn addition to any additional information required by the director, an application\nfor a use determination must:\n\n(1)\n\nstate whether the determination is requested in connection with a specific project,\nand if so, reference the application number;\n\n(2)\n\nif the determination is not related to a specific development application, state whether\nit is requested for a particular address;\n\n(3)\n\ndescribe the land use(s) for which a determination is sought; and\n\n(4)\n\ninclude any information that the applicant requests the director to consider in making\nthe use determination, including but not limited to an explanation of the similarities,\nif any, of the use to other classified uses.\n\n(D)\n\nA use determination for a project that is subject to a pending development application\nis a \"project use determination\" and is subject to the requirements of this subsection.\n\n(1)\n\nThe director shall determine whether a site plan application requires a use determination\nunder Section 25-2-2 (Determination of Use Classification) within the applicable review period required by Section 25-5-114 (Time Periods for Determination; Notice) or Section 25-5-143 (Director's Report).\n\n(2)\n\nIf the director determines that a use determination is required, the applicant must\nsubmit a request for a project use determination under Subsection (B) before the application\nexpires.\n\n(3)\n\nWithin 14 days after receiving a request for a project use determination, the director\nshall issue a determination under Subsection (F) of this section and provide notice\nof the determination under Section 25-1-133(B) (Notice of Applications and Administrative Decisions).\n\n(4)\n\nAny person entitled to notice of a use determination under Section 25-1-133(B) (Notice of Applications and Administrative Decisions) may appeal the decision to the Board of Adjustment no later than 14 days after notice\nis provided.\n\n(E)\n\nA request for a use determination that is not associated with a pending development\napplication is a \"non-project use determination\" and is subject to the requirements\nof this subsection.\n\n(1)\n\nA non-project use determination may be requested by anyone, at any time, for a use\nthat requires a determination under Section 25-2-2 (Use Determination).\n\n(2)\n\nIn addition to the requirements in Subsection (C) of this section, an application\nfor a non-project use determination must include:\n\n(a)\n\nany information requested by the director regarding the nature of the use for which\na determination is requested, including the size, scale, or intensity of the use;\nand\n\n(b)\n\na specific address, if the applicant intends to rely on the determination in connection\nwith a development application.\n\n(3)\n\nWithin 14 days after receiving a request for a non-project use determination, the\ndirector shall provide notice of the determination:\n\n(a)\n\nto the applicant and to registered environmental and neighborhood organizations, if\nthe determination is not associated with a specific address; or\n\n(b)\n\nto all parties entitled to notice under Section 25-1-133(A) (Notice of Applications and Administrative Decisions), if the determination is associated with a particular address.\n\n(4)\n\nAny person entitled to notice of a non-project use determination under this subsection\nmay appeal the determination to the Board of Adjustment within 14 days.\n\n(F)\n\nThe director may not make a decision on an application that is dependent upon a use\ndetermination:\n\n(1)\n\nuntil after the period for appealing the use determination to the Board of Adjustment\nhas run;\n\n(2)\n\nif the use determination is appealed to the Board of Adjustment, until after the board\nhas decided the appeal; or\n\n(3)\n\nif a decision of the Board of Adjustment is appealed to district court, until after\nthe district court has decided the appeal.\n\n(G)\n\nUnless a use determination is reversed or modified by the Board of Adjustment, the\ndirector shall follow the determination in reviewing subsequent requests for a determination\non the same or substantially similar land uses.\n\n(H)\n\nA use determination is not subject to further notification or appeal under this section\nif it has been considered by the Board of Adjustment in response to an appeal or notice\nof the determination was previously provided under this section and no appeal was\nfiled.\n\n(I)\n\nA use determination issued by the director under this section must:\n\n(1)\n\ninclude all information required under Section 25-1-133(C) (Notice of Applications and Administrative Decisions);\n\n(2)\n\nstate the director's determination regarding how the use is classified under existing\nuse regulations;\n\n(3)\n\nexplain the factors considered by the director in making the determination under Section 25-2-2 (Determination of Use Classification), including the similarity of a use to other classified land uses; and\n\n(4)\n\ndescribe any special characteristics of the use determination, including limitations\non the size, scale, location or intensity, of the use.\n\n(J)\n\nA use determination issued under this section may not be used to render decisions\ninterpreting site development regulations.\n\nSource: Ord. 20120426-122.\n\n(A)\n\nA person may file an application for a variance or a special exception with:\n\n(1)\n\nthe building official for a variance or special exception granted by the Board of\nAdjustment; or\n\n(2)\n\nthe responsible director for a variance granted by the Land Use Commission or the\ncouncil.\n\n(B)\n\nAn application may include a request for:\n\n(1)\n\nvariances or special exceptions from regulations applicable to the same site; or\n\n(2)\n\nsimilar variances or special exceptions on two or more adjacent parcels with similar\ncharacteristics.\n\n(C)\n\nThe building official or responsible director may require that the applicant provide\ninformation that the building official or responsible director determines is necessary\nto evaluate the variance or special exception request.\n\nSource: Section 13-1-280; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11;\nOrd. 20110526-098.\n\n(A)\n\nFor an application for a variance or special exception requiring consideration by\nthe Board of Adjustment, the building official shall prepare and file a report with\nthe board not later than the 11th day before the public hearing.\n\n(B)\n\nFor an application for a variance requiring consideration by the Land Use Commission,\nthe responsible director shall prepare and file a report with the Land Use Commission\nnot later than the 11th day before the public hearing.\n\n(C)\n\nThe building official shall make a report described in this section available to the\npublic when the report is filed with the Board of Adjustment or Land Use Commission.\n\n(D)\n\nThis subsection applies to an application for a zoning variance or special exception\nfor property zoned as a family residence (SF-3) or more restrictive district.\n\n(1)\n\nThe building official shall waive the application fee if the official determines that\nthe variance or special exception is supported by the notice owners of 80 percent\nor more of the property located within 300 feet of the property for which the variance\nis sought.\n\n(2)\n\nAn applicant who seeks a fee waiver must:\n\n(a)\n\nobtain the signature of each notice owner who supports the variance or special exception,\non a form provided by the building official; and\n\n(b)\n\nsubmit the completed form to the building official.\n\nSource: Section 13-1-281 and 13-1-282; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8;\nOrd. 031211-11; Ord. 20080110-106; Ord. 20110526-098.\n\n(A)\n\nThis section applies to an application for a variance from the requirements of Chapter 25-8, Subchapter A (Water Quality).\n\n(B)\n\nThe Environmental Board shall consider an application for a variance and forward its\nrecommendation to the Land Use Commission.\n\n(C)\n\nThe Land Use Commission shall consider the Environmental Board's recommendation before\nacting on a variance.\n\nSource: Section 13-1-283(b); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThis subsection does not apply to a preliminary plan, plat, or subdivision construction\nplan. For all other development applications:\n\n(1)\n\nThe Board of Adjustment or Land Use Commission, as applicable, shall hold a public\nhearing on an application for a variance or special exception not later than the 45th\nday after the date the application is filed.\n\n(2)\n\nThe building official or responsible director, as applicable, shall give notice under\nSection 25-1-132(A) (Notice of Public Hearing) of a public hearing on an application for a variance or special exception, and,\nfor a variance or special exception heard by the Board of Adjustment, by posting one\nor more signs.\n\n(B)\n\nFor an application to replat without vacation of the preceding plat, the director\nshall give notice under Section 25-1-132(B) (Notice of Public Hearing) if:\n\n(1)\n\nDuring the preceding five years any of the area to be platted was limited by an interim\nor permanent zoning classification to residential use for not more than two residential\nunits per lot; or\n\n(2)\n\nAny lot in the preceding plan was limited by deed restriction to residential use for\nnot more than two residential units per lot.\n\nSource: Section 13-1-283(a); Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11;\nOrd. 20110526-098; Ord. No. 20190822-117, Pt. 14, 9-1-19.\n\n(A)\n\nExcept as otherwise provided in this chapter, the Board of Adjustment or the Land\nUse Commission shall act on an application for a variance or special exception not\nlater than the next meeting after the public hearing is closed.\n\n(B)\n\nThe Board of Adjustment or the Land Use Commission may:\n\n(1)\n\napprove an application for a variance;\n\n(2)\n\napprove an application for a variance with modifications; or\n\n(3)\n\ndeny an application for a variance.\n\n(C)\n\nThe Board of Adjustment or the Land Use Commission may require that a variance be:\n\n(1)\n\nrevocable;\n\n(2)\n\neffective for a specified time period; or\n\n(3)\n\nsubject to one or more conditions.\n\n(D)\n\nThe Board of Adjustment may act on a request for a special exception in the manner\nprovided for variances under Subsections (B) and (C) of this section.\n\nSource: Section 13-1-284; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 20110526-098.\n\n(A)\n\nExcept as provided in Subsection (B), a decision on a variance or special exception\nis effective immediately.\n\n(B)\n\nIf a variance or special exception is appealable, a decision on the variance is effective:\n\n(1)\n\nexcept as provided in Subsection (B)(2), at the expiration of the time period during\nwhich an appeal may be filed; or\n\n(2)\n\nif a notice of appeal is filed, when a final decision on the appeal is made.\n\nSource: Section 13-1-285; Ord. 990225-70; Ord. 031211-11; Ord. 20110526-098.\n\n(A)\n\nExcept as provided in Subsection (B), a variance or special exception expires:\n\n(1)\n\nexcept as provided in Subsection (A)(2), one year after the effective date of the\nvariance or special exception; or\n\n(2)\n\non the date established as a condition of approval.\n\n(B)\n\nA variance or special exception expires on the date an approved plan or permit expires\nif:\n\n(1)\n\nan application for approval of a plan or permit is submitted before a variance or\nspecial exception expires under Subsection (A); or\n\n(2)\n\nthe variance or special exception is granted in association with the approved plan\nor permit.\n\nSource: Section 13-1-286; Ord. 990225-70; Ord. 031211-11; Ord. 20110526-098.\n\nIf an application for a variance or special exception is denied or if a variance or\nspecial exception is revoked, a person may not file an application for the same or\na similar variance or special exception on the same or substantially the same site\nfor a period of one year from the date of denial or revocation.\n\nSource: Section 13-1-287; Ord. 990225-70; Ord. 031211-11; Ord. 20110526-098.\n\n\n\nFootnotes:\n\n--- (**1**) ---\n\n**Editor's note—**\nOrd. No. 20140612-084, Pt. 4, effective June 23, 2014, repealed Division 4, §§ 25-1-231—25-1-234, which pertained to special exceptions.\nSee References to Ordinances for complete derivation. Subsequently, Division 5 was\nrenumbered as Division 4.\n\n(A)\n\nAn application for an adjustment under Chapter 25-8, Subchapter A (Water Quality) may be considered only in connection with the review of:\n\n(1)\n\na site plan;\n\n(2)\n\na subdivision; or\n\n(3)\n\nother specific development project or proposal.\n\n(B)\n\nAn applicant may file an application for an adjustment with the director.\n\n(C)\n\nAn application for an adjustment must be on a form prescribed by the director and\nmust include:\n\n(1)\n\nthe names and addresses of the applicant and the owner;\n\n(2)\n\nthe address and legal description of the property;\n\n(3)\n\nproof that the applicant is either the record owner or the record owner's agent;\n\n(4)\n\nidentification of the section of Chapter 25-8, Subchapter A (Water Quality) that, as applied to the development project or proposal, the applicant claims violates\nthe United States Constitution, the Texas Constitution, or federal or state statute,\nand the provisions violated;\n\n(5)\n\na statement of the factual basis for applicant's claims;\n\n(6)\n\na legal brief supporting applicant's claims; and\n\n(7)\n\na description of the adjustment requested, and an explanation of how the adjustment\nis the minimum required to comply with the conflicting law and provides maximum protection\nof water quality.\n\nSource: Section 13-1-304; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\nThis section prescribes the order of process for an application for adjustment.\n\n(1)\n\nThe Law Department shall review an application for adjustment and advise the city\nmanager.\n\n(2)\n\nThe city manager shall present the application and the city manager's recommendation\nto the council.\n\n(3)\n\nThe council shall determine whether application of the identified section of Chapter 25-8, Subchapter A (Water Quality) to the applicant's development project or proposal violates the United States Constitution,\nthe Texas Constitution, or federal or state statute. An affirmative determination\nrequires a three-quarters vote of the city council. If the council does not make an\naffirmative determination, the application is denied.\n\n(4)\n\nThis subsection applies if the council makes an affirmative determination under Subsection\n(3).\n\n(a)\n\nThe Watershed Protection Department shall review the application and advise the city\nmanager.\n\n(b)\n\nThe city manager shall present the application and the city manager's recommendation\nto the council at a public hearing.\n\n(c)\n\nAfter a public hearing, the city council shall:\n\n(i)\n\ndetermine the minimum adjustment required to comply with the conflicting law and provide\nmaximum protection of water quality; and\n\n(ii)\n\ngrant the adjustment.\n\nSource: Section 13-1-305; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046.\n\n### ARTICLE 8. - CONSTRUCTION MANAGEMENT.\n\nThis article applies to development that occurs under an approved subdivision construction\nplan or site plan in the planning jurisdiction of the City.\n\nSource: Section 13-1-830; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (C), the owner of a project, or owner representative,\nshall participate in a preconstruction conference with accountable officials before\nstarting construction under an approved site plan or subdivision construction plan.\n\n(B)\n\nAn owner, or owner representative, shall request the accountable official to schedule\nthe preconstruction conference when the owner pays the required inspection fees.\n\n(C)\n\nThe director may waive the requirement for a preconstruction conference.\n\nSource: Section 13-1-831(a); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nThe accountable official shall provide notice of the conference to the following persons\nor entities not later than the second day before the conference:\n\n(1)\n\nowner representative;\n\n(2)\n\nconsulting engineer;\n\n(3)\n\ncontractors;\n\n(4)\n\ncounty engineers, as appropriate; and\n\n(5)\n\naffected utilities and appropriate city departments.\n\n(B)\n\nBefore convening a preconstruction conference, the accountable official shall distribute\napproved plans for the development to the persons and entities receiving notice of\nthe conference.\n\nSource: Section 13-1-831(b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe conference participants shall exchange telephone numbers and addresses at the\nconference.\n\n(B)\n\nThe participants shall discuss:\n\n(1)\n\nthe sequence of construction;\n\n(2)\n\nstart dates and schedule of events;\n\n(3)\n\nerosion and sedimentation controls;\n\n(4)\n\ntraffic control barricades;\n\n(5)\n\nsite supervision;\n\n(6)\n\nemergency response;\n\n(7)\n\nspecial conditions or provisions of plans or specifications;\n\n(8)\n\nfinal acceptance guidelines; and\n\n(9)\n\npublishing and distribution of minutes of the conference.\n\nSource: Section 131-831(b); Ord. 990225-70; Ord. 031211-11.\n\nBefore construction begins, the owner's consulting engineer shall prepare and distribute\nminutes of the preconstruction conference. Conference participants may file exceptions\nto the minutes. The engineer shall distribute copies of exceptions to the conference\nparticipants and shall include the exceptions in the inspection file.\n\nSource: Section 13-1-831(b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe central dispatcher for the City shall coordinate contact between a permittee and\nan inspector.\n\n(B)\n\nA permittee shall contact the central dispatcher to request an inspection.\n\n(C)\n\nThe accountable official may:\n\n(1)\n\nrequire that a request be made 48 hours before the date the inspection is desired;\nand\n\n(2)\n\nspecify the manner in which the request is made.\n\n(D)\n\nThe central dispatcher shall maintain inspection requests for the city departments.\n\nSource: Section 13-1-833; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA permittee may not begin work under a permit until an inspection record card is posted\non the site.\n\n(B)\n\nThe permittee shall post the card in a readily accessible location.\n\n(C)\n\nThe inspector shall note each inspection on the record card.\n\n(D)\n\nThe permittee shall post the record card until the accountable official finds that\nthe permittee meets all City requirements.\n\nSource: Section 13-1-834; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe owner shall request an inspection of erosion and sedimentation controls and tree\nprotection measures after the owner installs the controls and measures.\n\n(B)\n\nThe accountable official shall schedule the inspection. The owner, consulting engineer,\nand contractor shall attend the inspection.\n\n(C)\n\nDuring the inspection, the owner shall:\n\n(1)\n\ndemonstrate that the erosion and sedimentation controls and tree protection measures\ncomply with the City's Environmental Criteria Manual; and\n\n(2)\n\npresent a plan to the inspector that includes future erosion and sedimentation controls,\ndrainage, and utility and street layout.\n\n(D)\n\nAfter two days notice to the owner, the inspector may modify the approved erosion\ncontrol and construction sequencing if:\n\n(1)\n\nthe inspector determines that the plans are inadequate;\n\n(2)\n\nthe inspector confirms the determination with the accountable official in the Watershed\nProtection and Development Review Department; and\n\n(3)\n\nthe accountable official provides written approval of the modification.\n\n(E)\n\nThe inspector may make minor changes to the erosion control and construction sequencing\nplans without written approval from an accountable official in the Watershed Protection\nand Development Review Department if the modification upgrades erosion controls or\nreflects construction progress.\n\n(F)\n\nExcept as provided in Subsection (G), the owner may not begin construction until the\naccountable official determines that the erosion and sedimentation controls and tree\nprotection measures comply with City requirements.\n\n(G)\n\nIf the accountable official does not conduct an inspection on or before the fifth\nday after receiving a request, the owner may proceed with construction.\n\nSource: Section 13-1-832; Ord. 99-0225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), the director may charge a reinspection fee if\nat the time that an inspector attempts to conduct an inspection, the permittee:\n\n(1)\n\nhas not finished the work to be inspected;\n\n(2)\n\nhas not finished corrections previously required by an inspector;\n\n(3)\n\nhas not posted the record inspection card;\n\n(4)\n\ndoes not make approved plans readily available to the inspector; or\n\n(5)\n\ndoes not provide access to the work on the scheduled inspection date.\n\n(B)\n\nWork that was rejected at the first inspection for failure to comply with a technical\ncode may be reinspected without payment of a reinspection fee.\n\n(C)\n\nIf a reinspection fee is due, additional inspections may not be performed until the\nreinspection fee is paid.\n\nSource: Section 13-1-835; Ord. 990225-70; Ord. 031211-11.\n\nThe director shall deliver two copies of the released subdivision construction plans\nand approved plan revisions to the accountable official for inspection.\n\nSource: Section 13-1-860; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nApproximately 10 days before work under the subdivision construction plans is finished,\nthe owner shall notify the accountable official in writing that the work is substantially\ncomplete and shall request a list of work to be completed.\n\n(B)\n\nOn the day that the owner provides notice under Subsection (A), the consulting engineer\nshall submit a construction summary report to the accountable official.\n\nSource: Section 13-1-861; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nNot later than the fourth day after the owner gives written notice that work under\na subdivision construction plan is substantially complete, the accountable official\nshall:\n\n(1)\n\nreview the work; and\n\n(2)\n\nprepare a report identifying work that does not comply with the construction plans\nand work that must be performed before the accountable official issues a final acceptance\nletter.\n\n(B)\n\nWhen the owner finishes the work listed in the report issued under Subsection (A),\nthe accountable official shall modify the report to reflect that the required work\nis finished.\n\nSource: Section 13-1-862; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe accountable official shall schedule a final acceptance meeting at the site and\nshall invite the:\n\n(1)\n\nconsulting engineer;\n\n(2)\n\ncontractors, as appropriate;\n\n(3)\n\ncounty engineer, as appropriate;\n\n(4)\n\nstaff of affected utilities and City departments;\n\n(B)\n\nThe accountable official may not issue a final acceptance letter until:\n\n(1)\n\nwork identified in the accountable official's report has been completed;\n\n(2)\n\nthe following items have been submitted:\n\n(a)\n\nconstruction summary report;\n\n(b)\n\nconsulting engineer's concurrence letter;\n\n(c)\n\nreproducible plans, certified \"as built\" by the consulting engineer;\n\n(d)\n\nrequired one-year warranty bonds;\n\n(e)\n\ncash or cashier's check for balances due, if any; and\n\n(3)\n\nif the owner executed a developer contract, the conditions of the contract have been\nsatisfied.\n\n(C)\n\nThe accountable official shall issue an acceptance letter to an owner who meets the\nrequirements of Subsection (B). If the owner has not satisfied all requirements, the\naccountable official shall issue a list of requirements that the owner must satisfy.\n\nSource: Section 13-1-863; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe director shall forward to the accountable official two copies of the approved\nsite plan, approved building permit construction plan, approved revision, and applicable\nspecifications for a development.\n\n(B)\n\nThe building official shall provide a copy of the approved plans required by Subsection\n(A) to the owner. The owner shall retain the plans at the site during construction\nand inspections.\n\nSource: Section 13-1-900; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDuring construction, the accountable official shall inspect land grading, drainage,\nand detention and water quality control facilities to determine whether the facilities\ncomply with the released site plan.\n\n(B)\n\nAfter construction of the land grading, drainage, and detention and water quality\ncontrol facilities on a site is finished, the design engineer must submit a letter\nto the accountable official stating that the project substantially complies with the\napproved construction plans.\n\n(C)\n\nThe accountable official shall perform the final inspection of the facilities after\nthe design engineer submits the letter described in Subsection (B).\n\n(D)\n\nExcept as provided in Subsection (E), the accountable official may issue a certificate\nof occupancy or compliance only if the land grading, drainage, and detention and water\nquality facilities have been completed in accordance with the requirements of the\nCode, site plan, and building permit construction plan.\n\n(E)\n\nExcept in the Barton Springs Zone, the accountable official may issue a certificate\nof compliance or certificate of occupancy before the construction is finished if:\n\n(1)\n\nthe accountable official determines that the unfinished construction is minor and\nthe facility, as constructed, can perform the task for which it was designed; and\n\n(2)\n\nthe owner executes an agreement on a form prescribed by the accountable official providing\nfor the finishing of the construction and the posting of fiscal security in the amount\nand for the length of time determined by the accountable official.\n\nSource: Section 13-1-901; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), City utilities may be provided to a property\nif:\n\n(1)\n\nfor a property located in the extraterritorial jurisdiction of the City, the accountable\nofficial issues a certificate of compliance for the development and signs a final\nacceptance letter for the subdivision infrastructure; or\n\n(2)\n\nfor a property located in the City's zoning jurisdiction, the building official issues\na certificate of occupancy for the building.\n\n(B)\n\nIf required erosion and sedimentation controls are finished, the accountable official\nmay authorize a temporary electrical connection:\n\n(1)\n\nto test building service equipment before a certificate of occupancy or certificate\nof compliance has been issued; or\n\n(2)\n\nto provide electrical service to a building for which a temporary certificate of occupancy\nhas been issued.\n\nSource: Section 13-1-905; Ord. 990225-70; Ord. 031211-11.\n\n### ARTICLE 9. - CERTIFICATES OF COMPLIANCE AND OCCUPANCY.\n\n(A)\n\nIn the zoning jurisdiction and in a municipal utility district that has a consent\nagreement with the City requiring the issuance of a building permit, a person may\nnot use, occupy, or change the existing use or occupancy of a structure unless the\nbuilding official has issued a certificate of occupancy for the structure.\n\n(B)\n\nIn the planning jurisdiction:\n\n(1)\n\nfor development that does not require a site plan, a person may not use or occupy\na structure unless the accountable official has issued a certificate of compliance\nfor the subdivision infrastructure; and\n\n(2)\n\nfor development that requires a site plan, a person may not use or occupy the development\nincluded in the site plan unless the accountable official has issued certificates\nof compliance for the site plan and the subdivision infrastructure.\n\nSource: Sections 13-1-903, 13-1-904, and 13-1-906; Ord. 990225-70; Ord. 031211-11.\n\nThe accountable official shall issue a certificate of compliance if the development\nhas been completed in accordance with the released site plan, construction plans,\nand other ordinance requirements, as applicable, and for subdivision infrastructure:\n\n(1)\n\nin the extraterritorial jurisdiction, the accountable official has signed a final\nacceptance letter; or\n\n(2)\n\nin the zoning jurisdiction:\n\n(a)\n\nthe accountable official has signed a final acceptance letter; or\n\n(b)\n\nthe accountable official and the developer have executed a developer agreement.\n\nSource: Section 13-1-903; Ord. 990225-70; Ord. 031211-11.\n",
  "start_line": 3391,
  "end_line": 4420,
  "subsections": [
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-D",
    "25-2-2-E",
    "25-2-2-F",
    "25-2-2-G",
    "25-2-2-H",
    "25-2-2-I",
    "25-2-2-J",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-D",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-D",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-D",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-D",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-D",
    "25-2-2-E",
    "25-2-2-F",
    "25-2-2-G",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-C",
    "25-2-2-D",
    "25-2-2-E",
    "25-2-2-A",
    "25-2-2-B",
    "25-2-2-A",
    "25-2-2-B"
  ]
}