{
  "id": "25-2-834",
  "title": "FEE WAIVER FOR EDUCATIONAL FACILITIES",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Ord. No. 20160623-090, Pt. 4, effective July 4, 2016, repealed the former ยง 25-2-834, and enacted a new ยง 25-2-834 as set out herein.\nThe former ยง 25-2-834 pertained to public school facility waiver. See References to\nOrdinances and Code Comparative Table for complete history.\n\nDevelopment of an independent school district educational facility site may be governed\nby an agreement authorized by Section 212.902 of the Local Government Code. If the\nCity and an independent school district have executed an agreement, the terms of that\nagreement supersede the requirements of this title and the criteria manuals to the\nextent of conflict.\n\nSource: Section 13-2-620; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA club or lodge use that is located in a residential zoning district must comply with\nthe requirements of this section.\n\n(B)\n\nVehicular access from a dedicated street with a right-of-way at least 60 feet wide\nfor the length of the adjacent block face is required.\n\n(C)\n\nThe club or lodge must be operated as a nonprofit organization.\n\n(D)\n\nService of food and beverages, including alcoholic beverages, must be limited to service\nthat is incidental to the primary activity of the facility.\n\nSource: Section 13-2-266; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA community recreation use must comply with the requirements of this section.\n\n(B)\n\nVehicular access from a dedicated street with a right-of-way at least 60 feet wide\nfor the length of the adjacent block face is required.\n\n(C)\n\nA community recreation use must be operated as a nonprofit organization.\n\n(D)\n\nService of food and beverages must be limited to service that is incidental to the\nprimary activity of the facility. Service of alcoholic beverages is prohibited if\nthe majority of the participants in the primary activity are 18 years of age or younger.\n\n(E)\n\nIf a community recreation use is a conditional use, baseball, softball and football\nfields and other similar outdoor athletic fields must be at least 300 feet from an\nSF-5 or more restrictive zoning district.\n\nSource: Section 13-2-267; Ord. 990225-70; Ord. 031211-11.\n\nAn employee recreation use must be located on property reserved by a business for\nfuture expansion.\n\nSource: Section 13-2-232; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA tower used by a public agency exclusively for police, fire, emergency medical services,\n911 or other public emergency communications is exempt from the requirements of this",
  "start_line": 27034,
  "end_line": 27102,
  "subsections": [
    "25-2-834-A",
    "25-2-834-B",
    "25-2-834-C",
    "25-2-834-D",
    "25-2-834-A",
    "25-2-834-B",
    "25-2-834-C",
    "25-2-834-D",
    "25-2-834-E",
    "25-2-834-A"
  ]
}