{
  "id": "25-2-article-1",
  "title": "GENERAL PROVISIONS",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 1. - GENERAL PROVISIONS.\n\nThe Planning Commission may, by resolution, adopt guidelines for the interpretation\nby the building official of yard and setback requirements in instances where geometric\nshape, dimensions, or topography make the literal interpretation of the requirements\nimpractical.\n\nSource: Section 13-2-613; Ord. 990225-70; Ord. 031211-11.\n\nThe Board of Adjustment shall hear and decide a request for a variance from a requirement\nof this chapter, or a Neighborhood Conservation Combining District adopted under this\nchapter, except as otherwise provided by the Code.\n\nSource: Section 13-2-833 (1); Ord. 990225-70; Ord. 031211-11; Ord. 20101216-095.\n\n(A)\n\nA variance from the requirements of this chapter, or a Neighborhood Conservation Combining\nDistrict adopted under this chapter, may be granted under this division if, because\nof special circumstances of a property, the strict application of this chapter deprives\nthe property owner of privileges that are enjoyed by another person who owns property\nin the area that has the same zoning designation as the property for which the variance\nis requested.\n\n(B)\n\nA variance to a regulation may not grant special privileges that are inconsistent\nwith the limitations on other properties in the area or on the district in which the\nproperty is located.\n\nSource: Section 13-2-830; Ord. 990225-70; Ord. 031211-11; Ord. 20101216-095.\n\n(A)\n\nThe Board of Adjustment may grant a variance from a requirement if it determines that:\n\n(1)\n\nthe requirement does not allow for a reasonable use of property;\n\n(2)\n\nthe hardship for which the variance is requested is unique to the property and is\nnot generally characteristic of the area in which the property is located; and\n\n(3)\n\ndevelopment under the variance does not:\n\n(a)\n\nalter the character of the area adjacent to the property;\n\n(b)\n\nimpair the use of adjacent property that is developed in compliance with the City\nrequirements; or\n\n(c)\n\nimpair the purposes of the regulations of the zoning district in which the property\nis located.\n\n(B)\n\nThe Board may grant a variance from a loading facility or off-street parking design\nrequirements if, in addition to the findings required by Subsection (A), the Board\ndetermines that:\n\n(1)\n\ncurrent or anticipated traffic volume generated by the use of the property or a nearby\nproperty does not reasonably require strict compliance with and enforcement of the\nrequirement from which a variance is requested;\n\n(2)\n\ndevelopment under the variance does not result in parking or loading on public streets\nthat interferes with the free flow of traffic on the streets; and\n\n(3)\n\ndevelopment under the variance does not create a safety hazard or any other condition\nthat is inconsistent with the objectives of the Code.\n\n(C)\n\nA variance granted under Subsection (B) applies only to the use for which the variance\nwas granted and does not run with the land on which the use is located.\n\n(D)\n\nA variance granted under Subsection (B) shall not apply to bicycle parking. An applicant\nmay also seek a waiver pursuant to Code Section ยง 25-6-477(F) (Bicycle Parking) to waive bicycle parking.\n\nSource: Section 13-2-834; Ord. 990225-70; Ord. 031211-11; Ord. 20130523-104; Ord. No. 20231102-028, Pt. 8, 11-13-23.\n\nA person may appeal a decision of the building official regarding a site development\nregulation prescribed by this subchapter, or by a Neighborhood Conservation Combining\nDistrict adopted under this chapter, to the Board of Adjustment. After an appeal is\nfiled, the building official shall provide the board with a copy of documents regarding\nthe matter that has been appealed.\n\nSource: Section 13-2-835; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20101216-095.\n\n(A)\n\nThe Board of Adjustment shall grant a special exception for an existing residential\nstructure, or portion of an existing structure, that violates a setback required under\nChapter 25-2 (Zoning) if the board finds that the special exception meets the requirements of this section.\n\n(B)\n\nThe Board shall grant a special exception under Subsection (A) of this section if:\n\n(1)\n\nthe residential use for which the special exception is sought is allowed in an SF-3\nor more restrictive zoning district;\n\n(2)\n\nthe building official performs an inspection and determines that the violation does\nnot pose a hazard to life, health, or public safety; and\n\n(3)\n\nthe Board finds that:\n\n(a)\n\nthe violation has existed for:\n\n(i)\n\nat least 25 years; or\n\n(ii)\n\nat least 10 years, if the application for a special exception is submitted on or before\nJune 6, 2017;\n\n(b)\n\nthe use is a permitted use or a nonconforming use;\n\n(c)\n\nthe structure does not share a lot with more than one other primary residence; and\n\n(d)\n\ngranting a special exception would not:\n\n(i)\n\nalter the character of the area;\n\n(ii)\n\nimpair the use of adjacent property that is developed in compliance with city code;\nor\n\n(iii)\n\ngrant a special privilege that is inconsistent with other properties in the area or\nin the district in which the property is located.\n\n(C)\n\nA special exception granted under this section:\n\n(1)\n\napplies only to the structure, or portion of a structure, for which the special exception\nwas granted and does not run with the land;\n\n(2)\n\nmay not authorize an increase in the degree of noncompliance or excuse compliance\nwith minimum health and safety requirements; and\n\n(3)\n\nmay not authorize a remodel or addition to the existing structure, except to the extent\nrequired by the building official to meet minimum life and safety requirements.\n\n(D)\n\nA structure granted a special exception under this section shall be treated as a non-complying\nstructure under Chapter 25-2, Article 8 (Noncomplying Structures).\n\nSource: Ord. 20110526-098; Ord. 20121108-091; Ord. 20130822-126; Ord. No. 20160519-057, Pt. 2, 5-30-16.\n",
  "start_line": 14247,
  "end_line": 14440,
  "subsections": []
}