{
  "id": "25-2-356",
  "title": "HISTORIC AREA COMBINING DISTRICT ORDINANCE",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "adopted in accordance with the requirements of Section 25-2-356 (Historic Area Combining District Ordinance) and to be considered in addition to historic design standards adopted by council\nwhere required by Code.\n\nSource: Ord. 041202-16; Ord. 20100819-065; Ord. No. 20221115-049, Pt. 3, 11-28-22.\n\n(A)\n\nThe Historic Landmark Commission may consider no more than a total of three applications\nper month for historic landmark (H) designation.\n\n(B)\n\nThe Historic Landmark Commission may consider no more than one application per month\nfor historic landmark (H) designation of property located in any National Register\nor Local Historic District, unless there would otherwise be fewer than a total of\nthree applications for historic landmark (H) designation considered in that month.\n\n(C)\n\nLimitations in Subsections (A) and (B) of this section shall not apply to applications\ninitiated by the Historic Landmark Commission in response to a request for a demolition\nor relocation permit.\n\nSource: Ord. 20100819-065.\n\n(A)\n\nThe council may designate a structure or site as a historic landmark (H) combining\ndistrict if:\n\n(1)\n\nthe property is at least 50 years old and represents a period of significance of at\nleast 50 years ago, unless the property is of exceptional importance as defined by\nNational Register Bulletin 22, National Park Service (1996);\n\n(2)\n\nthe property retains a high degree of integrity, as defined by the National Register\nof Historic Places, that clearly conveys its historical significance and does not\ninclude an addition or alteration which has significantly compromised its integrity;\nand\n\n(3)\n\nthe property:\n\n(a)\n\nis individually listed in the National Register of Historic Places; or is designated\nas a Recorded Texas Historic Landmark, State Archeological Landmark, or National Historic\nLandmark; or\n\n(b)\n\ndemonstrates significance in at least two of the following categories:\n\n(i)\n\nArchitecture. The property embodies the distinguishing characteristics of a recognized\narchitectural style, type, or method of construction; exemplifies technological innovation\nin design or construction; displays high artistic value in representing ethnic or\nfolk art, architecture, or construction; represents a rare example of an architectural\nstyle in the city; serves as an outstanding example of the work of an architect, builder,\nor artisan who significantly contributed to the development of the city, state, or\nnation; possesses cultural, historical, or architectural value as a particularly fine\nor unique example of a utilitarian or vernacular structure; or represents an architectural\ncuriosity or one-of-a-kind building. A property located within a local historic district\nis ineligible to be nominated for landmark designation under the criterion for architecture,\nunless it possesses exceptional significance or is representative of a separate period\nof significance.\n\n(ii)\n\nHistorical Associations. The property has long-standing significant associations with\npersons, groups, institutions, businesses, or events of historic importance which\ncontributed significantly to the history of the city, state, or nation; or represents\na significant portrayal of the cultural practices or the way of life of a definable\ngroup of people in a historic time.\n\n(iii)\n\nArcheology. The property has, or is expected to yield, significant data concerning\nthe human history or prehistory of the region;\n\n(iv)\n\nCommunity Value. The property has a unique location, physical characteristic, or significant\nfeature that contributes to the character, image, or cultural identity of the city,\na neighborhood, or a particular group.\n\n(v)\n\nLandscape Feature. The property is a significant natural or designed landscape or\nlandscape feature with artistic, aesthetic, cultural, or historical value to the city.\n\n(B)\n\nThe council may designate an area as a historic area (HD) combining district if at\nleast 51 percent of the principal structures within the proposed district are contributing\nto the historic character of the district when the historic preservation officer certifies\nthat the zoning or rezoning application is complete.\n\n(C)\n\nThe council may enlarge the boundary of an existing historic area (HD) combining district\nif the additional structure, group of structures, or area adds historic, archeological,\nor cultural value to the district.\n\n(D)\n\nExcept as limited by Subsection (E), the council may reduce the boundary of an existing\nhistoric area (HD) combining district if:\n\n(1)\n\nthe structure to be excluded does not contribute to the historic character of the\ndistrict;\n\n(2)\n\nexcluding the structure or area will not cause physical, historical, architectural,\narcheological, or cultural degradation of the district; or\n\n(3)\n\na reasonable use of the structure that allows the exterior to remain in its original\nstyle does not exist.\n\n(E)\n\nThe minimum size for a historic area (HD) combining district is one block face.\n\nSource: Ord. 041202-16; Ord. 20060622-128; Ord. 20111215-091.\n\n(A)\n\nAn application to designate a structure or site as a historic landmark (H) combining\ndistrict or an area as a historic area (HD) combining district must demonstrate that\nthe structure, site, or area satisfies the criteria for designation and include the\ninformation required by administrative rule.\n\n(B)\n\nA record owner or the record owner's agent filing an application for an owner-initiated\nhistoric landmark (H) designation shall affirm that no person involved in the matter\nwas or will be compensated on a contingent fee basis or arrangement.\n\n(C)\n\nAn applicant may submit supplemental standards as described in Section 25-2-356 (Historic Area Combining District Ordinance) as part of an application to designate an area as a historic area (HD) combining\ndistrict.\n\n(D)\n\nPrior to action by the Historic Landmark Commission on an application to designate\nan area as a historic area (HD) combining district, the historic preservation officer\nshall forward the supplemental standards, if any, to the Austin Energy Green Building\n(or successor) program for review and written recommendations regarding the opportunity\nto incorporate sustainable elements into the supplemental standards. The recommendations\nshall be provided to all boards and commissions and council prior to public hearing\nand action on the application.\n\nSource: Ord. 041202-16; Ord. 20060622-128; 20090806-068; Ord. 20100819-065; Ord. No. 20221115-049, Pt. 4, 11-28-22.\n\n(A)\n\nThe Historic Landmark Commission shall hold a public hearing on a zoning or rezoning\napplication that requests:\n\n(1)\n\ndesignation of a historic landmark (H) or historic area (HD) combining district; or\n\n(2)\n\nan amendment or removal of a historic landmark (H) or historic area (HD) combining\ndistrict designation.\n\n(B)\n\nThe director of the Neighborhood Planning and Zoning Department shall give notice\nof the public hearing under Section 25-1-132(A) (Notice of Public Hearing). The Director of the Neighborhood Planning and Zoning Department shall also provide\nnotice of the public hearing by posting signs on the property.\n\n(C)\n\nThe Historic Landmark Commission shall make a recommendation to the Land Use Commission\non a zoning or rezoning application governed by this section not later than the 14th\nday after the Historic Landmark Commission closes the public hearing on the application.\n\n(D)\n\nThe director of the Neighborhood Planning and Zoning Department shall forward the\nrecommendation of the Historic Landmark Commission to the Land Use Commission and\ncouncil.\n\nSource: Ord. 041202-16.\n\n(A)\n",
  "start_line": 12584,
  "end_line": 12784,
  "subsections": [
    "25-2-356-A",
    "25-2-356-B",
    "25-2-356-C",
    "25-2-356-A",
    "25-2-356-B",
    "25-2-356-C",
    "25-2-356-D",
    "25-2-356-E",
    "25-2-356-A",
    "25-2-356-B",
    "25-2-356-C",
    "25-2-356-D",
    "25-2-356-A",
    "25-2-356-B",
    "25-2-356-C",
    "25-2-356-D",
    "25-2-356-A"
  ]
}