{
  "id": "25-2-783",
  "title": "NUMBER OF ROOMS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "of the requirements prescribed in Section 25-2-782(A), (B), (C), (E), (H), (I), and (J) (General Requirements), Section 25-2-783 (Number of Rooms), and Section 25-2-784 (Parking Requirements).\n\n(B)\n\nThe director shall give notice of a waiver application under Section 25-1-133(A) (Notice of Application and Administrative Decisions).\n\n(C)\n\nExcept as provided in Subsection (D), a waiver application shall be considered by\nthe director. The director shall grant a waiver application if the director determines\nthat the waiver will not harm the surrounding area. An applicant may appeal the denial\nof an application by the director to the Land Use Commission.\n\n(D)\n\nIf an interested party files a protest of a waiver application, the application shall\nbe considered by the Land Use Commission.\n\n(E)\n\nThe Land Use Commission shall review a waiver application filed under this section\nin accordance with the conditional use process described in Chapter 25-5, Article 3 (Land Use Commission Approved Site Plans).\n\nSource: Ord. 990520-38; Ord. 010607-8; Ord. 031211-11.\n\nFootnotes:\n\n--- (**2**) ---\n\n**Editor's note—**\nOrd. No. 20250227-039, Pt. 1, effective October 1, 2025, repealed §§ 25-2-788—25-2-799, which pertained\nto requirements for short-term rental uses and derived from Ord. 20120802-122; Ord.\n20130926-144; Ord. No. 20151119-080, Pts. 4—7, 11-30-15; Ord. No. 20151217-098, Pt 1, 12-28-15; Ord. No. 20160223-A.1, Pts. 1, 2, 3-5-16; Ord. No. 20231207-001, Pts. 10, 11, 12-18-23.\n\n(A)\n\nIn this title:\n\n(1)\n\nADULT ARCADE means a movie arcade, game arcade, or other business that primarily offers\nstill or motion pictures or games that emphasize specified sexual activities or specified\nanatomical areas.\n\n(2)\n\nADULT BOOKSTORE means a business:\n\n(a)\n\nthat primarily offers books, magazines, films or videotapes, periodicals, or other\nprinted or pictorial materials that emphasize specified sexual activities or specified\nanatomical areas; and\n\n(b)\n\nin which at least 35 percent of the gross floor area is devoted to offering merchandise\ndescribed in Subsection (A)(2)(a).\n\n(3)\n\nADULT CABARET means a business that primarily offers live entertainment that emphasizes\nspecified sexual activities or specified anatomical areas.\n\n(4)\n\nADULT LOUNGE means an adult cabaret that serves alcoholic beverages.\n\n(5)\n\nADULT NOVELTY SHOP means a business that primarily sells products that emphasize specified\nsexual activities or specified anatomical areas, and in which at least 35 percent\nof the gross floor area is devoted to the sale of those products.\n\n(6)\n\nADULT-ORIENTED BUSINESS means an adult arcade, adult bookstore, adult cabaret, adult\nlounge, adult novelty shop, adult service business, or adult theater.\n\n(7)\n\nADULT SERVICE BUSINESS means an adult encounter parlor, adult retreat, nude modeling\nstudio, or a commercial enterprise that holds itself out to be primarily in the business\nof offering a service that is distinguished or characterized by an emphasis on depicting,\ndescribing, or relating to specified sexual activities or specified anatomical areas.\n\n(8)\n\nADULT THEATER means a business that primarily exhibits motion pictures that emphasize\nspecified sexual activities or specified anatomical areas.\n\n(9)\n\nSPECIFIED SEXUAL ACTIVITIES means:\n\n(a)\n\nhuman genitals in a state of sexual stimulation or arousal;\n\n(b)\n\nacts of human masturbation, sexual intercourse, or sodomy; or\n\n(c)\n\nerotic touching of human genitals, the pubic region, the buttock, or the female breast.\n\n(10)\n\nSPECIFIED ANATOMICAL AREAS means:\n\n(a)\n\nless than completely and opaquely covered:\n\n(i)\n\nhuman genitals or pubic region;\n\n(ii)\n\nbuttock;\n\n(iii)\n\nfemale breast below a point immediately above the top of the areola; or\n\n(b)\n\nhuman male genitals in a discernibly turgid state, even if completely and opaquely\ncovered.\n\n(B)\n\nOn-premises advertisements, displays, or other promotional materials for an adult-oriented\nbusiness that emphasize specified sexual activities or specified anatomical areas\nmust not be visible from public or semi-public places outside the business.\n\n(C)\n\nExcept as provided in Subsection (E), an adult-oriented business other than an adult\nlounge is a permitted use in a CS, CS-1, or CH zoning district and is a conditional\nuse in a CBD or DMU zoning district.\n\n(D)\n\nExcept as provided in Subsection (E), an adult lounge is a conditional use in a CBD,\nDMU, CS-1, or CH zoning district.\n\n(E)\n\nAn adult-oriented business may not be located on a lot:\n\n(1)\n\nthat is within 1,000 feet of a lot on which another adult-oriented business is located;\n\n(2)\n\nthat is within 1,000 feet of a lot on which a school, church, public park or playground,\nlicensed day-care center, museum, or library is located; or\n\n(3)\n\nwhere 50 percent or more of the lots within a 1,000 foot radius are zoned or used\nfor a residential use.\n\n(F)\n\nA radius or distance described in Subsection (E) is measured from the midpoint of\na line joining the two most distant points on the boundaries of the lot.\n\n(G)\n\nFor purposes of this section, \"museum\" means a building or site devoted to the acquisition,\nconservation, study, exhibition, or educational interpretation of objects having scientific,\nhistoric, or artistic value.\n\nSource: Section 13-2-265; Ord. 990225-70; Ord. 031211-11; Ord. No. 20150416-029, Pt. 1, 4-27-15.\n\n(A)\n\nFor an art gallery use in a general office (GO) or more restrictive district, the\nsale of art supplies, equipment, or accessories is prohibited.\n\n(B)\n\nThis subsection applies to an art workshop use in a community commercial (GR) or more\nrestrictive district.\n\n(1)\n\nThe use may not:\n\n(a)\n\nexceed 5,000 square feet of gross floor area; or\n\n(b)\n\nproduce external noise, vibration, smoke, dust, odor, heat, glare, fumes, electrical\ninterference, or waste runoff.\n\n(2)\n\nThe following are prohibited:\n\n(a)\n\nthe outdoor storage of materials; and\n\n(b)\n\nthe use of welding equipment, fiberglass, or epoxy.\n\nSource: Ord. 040617-Z-1.\n\nA commercial blood plasma center is a conditional use if the use is within:\n\n(1)\n\none-half mile of another commercial blood plasma center; or\n\n(2)\n\n540 feet of a lot zoned or used for a residence, church, public or private school,\npublic park or playground, or day-care facility.\n\nSource: Sections 13-2-233 and 13-2-333; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nFor a communication service facilities use, the base zoning district regulations are\nsuperseded by the requirements of this section.\n\n(B)\n\nBase zoning district requirements for lot size, lot width, floor area ratio, and building\ncoverage do not apply.\n\n(C)\n\nThe minimum side yard width is the lesser of:\n\n(1)\n\nfive feet; or\n\n(2)\n\nthe width required by the site development regulations for the base district.\n\n(D)\n\nAt least 50 percent of the yard areas must be landscaped, and one tree at least six\nfeet in initial height is required in the front yard. The following landscaping requirements\ndo not apply:\n\n(1)\n\nSubsection 25-2-983(B) (Final Inspection);\n\n(2)\n\nSubsections 25-2-1001(C) and (D) (Procedures);\n\n(3)\n\nSubsections 25-2-1003(B) and (C) (General Requirements);\n\n(4)\n\nSubsections 25-2-1005(C), (D), (E), and (F) (Trees);\n\n(5)\n\nSubsection 25-2-1006(A) (Visual Screening);\n\n(6)\n\nSection 25-2-1007 (Parking Lots); and\n\n(7)\n\nSection 25-2-1008 (Irrigation Requirements).\n\n(E)\n\nImpervious cover may not exceed the greater of the maximum percentage permitted by\nthe applicable site development regulations for the base zoning district; or\n\n(1)\n\nfor a site less than 2,500 square feet in size, 95 percent;\n\n(2)\n\nfor a site at least 2,500 and not more than 3,600 square feet in size, 85 percent;\n\n(3)\n\nfor a site at least 3,600 and not more than 5,000 square feet in size, 50 percent;\nor\n\n(4)\n\nfor a site more than 5,000 square feet in size, 45 percent.\n\n(F)\n\nA structure may not exceed 12 feet in height and must be set back at least 25 feet\nfrom a front or side street if the structure is located:\n\n(1)\n\nin an SF-6 or more restrictive zoning district; or\n\n(2)\n\nacross a street from or adjacent to property that is zoned or used for a use permitted\nin an SF-5 or more restrictive zoning district,\n\n(G)\n\nA structure's location must not create a visual obstruction to traffic.\n\nSource: Section 13-2-268; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA drop-off recycling collection facility must comply with the requirements of this\nsubsection.\n\n(1)\n\nA facility must be located in an enclosed structure or enclosable trailer, or be screened\non three sides by a solid fence or wall not less than six feet high. This requirement\ndoes not apply to a single-feed reverse vending machine.\n\n(2)\n\nA facility must be at least 100 feet from an adjoining property that is zoned or used\nfor SF-5 or more restrictive use.\n\n(3)\n\nA sign that is visible to the public identifying the facility operator, its telephone\nnumber, its hours of operation, and the City of Austin Recycling Hotline telephone\nnumber is required.\n\n(4)\n\nA facility operator shall exchange a trailer that contains a facility for another\ntrailer when the facility reaches its capacity. The operator shall place a replacement\ntrailer in the exact location of the trailer it replaced, unless the trailer is in\nthe fenced boundaries of a drop-off recycling collection facility site.\n\n(5)\n\nStorage containers that are marked to identify the materials to be deposited are required.\nCoverable containers for paper and plastic products are required for an unenclosed\nfacility. A sign near the containers stating materials may only be deposited between\nthe hours of 7:00 a.m. and 10:00 p.m. is required.\n\n(6)\n\nStorage and unloading areas must be paved.\n\n(7)\n\nThe facility operator shall remove all deposited materials from the facility:\n\n(a)\n\nat least once a week; or\n\n(b)\n\nwhen the containers for a material are full.\n\n(8)\n\nA facility operator may not remove deposited materials between the hours of 8:00 p.m.\nand 8:00 a.m.\n\n(9)\n\nA facility operator shall keep the facility free of refuse and putrescible materials.\n\n(10)\n\nA facility operator may not use power driven processing equipment at an unenclosed\nfacility. This limitation does not apply to a bulk or single-feed reverse vending\nmachine.\n\n(11)\n\nA facility that shares a site with another use may not be designed or operated to\ninterfere with the off-street parking, shared parking, traffic circulation, or access\nrequired by the other use.\n\n(B)\n\nThe operator may seek a waiver of a requirement of Subsection (A) from the council.\nThe waiver request must demonstrate that:\n\n(1)\n\ncompliance with the requirement is an undue hardship on the applicant;\n\n(2)\n\nwaiver of the requirement will not adversely affect surrounding properties; and\n\n(3)\n\nthe facility substantially complies with requirements of this section.\n\nSource: Sections 13-2-224 and 13-2-271; Ord. 990225-70; Ord. 031120-44; Ord. 031211-11;\nOrd. 050127-64.\n\n(A)\n\nThis section applies to a plant nursery use.\n\n(B)\n\nIn a neighborhood commercial (LR) district, the site area may not exceed one acre.\n\n(C)\n\nStorage areas for herbicides, pesticides, or fertilizers, if any, must be shown on\nthe site plan.\n\n(D)\n\nThis subsection applies to products that are required by the Environmental Protection\nAgency to be labeled \"combustible\", \"corrosive\", \"danger\", \"flammable\", \"highly flammable\",\n\"poison\", or \"warning\".\n\n(1)\n\nStorage or display of a product is required to be:\n\n(a)\n\nin an enclosed building; and\n\n(b)\n\nfor a site larger than one acre, separated from property used or zoned for a residential\nuse by at least 75 feet plus 20 feet for each acre of site area over one acre.\n\n(2)\n\nTotal storage and display area:\n\n(a)\n\nis limited to 100 square feet for each acre, or portion of an acre, of site area;\nand\n\n(b)\n\nmay not exceed 1,000 square feet.\n\n(E)\n\nA bulk storage area for soil, compost, or a similar product outside of an enclosed\nbuilding:\n\n(1)\n\nmay not exceed 10 percent of the site area;\n\n(2)\n\nmust be at least 25 feet from property used or zoned for a residential use;\n\n(3)\n\nmust be screened from view from adjacent property used or zoned for a residential\nuse; and\n\n(4)\n\nmay not cause noxious odors that are detectible from adjacent property used or zoned\nfor a residential use.\n\nSource: Section 13-2-274; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to a site if:\n\n(1)\n\nthe structure and land are zoned as a historic landmark (H) or historic area (HD)\ncombining district;\n\n(2)\n\nthe property is owned and operated by a non-profit entity;\n\n(3)\n\nthe property is directly accessible from a street with at least 40 feet of paving;\n\n(4)\n\nthe site has at least one acre of contiguous land area;\n\n(5)\n\nat least 80 percent of the parking is on site;\n\n(6)\n\na single commercial use does not occupy more than 25 percent of the gross floor area;\n\n(7)\n\ncivic uses occupy at least 50 percent of the gross floor area; and\n\n(8)\n\nthe property owner does not discriminate on the basis of race, color, religion, sex,\nnational origin, sexual orientation, age, or physical disability in leasing the property.\n\n(B)\n\nIf not otherwise permitted in the base district, the following are conditional uses\non a site described in Subsection (A):\n\n(1)\n\nadministrative and business offices;\n\n(2)\n\ngeneral retail sales (convenience);\n\n(3)\n\nindoor entertainment;\n\n(4)\n\nrestaurant (limited) without drive-in service; and\n\n(5)\n\ncultural services.\n\nSource: Sections 13-2-1 and 13-2-234; Ord. 990225-70; Ord. 000309-39; Ord. 031211-11;\nOrd. 031211-41; Ord. 041202-16; Ord. No. 20231102-028, Pt. 14, 11-13-23.\n\n(A)\n\nA restaurant (general) use must comply with the requirements of this subsection.\n\n(1)\n\nThe restaurant must contain kitchen facilities that are adequate for the preparation\nof the food to be sold. The adequacy of the kitchen facilities is based on the seating\ncapacity of the restaurant and the type of menu offered.\n\n(2)\n\nThe menu must provide a variety of entrees, a list of all food items for sale, and\nthe price of each item.\n\n(B)\n\nA restaurant (general) use that serves alcoholic beverages must comply with the requirements\nof this subsection.\n\n(1)\n\nAt least 51 percent of the gross income of a restaurant must be derived from the sale\nof prepared food.\n\n(2)\n\nAn area within a restaurant devoted to the preparation, sale, and consumption of alcoholic\nbeverages may not be operated or advertised under a name different from the restaurant.\nAn outside sign, separate identification, or advertising for the area within the restaurant\ndevoted to the preparation, sale, and consumption of alcoholic beverages must be incidental\nto and in conjunction with the restaurant use.\n\n(3)\n\nLive entertainment is permitted if the amplified sound does not exceed 70 decibels,\nmeasured at the property line of the licensed premises. In this paragraph, \"premises\"\nhas the meaning ascribed to it in the Texas Alcoholic Beverage Code.\n\n(4)\n\nThe building official may order a verified audit that includes documents submitted\nto taxing authorities. A person's failure to timely produce requested documents is\nprima facie evidence of a violation of this chapter.\n\n(C)\n\nA restaurant that requires a late-hours permit from the Texas Alcoholic Beverage Commission\nis a conditional use if:\n\n(1)\n\nArticle 10 (Compatibility Standards) applies to the restaurant; and\n\n(2)\n\nArticle 10 (Compatibility Standards) is not waived in accordance with Article 10, Division 3 (Waivers).\n\n(D)\n\nFor a cocktail lounge or a restaurant with a late-hours permit:\n\n(1)\n\nall parking must be shown on the site plan that is required for a conditional use\npermit or compatibility standards waiver; and\n\n(2)\n\ncompliance with the parking area setback described in Section 25-5-146 (Conditions of Approval) is required.\n\nSource: Section 13-2-263; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn a neighborhood commercial (LR) district, a restaurant (limited) use is:\n\n(1)\n\na conditional use if it has drive-in service; and\n\n(2)\n\nprohibited if it exceeds 3,000 square feet of gross floor area, and the site abuts\nproperty:\n\n(a)\n\nzoned as an urban family residence (SF-5) or more restrictive district; or\n\n(b)\n\non which a use permitted in a SF-5 or more restrictive district is located.\n\n(B)\n\nin a general office (GO), commercial recreation (CR), or neighborhood commercial (LR)\ndistrict, the outdoor seating area, if any, for a restaurant (limited) use may not\nexceed 50 percent of the indoor seating area. Seating area is measured in square feet.\n\nSource: Ord. 031211-41.\n\n(A)\n\nThis section applies to a printing and publishing use in a community commercial (GR)\nor more restrictive district.\n\n(B)\n\nThe use may not:\n\n(1)\n\nexceed 5,000 square feet of gross floor area; or\n\n(2)\n\nproduce external noise, vibration, smoke, dust, odor, heat, glare, fumes, electrical\ninterference, or waste runoff.\n\n(C)\n\nThe following are prohibited:\n\n(1)\n\nthe outdoor storage of materials; and\n\n(2)\n\nthe wholesale distribution of goods.\n\n(D)\n\nThe use is limited to printing equipment typically used in a business office.\n\nSource: Ord. 040617-Z-1.\n\n(A)\n\nThis section applies to an electronic testing use.\n\n(B)\n\nIn this section, the terms \"hazardous waste\" and \"conditionally exempt small quantity\ngenerator\" have meanings assigned to them by Texas Administrative Code Title 30, Chapter\n335.\n\n(C)\n\nAn activity that generates hazardous waste is prohibited, unless the waste is generated\nby a conditionally exempt small quantity generator.\n\n(D)\n\nAn electronic testing use must comply with the requirements for a planned development",
  "start_line": 25211,
  "end_line": 25923,
  "subsections": [
    "25-2-783-B",
    "25-2-783-C",
    "25-2-783-D",
    "25-2-783-E",
    "25-2-783-A",
    "25-2-783-B",
    "25-2-783-C",
    "25-2-783-D",
    "25-2-783-E",
    "25-2-783-F",
    "25-2-783-G",
    "25-2-783-A",
    "25-2-783-B",
    "25-2-783-A",
    "25-2-783-B",
    "25-2-783-C",
    "25-2-783-D",
    "25-2-783-E",
    "25-2-783-F",
    "25-2-783-G",
    "25-2-783-A",
    "25-2-783-B",
    "25-2-783-A",
    "25-2-783-B",
    "25-2-783-C",
    "25-2-783-D",
    "25-2-783-E",
    "25-2-783-A",
    "25-2-783-B",
    "25-2-783-A",
    "25-2-783-B",
    "25-2-783-C",
    "25-2-783-D",
    "25-2-783-A",
    "25-2-783-B",
    "25-2-783-A",
    "25-2-783-B",
    "25-2-783-C",
    "25-2-783-D",
    "25-2-783-A",
    "25-2-783-B",
    "25-2-783-C",
    "25-2-783-D"
  ]
}