{
  "id": "25-2-671",
  "title": "TOWN LAKE PARK TERMS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "(A)\n\nDevelopment of a natural area described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nnature trails with interpretive signs and facilities;\n\n(2)\n\nsurface parking with pervious material;\n\n(3)\n\nmaintenance and improvement of environmental quality, including fencing and wildlife\nand vegetation management; and\n\n(4)\n\ngeneral park support and maintenance.\n\n(B)\n\nDevelopment of a neighborhood park described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nwalking, exercise, and bicycle trails;\n\n(2)\n\nsurface parking and access roads;\n\n(3)\n\npicnic facilities;\n\n(4)\n\ngeneral neighborhood park uses, including playing fields, ball courts, swimming pools,\nand playscapes;\n\n(5)\n\nconcessions primarily serving an adjacent neighborhood, including food vending, bicycle\nrentals, and sports equipment rentals;\n\n(6)\n\ncultural facilities primarily serving an adjacent neighborhood;\n\n(7)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(8)\n\ngeneral park support and maintenance.\n\n(C)\n\nDevelopment of a community park described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\ndevelopment permitted in a neighborhood park;\n\n(2)\n\nmunicipal swimming pools and associated facilities;\n\n(3)\n\nconcessions designed to attract individuals from throughout the city, including boat\nrentals, food vending, dining facilities, special sports facilities, and special recreational\nfacilities;\n\n(4)\n\nsurface parking and parking structures;\n\n(5)\n\nperformance and special events facilities;\n\n(6)\n\nspecialized facilities, including facilities that serve the handicapped, private nonprofit\nrecreational facilities that serve the general public, and private park enhancement\nfacilities;\n\n(7)\n\nan internal park road system, with grade-separated intersections if required;\n\n(8)\n\nathletic facilities, including multipurpose sports fields and exercise courses;\n\n(9)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(10)\n\ngeneral park support and maintenance.\n\n(D)\n\nDevelopment of a cultural park described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\ncultural facilities and special event and performance areas;\n\n(2)\n\nparking structures and limited surface parking;\n\n(3)\n\nconcessions that are designed to attract people from throughout the city, that are\nmobile, temporary, or located in a building described in the Town Lake Park Plan,\nand that require a small amount of space, including pushcarts selling food or flowers,\ntemporary vending stands for special events, and museum gift shops;\n\n(4)\n\nwalking, exercise, and bicycle paths;\n\n(5)\n\nan internal park transportation system;\n\n(6)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(7)\n\ngeneral park support and maintenance.\n\n(E)\n\nDevelopment of an urban waterfront described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nplazas for performances and special events;\n\n(2)\n\nwide sidewalks for walking, exercising, and bicycle riding;\n\n(3)\n\nconcessions that are designed to attract people from throughout the city, are mobile,\ntemporary, or located in a building described in the Town Lake Park Plan, and require\na small amount of space, including pushcarts selling food or flowers, temporary vending\nstands for special events, and museum gift shops;\n\n(4)\n\nrowing facilities, boathouses, and similar water-related activities;\n\n(5)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(6)\n\ngeneral park support and maintenance.\n\n(F)\n\nDevelopment of an area of Town Lake Park not included in a natural area, neighborhood\npark, community park, cultural park, or urban waterfront described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nwalking, exercise, and bicycle trails;\n\n(2)\n\npicnic facilities;\n\n(3)\n\nsurface parking of pervious material and park access roads; and\n\n(4)\n\ngeneral park support and maintenance.\n\n(G)\n\nThis section does not apply to a community events use.\n\nSource: Section 13-2-228.1; Ord. 990225-70; Ord. 990902-57; Ord. 031211-11.",
  "start_line": 19963,
  "end_line": 20165,
  "subsections": []
}