{
  "id": "25-2-article-4",
  "title": "ADDITIONAL REQUIREMENTS FOR CERTAIN USES",
  "level": 1,
  "parent_id": null,
  "content": "### ARTICLE 4. - ADDITIONAL REQUIREMENTS FOR CERTAIN USES.\n\n(A)\n\nThe conservation single family residential use is permitted only:\n\n(1)\n\non properties zoned single family residence large lot (SF-1); and\n\n(2)\n\nwithin the drinking water protection zone.\n\n(B)\n\nFor a conservation single family residential use, the base zoning district regulations\nare superseded by the requirements of this section.\n\n(C)\n\nProperties used for conservation single family residential use must be subdivided\nto create:\n\n(1)\n\ntwo or more residential lots, not to exceed the number of lots that would otherwise\nbe allowed on the property under SF-1 zoning, of no less than 3,600 square feet and\nno more than 5,750 square feet in area;\n\n(2)\n\na conservation lot consisting of the remainder of the property.\n\n(D)\n\nThe following site development standards apply to the residential lots used for conservation\nsingle family residential use:\n\n(1)\n\nminimum district size of 20,000 square feet.\n\n(2)\n\nminimum residential lot size of 3,600 square feet.\n\n(3)\n\nmaximum residential lot size of 5,750 square feet.\n\n(4)\n\nminimum lot width of 50 feet.\n\n(5)\n\njoint access driveways may be permitted as specified in Chapter 25-5, Article 5.\n\n(6)\n\nimpervious cover maximum of 60% for each residential lot.\n\n(7)\n\nall other site standards as specified for single family residence large lot (SF-1)\nzoning.\n\n(E)\n\nA conservation lot must be jointly owned and maintained by the owners of the individual\nresidential lots and preserved as undisturbed open space by means of a binding legal\nagreement, such as a conservation easement, approved by the City of Austin and a plat\nnote approved by the City of Austin and added at the time of subdivision.\n\n(F)\n\nThe total impervious cover for the property may not exceed maximum allowable impervious\ncover by watershed as specified in Chapter 25-8, including, but not limited to, Chapter 25-8, Article 12 (Save Our Springs Initiative).\n\n(G)\n\nImpervious cover shall be allocated among the individual lots within the property\nat the time of subdivision.\n\nSource: Ord. 20130425-107.\n\nA single-family residential use in a multi-family district must comply with the site\ndevelopment regulations for a family residence (SF-3) district prescribed by Section 25-2-492 (Site Development Regulations).\n\nSource: Ord. 041118-57.\n\n(A)\n\nFor a single-family attached residential use, the base zoning district regulations\nare superseded by the requirements of this section.\n\n(B)\n\nFor a single-family residential use:\n\n(1)\n\nminimum site area is 7,000 square feet;\n\n(2)\n\nminimum lot area is 3,000 square feet; and\n\n(3)\n\nminimum lot width, for a distance of 25 feet measured from the front property line,\nis:\n\n(a)\n\n25 feet; or\n\n(b)\n\non a cul-de-sac or curved street, 20 feet.\n\n(C)\n\nA lot may not contain more than one dwelling unit.\n\n(D)\n\nA site must contain two attached dwelling units.\n\n(E)\n\nBuilding coverage may not exceed 40 percent of the site.\n\n(F)\n\nImpervious cover may not exceed 45 percent of the site.\n\n(G)\n\nFor a dwelling unit with fewer than six bedrooms, not more than two parking spaces\nmay be located in the front yard.\n\n(H)\n\nFor a dwelling unit with six or more bedrooms, not more than four parking spaces may\nbe located in the front yard.\n\n(I)\n\nA fence is prohibited along the common lot line between attached single-family residential\nunits for a distance of 25 feet measured from the front lot line.\n\n(J)\n\nA single-family attached residential use is prohibited on property that is subject\nto a deed restriction that limits use of the property to single-family detached dwellings\nor that requires a minimum lot size that is larger than the minimum lot size required\nby this section.\n\nSource: Section 13-2-253; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 11, 11-13-23.\n\n(A)\n\nTo the extent of conflict, this section supersedes the base zoning district regulations.\n\n(B)\n\nFor a duplex, two-unit, and three-unit residential use:\n\n(1)\n\nminimum lot area is 5,750 square feet;\n\n(2)\n\nminimum front yard setback is 15 feet;\n\n(3)\n\nminimum rear yard setback is:\n\n(a)\n\nthe base zoning district minimum rear yard setback; or\n\n(b)\n\nfive feet when the lot is adjacent to:\n\n(i)\n\nan alley; or\n\n(ii)\n\nanother lot with a use that is permitted in a multifamily base zoning district or\nless restrictive base zoning district;\n\n(4)\n\nminimum street-side yard setback for a lot located on a corner and:\n\n(a)\n\non a Level 1 street is the greater of five feet from the property line or 10 feet\nfrom curb, or in the absence of curbs, from the edge of the pavement; or\n\n(b)\n\non a Level 2, Level 3, or Level 4 street is 10 feet from the property line;\n\n(5)\n\nminimum number of street-facing entrances is one;\n\n(6)\n\nmaximum building coverage is 40 percent; and\n\n(7)\n\nmaximum impervious cover is 45 percent.\n\n(C)\n\nDesign Standards Applicable to Duplex, Two-Unit, and Three-Unit Residential Use.\n\n(1)\n\nPorches.\n\n(a)\n\nA porch that is open on three sides may project into the front yard and include a\nroof.\n\n(b)\n\nA porch that projects into the front yard must be at least 15 feet from the front\nlot line.\n\n(c)\n\nA porch roof or overhang must be at least 13 feet from the front lot line.\n\n(2)\n\nImpervious Cover and Parking Placement.\n\n(a)\n\nImpervious cover in a front yard may not exceed 40 percent.\n\n(b)\n\nThe director may waive front yard impervious cover limitations if the director determines\nbacking a motor vehicle onto the adjacent roadway is unsafe and that a circular driveway\nor turnaround in the front yard is required.\n\n(c)\n\nNot more than four parking spaces may be located in the front street yard, or for\na corner lot, not more than four parking spaces may be located in the front street\nyard and side street yard combined.\n\n(3)\n\nGarage Placement.\n\n(a)\n\nIn this subdivision,\n\n(i)\n\nBUILDING FACADE means the front-facing exterior wall or walls of the first floor of\nthe residential structure closest to the primary street, and the term excludes the\nbuilding facade of the portion of that structure designed or used as a parking structure.\nProjections from front-facing exterior walls, including but not limited to eaves,\nchimneys, porches, stoops, box or bay windows, and other similar features as determined\nby the building official, are not considered part of the building facade.\n\n(ii)\n\nPARKING STRUCTURE means an attached or detached garage or carport.\n\n(b)\n\nA parking structure may not be closer to the front lot line than the front-most exterior\nwall of the first floor of the building facade.\n\n(c)\n\nIf a parking structure with an entrance that faces a front yard abutting public right-of-way\nis less than 20 feet behind the building facade, the width of the parking structure\nmay not exceed the width of the building facade as measured parallel to the front\nlot line.\n\n(D)\n\nReserved.\n\n(E)\n\nThis subsection applies to the area established in Subsection 1.2.1 of Chapter 252,\nSubchapter F (Residential Design and Compatibility Standards).\n\n(1)\n\nIn this subsection,\n\n(a)\n\nEXISTING DWELLING UNIT means a dwelling unit that is:\n\n(i)\n\nlegally permitted and occupied before December 7, 2023; or\n\n(ii)\n\ndescribed in an application for a residential permit that was submitted on or before\nDecember 7, 2023.\n\n(b)\n\nGROSS FLOOR AREA means the total enclosed area of all floors in a building with a\nclear height of more than six feet, measured to the outside surface of the exterior\nwalls, except as provided in this subsection.\n\n(2)\n\nGross Floor Area Exclusions.\n\n(a)\n\nFor a property that includes an existing dwelling unit that was constructed on or\nbefore December 31, 1960, the property owner may exclude the preserved square footage\nfrom the gross floor area if the requirements in Subsection (F) are met.\n\n(b)\n\nFor a property that includes an existing dwelling unit that was constructed on or\nafter January 1, 1961, and is at least 20 years old, the property owner may exclude\nthe preserved square footage from the gross floor area if the requirements in Subsection\n(F) are met.\n\n(3)\n\nFloor-to-area ratio for a duplex or two-unit residential use.\n\n(a)\n\nThe maximum floor-to-area ratio for the site is the greater of 0.55 or 3,200 square\nfeet.\n\n(b)\n\nExcept for an existing dwelling unit, a dwelling unit may not exceed the greater of\n0.4 or 2,300 square feet.\n\n(4)\n\nFloor-to-area ratio for three-unit residential use.\n\n(a)\n\nThe maximum floor-to-area ratio for the site is the greater of 0.65 or 4,350 square\nfeet.\n\n(b)\n\nExcept for an existing dwelling unit, a dwelling unit may not exceed the greater of\n0.4 or 2,300 square feet.\n\n(c)\n\nExcept for two existing dwelling units.\n\n(i)\n\ntwo dwelling units may not exceed the greater of 0.55 or 3,200 square feet if an existing\nunit on the site is not preserved; or\n\n(ii)\n\ntwo dwelling units may not exceed the greater of 0.65 or 4,350 square feet if an existing\nunit on the site is preserved under Subsection (F).\n\n(F)\n\nPreserving Existing Dwelling Units. This subsection applies to an applicant who chooses\nto preserve an existing dwelling unit and wants the preserved square footage excluded\nfrom gross floor area as described in Subsection (E).\n\n(1)\n\nGeneral.\n\n(a)\n\nIn order to exclude the preserved square footage from the gross floor area, an applicant\nmust comply with the requirements in this subsection and the rules adopted by the\nbuilding official.\n\n(b)\n\nAn applicant must submit a request on a form approved by the building official and\ninclude all of the information required by the building official.\n\n(c)\n\nThe building official may adopt requirements for administering and enforcing this\nsubsection. Because this program includes preserving existing dwelling units, the\nbuilding official's requirements should incorporate the historic preservation officer's\nfeedback as needed.\n\n(2)\n\nIf the existing dwelling unit was constructed on or before December 31, 1960, the\nfollowing applies:\n\n(a)\n\nThe property owner must preserve at least 50 percent of the existing dwelling unit\nand 100 percent of the street-facing façade.\n\n(b)\n\nThe property owner must limit alterations and remodels to the existing dwelling unit\nas described in this paragraph.\n\n(i)\n\nFor a structure with a side-gabled, cross-gabled, hipped, or pyramidal roof form,\nthe property owner must limit remodeling and alterations to the area behind the existing\ndwelling unit's roof ridgeline or peak.\n\n(ii)\n\nFor a structure with a front-gabled, shed roof or flat roof form, the property owner\nmust limit remodeling and alterations to the lesser of 15 feet from the front façade\nof the existing dwelling unit or one-half of the width of the front wall of the existing\ndwelling unit.\n\n(c)\n\nIf the development requires a 15-foot clearance on the side of the existing dwelling\nunit to build other allowable dwelling units, an existing or converted carport or\ngarage may be altered or removed to provide the clearance.\n\n(d)\n\nIf the property is designated as a historic landmark or located within a historic\ndistrict, the Historic Design Standards or applicable design standards apply and control\nover this subsection.\n\n(3)\n\nIf the existing dwelling unit was constructed on or after January 1, 1961, and is\nat least 20 years old, the property owner must preserve at least 50 percent of the\nexisting dwelling unit.\n\nSource: Section 13-2-254; Ord. 990225-70; Ord. 000309-39; Ord. 030605-49; Ord. 031120-44;\nOrd. 031211-11; Ord. 20060216-043; Ord. 20060309-058; Ord. 20060622-022; Ord. 20060928-022;\nOrd. 20080618-093; Ord. No. 20231102-028, Pt. 12, 11-13-23; Ord. No. 20231207-001, Pt. 8, 12-18-23; Ord. No. 20250227-039, Pt. 2, 10-1-25; Ord. No. 20250424-073, Pt. 1, 5-5-25.\n\n**Editor's note—**\nOrd. No. 20231207-001, Pt. 9, effective December 18, 2023, repealed § 25-2-774, which pertained to Two-Family\nResidential Use and derived from Section 13-2-255; Ord. 990225-70; Ord. 000511-108;\nOrd. 000831-65; Ord. 031211-11; Ord. 041118-59; Ord. No. 20151119-080, Pt. 1, 11-30-15.\n\n(A)\n\nNot more than one townhouse is permitted on a townhouse lot.\n\n(B)\n\nThe minimum lot width for a townhouse is 20 feet.\n\n(C)\n\nAt least 3,600 square feet of site area is required for each townhouse.\n\n(D)\n\nAt least two connected townhouses are required on a townhouse site.\n\n(E)\n\nA townhouse lot must include a private yard that complies with the zoning district\nopen space requirement. A wall or solid fence, not less than five feet in height,\nis required along a side lot line that adjoins a required private yard.\n\n(F)\n\nThe width of a driveway that serves only one townhouse and that is located in the\nfront yard of the townhouse lot may not exceed 50 percent of the lot width.\n\n(G)\n\nA driveway that serves more than one townhouse may include not more than 50 percent\nof the combined area of the required street yards of the townhouses served by the\ndriveway. The driveway may have not more than two points of vehicular access to a\npublic street.\n\n(H)\n\nThis subsection applies in an SF-5 district.\n\n(1)\n\nA townhouse group with access to a local residential street:\n\n(a)\n\nmust be located at least 100 feet from other townhouse groups with access to a local\nresidential street; and\n\n(b)\n\nmay include not more than six townhouses.\n\n(2)\n\nA townhouse group with access to a street other than a local residential street:\n\n(a)\n\nmust be located at least 300 feet from other townhouse groups with access to a street\nother than a local residential street; and\n\n(b)\n\nmay include not more than ten townhouses.\n\nSource: Section 13-2-256; Ord. 990225-70; Ord. 000309-39; Ord. 031211-11.\n\n(A)\n\nFor a condominium residential use in a SF-5, SF-6, or multi-family district, the base\nzoning district regulations are superseded by the requirements of this section.\n\n(B)\n\nThe minimum site area for a condominium residential use is 14,000 square feet.\n\n(C)\n\nAt least 3,500 square feet of site area is required for each condominium.\n\n(D)\n\nThis subsection applies in an SF-5 district.\n\n(1)\n\nA condominium site must be at least 300 feet from other condominium sites in an SF-5\ndistrict.\n\n(2)\n\nA condominium use is prohibited on a site with access only to a local residential\nstreet.\n\n(3)\n\nA condominium site may include not more than ten condominium units.\n\n(4)\n\nA parking space may not be located in a required front street yard, except for a parking\nspace in a driveway.\n\n(E)\n\nThis subsection applies in an SF-6 district.\n\n(1)\n\nThe building official may not issue a certificate of occupancy until the owner of\nthe property has complied with state requirements concerning condominiums. A note\nregarding this requirement must be included on the site plan.\n\n(2)\n\nA parking space may not be located in a required front street yard, except for a parking\nspace in a driveway.\n\n(F)\n\nA condominium use with 10 or more dwelling units in a building constructed after the\neffective date of this ordinance must comply with the open space requirements in Chapter 25-2, Subchapter E, Section 2.7 (Private Common Open Space and Pedestrian Amenities) except as provided by this subsection.\n\n(1)\n\nCompliance with the open space requirements in Chapter 25-2, Subchapter E, Section 2.7 (Private Common Open Space and Pedestrian Amenities) is not required if the development is:\n\n(a)\n\nlocated in:\n\n(i)\n\nthe University Neighborhood Overlay and the applicant elects to comply with Subchapter\nC, Article 3, Division 9 (University Neighborhood Overlay District) of this chapter; or\n\n(ii)\n\nthe central business district (CBD); or\n\n(iii)\n\nthe downtown mixed use (DMU) district; or\n\n(b)\n\ncertified under a local, state, or federal affordable housing program and located\nwithin ¼ mile safe pedestrian travel distance of an existing and developed public\npark or multi-use trail, measured from the boundary of the site to the nearest public\nentrance of the park or multi-use trail.\n\n(2)\n\nIn evaluating safe pedestrian travel distances under Paragraph (1)(b), consideration\nshall be given to factors affecting the suitability of the area for pedestrian travel,\nincluding physical or topographic barriers, traffic volumes, pedestrian crosswalks,\nand accessible routes compliant with the Americans with Disabilities Act.\n\n(G)\n\nA condominium use with less than 10 dwelling units must provide private personal open\nspace in accordance with the requirements of this subsection.\n\n(1)\n\nThe open space must be a minimum of five percent of the gross site area of the property.\n\n(2)\n\nAn area of private personal open space at ground level must contain at least 100 square\nfeet and may not be less than ten feet across in each direction.\n\n(3)\n\nAn area of private personal open space above ground level must contain at least 50\nsquare feet and may not be less than five feet across in each direction.\n\n(4)\n\nThe requirements of this subsection do not apply to a condominium use located within\ndevelopment that meets the requirements in Subsection (F)(1) of this section.\n\nSource: Section 13-2-257; Ord. 990225-70; Ord. 000309-39; Ord. 031211-11; Ord. 20111215-096.\n\n(A)\n\nThis subsection applies to a retirement housing use.\n\n(B)\n\nThe following are required for a retirement housing use:\n\n(1)\n\ndoors wide enough to accommodate wheelchairs in the areas normally open to residents;\n\n(2)\n\nramps or elevators wherever steps are located in all areas normally open to residents;\n\n(3)\n\nstructurally mounted grab bars around showers, tubs, and toilets;\n\n(4)\n\nemergency signal facilities located three to four feet above floor level in individual\nunits and designed to register a signal that is continuously monitored at the property,\na fire station, or a location that provides public emergency services;\n\n(5)\n\nelectrical outlets located at least 24 inches above floor level;\n\n(6)\n\ncooking facilities without open flames;\n\n(7)\n\nnonskid floors or low pile carpeting in all areas normally open to residents;\n\n(8)\n\nlever handles on doors and plumbing fixtures;\n\n(9)\n\nwindows placed that allow occupants views of the outside while seated; and\n\n(10)\n\nanti-scalding devices on showers, bathtubs, and sinks.\n\n(C)\n\nA retirement housing (small site) use in an SF-3 district must be at least 300 feet\nfrom other retirement housing (small site) uses. The distance is measured from lot\nline to lot line.\n\n(D)\n\nThe owner of a retirement housing use shall register the use with the Austin Housing\nAuthority and other local agencies that provide housing assistance to elderly or physically\nhandicapped persons.\n\nSource: Sections 13-2-259; Ord. 990225-70; Ord. 990520-38; Ord. 031211-11.\n\n(A)\n\nThis section applies to a single-family residential use.\n\n(B)\n\nThe minimum front yard setback is the lesser of:\n\n(1)\n\nthe setback prescribed by Section 25-2-492 (Site Development Regulations); or\n\n(2)\n\nthe setback prescribed by Subsection (D) or (E).\n\n(C)\n\nIn making a determination under Subsection (D) or (E), only a side lot with a single-family\nresidential use is considered.\n\n(D)\n\nThis subsection applies to an interior lot.\n\n(1)\n\nIf the lots on both sides of an interior lot are legally developed, the minimum front\nyard setback of the interior lot is equal to the average of the setbacks of the principal\nstructures on the side lots.\n\n(2)\n\nIf only one lot on a side of an interior lot is legally developed, the minimum front\nyard setback of the interior lot is equal to the setback of the principal structure\non the side lot.\n\n(E)\n\nThis subsection applies to a corner lot.\n\n(1)\n\nIf the lot on the side of the corner lot is legally developed, the minimum front yard\nsetback of the corner lot is equal to the setback of the principal structure on the\nside lot.\n\n(2)\n\nIf the lot on the side of the corner lot is vacant, the minimum front yard setback\nof the corner lot is equal to the average setbacks of the principal structures on\nthe other lots in the block on the same side of the street.\n\nSource: Ord. 030925-64; Ord. 031211-11; Ord. No. 20231207-001, Pt. 17, 12-18-23.\n\n(A)\n\nThis section applies to a small lot single-family residential use.\n\n(B)\n\nThis section supersedes the base zoning district regulations to the extent of conflict.\n\n(C)\n\nOnly one dwelling unit is permitted on a lot.\n\n(D)\n\nThis subsection applies to small lot single-family residential use on a property zoned\nsingle-family residence small lot (SF-4A) district or less restrictive.\n\n(1)\n\nThe minimum lot size is:\n\n(a)\n\n3,600 square feet; or\n\n(b)\n\nfor a corner lot, 4,500 square feet.\n\n(2)\n\nA lot that fronts on a cul-de-sac must have:\n\n(a)\n\na chord width of not less than 33 feet at the front lot line;\n\n(b)\n\na width of not less than 40 feet at the front yard setback line; and\n\n(c)\n\na width of not less than 40 feet at all points 50 feet or more behind the front lot\nline.\n\n(3)\n\nThe maximum height for a structure is 35 feet.\n\n(4)\n\nThe minimum front yard setback is 15 feet.\n\n(5)\n\nThe minimum street side yard setback is 10 feet.\n\n(6)\n\nThe minimum interior side yard setback is three and one-half feet, except:\n\n(a)\n\nan interior side yard setback is not required if the interior side yard is adjacent\nto property zoned single-family residence small lot (SF-4A) district; and\n\n(b)\n\nthe combined width of the interior side yards of a lot may not be less than seven\nfeet.\n\n(7)\n\nThe minimum rear yard setback is five feet, excluding easements.\n\n(8)\n\nThe minimum setback between a rear access easement and a building or fence is 10 feet.\n\n(9)\n\nThe maximum building coverage is 55 percent.\n\n(10)\n\nThe maximum impervious cover is 65 percent.\n\n(11)\n\nA small lot single-family residential use must comply with the requirements of Section 25-4-232 (Small Lot Subdivisions).\n\n(E)\n\nSubsections (F) through (M) apply to small lot single-family residential use on property\nzoned family residence (SF-3) district or more restrictive.\n\n(F)\n\nLot Standards.\n\n(1)\n\nA lot must be at least 1,800 square feet but less than 5,750 square feet.\n\n(2)\n\nLot Width.\n\n(a)\n\nExcept for a flag lot, a lot must be at least 15 feet wide.\n\n(b)\n\nExcept for the portion of a flag lot that provides street access, a flag lot must\nbe at least 20 feet wide.\n\n(3)\n\nA flag lot must comply with Section 25-4-177 (Flag Lots).\n\n(4)\n\nExcept as provided in Subdivisions (5) and (6), the following setbacks apply:\n\n(a)\n\nThe minimum street side yard setback:\n\n(i)\n\non a Level 1 street is the greater of five feet from the property line or 10 feet\nfrom curb, or in the absence of curbs, from the edge of the pavement; or\n\n(ii)\n\non a Level 2, Level 3, or Level 4 street is 10 feet from the property line.\n\n(b)\n\nThe minimum side yard setback is:\n\n(i)\n\nfive feet;\n\n(ii)\n\nzero feet if adjacent to the portion of a flag lot that provides street access; or\n\n(iii)\n\nzero feet for a side lot line that is shared with a lot that was subdivided to less\nthan 5,750 square feet and was approved on or after August 16, 2024.\n\n(c)\n\nThe minimum front yard setback is:\n\n(i)\n\n10 feet; or\n\n(ii)\n\nfive feet if the lot is a flag lot;\n\n(iii)\n\nzero feet if the lot is a flag lot and the front lot line is shared with a lot that\nis shared with a lot that was subdivided to less than 5,750 square feet on or after\nAugust 16, 2024.\n\n(d)\n\nThe minimum rear yard setback is:\n\n(i)\n\nfive feet; or\n\n(ii)\n\nzero feet for a rear lot line that is shared with a lot that was subdivided to less\nthan 5,750 square on or after August 16, 2024.\n\n(5)\n\nExcept for a street side yard setback, when an attached dwelling unit abuts a property\nline, the minimum setback for that property line is zero.\n\n(6)\n\nProjections into Required Yards.\n\n(a)\n\nA windowsill, belt course, cornice, flue, chimney, eave, awning, box window, or cantilevered\nbay window may project two feet into a required yard. The two-foot limitation does\nnot apply to a feature required for a passive energy design.\n\n(b)\n\nA one-story uncovered porch, stoop, or steps may project three feet into a required\nyard.\n\n(G)\n\nBuilding cover limits do not apply to a property zoned family residence (SF-3) district\nor more restrictive.\n\n(H)\n\nImpervious Cover.\n\n(1)\n\nThe maximum impervious cover is the maximum allowed in the base zoning district regulations.\n\n(2)\n\nExcept for a flag lot, the maximum front yard impervious cover for driveways and parking\nareas is 50 percent.\n\n(I)\n\nSubchapter F (Residential Design and Compatibility Standards) does not apply to a property zoned family residence (SF-3) district or more restrictive\nexcept as provided in Subsection (J).\n\n(J)\n\nGross Floor Area.\n\n(1)\n\nThis subsection applies to a property located within the area described in Subsection\n1.2.1 of Subchapter F (Residential Design and Compatibility Standards).\n\n(2)\n\nGROSS FLOOR AREA means the total enclosed area of all floors in a building with a\nclear height of more than six feet, measured to the outside surface of the exterior\nwalls, except as provided in this subsection.\n\n(3)\n\nThe gross floor area may not exceed the greater of 1,650 square feet or a floor-to-area\nratio of 0.55.\n\n(4)\n\nThe maximum unit size is 2,300 square feet.\n\n(K)\n\nDesign Standards.\n\n(1)\n\nThis subsection does not apply to a flag lot.\n\n(2)\n\nThe minimum number of street-facing entrances is one.\n\n(3)\n\nGarage Placement\n\n(a)\n\nIn this subsection,\n\n(i)\n\nBUILDING FACADE means the front-facing exterior wall or walls of the first floor of\nthe residential structure closest to the primary street, and the term excludes the\nbuilding facade of the portion of that structure designed or used as a parking structure.\nProjections from front-facing exterior walls, including but not limited to eaves,\nchimneys, porches, stoops, box or bay windows, and other similar features as determined\nby the building official, are not considered part of the building facade.\n\n(ii)\n\nPARKING STRUCTURE means an attached or detached garage or carport.\n\n(b)\n\nA parking structure may not be closer to the front lot line than the front-most exterior\nwall of the first floor of the building facade.\n\n(c)\n\nIf a parking structure with an entrance that faces a front-yard abutting public right-of-way\nis less than 5 feet behind the building facade, the width of the parking structure\nmay not exceed the width of the building facade as measured parallel to the front\nlot line.\n\n(L)\n\nAccess Requirements for Driveways.\n\n(1)\n\nFor lot widths less than 20 feet, the site may only take vehicular access off an improved\nalley or from a side street.\n\n(2)\n\nFor lot widths 20 feet or greater but less than 30 feet, the site may only take vehicular\naccess off of an improved alley, from a side street, or through a joint-use driveway\nwith adjoining lots.\n\n(3)\n\nFor lot widths of 30 feet or greater, the site may take vehicular access off of an\nimproved alley, through a joint-use driveway with adjoining lots, or by individual\ndriveway.\n\n(M)\n\nReserved.\n\nSource: Ord. 041118-57; Ord. No. 20240516-006, Pt. 5, 5-27-24; Ord. No. 20250227-039, Pt. 2, 10-1-25.\n\n(A)\n\nA multifamily use with 10 or more dwelling units in a building constructed after the\neffective date of this ordinance must comply with the open space requirements of Chapter 25-2, Subchapter E, Section 2.7 (Private Common Open Space and Pedestrian Amenities) except as provided by this subsection.\n\n(1)\n\nCompliance with the open space requirements in Chapter 25-2, Subchapter E, Section 2.7 (Private Common Open Space and Pedestrian Amenities) is not required if the development is:\n\n(a)\n\nlocated in:\n\n(i)\n\nthe University Neighborhood Overlay and the applicant elects to comply with Subchapter\nC, Article 3, Division 9 (University Neighborhood Overlay District) of this chapter; or\n\n(ii)\n\nthe central business district (CBD); or\n\n(iii)\n\nthe downtown mixed use (DMU) district; or\n\n(b)\n\ncertified under a local, state, or federal affordable housing program and located\nwithin ¼ mile safe pedestrian travel distance of an existing and developed public\npark or multi-use trail, measured from the boundary of the site to the nearest public\nentrance of the park or multi-use trail.\n\n(2)\n\nIn evaluating safe pedestrian travel distances under Paragraph (1)(b), consideration\nshall be given to factors affecting the suitability of the area for pedestrian travel,\nincluding physical or topographic barriers, traffic volumes, pedestrian crosswalks,\nand accessible routes compliant with the Americans with Disabilities Act.\n\n(B)\n\nA multifamily use with less than 10 dwelling units must provide private personal open\nspace in accordance with the requirements of this subsection.\n\n(1)\n\nThe open space must be a minimum of five percent of the gross site area of the property.\n\n(2)\n\nAn area of private personal open space at ground level must contain at least 100 square\nfeet and may not be less than 10 feet across in each direction.\n\n(3)\n\nAn area of private personal open space above ground level must contain at least 50\nsquare feet and may not be less than five feet across in each direction.\n\n(4)\n\nThe requirements of this subsection do not apply to a multifamily use located within\na development that meets the requirements in Subsection (A)(1) of this section.\n\n(C)\n\nThis subsection applies to a multifamily use that is located in a transit-oriented\ndevelopment district or on a core transit corridor or future core transit corridor\nand that complies with the requirements in Subsection (C)(3).\n\n(1)\n\nThe following site area and parking requirements apply to a dwelling unit that contains\n500 square feet or less.\n\n(a)\n\nthe minimum site area requirement is zero; and\n\n(b)\n\nparking is to be leased separately.\n\n(2)\n\nFor a three-bedroom unit the minimum site area requirement is zero.\n\n(3)\n\nThe site area and parking requirements in Subsection (C)(1) and the site area requirements\nin Subsection (C)(2) apply if the use meets the affordability requirements of this\nsubsection.\n\n(a)\n\nFor owner-occupied units, ten percent of the units 500 square feet or less, or three\nbedroom units, shall be reserved as affordable for ownership and occupancy by households\nearning no more than 80 percent of the current Annual Median Family Income for the\nCity of Austin Metropolitan Statistical Area, for not less than 99 years from the\ndate the first certificate of occupancy is issued for ownership and occupancy.\n\n(b)\n\nFor rental units, ten percent of the units 500 square feet or less, or three bedroom\nunits, shall be reserved as affordable for occupancy by households earning no more\nthan 50 percent of the current Annual Median Family Income for the City of Austin\nMetropolitan Statistical Area, for not less than 40 years from the date the first\ncertificate of occupancy is issued.\n\n(4)\n\nNotwithstanding the requirements stated in Subsection (C)(3), at least one unit must\nbe reserved as affordable.\n\nSource: Ord. 20111215-096; Ord. 20111215-096; Ord. No. 20141211-228, Pt. 1, 12-22-14; Ord. No. 20231102-028, Pt. 13, 11-13-23.\n\n(A)\n\nA residential structure may be used as a bed and breakfast residential use only if\nit qualifies as a Group 1 or Group 2 bed and breakfast residential use structure.\n\n(B)\n\nExcept as provided in Subsection (D), a Group 1 bed and breakfast residential use\nstructure is a structure that contains not more than:\n\n(1)\n\nfive rental units if the building in which the bed and breakfast residential use is\nlocated is more than 50 years old; or\n\n(2)\n\nthree rental units if the building in which the bed and breakfast residential use\nis located is 50 years old or less.\n\n(C)\n\nExcept as provided in Subsection (D), a Group 2 bed and breakfast residential use\nstructure is a structure that contains not more than:\n\n(1)\n\n10 rental units if the building in which the bed and breakfast residential use is\nlocated is more than 50 years old; or\n\n(2)\n\nfive rental units if the building in which the bed and breakfast residential use is\nlocated is 50 years old or less.\n\n(D)\n\nFor an establishment that operated as a lodging house residential use on or before\nOctober 1, 1994:\n\n(1)\n\na Group 1 bed and breakfast residential use structure is a structure that contains\nnot more than five rental units; and\n\n(2)\n\na Group 2 bed and breakfast residential use structure is a structure that contains\nnot more than 10 rental units.\n\nSource: Ord. 990520-38; Ord. 031211-11.\n\n(A)\n\nA person may own only one bed and breakfast residential use facility.\n\n(B)\n\nThe owner must reside in the bed and breakfast residential use structure or in another\nresidential structure on the lot on which the structure is located.\n\n(C)\n\nThe owner of a bed and breakfast residential use structure must own the land on which\nthe structure is located.\n\n(D)\n\nThe owner must obtain a license to operate a bed and breakfast residential use structure.\nThe license must be renewed annually.\n\n(E)\n\nThe owner of a bed and breakfast residential use may employ one or more persons who\ndo not permanently reside on the lot on which the use is located to assist in the\noperation of the bed and breakfast residential use if the total hours worked by the\nemployees does not cumulatively total more than 40 hours per week.\n\n(F)\n\nMeal service is prohibited, except for breakfast service to an overnight guest.\n\n(G)\n\nA register of guests must be maintained.\n\n(H)\n\nA person may not structurally alter the exterior of a Group 1 residential use structure\nto change the existing residential character of the structure.\n\n(I)\n\nA bed and breakfast residential use must be more than 1,000 feet from an existing\nbed and breakfast residential use. A City council-adopted neighborhood plan that permits\nspacing of 1,000 feet or less supersedes this subsection.\n\n(J)\n\nA Group 1 bed and breakfast residential use must be located in the principal residential\nstructure on the lot.\n\n(K)\n\nEach bed and breakfast residential use structure of a Group 2 bed and breakfast residential\nuse facility must comply with this section and other applicable Code requirements.\n\nSource: Ord. 990520-38; Ord. 031211-11.\n\n(A)\n\nA bed and breakfast residential use structure may contain:\n\n(1)\n\none room for each 500 square feet of gross floor area within the structure if the\nowner resides in the structure; and\n\n(2)\n\none room for each 700 square feet of gross floor area within the structure if the\nowner resides in another residential structure on the lot.\n\n(B)\n\nIn this section, gross floor area does not include rooms occupied exclusively by the\nowner.\n\nSource: Ord. 990520-38; Ord. 031211-11.\n\n(A)\n\nPervious pavers may be used as driveway and parking surface materials within the property\nboundaries.\n\n(B)\n\nNot more than 25 percent of the parking surface may be constructed of gravel.\n\n(C)\n\nA guest parking space is not permitted in the front yard of a bed and breakfast residential\nuse structure.\n\nSource: Ord. 990520-38; Ord. 031120-44; Ord. 031211-11.\n\nAdvertising the street address of a bed and breakfast residential use through signs,\nbillboards, television, radio, or newspapers is prohibited.\n\nSource: Ord. 990520-38; Ord. 031211-11.\n\n(A)\n\nThe use of a bed and breakfast residential use facility as a rented site for a gathering,\nincluding a wedding, is a conditional use.\n\n(B)\n\nA conditional use permit may be approved only if:\n\n(1)\n\nthe bed and breakfast residential use structure is located in a multifamily residence\n(limited density) or less restrictive base district; and\n\n(2)\n\na certificate of occupancy has been issued that authorizes the use of the site for\na gathering.\n\n(C)\n\nThe maximum number of attendees at a gathering held under this section equals four\ntimes the total of the number of parking spaces for rental units plus the number of\nspaces on the property that are not required for other uses on the property.\n\n(D)\n\nAmplified live outdoor music is prohibited at a gathering.\n\n(E)\n\nA gathering must end at 9:00 p.m. on Sunday through Thursday and at 10:30 p.m. on\nFriday and Saturday.\n\n(F)\n\nThe Land Use Commission may not approve an increase of the maximum number of attendees,\nauthorize amplified live outdoor music, or extend the hours of operation through the\nconditional use process.\n\n(G)\n\nThe Land Use Commission may reduce the hours of operation.\n\nSource: Ord. 990520-38; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe owner of an establishment that operated as a lodging house residential use on\nor before October 1, 1994, may submit to the director an application for a waiver\nof the requirements prescribed in Section 25-2-782(A), (B), (C), (E), (H), (I), and (J) (General Requirements), Section 25-2-783 (Number of Rooms), and Section 25-2-784 (Parking Requirements).\n\n(B)\n\nThe director shall give notice of a waiver application under Section 25-1-133(A) (Notice of Application and Administrative Decisions).\n\n(C)\n\nExcept as provided in Subsection (D), a waiver application shall be considered by\nthe director. The director shall grant a waiver application if the director determines\nthat the waiver will not harm the surrounding area. An applicant may appeal the denial\nof an application by the director to the Land Use Commission.\n\n(D)\n\nIf an interested party files a protest of a waiver application, the application shall\nbe considered by the Land Use Commission.\n\n(E)\n\nThe Land Use Commission shall review a waiver application filed under this section\nin accordance with the conditional use process described in Chapter 25-5, Article 3 (Land Use Commission Approved Site Plans).\n\nSource: Ord. 990520-38; Ord. 010607-8; Ord. 031211-11.\n\nFootnotes:\n\n--- (**2**) ---\n\n**Editor's note—**\nOrd. No. 20250227-039, Pt. 1, effective October 1, 2025, repealed §§ 25-2-788—25-2-799, which pertained\nto requirements for short-term rental uses and derived from Ord. 20120802-122; Ord.\n20130926-144; Ord. No. 20151119-080, Pts. 4—7, 11-30-15; Ord. No. 20151217-098, Pt 1, 12-28-15; Ord. No. 20160223-A.1, Pts. 1, 2, 3-5-16; Ord. No. 20231207-001, Pts. 10, 11, 12-18-23.\n\n(A)\n\nIn this title:\n\n(1)\n\nADULT ARCADE means a movie arcade, game arcade, or other business that primarily offers\nstill or motion pictures or games that emphasize specified sexual activities or specified\nanatomical areas.\n\n(2)\n\nADULT BOOKSTORE means a business:\n\n(a)\n\nthat primarily offers books, magazines, films or videotapes, periodicals, or other\nprinted or pictorial materials that emphasize specified sexual activities or specified\nanatomical areas; and\n\n(b)\n\nin which at least 35 percent of the gross floor area is devoted to offering merchandise\ndescribed in Subsection (A)(2)(a).\n\n(3)\n\nADULT CABARET means a business that primarily offers live entertainment that emphasizes\nspecified sexual activities or specified anatomical areas.\n\n(4)\n\nADULT LOUNGE means an adult cabaret that serves alcoholic beverages.\n\n(5)\n\nADULT NOVELTY SHOP means a business that primarily sells products that emphasize specified\nsexual activities or specified anatomical areas, and in which at least 35 percent\nof the gross floor area is devoted to the sale of those products.\n\n(6)\n\nADULT-ORIENTED BUSINESS means an adult arcade, adult bookstore, adult cabaret, adult\nlounge, adult novelty shop, adult service business, or adult theater.\n\n(7)\n\nADULT SERVICE BUSINESS means an adult encounter parlor, adult retreat, nude modeling\nstudio, or a commercial enterprise that holds itself out to be primarily in the business\nof offering a service that is distinguished or characterized by an emphasis on depicting,\ndescribing, or relating to specified sexual activities or specified anatomical areas.\n\n(8)\n\nADULT THEATER means a business that primarily exhibits motion pictures that emphasize\nspecified sexual activities or specified anatomical areas.\n\n(9)\n\nSPECIFIED SEXUAL ACTIVITIES means:\n\n(a)\n\nhuman genitals in a state of sexual stimulation or arousal;\n\n(b)\n\nacts of human masturbation, sexual intercourse, or sodomy; or\n\n(c)\n\nerotic touching of human genitals, the pubic region, the buttock, or the female breast.\n\n(10)\n\nSPECIFIED ANATOMICAL AREAS means:\n\n(a)\n\nless than completely and opaquely covered:\n\n(i)\n\nhuman genitals or pubic region;\n\n(ii)\n\nbuttock;\n\n(iii)\n\nfemale breast below a point immediately above the top of the areola; or\n\n(b)\n\nhuman male genitals in a discernibly turgid state, even if completely and opaquely\ncovered.\n\n(B)\n\nOn-premises advertisements, displays, or other promotional materials for an adult-oriented\nbusiness that emphasize specified sexual activities or specified anatomical areas\nmust not be visible from public or semi-public places outside the business.\n\n(C)\n\nExcept as provided in Subsection (E), an adult-oriented business other than an adult\nlounge is a permitted use in a CS, CS-1, or CH zoning district and is a conditional\nuse in a CBD or DMU zoning district.\n\n(D)\n\nExcept as provided in Subsection (E), an adult lounge is a conditional use in a CBD,\nDMU, CS-1, or CH zoning district.\n\n(E)\n\nAn adult-oriented business may not be located on a lot:\n\n(1)\n\nthat is within 1,000 feet of a lot on which another adult-oriented business is located;\n\n(2)\n\nthat is within 1,000 feet of a lot on which a school, church, public park or playground,\nlicensed day-care center, museum, or library is located; or\n\n(3)\n\nwhere 50 percent or more of the lots within a 1,000 foot radius are zoned or used\nfor a residential use.\n\n(F)\n\nA radius or distance described in Subsection (E) is measured from the midpoint of\na line joining the two most distant points on the boundaries of the lot.\n\n(G)\n\nFor purposes of this section, \"museum\" means a building or site devoted to the acquisition,\nconservation, study, exhibition, or educational interpretation of objects having scientific,\nhistoric, or artistic value.\n\nSource: Section 13-2-265; Ord. 990225-70; Ord. 031211-11; Ord. No. 20150416-029, Pt. 1, 4-27-15.\n\n(A)\n\nFor an art gallery use in a general office (GO) or more restrictive district, the\nsale of art supplies, equipment, or accessories is prohibited.\n\n(B)\n\nThis subsection applies to an art workshop use in a community commercial (GR) or more\nrestrictive district.\n\n(1)\n\nThe use may not:\n\n(a)\n\nexceed 5,000 square feet of gross floor area; or\n\n(b)\n\nproduce external noise, vibration, smoke, dust, odor, heat, glare, fumes, electrical\ninterference, or waste runoff.\n\n(2)\n\nThe following are prohibited:\n\n(a)\n\nthe outdoor storage of materials; and\n\n(b)\n\nthe use of welding equipment, fiberglass, or epoxy.\n\nSource: Ord. 040617-Z-1.\n\nA commercial blood plasma center is a conditional use if the use is within:\n\n(1)\n\none-half mile of another commercial blood plasma center; or\n\n(2)\n\n540 feet of a lot zoned or used for a residence, church, public or private school,\npublic park or playground, or day-care facility.\n\nSource: Sections 13-2-233 and 13-2-333; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nFor a communication service facilities use, the base zoning district regulations are\nsuperseded by the requirements of this section.\n\n(B)\n\nBase zoning district requirements for lot size, lot width, floor area ratio, and building\ncoverage do not apply.\n\n(C)\n\nThe minimum side yard width is the lesser of:\n\n(1)\n\nfive feet; or\n\n(2)\n\nthe width required by the site development regulations for the base district.\n\n(D)\n\nAt least 50 percent of the yard areas must be landscaped, and one tree at least six\nfeet in initial height is required in the front yard. The following landscaping requirements\ndo not apply:\n\n(1)\n\nSubsection 25-2-983(B) (Final Inspection);\n\n(2)\n\nSubsections 25-2-1001(C) and (D) (Procedures);\n\n(3)\n\nSubsections 25-2-1003(B) and (C) (General Requirements);\n\n(4)\n\nSubsections 25-2-1005(C), (D), (E), and (F) (Trees);\n\n(5)\n\nSubsection 25-2-1006(A) (Visual Screening);\n\n(6)\n\nSection 25-2-1007 (Parking Lots); and\n\n(7)\n\nSection 25-2-1008 (Irrigation Requirements).\n\n(E)\n\nImpervious cover may not exceed the greater of the maximum percentage permitted by\nthe applicable site development regulations for the base zoning district; or\n\n(1)\n\nfor a site less than 2,500 square feet in size, 95 percent;\n\n(2)\n\nfor a site at least 2,500 and not more than 3,600 square feet in size, 85 percent;\n\n(3)\n\nfor a site at least 3,600 and not more than 5,000 square feet in size, 50 percent;\nor\n\n(4)\n\nfor a site more than 5,000 square feet in size, 45 percent.\n\n(F)\n\nA structure may not exceed 12 feet in height and must be set back at least 25 feet\nfrom a front or side street if the structure is located:\n\n(1)\n\nin an SF-6 or more restrictive zoning district; or\n\n(2)\n\nacross a street from or adjacent to property that is zoned or used for a use permitted\nin an SF-5 or more restrictive zoning district,\n\n(G)\n\nA structure's location must not create a visual obstruction to traffic.\n\nSource: Section 13-2-268; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA drop-off recycling collection facility must comply with the requirements of this\nsubsection.\n\n(1)\n\nA facility must be located in an enclosed structure or enclosable trailer, or be screened\non three sides by a solid fence or wall not less than six feet high. This requirement\ndoes not apply to a single-feed reverse vending machine.\n\n(2)\n\nA facility must be at least 100 feet from an adjoining property that is zoned or used\nfor SF-5 or more restrictive use.\n\n(3)\n\nA sign that is visible to the public identifying the facility operator, its telephone\nnumber, its hours of operation, and the City of Austin Recycling Hotline telephone\nnumber is required.\n\n(4)\n\nA facility operator shall exchange a trailer that contains a facility for another\ntrailer when the facility reaches its capacity. The operator shall place a replacement\ntrailer in the exact location of the trailer it replaced, unless the trailer is in\nthe fenced boundaries of a drop-off recycling collection facility site.\n\n(5)\n\nStorage containers that are marked to identify the materials to be deposited are required.\nCoverable containers for paper and plastic products are required for an unenclosed\nfacility. A sign near the containers stating materials may only be deposited between\nthe hours of 7:00 a.m. and 10:00 p.m. is required.\n\n(6)\n\nStorage and unloading areas must be paved.\n\n(7)\n\nThe facility operator shall remove all deposited materials from the facility:\n\n(a)\n\nat least once a week; or\n\n(b)\n\nwhen the containers for a material are full.\n\n(8)\n\nA facility operator may not remove deposited materials between the hours of 8:00 p.m.\nand 8:00 a.m.\n\n(9)\n\nA facility operator shall keep the facility free of refuse and putrescible materials.\n\n(10)\n\nA facility operator may not use power driven processing equipment at an unenclosed\nfacility. This limitation does not apply to a bulk or single-feed reverse vending\nmachine.\n\n(11)\n\nA facility that shares a site with another use may not be designed or operated to\ninterfere with the off-street parking, shared parking, traffic circulation, or access\nrequired by the other use.\n\n(B)\n\nThe operator may seek a waiver of a requirement of Subsection (A) from the council.\nThe waiver request must demonstrate that:\n\n(1)\n\ncompliance with the requirement is an undue hardship on the applicant;\n\n(2)\n\nwaiver of the requirement will not adversely affect surrounding properties; and\n\n(3)\n\nthe facility substantially complies with requirements of this section.\n\nSource: Sections 13-2-224 and 13-2-271; Ord. 990225-70; Ord. 031120-44; Ord. 031211-11;\nOrd. 050127-64.\n\n(A)\n\nThis section applies to a plant nursery use.\n\n(B)\n\nIn a neighborhood commercial (LR) district, the site area may not exceed one acre.\n\n(C)\n\nStorage areas for herbicides, pesticides, or fertilizers, if any, must be shown on\nthe site plan.\n\n(D)\n\nThis subsection applies to products that are required by the Environmental Protection\nAgency to be labeled \"combustible\", \"corrosive\", \"danger\", \"flammable\", \"highly flammable\",\n\"poison\", or \"warning\".\n\n(1)\n\nStorage or display of a product is required to be:\n\n(a)\n\nin an enclosed building; and\n\n(b)\n\nfor a site larger than one acre, separated from property used or zoned for a residential\nuse by at least 75 feet plus 20 feet for each acre of site area over one acre.\n\n(2)\n\nTotal storage and display area:\n\n(a)\n\nis limited to 100 square feet for each acre, or portion of an acre, of site area;\nand\n\n(b)\n\nmay not exceed 1,000 square feet.\n\n(E)\n\nA bulk storage area for soil, compost, or a similar product outside of an enclosed\nbuilding:\n\n(1)\n\nmay not exceed 10 percent of the site area;\n\n(2)\n\nmust be at least 25 feet from property used or zoned for a residential use;\n\n(3)\n\nmust be screened from view from adjacent property used or zoned for a residential\nuse; and\n\n(4)\n\nmay not cause noxious odors that are detectible from adjacent property used or zoned\nfor a residential use.\n\nSource: Section 13-2-274; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to a site if:\n\n(1)\n\nthe structure and land are zoned as a historic landmark (H) or historic area (HD)\ncombining district;\n\n(2)\n\nthe property is owned and operated by a non-profit entity;\n\n(3)\n\nthe property is directly accessible from a street with at least 40 feet of paving;\n\n(4)\n\nthe site has at least one acre of contiguous land area;\n\n(5)\n\nat least 80 percent of the parking is on site;\n\n(6)\n\na single commercial use does not occupy more than 25 percent of the gross floor area;\n\n(7)\n\ncivic uses occupy at least 50 percent of the gross floor area; and\n\n(8)\n\nthe property owner does not discriminate on the basis of race, color, religion, sex,\nnational origin, sexual orientation, age, or physical disability in leasing the property.\n\n(B)\n\nIf not otherwise permitted in the base district, the following are conditional uses\non a site described in Subsection (A):\n\n(1)\n\nadministrative and business offices;\n\n(2)\n\ngeneral retail sales (convenience);\n\n(3)\n\nindoor entertainment;\n\n(4)\n\nrestaurant (limited) without drive-in service; and\n\n(5)\n\ncultural services.\n\nSource: Sections 13-2-1 and 13-2-234; Ord. 990225-70; Ord. 000309-39; Ord. 031211-11;\nOrd. 031211-41; Ord. 041202-16; Ord. No. 20231102-028, Pt. 14, 11-13-23.\n\n(A)\n\nA restaurant (general) use must comply with the requirements of this subsection.\n\n(1)\n\nThe restaurant must contain kitchen facilities that are adequate for the preparation\nof the food to be sold. The adequacy of the kitchen facilities is based on the seating\ncapacity of the restaurant and the type of menu offered.\n\n(2)\n\nThe menu must provide a variety of entrees, a list of all food items for sale, and\nthe price of each item.\n\n(B)\n\nA restaurant (general) use that serves alcoholic beverages must comply with the requirements\nof this subsection.\n\n(1)\n\nAt least 51 percent of the gross income of a restaurant must be derived from the sale\nof prepared food.\n\n(2)\n\nAn area within a restaurant devoted to the preparation, sale, and consumption of alcoholic\nbeverages may not be operated or advertised under a name different from the restaurant.\nAn outside sign, separate identification, or advertising for the area within the restaurant\ndevoted to the preparation, sale, and consumption of alcoholic beverages must be incidental\nto and in conjunction with the restaurant use.\n\n(3)\n\nLive entertainment is permitted if the amplified sound does not exceed 70 decibels,\nmeasured at the property line of the licensed premises. In this paragraph, \"premises\"\nhas the meaning ascribed to it in the Texas Alcoholic Beverage Code.\n\n(4)\n\nThe building official may order a verified audit that includes documents submitted\nto taxing authorities. A person's failure to timely produce requested documents is\nprima facie evidence of a violation of this chapter.\n\n(C)\n\nA restaurant that requires a late-hours permit from the Texas Alcoholic Beverage Commission\nis a conditional use if:\n\n(1)\n\nArticle 10 (Compatibility Standards) applies to the restaurant; and\n\n(2)\n\nArticle 10 (Compatibility Standards) is not waived in accordance with Article 10, Division 3 (Waivers).\n\n(D)\n\nFor a cocktail lounge or a restaurant with a late-hours permit:\n\n(1)\n\nall parking must be shown on the site plan that is required for a conditional use\npermit or compatibility standards waiver; and\n\n(2)\n\ncompliance with the parking area setback described in Section 25-5-146 (Conditions of Approval) is required.\n\nSource: Section 13-2-263; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn a neighborhood commercial (LR) district, a restaurant (limited) use is:\n\n(1)\n\na conditional use if it has drive-in service; and\n\n(2)\n\nprohibited if it exceeds 3,000 square feet of gross floor area, and the site abuts\nproperty:\n\n(a)\n\nzoned as an urban family residence (SF-5) or more restrictive district; or\n\n(b)\n\non which a use permitted in a SF-5 or more restrictive district is located.\n\n(B)\n\nin a general office (GO), commercial recreation (CR), or neighborhood commercial (LR)\ndistrict, the outdoor seating area, if any, for a restaurant (limited) use may not\nexceed 50 percent of the indoor seating area. Seating area is measured in square feet.\n\nSource: Ord. 031211-41.\n\n(A)\n\nThis section applies to a printing and publishing use in a community commercial (GR)\nor more restrictive district.\n\n(B)\n\nThe use may not:\n\n(1)\n\nexceed 5,000 square feet of gross floor area; or\n\n(2)\n\nproduce external noise, vibration, smoke, dust, odor, heat, glare, fumes, electrical\ninterference, or waste runoff.\n\n(C)\n\nThe following are prohibited:\n\n(1)\n\nthe outdoor storage of materials; and\n\n(2)\n\nthe wholesale distribution of goods.\n\n(D)\n\nThe use is limited to printing equipment typically used in a business office.\n\nSource: Ord. 040617-Z-1.\n\n(A)\n\nThis section applies to an electronic testing use.\n\n(B)\n\nIn this section, the terms \"hazardous waste\" and \"conditionally exempt small quantity\ngenerator\" have meanings assigned to them by Texas Administrative Code Title 30, Chapter\n335.\n\n(C)\n\nAn activity that generates hazardous waste is prohibited, unless the waste is generated\nby a conditionally exempt small quantity generator.\n\n(D)\n\nAn electronic testing use must comply with the requirements for a planned development\narea prescribed by Section 25-2-648 (Planned Development Area Performance Standards).\n\n(E)\n\nAn electronic testing use is a conditional use in DMU and CBD base zoning districts,\nunless the following requirements are met, in which case electronic testing is permitted:\n\n(1)\n\nthe building in which the electronic testing use is located is a single-tenant building,\nbut not including any pedestrian-oriented uses on the ground floor;\n\n(2)\n\nthe building in which the electronic testing use is located is less than 90 feet in\nheight;\n\n(3)\n\nthe building in which the electronic testing use is located does not contain residential\nuses; and,\n\n(4)\n\nthe proposed electronic testing use does not require Group H occupancy, per\nChapter 25-12 Article 1\n(Building Code).\n\nSource: Ord. 020627-Z34; Ord. 20110804-008; 20130620-092.\n\n(A)\n\nIn this section:\n\n(1)\n\nPERMIT HOLDER means the person to whom the health authority issues a permit for a\nmobile food establishment permit required by Chapter 10-3 (Food and Food Handlers) of the City Code.\n\n(2)\n\nMOBILE FOOD ESTABLISHMENT has the meaning established in Title 25, Part 1, Section 229.162 (Definitions) of the Texas Administrative Code and Section 10-3-1 (Definitions) of the City Code.\n\n(3)\n\nSOUND EQUIPMENT has the meaning established in Section 9-2-1 (Definitions) of the City Code.\n\n(B)\n\nA mobile food establishment is not permitted on private property except as provided\nin this section.\n\n(C)\n\nA mobile food establishment:\n\n(1)\n\nmust be licensed by the health authority;\n\n(2)\n\nis permitted in all commercial and industrial zoning districts, except in a neighborhood\noffice (NO), limited office (LO), or general office (GO) zoning district;\n\n(3)\n\nmay not be located within 50 feet of a lot with a building that contains both a residential\nand commercial use;\n\n(4)\n\nmay not operate between the hours of 3:00 a.m. and 6:00 a.m.; and\n\n(5)\n\nmay not be located within 20 feet of a restaurant (general) or restaurant (limited)\nuse.\n\n(D)\n\nThe noise level of mechanical equipment or outside sound equipment used in association\nwith a mobile food establishment may not exceed 70 decibels when measured at the property\nline that is across the street from or abutting a residential use.\n\n(E)\n\nA drive-in service is not permitted.\n\n(F)\n\nExterior lighting must be hooded or shielded so that the light source is not directly\nvisible to a residential use.\n\n(G)\n\nA mobile food establishment is limited to signs attached to the exterior of the mobile\nfood establishment. The signs:\n\n(1)\n\nmust be secured and mounted flat against the mobile food establishment; and\n\n(2)\n\nmay not project more than six inches from the exterior of the mobile food establishment.\n\n(H)\n\nDuring business hours, the permit holder shall provide a trash receptacle for use\nby customers.\n\n(I)\n\nThe permit holder shall keep the area around the mobile food establishment clear of\nlitter and debris at all times.\n\n(J)\n\nA permanent water or wastewater connection is prohibited.\n\n(K)\n\nElectrical service may be provided only by:\n\n(1)\n\ntemporary service or other connection provided by an electric utility; or\n\n(2)\n\nan onboard generator.\n\n(L)\n\nA request that the city council require a mobile food establishment in a neighborhood\nassociation area to comply with the additional distance requirements set forth in\nSubsection (N) may be made in accordance with this subsection.\n\n(1)\n\nThe following persons may submit an application to the director requesting that the\ncity council require mobile food establishments in a neighborhood association area\nto comply with Subsection (N):\n\n(a)\n\nfor an area with an adopted neighborhood plan:\n\n(i)\n\nthe chair of the official planning area contact team; or\n\n(ii)\n\nan officer of a neighborhood association if there is no official planning area contact\nteam; or\n\n(b)\n\nfor an area without an adopted neighborhood plan, an officer of a neighborhood association.\n\n(2)\n\nThe director shall accept an application made under this subsection during February\nof each year. The council shall consider the applications annually.\n\n(3)\n\nNotice in English and Spanish of a public hearing on the application by the council\nis required. The City is responsible for the cost of the notice. The director shall\ngive notice not later than the 16th day before the date of the public hearing by:\n\n(a)\n\npublishing notice in a newspaper of general circulation; and\n\n(b)\n\nmailing notice to:\n\n(i)\n\neach mobile food establishment licensed by the health authority; and\n\n(ii)\n\neach registered neighborhood association.\n\n(4)\n\nThe director shall maintain a map that depicts the areas to which Subsection (O) applies.\n\n(5)\n\nA neighborhood association must be registered with the Public Information Office of\nthe City.\n\n(M)\n\nThe requirements of Subsection (N) may be added to an ordinance zoning or rezoning\nproperty as a neighborhood plan combining district in accordance with Section 25-2-1406 (Ordinance Requirements).\n\n(N)\n\nThe subsection establishes additional distance requirements that may be applied under\nSubsections (L) or (M).\n\n(1)\n\nA mobile food establishment may not be less than 50 feet from property:\n\n(a)\n\nin a SF-5 or more restrictive district; or\n\n(b)\n\non which a residential use permitted in a SF-5 or more restrictive district is located.\n\n(2)\n\nA mobile food establishment may operate between 6:00 a.m. and 10:00 p.m. if the mobile\nfood establishment is more than 50 feet and not more than 300 feet from a property:\n\n(a)\n\nin a SF-5 or more restrictive district; or\n\n(b)\n\non which a residential use permitted in a SF-5 or more restrictive district is located.\n\n(3)\n\nA mobile food establishment may operate between 6:00 a.m. and 3:00 a.m. if the mobile\nfood establishment is more than 300 feet from a property:\n\n(a)\n\nin a SF-5 or more restrictive district; or\n\n(b)\n\non which a residential use permitted in a SF-5 or more restrictive district is located.\n\n(O)\n\nA mobile food establishment must comply with Subsection (N) not later than the 60th\nday after the effective date of an ordinance adopted under Subsection (L) or (M).\n\n(P)\n\nThis subsection applies to a mobile food establishment that is located on the same\nsite as a restaurant (limited) or restaurant (general) use and serves food provided\nby the restaurant (limited) or restaurant (general) use. The mobile food establishment:\n\n(1)\n\nmay only operate between the hours of 6:00 a.m. and 10:00 p.m. if the mobile food\nestablishment is located 300 feet or less from property in a SF-5 or more restrictive\ndistrict or on which a residential use permitted in a SF-5 or more restrictive district\nis located; and\n\n(2)\n\nmust comply only with Subsections (D), (F), (G), (H), and (I).\n\n(Q)\n\nThis ordinance does not apply to a mobile food establishment that is located on private\nproperty for three hours or less between the hours of 6:00 a.m. and 10:00 p.m.\n\n(R)\n\nA site plan, site plan exemption, or temporary use permit is not required for the\noperation of a mobile food establishment.\n\n(S)\n\nThe permit holder shall comply with the section. A violation of this section is a\nClass C misdemeanor.\n\nSource: Ord. 20060928-020; Ord. 20080131-134; Ord. 20110623-135; Ord. 20110804-008.\n\nA business that has a drive-through facility but does not have walk-in service must\nprovide safe and convenient access for pedestrians to the drive-through facility.\n\nSource: Ord. 20060831-068; Ord. 20110804-008.\n\nA service station use:\n\n(1)\n\nmust be screened from the street by a building or a landscape buffer that includes\nshade trees;\n\n(2)\n\nmay not have more than 16 fuel dispensers; and\n\n(3)\n\nmay not have more than eight vehicle queue lanes.\n\nSource: Ord. 20060831-068; Ord. 20110804-008.\n\n(A)\n\nIn this section, LARGE RETAIL USE means one of the following principal uses, including\nits accessory uses, with 100,000 square feet or more of gross floor area:\n\n(1)\n\nagricultural sales and services use;\n\n(2)\n\nart gallery use;\n\n(3)\n\nart workshop use;\n\n(4)\n\nautomotive repair services use;\n\n(5)\n\nautomotive sales use;\n\n(6)\n\nconstruction sales and services use;\n\n(7)\n\nequipment sales use;\n\n(8)\n\nfood sales use;\n\n(9)\n\ngeneral retail services (convenience) use;\n\n(10)\n\ngeneral retail sales (general) use;\n\n(11)\n\nliquor sales use;\n\n(12)\n\nmonument retail sales use;\n\n(13)\n\npawn shop services use;\n\n(14)\n\npersonal improvement services;\n\n(15)\n\npet services use;\n\n(16)\n\nplant nursery use;\n\n(17)\n\nrecreational equipment sales use;\n\n(18)\n\nrestaurant (general) use;\n\n(19)\n\nrestaurant (limited) use;\n\n(20)\n\nservice station use;\n\n(21)\n\nspecial use historic use; or\n\n(22)\n\nveterinary services use.\n\n(B)\n\nA large retail use is a conditional use.\n\nSource: Ord. 20070215-072; Ord. 20110804-008.\n\n(A)\n\nThis section applies to an alternative financial services business use.\n\n(B)\n\nA use may not be located on a site that is:\n\n(1)\n\nwithin 1,000 feet of a site that contains another alternative financial services business\nuse;\n\n(2)\n\nwithin 200 feet of a property in a base, combining or overlay district in which a\nresidential use is allowed or in which a residential use is located;\n\n(3)\n\nwithin 500 feet of the rights-of-way of Interstate Highway 35, U.S. Highway 183, U.S.\nHighway 290, Texas State Highway Loop 360, Texas State Highway Loop 1, Texas State\nHighway 130, or Texas State Highway 45; or\n\n(4)\n\nwithin the waterfront overlay district, the university neighborhood overlay district,\nor the area bounded by Interstate Highway 35, Airport Boulevard, and Town Lake.\n\n(C)\n\nA use may be located only within a freestanding structure and may not be co-located\nin the same structure with other uses.\n\nSource: Ord. 20120426-139.\n\n(A)\n\nAn electronic prototype assembly use is a conditional use in DMU and CBD base zoning\ndistricts, unless the following requirements are met, in which case electronic prototype\nassembly is permitted:\n\n(1)\n\nthe building in which the electronic prototype assembly use is located is a single-tenant\nbuilding and does not include any pedestrian-oriented uses on the ground floor;\n\n(2)\n\nthe building in which the electronic prototype assembly use is located is less than\n90 feet in height;\n\n(3)\n\nthe building in which the electronic prototype assembly use is located does not contain\nresidential uses; and,\n\n(4)\n\nthe proposed electronic prototype assembly use does not require Group H occupancy,\nper Chapter\n25-12 Article 1\n(Building Code).\n\nSource: Ord. 20130620-092.\n\n(A)\n\nDefinitions. In this section:\n\n(1)\n\nMOBILE RETAIL ESTABLISHMENT means a retail establishment that sells non-food items\nand services to an end user consumer from a movable vehicle or trailer that routinely\nchanges locations.\n\n(2)\n\nOPERATOR means a person who operates a mobile retail establishment.\n\n(3)\n\nRIGHT-OF-WAY means a public roadway and property dedicated or reserved for public\npedestrian or vehicular travel.\n\n(4)\n\nSOUND EQUIPMENT has the meaning established in Section 9-2-1 (Definitions) of the City Code.\n\n(B)\n\nApplicability. This section does not apply to a mobile food establishment defined\nin Section 25-2-812 (Mobile Food Establishments) of the City Code or to a mobile retail establishment that is located on private\nproperty for three hours or less between the hours of 6 a.m. and 11 p.m.\n\n(C)\n\nTime Limit. A mobile retail establishment may not remain at the same location for\nmore than 180 consecutive days.\n\n(D)\n\nRequired Approvals.\n\n(1)\n\nA person may not operate a mobile retail establishment until the director of the Planning\nand Development Review Department approves the establishment.\n\n(2)\n\nThe director of the Planning and Development Review Department shall approve an establishment\nif all of the following is provided by the operator:\n\n(a)\n\nthe name and address of the mobile retail establishment owner;\n\n(b)\n\nproof of motor vehicle or trailer registration;\n\n(c)\n\na description of the items that the mobile retail establishment sells;\n\n(d)\n\nproof of sales tax and use permit;\n\n(e)\n\nproof of Texas Department of Licensing and Regulation license(s), if applicable for\nPersonal Services use;\n\n(f)\n\nan itinerary of the locations where sales occur;\n\n(g)\n\nif at one location more than two hours, a written agreement from a business within\n150 feet of the location to allow employees of the mobile retail establishment to\nuse flushable restrooms or other facilities approved by the health authority during\nhours of operation;\n\n(h)\n\na fee, as established by separate ordinance; and\n\n(i)\n\nany other information reasonably required by the director of the Planning and Development\nReview Department to enforce this section.\n\n(3)\n\nA site plan, site plan exemption, or temporary use permit is not required for the\noperation of a mobile food establishment.\n\n(E)\n\nItems and Services to be Sold. An operator may only sell non-food retail items or\nservices. Mobile retail establishments may only sell items or services permitted under\na general retail sales (convenience) use, pet services use, and personal services\nuse. All sales items and supplies must be stored within the mobile unit.\n\n(F)\n\nZoning. A mobile retail establishment shall comply with the regulations in this section.\n\n(1)\n\nA mobile retail establishment is permitted in all commercial and industrial zoning\ndistricts except in a neighborhood office (NO), limited office (LO), or general office\n(GO) zoning district.\n\n(2)\n\nUnless located in a central business district (CBD) zoning district, a mobile retail\nestablishment may not be located less than fifty feet from a lot with a building that\ncontains both a residential and commercial use.\n\n(3)\n\nA mobile retail establishment may not be less than fifty feet from property:\n\n(a)\n\nin an SF-5 or more restrictive district; or\n\n(b)\n\non which a residential use permitted in an SF-5 or more restrictive district is located.\n\n(4)\n\nA person may not operate a mobile retail establishment between the hours of 11:00\np.m. and 6:00 a.m.\n\n(5)\n\nA mobile retail establishment may not be located less than twenty feet from a general\nretail sales (convenience) use, general retail sales (general) use, pet services use,\nor personal services use.\n\n(6)\n\nA drive-in service is not permitted.\n\n(7)\n\nExterior lighting must be hooded or shielded so that the light source is not directly\nvisible to a residential use.\n\n(8)\n\nA mobile retail establishment may not be located within the right-of-way unless the\nmobile retail establishment obtains and possesses the permission required under Sections\n14-8-2 (Permit Required; Waiver of Deadlines) and 14-9-21 (Street Vendor License Authorized) of the City Code.\n\n(9)\n\nA mobile retail establishment may not occupy or impede required accessible spaces\nor bicycle parking for another use.\n\n(G)\n\nNoise Level. The noise level of mechanical equipment or outside sound equipment used\nin association with a mobile retail establishment may not exceed seventy decibels\nwhen measured at the property line that is across the street from or abutting a residential\nuse.\n\n(H)\n\nSigns. A mobile retail establishment is limited to signs attached to the exterior\nof the mobile retail establishment. The signs:\n\n(1)\n\nmust be secured and mounted flat against the mobile retail establishment;\n\n(2)\n\nmay not project more than six inches from the exterior of the mobile retail establishment;\n\n(3)\n\nmay not use a flashing light source; and\n\n(4)\n\nmay not use an LED message board.\n\n(I)\n\nDebris and Litter. During business hours a mobile retail establishment shall provide\na trash receptacle for use by customers. The mobile retail establishment shall also\nkeep the area around the mobile retail establishment clear of litter and debris at\nall times.\n\n(J)\n\nUtilities. A permanent water or wastewater connection is prohibited. Electrical service\nmay be provided only by a temporary service or other connection provided by an electric\nutility or by an onboard generator.\n\n(K)\n\nWaste and Disposal. An operator must dispose of all waste generated by the mobile\nretail establishment in accordance with City Code regulations.\n\n(L)\n\nMobility. An operator must demonstrate that the vehicle or trailer is readily moveable\nif requested by the directors of the Planning and Development Review Department or\nthe Code Compliance Department.\n\n(M)\n\nOperations. An operator may not place sales items, equipment, or supplies that are\npart of its operations outside of the permitted unit and must conduct all of its operational\nactivities within the mobile retail establishment.\n\n(N)\n\nBad Actor.\n\n(1)\n\nThe director may revoke an approved application granted under this section if an operator\nprovides false information on an application or commits repeated violations of applicable\nlaw.\n\n(2)\n\nIn determining whether to revoke an approved application, the director shall consider\nthe frequency of any repeated violations, whether a violation was committed intentionally\nor knowingly, and any other information relevant to the degree to which an operator\nhas endangered the public health, safety, or welfare.\n\n(3)\n\nAn operator may appeal the director's decision to revoke an approved application to\nthe Planning Commission.\n\n(4)\n\nAn operator must file an appeal under this section with the director no later than\nthe 20th day following the date of the director's decision. The appeal must be on\na form approved by the director.\n\n(5)\n\nAfter notice and public hearing, the Planning Commission shall either uphold or overturn\nthe decision of the director. In making its decision, the Planning Commission shall\nconsider the criteria contained within this Subsection (N). The Planning Commission's\ndecision shall be final on this matter.\n\n(O)\n\nCompliance Required; Offense. An operator shall comply with this section. A violation\nof this section is a Class C misdemeanor.\n\nSource: Ord. No. 20140626-145, Pt. 1, 7-7-14; Ord. No. 20231102-028, Pt. 15, 11-13-23.\n\n(A)\n\nThe purpose of the performance venue is to enhance the development and preservation\nof venues that support art, music, and culture; and contribute to the City's status\nas the Live Music Capital of the World.\n\n(B)\n\nProduction Space.\n\n(1)\n\nA performance venue must allocate a minimum of 50 percent of the gross floor area\nfor production and programming space.\n\n(2)\n\nProduction and programming space includes stages, green rooms, box offices and ticketing\nbooths, audience areas, and equipment dedicated to producing plays, motion pictures,\nor other performances.\n\n(C)\n\nSale of Alcoholic Beverages.\n\n(1)\n\nA performance venue with a late-hours permit from the Texas Alcoholic Beverage Commission\n(TABC) is subject to Article 10 (Compatibility Standards) unless the venue is eligible for a waiver under Article 10, Division 3 (Waivers).\n\n(2)\n\nFor a performance venue with a late-hours permit:\n\n(a)\n\nan applicant must show all of the proposed parking on a site plan that is required\nfor a conditional use or compatibility standards waiver; and\n\n(b)\n\nthe site is subject to the parking area setback described in Section 25-5-146 (Conditions of Approval).\n\n(3)\n\nDuring the Conditional Use Permitting Process, the Land Use Commission may:\n\n(a)\n\nreduce the amount of gross floor area that can be dedicated as audience space if the\nLand Use Commission determines that the surrounding uses support a reduced amount\nof gross floor area; and\n\n(b)\n\nallow an outdoor entertainment area.\n\n(4)\n\nThe Land Use Commission shall identify the basis for its determination that surrounding\nuses support a reduced amount of gross floor area.\n\nSource: Ord. No. 20230914-097, Pt. 3, 9-25-23.\n\n(A)\n\nThis section applies to electric vehicle charging as a principal use.\n\n(B)\n\nThis section does not apply to electric vehicle charging as an accessory use.\n\n(C)\n\nThis section governs over a conflicting provision of this title or other ordinance\nunless the conflicting provision is more restrictive.\n\n(D)\n\nIn this section:\n\n(1)\n\na roadway description has the meaning assigned in Article 5 (Definitions) of Subchapter E; and\n\n(2)\n\ndistance is measured from lot line to lot line.\n\n(E)\n\nElectric vehicle charging stations may be located one level below ground and above.\n\n(F)\n\nElectric vehicle charging use is a permitted use on a site with a commercial or industrial\nbase zoning district and:\n\n(1)\n\nan existing service station use; or\n\n(2)\n\na discontinued service station use, if a subsequent use on the site did not include\na restaurant (general) use, a restaurant (limited) use, or a residential use.\n\n(G)\n\nSubject to the requirements of Subsections (H), (I), and (J), electric vehicle charging\nuse is a permitted or conditional use on a site zoned:\n\n(1)\n\ngeneral commercial services (CS);\n\n(2)\n\ncommercial liquor sales (CS-1);\n\n(3)\n\ncommercial highway (CH);\n\n(4)\n\nindustrial park (IP);\n\n(5)\n\nmajor industry (MI);\n\n(6)\n\nlimited industrial services (LI); or\n\n(7)\n\nresearch and development (R&D).\n\n(H)\n\nElectric vehicle charging use is a permitted use if:\n\n(1)\n\nthe site is:\n\n(a)\n\nzoned with a base zoning district described in Subsection (G);\n\n(b)\n\nlocated at least 1,000 feet from another lot with electric vehicle charging use as\nits principal use;\n\n(c)\n\n25,000 square feet or less; and\n\n(2)\n\nthe site front-faces or side-faces one of the following roadways:\n\n(a)\n\na core transit corridor;\n\n(b)\n\na future core transit corridor; or\n\n(c)\n\nan urban roadway.\n\n(I)\n\nElectric vehicle charging use is a permitted use if the site:\n\n(1)\n\nis zoned with a base zoning district described in Subsection (G); and\n\n(2)\n\nfront-faces or side-faces one of the following roadways:\n\n(a)\n\na suburban roadway;\n\n(b)\n\na highway;\n\n(c)\n\na hill country roadway; or\n\n(d)\n\nan internal circulation route.\n\n(J)\n\nElectric vehicle charging use is a conditional use if the site:\n\n(1)\n\nis zoned with a base zoning district described in Subsection (G); and\n\n(2)\n\nfront-faces or side-faces a roadway type adopted in Chapter 25-2 (Zoning) other than a roadway described in Subdivision (I)(2); or\n\n(3)\n\nis located within 1,000 feet of a highway cap or stitch.\n\nSource: Ord. No. 20240516-007, Pt. 2, 5-27-24.\n\n(A)\n\nThis section applies to a college and university facilities use.\n\n(B)\n\nA site must be located on a street that has a paved width of at least 40 feet from\nthe site to where it connects with another street that has a paved width of at least\n40 feet.\n\n(C)\n\nIf more than one dwelling unit is located on the site, the dwelling units must comply\nwith the requirements of this title that are applicable to residential uses.\n\nSource: Section 13-2-264; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 16, 11-13-23.\n\nThis section applies to a public or private primary or secondary school.\n\n(1)\n\nA site must be located on a street that has a paved width of at least 40 feet from\nthe site to where it connects with another street that has a paved width of at least\n40 feet.\n\n(2)\n\nIf more than one dwelling unit is located on the site, the dwelling units must comply\nwith the requirements of this title that are applicable to residential uses.\n\nSource: Section 13-2-261; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Section 25-2-835\n(School District Development Agreements), this section applies to development of a public primary or secondary educational\nfacility.\n\n(B)\n\nThis subsection specifies the minimum setback required from a public primary or secondary\neducational facility and an adjoining residential, intensive recreational, or activity\ncenter use.\n\n(1)\n\nWithin the boundaries of the Austin Independent School District, a public primary\nor secondary educational facility must be constructed within the setbacks required\nunder the applicable regulations of this chapter.\n\n(2)\n\nOutside the boundaries of the Austin Independent School District, a public primary\nor secondary educational facility may not be constructed closer than 25 feet from\nan adjoining residential use.\n\n(C)\n\nThis subsection specifies maximum height of a public primary or secondary educational\nfacility.\n\n(1)\n\nWithin the boundaries of the Austin Independent School District, the height of a public\nprimary or secondary educational facility may not exceed the lesser of:\n\n(a)\n\n60 feet;\n\n(b)\n\n30 feet, if the facility is located within 50 feet of a single-family residential\nbase district or a single-family use; or\n\n(c)\n\n40 feet, if the facility is located within 100 feet of a single-family residential\ndistrict or a single-family use.\n\n(2)\n\nOutside the boundaries of the Austin Independent School District, the height of a\npublic primary or secondary educational facility may not exceed the lesser of:\n\n(a)\n\ntwo stories or 30 feet, if the facility is located within 50 feet of a single-family\nresidential base district or single-family use; or\n\n(b)\n\nthree stories or 40 feet, if the facility is located within 100 feet of a single family\nresidential base district or single family use.\n\n(D)\n\nA public primary or secondary educational facility:\n\n(1)\n\nis exempt from requirements of this chapter limiting floor-to-area ratio;\n\n(2)\n\nis subject to Chapter 25-2, Subchapter C, Article 10 (Compatibility) within the boundaries of the Austin Independent School District, except that no\nopaque fencing or screening around any building or shielding for security lighting\nis required; and\n\n(3)\n\nis exempt from Chapter 25-2, Subchapter C, Article 10 (Compatibility) outside the boundaries of the Austin Independent School District, but must comply\nthe standards specified under this subsection.\n\n(a)\n\nAn intensive recreational use associated with a public primary or secondary educational\nfacility, excluding a multi-use trail and including a swimming pool, tennis court,\nball court, or playground, may not be constructed 50 feet or less from adjoining property:\n\n(i)\n\nin an SF-5 or more restrictive zoning district; or\n\n(ii)\n\non which a use permitted in an SF-5 or more restrictive zoning district is located.\n\n(b)\n\nExterior lighting must be hooded or shielded so that the light source is not directly\nvisible from adjacent property:\n\n(i)\n\nin an urban family residence (SF-5) or more restrictive zoning district; or\n\n(ii)\n\non which a use permitted in an SF-5 or more restrictive zoning district is located.\n\nSource: Ord. No. 20160623-090, Pt. 4, 7-4-16.\n\n**Editor's note—**\nOrd. No. 20160623-090, Pt. 4, effective July 4, 2016, repealed the former § 25-2-833,\nand enacted a new § 25-2-833 as set out herein. The former § 25-2-833 pertained to\npublic school facility standards. See References to Ordinances and Code Comparative\nTable for complete history.\n\nFees associated with review of a site plan or building permit application required\nfor a public primary or secondary educational facility are waived.\n\nSource: Ord. No. 20160623-090, Pt. 4, 7-4-16.\n\n**Editor's note—**\nOrd. No. 20160623-090, Pt. 4, effective July 4, 2016, repealed the former § 25-2-834, and enacted a new § 25-2-834 as set out herein.\nThe former § 25-2-834 pertained to public school facility waiver. See References to\nOrdinances and Code Comparative Table for complete history.\n\nDevelopment of an independent school district educational facility site may be governed\nby an agreement authorized by Section 212.902 of the Local Government Code. If the\nCity and an independent school district have executed an agreement, the terms of that\nagreement supersede the requirements of this title and the criteria manuals to the\nextent of conflict.\n\nSource: Section 13-2-620; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA club or lodge use that is located in a residential zoning district must comply with\nthe requirements of this section.\n\n(B)\n\nVehicular access from a dedicated street with a right-of-way at least 60 feet wide\nfor the length of the adjacent block face is required.\n\n(C)\n\nThe club or lodge must be operated as a nonprofit organization.\n\n(D)\n\nService of food and beverages, including alcoholic beverages, must be limited to service\nthat is incidental to the primary activity of the facility.\n\nSource: Section 13-2-266; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA community recreation use must comply with the requirements of this section.\n\n(B)\n\nVehicular access from a dedicated street with a right-of-way at least 60 feet wide\nfor the length of the adjacent block face is required.\n\n(C)\n\nA community recreation use must be operated as a nonprofit organization.\n\n(D)\n\nService of food and beverages must be limited to service that is incidental to the\nprimary activity of the facility. Service of alcoholic beverages is prohibited if\nthe majority of the participants in the primary activity are 18 years of age or younger.\n\n(E)\n\nIf a community recreation use is a conditional use, baseball, softball and football\nfields and other similar outdoor athletic fields must be at least 300 feet from an\nSF-5 or more restrictive zoning district.\n\nSource: Section 13-2-267; Ord. 990225-70; Ord. 031211-11.\n\nAn employee recreation use must be located on property reserved by a business for\nfuture expansion.\n\nSource: Section 13-2-232; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA tower used by a public agency exclusively for police, fire, emergency medical services,\n911 or other public emergency communications is exempt from the requirements of this\nsection and Section 25-2-840 (Special Requirements For Telecommunication Towers).\n\n(B)\n\nA telecommunication tower may exceed the height restrictions of the base zoning district\nand the compatibility standards in Article 10 (Compatibility Standards).\n\n(C)\n\nA telecommunication tower must be constructed in accordance with the most recent American\nNational Standard Institute structural standards for steel antenna towers.\n\n(D)\n\nNotwithstanding the requirements of Subsections (E), (F), and (G), a telecommunication\ntower that complies with the requirements of this subsection is permitted in any zoning\ndistrict.\n\n(1)\n\nThe tower must be a replacement for a functioning:\n\n(a)\n\nutility pole or light standard within a utility easement or public right of way;\n\n(b)\n\nrecreation facility light pole; or\n\n(c)\n\ntelecommunication tower.\n\n(2)\n\nThe tower, including antenna array, may not exceed the height of:\n\n(a)\n\nthe original utility pole, light standard, or recreation facility pole by more than\n10 feet; or\n\n(b)\n\nthe original telecommunication tower and antenna array.\n\n(3)\n\nThe tower may not obstruct a public sidewalk, public alley, or other public right\nof way.\n\n(4)\n\nThe tower must be similar in appearance and function to the pole, standard, or tower\nthat it replaces, except for the antennae.\n\n(E)\n\nA telecommunication tower described in Subsection (F) or (G) must comply with the\nrequirements of this subsection.\n\n(1)\n\nThe tower may not be located:\n\n(a)\n\non or within 300 feet of property that is zoned as a historic landmark (H) or historic\narea (HD) combining district or included in a National Register District;\n\n(b)\n\nwithin 50 feet of a day care services (commercial) use; or\n\n(c)\n\nwithin 50 feet of a dwelling unit.\n\n(2)\n\nThe tower must be of monopole construction and designed to accommodate at least two\nantenna array.\n\n(3)\n\nThe antenna array may not exceed tower height by more than 10 feet.\n\n(4)\n\nGuys and guy anchors must be at least 20 feet from adjoining property.\n\n(5)\n\nThe tower must be:\n\n(a)\n\nenclosed by security fencing; and\n\n(b)\n\nscreened from street view by landscaping at least six feet high.\n\n(6)\n\nThe tower must be identified by a sign visible from outside the screening. The sign\nmust state in letters at least two inches high the name and telephone number of the\ntower manager and the Federal Communications Commission license number.\n\n(F)\n\nA telecommunication tower that complies with the requirements of this subsection is\na permitted use in an SF-6 or less restrictive district, except for an MH district.\n\n(1)\n\nThe tower must be at least 200 feet from an MH district or use or an SF-5 or more\nrestrictive district or use.\n\n(2)\n\nThe tower, excluding antenna array, may not exceed the following height:\n\n(a)\n\n75 feet, for a tower less than 250 feet from an MH district or use or SF-5 or more\nrestrictive district or use;\n\n(b)\n\n100 feet, for a tower at least 250, but less than 540, feet from an MH district or\nuse or an SF-5 or more restrictive district or use; or\n\n(c)\n\n120 feet, for a tower 540 feet or more from an MH district or use or an SF-5 or more\nrestrictive district or use.\n\n(3)\n\nThe director may waive a requirement of this subsection for a minimum separation distance\nbetween a tower and an MH use or an SF-5 or more restrictive use if the director determines\nthat:\n\n(a)\n\nthe tower will be located in a GO or less restrictive district;\n\n(b)\n\nnot more than two uses that are MH uses or SF-5 or more restrictive uses are less\nthan the prescribed separation distance from the tower base;\n\n(c)\n\nthe MH uses or SF-5 or more restrictive uses that are less than the prescribed separation\ndistance from the tower base, if any, are located in SF-6 or less restrictive zoning\ndistricts; and\n\n(d)\n\nthe proposed tower location will not negatively affect a residential neighborhood.\n\n(G)\n\nA telecommunications tower that is not a permitted use under Subsection (F) is a conditional\nuse in an SF-6 or less restrictive district, except for an MH district, if the tower\ncomplies with the requirements of this subsection.\n\n(1)\n\nThe tower must be at least 75 feet from an MH district or use or an SF-5 or more restrictive\ndistrict or use.\n\n(2)\n\nThe tower, excluding antenna array, may not exceed the following height:\n\n(a)\n\n75 feet for a tower less than 100 feet from an MH district or use or an SF-5 or more\nrestrictive district or use;\n\n(b)\n\n100 feet, for a tower at least 100, but less than 200, feet from an MH district or\nuse or an SF-5 or more restrictive district or use;\n\n(c)\n\n120 feet, for a tower at least 200, but less than 300, feet from an MH district or\nuse or an SF-5 or more restrictive district or use; or\n\n(d)\n\na height set by the Land Use Commission, for a tower 300 feet or more from an MH district\nor use or SF-5 or more restrictive district or use.\n\n(3)\n\nThe Land Use Commission may waive a requirement of this subsection for a minimum separation\ndistance between a tower and an MH use or an SF-5 or more restrictive use if the Land\nUse Commission determines that:\n\n(a)\n\nthe tower will be located in a GO or less restrictive district;\n\n(b)\n\nnot more than two uses that are MH uses or SF-5 or more restrictive uses are less\nthan the prescribed separation distance from the tower base;\n\n(c)\n\nthe MH uses or SF-5 or more restrictive uses that are less than the prescribed separation\ndistance from the tower base, if any, are located in SF-6 or less restrictive zoning\ndistricts; and\n\n(d)\n\nthe proposed tower location will not negatively affect a residential neighborhood.\n\n(H)\n\nThe distance from a tower to a zoning district or use is measured:\n\n(1)\n\nalong a straight line from the center of the tower base to the nearest property line\nof the zoning district or use; or\n\n(2)\n\nfor a distance prescribed by Paragraph (E)(1)(c), along a straight line from the center\nof the tower base to the nearest exterior wall of the dwelling unit.\n\n(I)\n\nIn this section, a reference to an MH district or use or SF-5 or more restrictive\nzoning district or use does not include property that is:\n\n(1)\n\nvacant and unplatted;\n\n(2)\n\nused for a public or private primary or secondary educational facility;\n\n(3)\n\nused for a college or university educational facility;\n\n(4)\n\nowned by the United States, the State of Texas, a county, or the City, and not used\nfor an MH or SF-5 or more restrictive residential use;\n\n(5)\n\nused primarily for religious assembly;\n\n(6)\n\nused for a cemetery;\n\n(7)\n\nused for a non-residential, nonconforming use; or\n\n(8)\n\ndetermined by the director to be used in a manner similar to the uses described in\nthis subsection.\n\nSource: Sections 13-2-235 and 13-2-273; Ord. 990225-70; Ord. 000302-36; Ord. 010607-8;\nOrd. 031211-11; Ord. 041202-16.\n\n(A)\n\nAn application to construct a telecommunication tower described in Section 25-2-839(F) or (G) (Telecommunication Towers) must be accompanied by an affidavit that includes:\n\n(1)\n\na description of the search area for the tower location;\n\n(2)\n\nthe elevation required for the antenna array; and\n\n(3)\n\nthe reasons that the antenna array cannot be located on an existing tower or other\nstructure.\n\n(B)\n\nAn applicant who prepares an affidavit required by Subsection (A) shall record the\nname and address of each person the applicant contacts in attempting to locate the\nantenna array on an existing tower or other structure. If requested by the city manager,\nthe applicant shall disclose to the city manager the recorded information.\n\n(C)\n\nThis subsection applies if a telecommunication tower described in Section 25-2-839(F) or (G) (Telecommunication Towers) ceases to be used for wireless communications.\n\n(1)\n\nThe tower owner and the property owner shall notify the director that the tower is\nnot being used for wireless communications within 30 days of the cessation of use.\n\n(2)\n\nIf the tower is not used for wireless communications for a continuous one year period,\nthe tower owner and the property owner shall remove the tower. The tower owner and\nthe property owner shall finish the tower removal within 18 months of the date that\nwireless communications cease.\n\n(D)\n\nThe director shall maintain a map of all telecommunication towers located within the\nplanning jurisdiction.\n\nSource: Ord. 000302-36; Ord. 031204-53; Ord. 031211-11.\n\n**Editor's note—**\nOrd. No. 20231207-001, Pt. 12, effective December 18, 2023, repealed § 25-2-841, which pertained to group\nand family homes and derived from Sections 13-2-232 and 13-2-262; Ord. 990225-70;\nOrd. 031211-11.\n\n(A)\n\nThis section applies to a community events use.\n\n(B)\n\nA community events use is permitted only on:\n\n(1)\n\nCity-owned land located within the area bounded on the north by the southern right-of-way\nof Riverside Drive, on the east by the western right-of-way of South First Street,\non the south by the northern right-of-way of Barton Springs Road, and on the west\nby a line 1,500 feet west of and parallel to the western right-of-way of South First\nStreet; and\n\n(2)\n\nCity-owned land located with the area bounded on the north by a line 650 feet north\nof and parallel to the northern right-of-way of Toomey Road, on the east by the western\nright-of-way of South Lamar Boulevard, on the south by northern right-of-way of Toomey\nRoad, and on the west by a line 700 feet west of and parallel to the western right-of-way\nof South Lamar Boulevard.\n\n(C)\n\nCouncil approval is required for a site plan for a community events use. Approval\nof a site plan:\n\n(1)\n\nestablishes the site development regulations; and\n\n(2)\n\nwaives regulations that are inconsistent with the site plan, if any.\n\n(D)\n\nA public hearing is required for each site plan considered under this section. The\ndirector shall give notice of the public hearing in accordance with Section 25-1-132(C) (Notice of Public Hearing).\n\nSource: Ord. 990902-57; Ord. 031211-11; Ord. 20130228-078.\n\n(A)\n\nThe following are conditional uses in all commercial, industrial, and special purpose\nbase districts:\n\n(1)\n\na heli-facility or heliport, as defined in Chapter 13-1, Article 4 (Heliports and Helicopter Operations); and\n\n(2)\n\nexcept as provided in Subsection (B), a landing field for hot air balloons or nonfixed-wing\naircraft.\n\n(B)\n\nAn advertising or promotional event involving the use of a hot air balloon is a permitted\nuse in all commercial, industrial, and special purpose base districts. The approval\nof the building official, the director, and the director of Aviation is required for\nthe event.\n\nSource: Section 13-2-270; Ord. 990225-70; Ord. 031211-11; Ord. 20130620-088.\n\n(A)\n\nThis section applies to a recycling center.\n\n(B)\n\nA recycling center site must have at least 150 feet of frontage on a public street.\n\n(C)\n\nAn outdoor unloading area for recyclable materials must be at least 50 feet from a\nmore restrictive zoning district. This requirement does not apply to a portion of\na site that abuts a railroad right-of-way.\n\n(D)\n\nThe portion of a site used for truck maneuvering or the storage, bailing, processing,\nor other handling of recyclable material must be enclosed by a solid fence or wall\nwith a nonglare finish not less than eight feet in height. This requirement does not\napply to a portion of a site that abuts a railroad right-of-way.\n\n(E)\n\nA loading or unloading area or a truck maneuvering area must be paved.\n\n(F)\n\nA facility operator shall keep the facility free of refuse and putrescible materials.\n\n(G)\n\nA facility operator may not use chemical or heating processes on the recyclable materials.\n\nSource: Section 13-2-272; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to an urban farm use.\n\n(B)\n\nAn urban farm is allowed within the critical water quality zone if it meets the requirements\nin 25-8-261(B)(4) (Critical Water Quality Zone Development) for sustainable urban agriculture or a community garden.\n\n(C)\n\nA site area for an urban farm shall not be less than one acre and not more than five\nacres.\n\n(D)\n\nThe number of dwelling units allowed on a site may not exceed the number of dwelling\nunits allowed under the base zoning district regulations. Notwithstanding the foregoing,\nnot more than two units are allowed on the site. Animal raising in accordance with\nSection 25-2-863(F) is not allowed without a dwelling on the site. Accessory structures are permitted\nwithout a dwelling.\n\n(E)\n\nRaising livestock is prohibited notwithstanding Chapter 3-2 of the City Code.\n\n(F)\n\nFor properties not zoned residential, raising, slaughtering, processing and composting\nof fowl, rabbits, and aquatic foods using an aquaponic system is permitted in accordance\nwith Chapter 3-2 (Restrictions on Animals) of the City Code. One animal (either fowl or rabbit) may be processed per 1/10\nth\nof an acre per week. Composting, slaughtering or processing of animals must take place\nat least 50 feet from the nearest residential structure other than the structure associated\nwith the use. Slaughtering and processing animals must take place out of public view.\n\nFor properties zoned residential, raising of fowl, rabbits, and aquatic foods using\nan aquaponic system is permitted in accordance with Chapter 3-2 (Restrictions on Animals) of the City Code. Slaughtering and processing of aquatics foods is permitted. Slaughtering,\nprocessing of fowl and rabbits is prohibited. Composting of animal parts is prohibited\nin residential zoning districts.\n\n(G)\n\nWater conservation practices must be followed, at minimum in accordance with Chapter\n6-4 (Water Conservation) of the City Code.\n\n(H)\n\nThe use of synthetic inputs is prohibited. An Integrated Pest Management Plan, developed\nin accordance with the Environmental Criteria Manual and approved by the Watershed\nProtection Department, must be followed.\n\n(I)\n\nAgricultural and value-added agricultural products raised by the farmer or produced\nwithin the State of Texas may be sold from the site or distributed off-site to buyers.\nAgricultural products and value-added agricultural products produced off-site by someone\nother than the farmer cannot exceed 20% of the retail space by area.\n\n(J)\n\nEmployees are permitted. The maximum number of full-time, non-seasonal employees is\ntwo for each full acre, plus two for the remaining portion of an acre, if any. This\ndoes not include the property owner.\n\n(K)\n\nThe residential character of the lot and dwelling must be maintained.\n\n(L)\n\nFor an urban farm use, a sign is permitted in accordance with Chapter 25-10-155 (Urban Farm Sign).\n\n(M)\n\nAgricultural education activities as referenced in Chapter 25-2-7 (Agricultural Uses Described) do not require a temporary use permit.\n\nSource: Ord. 000406-86; Ord. 031211-11; Ord. 20110210-018; Ord. 20131121-105, Pt. 3, 3-21-14.\n\n(A)\n\nThis section applies to a market garden use.\n\n(B)\n\nA market garden is allowed within the critical water quality zone if it meets the\nrequirements in 25-8-261 (Critical Water Quality Zone Development) for sustainable urban agriculture or a community garden.\n\n(C)\n\nA site area for a market garden shall not be more than one acre.\n\n(D)\n\nA dwelling unit must be located on the site.\n\n(E)\n\nThe number of dwellings units on a site may not exceed the number of dwelling units\nallowed under the base zoning district regulations. A market garden is a permitted\nuse in all base zoning districts.\n\n(F)\n\nRaising of fowl, rabbits, and aquatic foods using aquaponic systems is permitted in\naccordance with Chapter 3-2 (Restrictions on Animals) of the City Code. On-site slaughtering, processing or composting of animals is not\npermitted.\n\n(G)\n\nThe use of synthetic inputs is prohibited. An Integrated Pest Management Plan, developed\nin accordance with the Environmental Criteria Manual and approved by the director,\nmust be followed.\n\n(H)\n\nWater conservation practices must be followed, at minimum in accordance with Chapter\n6-4 (Water Conservation) of the City Code.\n\n(I)\n\nAgricultural products produced on-site may be sold from the site or distributed off-site\nto buyers. On-site farm stands are not permitted. Sales must be conducted out of sight\nof the general public on the property. No more than three customer-related trips per\nday are permitted.\n\n(J)\n\nEmployees are permitted. The maximum number of full-time employees is one. This does\nnot include the property owner.\n\n(K)\n\nThe residential character of the lot and dwelling must be maintained.\n\n(L)\n\nFor a market garden use, a sign is permitted in accordance with Chapter 25-10-155 (Urban Farm Sign).\n\n(M)\n\nAgricultural education activities do not require a temporary use permit.\n\nSource: Ord. 20131121-105, Pt. 4, 3-21-14.\n\n(A)\n\nThis section applies to the following uses and zoning districts, where the principal\nuse of the property is a brewery:\n\n(1)\n\nlight manufacturing use with industrial park (IP) zoning district;\n\n(2)\n\nlight manufacturing use with major industry (MI) zoning district;\n\n(3)\n\nlight manufacturing use with limited industrial service (LI) zoning district;\n\n(4)\n\nlight manufacturing use with North Burnet/Gateway (NBG) zoning district; or\n\n(5)\n\nlimited warehousing and distribution use within North Burnet/Gateway (NBG) zoning\ndistrict.\n\n(B)\n\nThe sale of beer or ale produced on-site for on-site consumption:\n\n(1)\n\nis a permitted use, if the brewery is at least 540 feet from any single family residential\nuse, as measured from lot line to lot line;\n\n(2)\n\nis a conditional use, if the brewery is less than 540 feet from any single family\nresidential use, as measured from lot line to lot line; and\n\n(3)\n\nexcept as provided in Subsections (C), (D), and (E) of this section, shall not exceed\n33 percent or 5,000 square feet of the total floor area of the principal developed\nuse, whichever is less.\n\n(C)\n\nBeer and ale sold on-site may be consumed during a brewery tour in an area exceeding\n33 percent or 5,000 square feet of the total floor area of the principal developed\nuse, whichever is less.\n\n(D)\n\nBeer and ale sold on-site may be consumed in an area exceeding 33 percent or 5,000\nsquare feet of the total floor area of the principal developed use, whichever is less,\nif the brewery is located in Airport Overlay zones AO-1, AO-2 or AO-3.\n\n(E)\n\nDuring the Conditional Use Permitting Process the Council on appeal or Planning Commission\nmay increase the square footage allowed under Subsection B(3).\n\nSource: Ord. 20140417-082, Pt. 1, 4-28-14; Ord. No. 20231102-028, Pt. 17, 11-13-23.\n",
  "start_line": 23793,
  "end_line": 27746,
  "subsections": []
}