{
  "id": "25-2-840",
  "title": "SPECIAL REQUIREMENTS FOR TELECOMMUNICATION TOWERS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "section and Section 25-2-840 (Special Requirements For Telecommunication Towers).\n\n(B)\n\nA telecommunication tower may exceed the height restrictions of the base zoning district\nand the compatibility standards in Article 10 (Compatibility Standards).\n\n(C)\n\nA telecommunication tower must be constructed in accordance with the most recent American\nNational Standard Institute structural standards for steel antenna towers.\n\n(D)\n\nNotwithstanding the requirements of Subsections (E), (F), and (G), a telecommunication\ntower that complies with the requirements of this subsection is permitted in any zoning\ndistrict.\n\n(1)\n\nThe tower must be a replacement for a functioning:\n\n(a)\n\nutility pole or light standard within a utility easement or public right of way;\n\n(b)\n\nrecreation facility light pole; or\n\n(c)\n\ntelecommunication tower.\n\n(2)\n\nThe tower, including antenna array, may not exceed the height of:\n\n(a)\n\nthe original utility pole, light standard, or recreation facility pole by more than\n10 feet; or\n\n(b)\n\nthe original telecommunication tower and antenna array.\n\n(3)\n\nThe tower may not obstruct a public sidewalk, public alley, or other public right\nof way.\n\n(4)\n\nThe tower must be similar in appearance and function to the pole, standard, or tower\nthat it replaces, except for the antennae.\n\n(E)\n\nA telecommunication tower described in Subsection (F) or (G) must comply with the\nrequirements of this subsection.\n\n(1)\n\nThe tower may not be located:\n\n(a)\n\non or within 300 feet of property that is zoned as a historic landmark (H) or historic\narea (HD) combining district or included in a National Register District;\n\n(b)\n\nwithin 50 feet of a day care services (commercial) use; or\n\n(c)\n\nwithin 50 feet of a dwelling unit.\n\n(2)\n\nThe tower must be of monopole construction and designed to accommodate at least two\nantenna array.\n\n(3)\n\nThe antenna array may not exceed tower height by more than 10 feet.\n\n(4)\n\nGuys and guy anchors must be at least 20 feet from adjoining property.\n\n(5)\n\nThe tower must be:\n\n(a)\n\nenclosed by security fencing; and\n\n(b)\n\nscreened from street view by landscaping at least six feet high.\n\n(6)\n\nThe tower must be identified by a sign visible from outside the screening. The sign\nmust state in letters at least two inches high the name and telephone number of the\ntower manager and the Federal Communications Commission license number.\n\n(F)\n\nA telecommunication tower that complies with the requirements of this subsection is\na permitted use in an SF-6 or less restrictive district, except for an MH district.\n\n(1)\n\nThe tower must be at least 200 feet from an MH district or use or an SF-5 or more\nrestrictive district or use.\n\n(2)\n\nThe tower, excluding antenna array, may not exceed the following height:\n\n(a)\n\n75 feet, for a tower less than 250 feet from an MH district or use or SF-5 or more\nrestrictive district or use;\n\n(b)\n\n100 feet, for a tower at least 250, but less than 540, feet from an MH district or\nuse or an SF-5 or more restrictive district or use; or\n\n(c)\n\n120 feet, for a tower 540 feet or more from an MH district or use or an SF-5 or more\nrestrictive district or use.\n\n(3)\n\nThe director may waive a requirement of this subsection for a minimum separation distance\nbetween a tower and an MH use or an SF-5 or more restrictive use if the director determines\nthat:\n\n(a)\n\nthe tower will be located in a GO or less restrictive district;\n\n(b)\n\nnot more than two uses that are MH uses or SF-5 or more restrictive uses are less\nthan the prescribed separation distance from the tower base;\n\n(c)\n\nthe MH uses or SF-5 or more restrictive uses that are less than the prescribed separation\ndistance from the tower base, if any, are located in SF-6 or less restrictive zoning\ndistricts; and\n\n(d)\n\nthe proposed tower location will not negatively affect a residential neighborhood.\n\n(G)\n\nA telecommunications tower that is not a permitted use under Subsection (F) is a conditional\nuse in an SF-6 or less restrictive district, except for an MH district, if the tower\ncomplies with the requirements of this subsection.\n\n(1)\n\nThe tower must be at least 75 feet from an MH district or use or an SF-5 or more restrictive\ndistrict or use.\n\n(2)\n\nThe tower, excluding antenna array, may not exceed the following height:\n\n(a)\n\n75 feet for a tower less than 100 feet from an MH district or use or an SF-5 or more\nrestrictive district or use;\n\n(b)\n\n100 feet, for a tower at least 100, but less than 200, feet from an MH district or\nuse or an SF-5 or more restrictive district or use;\n\n(c)\n\n120 feet, for a tower at least 200, but less than 300, feet from an MH district or\nuse or an SF-5 or more restrictive district or use; or\n\n(d)\n\na height set by the Land Use Commission, for a tower 300 feet or more from an MH district\nor use or SF-5 or more restrictive district or use.\n\n(3)\n\nThe Land Use Commission may waive a requirement of this subsection for a minimum separation\ndistance between a tower and an MH use or an SF-5 or more restrictive use if the Land\nUse Commission determines that:\n\n(a)\n\nthe tower will be located in a GO or less restrictive district;\n\n(b)\n\nnot more than two uses that are MH uses or SF-5 or more restrictive uses are less\nthan the prescribed separation distance from the tower base;\n\n(c)\n\nthe MH uses or SF-5 or more restrictive uses that are less than the prescribed separation\ndistance from the tower base, if any, are located in SF-6 or less restrictive zoning\ndistricts; and\n\n(d)\n\nthe proposed tower location will not negatively affect a residential neighborhood.\n\n(H)\n\nThe distance from a tower to a zoning district or use is measured:\n\n(1)\n\nalong a straight line from the center of the tower base to the nearest property line\nof the zoning district or use; or\n\n(2)\n\nfor a distance prescribed by Paragraph (E)(1)(c), along a straight line from the center\nof the tower base to the nearest exterior wall of the dwelling unit.\n\n(I)\n\nIn this section, a reference to an MH district or use or SF-5 or more restrictive\nzoning district or use does not include property that is:\n\n(1)\n\nvacant and unplatted;\n\n(2)\n\nused for a public or private primary or secondary educational facility;\n\n(3)\n\nused for a college or university educational facility;\n\n(4)\n\nowned by the United States, the State of Texas, a county, or the City, and not used\nfor an MH or SF-5 or more restrictive residential use;\n\n(5)\n\nused primarily for religious assembly;\n\n(6)\n\nused for a cemetery;\n\n(7)\n\nused for a non-residential, nonconforming use; or\n\n(8)\n\ndetermined by the director to be used in a manner similar to the uses described in\nthis subsection.\n\nSource: Sections 13-2-235 and 13-2-273; Ord. 990225-70; Ord. 000302-36; Ord. 010607-8;\nOrd. 031211-11; Ord. 041202-16.\n\n(A)\n\nAn application to construct a telecommunication tower described in Section 25-2-839(F) or (G) (Telecommunication Towers) must be accompanied by an affidavit that includes:\n\n(1)\n\na description of the search area for the tower location;\n\n(2)\n\nthe elevation required for the antenna array; and\n\n(3)\n\nthe reasons that the antenna array cannot be located on an existing tower or other\nstructure.\n\n(B)\n\nAn applicant who prepares an affidavit required by Subsection (A) shall record the\nname and address of each person the applicant contacts in attempting to locate the\nantenna array on an existing tower or other structure. If requested by the city manager,\nthe applicant shall disclose to the city manager the recorded information.\n\n(C)\n\nThis subsection applies if a telecommunication tower described in Section 25-2-839(F) or (G) (Telecommunication Towers) ceases to be used for wireless communications.\n\n(1)\n\nThe tower owner and the property owner shall notify the director that the tower is\nnot being used for wireless communications within 30 days of the cessation of use.\n\n(2)\n\nIf the tower is not used for wireless communications for a continuous one year period,\nthe tower owner and the property owner shall remove the tower. The tower owner and\nthe property owner shall finish the tower removal within 18 months of the date that\nwireless communications cease.\n\n(D)\n\nThe director shall maintain a map of all telecommunication towers located within the\nplanning jurisdiction.\n\nSource: Ord. 000302-36; Ord. 031204-53; Ord. 031211-11.\n\n**Editor's note—**\nOrd. No. 20231207-001, Pt. 12, effective December 18, 2023, repealed § 25-2-841, which pertained to group\nand family homes and derived from Sections 13-2-232 and 13-2-262; Ord. 990225-70;\nOrd. 031211-11.\n\n(A)\n\nThis section applies to a community events use.\n\n(B)\n\nA community events use is permitted only on:\n\n(1)\n\nCity-owned land located within the area bounded on the north by the southern right-of-way\nof Riverside Drive, on the east by the western right-of-way of South First Street,\non the south by the northern right-of-way of Barton Springs Road, and on the west\nby a line 1,500 feet west of and parallel to the western right-of-way of South First\nStreet; and\n\n(2)\n\nCity-owned land located with the area bounded on the north by a line 650 feet north\nof and parallel to the northern right-of-way of Toomey Road, on the east by the western\nright-of-way of South Lamar Boulevard, on the south by northern right-of-way of Toomey\nRoad, and on the west by a line 700 feet west of and parallel to the western right-of-way\nof South Lamar Boulevard.\n\n(C)\n\nCouncil approval is required for a site plan for a community events use. Approval\nof a site plan:\n\n(1)\n\nestablishes the site development regulations; and\n\n(2)\n\nwaives regulations that are inconsistent with the site plan, if any.\n\n(D)\n\nA public hearing is required for each site plan considered under this section. The\ndirector shall give notice of the public hearing in accordance with Section 25-1-132(C) (Notice of Public Hearing).\n\nSource: Ord. 990902-57; Ord. 031211-11; Ord. 20130228-078.\n\n(A)\n\nThe following are conditional uses in all commercial, industrial, and special purpose\nbase districts:\n\n(1)\n\na heli-facility or heliport, as defined in Chapter 13-1, Article 4 (Heliports and Helicopter Operations); and\n\n(2)\n\nexcept as provided in Subsection (B), a landing field for hot air balloons or nonfixed-wing\naircraft.\n\n(B)\n\nAn advertising or promotional event involving the use of a hot air balloon is a permitted\nuse in all commercial, industrial, and special purpose base districts. The approval\nof the building official, the director, and the director of Aviation is required for\nthe event.\n\nSource: Section 13-2-270; Ord. 990225-70; Ord. 031211-11; Ord. 20130620-088.\n\n(A)\n\nThis section applies to a recycling center.\n\n(B)\n\nA recycling center site must have at least 150 feet of frontage on a public street.\n\n(C)\n\nAn outdoor unloading area for recyclable materials must be at least 50 feet from a\nmore restrictive zoning district. This requirement does not apply to a portion of\na site that abuts a railroad right-of-way.\n\n(D)\n\nThe portion of a site used for truck maneuvering or the storage, bailing, processing,\nor other handling of recyclable material must be enclosed by a solid fence or wall\nwith a nonglare finish not less than eight feet in height. This requirement does not\napply to a portion of a site that abuts a railroad right-of-way.\n\n(E)\n\nA loading or unloading area or a truck maneuvering area must be paved.\n\n(F)\n\nA facility operator shall keep the facility free of refuse and putrescible materials.\n\n(G)\n\nA facility operator may not use chemical or heating processes on the recyclable materials.\n\nSource: Section 13-2-272; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to an urban farm use.\n\n(B)\n\nAn urban farm is allowed within the critical water quality zone if it meets the requirements\nin 25-8-261(B)(4) (Critical Water Quality Zone Development) for sustainable urban agriculture or a community garden.\n\n(C)\n\nA site area for an urban farm shall not be less than one acre and not more than five\nacres.\n\n(D)\n\nThe number of dwelling units allowed on a site may not exceed the number of dwelling\nunits allowed under the base zoning district regulations. Notwithstanding the foregoing,\nnot more than two units are allowed on the site. Animal raising in accordance with\nSection 25-2-863(F) is not allowed without a dwelling on the site. Accessory structures are permitted\nwithout a dwelling.\n\n(E)\n\nRaising livestock is prohibited notwithstanding Chapter 3-2 of the City Code.\n\n(F)\n\nFor properties not zoned residential, raising, slaughtering, processing and composting\nof fowl, rabbits, and aquatic foods using an aquaponic system is permitted in accordance\nwith Chapter 3-2 (Restrictions on Animals) of the City Code. One animal (either fowl or rabbit) may be processed per 1/10\nth\nof an acre per week. Composting, slaughtering or processing of animals must take place\nat least 50 feet from the nearest residential structure other than the structure associated\nwith the use. Slaughtering and processing animals must take place out of public view.\n\nFor properties zoned residential, raising of fowl, rabbits, and aquatic foods using\nan aquaponic system is permitted in accordance with Chapter 3-2 (Restrictions on Animals) of the City Code. Slaughtering and processing of aquatics foods is permitted. Slaughtering,\nprocessing of fowl and rabbits is prohibited. Composting of animal parts is prohibited\nin residential zoning districts.\n\n(G)\n\nWater conservation practices must be followed, at minimum in accordance with Chapter\n6-4 (Water Conservation) of the City Code.\n\n(H)\n\nThe use of synthetic inputs is prohibited. An Integrated Pest Management Plan, developed\nin accordance with the Environmental Criteria Manual and approved by the Watershed\nProtection Department, must be followed.\n\n(I)\n\nAgricultural and value-added agricultural products raised by the farmer or produced\nwithin the State of Texas may be sold from the site or distributed off-site to buyers.\nAgricultural products and value-added agricultural products produced off-site by someone\nother than the farmer cannot exceed 20% of the retail space by area.\n\n(J)\n\nEmployees are permitted. The maximum number of full-time, non-seasonal employees is\ntwo for each full acre, plus two for the remaining portion of an acre, if any. This\ndoes not include the property owner.\n\n(K)\n\nThe residential character of the lot and dwelling must be maintained.\n\n(L)\n\nFor an urban farm use, a sign is permitted in accordance with Chapter 25-10-155 (Urban Farm Sign).\n\n(M)\n",
  "start_line": 27103,
  "end_line": 27611,
  "subsections": [
    "25-2-840-B",
    "25-2-840-C",
    "25-2-840-D",
    "25-2-840-E",
    "25-2-840-F",
    "25-2-840-G",
    "25-2-840-H",
    "25-2-840-I",
    "25-2-840-A",
    "25-2-840-B",
    "25-2-840-C",
    "25-2-840-D",
    "25-2-840-A",
    "25-2-840-B",
    "25-2-840-C",
    "25-2-840-D",
    "25-2-840-A",
    "25-2-840-B",
    "25-2-840-A",
    "25-2-840-B",
    "25-2-840-C",
    "25-2-840-D",
    "25-2-840-E",
    "25-2-840-F",
    "25-2-840-G",
    "25-2-840-A",
    "25-2-840-B",
    "25-2-840-C",
    "25-2-840-D",
    "25-2-840-E",
    "25-2-840-F",
    "25-2-840-G",
    "25-2-840-H",
    "25-2-840-I",
    "25-2-840-J",
    "25-2-840-K",
    "25-2-840-L",
    "25-2-840-M"
  ]
}