{
  "id": "25-2-773",
  "title": "DUPLEX, TWO-UNIT, AND THREE-UNIT RESIDENTIAL USES",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Section 25-2-773 (Duplex, Two-Unit and Three-Unit Residential Uses); or\n\n(5)\n\nminimum site area requirements.\n\n(E)\n\nThis subsection applies to a qualifying development located in urban residence (SF-5)\nor more restrictive zoning district and the height of the development exceeds 35 feet\nor three stories.\n\n(1)\n\nA qualifying development must comply with:\n\n(a)\n\nSection 25-2-1066 (Screening Requirements); and\n\n(b)\n\nSubsections (A) and (B) in Section 25-2-1067 (Design Regulations).\n\n(2)\n\nA person must enclose a refuse receptacle, including a dumpster.\n\n(3)\n\nThe location of and access to a refuse receptacle is subject to review and approval\nby the accountable official.\n\n(4)\n\nA person may not collect or allow another to collect refuse receptacles between 10:00\np.m. and 7:00 a.m.\n\nSource: Ord. No. 20190509-027, Pt. 3, 5-20-19; Ord. No. 20231207-001, Pt. 18, 12-18-23.\n\n**Editor's note—**\nOrd. No. 20240229-070, Pt. 1, adopted March 11, 2024, repealed § 25-2-519, which pertained to Commercial-Residential\nDevelopment and derived from Ord. No. 20221201-055, Pt. 2, 12-12-22; Ord. No. 20231102-028, Pt. 9, 11-13-23.\n\n(A)\n\nThis section provides exceptions to zoning district height limits.\n\n(B)\n\nSubsection (C) applies to:\n\n(1)\n\nparapet walls, chimneys, vents, and mechanical or safety features including fire towers,\nstairways, elevator penthouses, heating or cooling equipment, solar installations,\nand protective covers; and\n\n(2)\n\nornamental towers, cupolas, domes, and spires that are not designed for occupancy.\n\n(C)\n\nA structure described in Subsection (B) may exceed a zoning district height limit\nby the greater of:\n\n(1)\n\n15 percent;\n\n(2)\n\nthe amount necessary to comply with a federal or state regulation;\n\n(3)\n\nfor a stack or vent, the amount necessary to comply with generally accepted engineering\nstandards; or\n\n(4)\n\nfor a spire, 30 percent.\n\n(D)\n\nThe height of a home radio or television receiving antenna or a flagpole may not exceed\nthe lesser of:\n\n(1)\n\na 50 feet; or\n\n(2)\n\nif attached to a building, 25 feet above the building; or\n\n(3)\n\nif located on the ground, 125 percent of the zoning district height limit.\n\n(E)\n\nA radio tower operated by a licensed amateur radio operator may not exceed a height\nof 60 feet plus 15 feet for antennae. The Land Use Commission may approve a greater\nheight as a conditional use.\n\n(F)\n\nAn antenna located on a building in a non-residential zoning district may exceed the\nzoning district height limit by not more than 20 feet.\n\n(G)\n\nA fly tower that is constructed within a performing arts theater that seats 300 or\nmore people may be up to 80 feet in height, regardless of the zoning district height\nlimit, unless a lower height limit is required by City Code Chapter 25-2, Article 10 (Compatibility Standards). The fly tower must be:\n\n(1)\n\nlocated on land owned by the City of Austin; and\n\n(2)\n\ndesigned and used for moving set pieces, lights, microphones, and other equipment\non and off stage.\n\nSource: Section 13-2-608; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 040826-67;\nOrd. 20080724-082; Ord. 20100923-132.\n\n(A)\n\nThis section applies to property that had existing development or that was included\nin a released site plan on March 10, 1996.\n\n(B)\n\nDevelopment may exceed the impervious cover limits of this article if the director\ndetermines that the amount of impervious cover proposed is the minimum necessary to\ncomply with the accessibility standards of the Americans with Disabilities Act or\nChapter 25-12,\nArticle 1 (Uniform Building Code).\n\nSource: Section 13-2-630; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe council may, by ordinance, designate a location in a neighborhood commercial (LR),\ncommunity commercial (GR), general commercial services (CS), commercial services -\nliquor sales (CS-1), or commercial highway services (CH) district where the minimum\nstreet yard requirement does not apply. To make a designation under this section,\nthe council must determine that:\n\n(1)\n\nthe location contains at least two nonresidential uses that were developed as a neighborhood\nshopping or business center under previous regulations;\n\n(2)\n\nthe construction of a new building in compliance with current street yard requirements\nwould be incompatible with the existing buildings;\n\n(3)\n\nat least half of the total lot area that is developed is used for nonresidential uses;\nand\n\n(4)\n\nat least half of the total street frontage that is developed with structures does\nnot comply with the current street yard requirements.\n\n(B)\n\nThe director of the Neighborhood Planning and Zoning Department shall delineate an\narea designated under this section on the zoning map.\n\nSource: Section 13-2-611; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n",
  "start_line": 15206,
  "end_line": 15387,
  "subsections": [
    "25-2-773-E",
    "25-2-773-A",
    "25-2-773-B",
    "25-2-773-C",
    "25-2-773-D",
    "25-2-773-E",
    "25-2-773-F",
    "25-2-773-G",
    "25-2-773-A",
    "25-2-773-B",
    "25-2-773-A",
    "25-2-773-B",
    "25-2-773-A"
  ]
}