{
  "id": "25-2-671",
  "title": "TOWN LAKE PARK TERMS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "Development of a natural area described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nnature trails with interpretive signs and facilities;\n\n(2)\n\nsurface parking with pervious material;\n\n(3)\n\nmaintenance and improvement of environmental quality, including fencing and wildlife\nand vegetation management; and\n\n(4)\n\ngeneral park support and maintenance.\n\n(B)\n\nDevelopment of a neighborhood park described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nwalking, exercise, and bicycle trails;\n\n(2)\n\nsurface parking and access roads;\n\n(3)\n\npicnic facilities;\n\n(4)\n\ngeneral neighborhood park uses, including playing fields, ball courts, swimming pools,\nand playscapes;\n\n(5)\n\nconcessions primarily serving an adjacent neighborhood, including food vending, bicycle\nrentals, and sports equipment rentals;\n\n(6)\n\ncultural facilities primarily serving an adjacent neighborhood;\n\n(7)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(8)\n\ngeneral park support and maintenance.\n\n(C)\n\nDevelopment of a community park described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\ndevelopment permitted in a neighborhood park;\n\n(2)\n\nmunicipal swimming pools and associated facilities;\n\n(3)\n\nconcessions designed to attract individuals from throughout the city, including boat\nrentals, food vending, dining facilities, special sports facilities, and special recreational\nfacilities;\n\n(4)\n\nsurface parking and parking structures;\n\n(5)\n\nperformance and special events facilities;\n\n(6)\n\nspecialized facilities, including facilities that serve the handicapped, private nonprofit\nrecreational facilities that serve the general public, and private park enhancement\nfacilities;\n\n(7)\n\nan internal park road system, with grade-separated intersections if required;\n\n(8)\n\nathletic facilities, including multipurpose sports fields and exercise courses;\n\n(9)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(10)\n\ngeneral park support and maintenance.\n\n(D)\n\nDevelopment of a cultural park described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\ncultural facilities and special event and performance areas;\n\n(2)\n\nparking structures and limited surface parking;\n\n(3)\n\nconcessions that are designed to attract people from throughout the city, that are\nmobile, temporary, or located in a building described in the Town Lake Park Plan,\nand that require a small amount of space, including pushcarts selling food or flowers,\ntemporary vending stands for special events, and museum gift shops;\n\n(4)\n\nwalking, exercise, and bicycle paths;\n\n(5)\n\nan internal park transportation system;\n\n(6)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(7)\n\ngeneral park support and maintenance.\n\n(E)\n\nDevelopment of an urban waterfront described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nplazas for performances and special events;\n\n(2)\n\nwide sidewalks for walking, exercising, and bicycle riding;\n\n(3)\n\nconcessions that are designed to attract people from throughout the city, are mobile,\ntemporary, or located in a building described in the Town Lake Park Plan, and require\na small amount of space, including pushcarts selling food or flowers, temporary vending\nstands for special events, and museum gift shops;\n\n(4)\n\nrowing facilities, boathouses, and similar water-related activities;\n\n(5)\n\nmaintenance and improvement of environmental quality, including stream bank stabilization,\nfencing, and wildlife and vegetation management; and\n\n(6)\n\ngeneral park support and maintenance.\n\n(F)\n\nDevelopment of an area of Town Lake Park not included in a natural area, neighborhood\npark, community park, cultural park, or urban waterfront described in Section 25-2-671 (Town Lake Park Terms) is limited to:\n\n(1)\n\nwalking, exercise, and bicycle trails;\n\n(2)\n\npicnic facilities;\n\n(3)\n\nsurface parking of pervious material and park access roads; and\n\n(4)\n\ngeneral park support and maintenance.\n\n(G)\n\nThis section does not apply to a community events use.\n\nSource: Section 13-2-228.1; Ord. 990225-70; Ord. 990902-57; Ord. 031211-11.\n\n(A)\n\nThis section applies to the waterfront overlay (WO) district, except for a community\nevents use.\n\n(B)\n\nA residential use that is permitted in an MF-6 or more restrictive base district is\nalso permitted in an NO or less restrictive base district.\n\n(C)\n\nA pedestrian-oriented use is a use that serves the public by providing goods or services\nand includes:\n\n(1)\n\nart gallery;\n\n(2)\n\nart workshop;\n\n(3)\n\ncocktail lounge;\n\n(4)\n\nconsumer convenience services;\n\n(5)\n\ncultural services;\n\n(6)\n\nday care services (limited, general, or commercial);\n\n(7)\n\nfood sales;\n\n(8)\n\ngeneral retail sales (convenience or general);\n\n(9)\n\npark and recreation services;\n\n(10)\n\nresidential uses;\n\n(11)\n\nrestaurant (limited or general) without drive-in service; and\n\n(12)\n\nother uses as determined by the Land Use Commission.\n\n(D)\n\nPedestrian oriented uses in an MF-1 or less restrictive base district:\n\n(1)\n\nare permitted on the ground floor of a structure; and\n\n(2)\n\nmay be permitted by the Land Use Commission above the ground floor of a structure.\n\n(E)\n\nA determination by the Land Use Commission under Subsection (D)(1) may be appealed\nto the council. For the City Hall subdistrict, a determination by the Land Use Commission\nunder Subsection (C)(11) may be appealed to council.\n\nSource: Section 13-2-228; Ord. 990225-70; Ord. 990715-115; Ord. 990902-57; Ord. 010607-8;\nOrd. 031211-11; Ord. 031211-41; Ord. 040617-Z-1.\n\n(A)\n\nThis subsection applies to the University/Deep Eddy subdistrict.\n\n(1)\n\nThe following uses are prohibited:\n\n(a)\n\nautomotive rentals;\n\n(b)\n\nautomotive repair services;\n\n(c)\n\nautomotive sales;\n\n(d)\n\nautomotive washing;\n\n(e)\n\ncommercial off-street parking; and\n\n(f)\n\na use with a drive-in service.\n\n(2)\n\nThe following are conditional uses:\n\n(a)\n\nhotel-motel;\n\n(b)\n\nservice station;\n\n(c)\n\nlocal utility services.\n\n(B)\n\nIn the North Shore Central subdistrict, not less than 50 percent of the net usable\nfloor area of the ground level of a structure adjacent to Town Lake must be used for\npedestrian-oriented uses. The Land Use Commission may allow an applicant up to five\nyears from the date a certificate of occupancy is issued to comply with this requirement.\n\n(C)\n\nThis subsection applies to the Red Bluff subdistrict.\n\n(1)\n\nThe following uses are prohibited:\n\n(a)\n\nlight manufacturing;\n\n(b)\n\nbasic industry;\n\n(c)\n\nstockyards;\n\n(d)\n\nlaundry services; and\n\n(e)\n\nresource extraction.\n\n(2)\n\nThe following are conditional uses:\n\n(a)\n\nautomotive rentals;\n\n(b)\n\nautomotive repair services;\n\n(c)\n\nautomotive sales;\n\n(d)\n\nautomotive washing;\n\n(e)\n\ncommercial off-street parking;\n\n(f)\n\na use with a drive-in service; and\n\n(g)\n\nwarehousing and distribution.\n\n(D)\n\nThis subsection applies to the East Riverside subdistrict.\n\n(1)\n\nThe following uses are prohibited:\n\n(a)\n\nautomotive rentals;\n\n(b)\n\nautomotive repair services;\n\n(c)\n\nautomotive sales;\n\n(d)\n\nautomotive washing;\n\n(e)\n\nbasic industry;\n\n(f)\n\ncommercial off-street parking;\n\n(g)\n\na use with a drive-in service;\n\n(h)\n\nlaundry services;\n\n(i)\n\nlight manufacturing;\n\n(j)\n\nstockyards; and\n\n(k)\n\nwarehousing and distribution.\n\n(2)\n\nThe following are conditional uses:\n\n(a)\n\nhotel-motel;\n\n(b)\n\nservice station; and\n\n(c)\n\nlocal utility service.\n\n(E)\n\nThis subsection applies to the Travis Heights subdistrict.\n\n(1)\n\nThe following uses are prohibited:\n\n(a)\n\nautomotive rentals;\n\n(b)\n\nautomotive repair services;\n\n(c)\n\nautomotive sales;\n\n(d)\n\nautomotive washing;\n\n(e)\n\nbasic industry;\n\n(f)\n\ncommercial off-street parking;\n\n(g)\n\nlaundry services;\n\n(h)\n\nlight manufacturing;\n\n(i)\n\nstockyards; and\n\n(j)\n\nwarehousing and distribution.\n\n(2)\n\nThe following are conditional uses:\n\n(a)\n\nhotel-motel;\n\n(b)\n\nservice station; and\n\n(c)\n\nlocal utility service.\n\n(F)\n\nIn the South Shore Central subdistrict, not less than 50 percent of the net usable\nfloor area of the ground level of a structure adjacent to Town Lake must be used for\npedestrian-oriented uses. The Land Use Commission may allow an applicant up to five\nyears from the date a certificate of occupancy is issued to comply with this requirement.\n\n(G)\n\nThis subsection applies to the Auditorium Shores subdistrict, except for a community\nevents use.\n\n(1)\n\nNot less than 50 percent of the net usable floor area of the ground level of a structure\nadjacent to Town Lake must be used for pedestrian-oriented uses. The Land Use Commission\nmay allow an applicant up to five years from the date a certificate of occupancy is\nissued to comply with this requirement.\n\n(2)\n\nUse of the area between the primary setback line and the secondary setback line is\nlimited to:\n\n(a)\n\ncultural services;\n\n(b)\n\nday care services;\n\n(c)\n\npark and recreation services;\n\n(d)\n\nfood sales; and\n\n(e)\n\nrestaurant (limited) without drive-in service.\n\n(H)\n\nIn the Butler Shores subdistrict, not less than 50 percent of the net usable floor\narea of the ground level of a structure adjacent to Town Lake must be used for pedestrian-oriented\nuses. The Land Use Commission may allow an applicant up to five years from the date\na certificate of occupancy is issued to comply with this requirement.\n\n(I)\n\nUse of the Zilker Park subdistrict is limited to park-related structures.\n\n(J)\n\nIn the City Hall subdistrict, at least 50 percent of the net usable floor area of\nthe ground level of a structure adjacent to Town Lake must be used for pedestrian-oriented\nuses. The Land Use Commission may allow an applicant up to five years from the date\na certificate of occupancy is issued to comply with this requirement. This requirement\ndoes not apply to a building used by the City for a governmental function.\n\n(K)\n\nCocktail lounge is a conditional use within the Rainey Street subdistrict.\n\nSource: Section 13-2-229; Ord. 990225-70; Ord. 990715-115; Ord. 990902-57; Ord. 010607-8;\nOrd. 031211-11; Ord. 031211-41; Ord. 20130228-076.\n\nDecisions by the accountable official and city boards regarding implementation of\nthis Division shall be guided at all stages by the goals and policies of the Town\nLake Corridor Study, including but not limited to the following:\n\n(A)\n\nEnsure that zoning decisions in the Colorado River corridor achieve the highest degree\nof land use compatibility by:\n\n1.\n\neliminating industrial uses from the confluence of Longhorn Dam;\n\n2.\n\nphasing out resource extraction;\n\n3.\n\nproviding the pubic visual and physical access to the Colorado River.\n\n(B)\n\nProtect, enhance, and interpret natural values and environmentally sensitive areas\nof the Colorado River Corridor through:\n\n1.\n\nappropriate mitigation for new development affecting identified landforms; and\n\n2.\n\nmaintenance of natural shorelines and bluffs along the waterfront, except where otherwise\nrequired by subdistrict regulations or for necessary stabilization.\n\n(C)\n\nRecognize the potential of the waterfront as an open space connector, form-shaper\nof urban development, and focal point for lively pedestrian-oriented mixed uses as\ndefined by the subdistrict goals of the Town Lake Corridor Study.\n\nSource: Ord. 20090611-074.\n\n(A)\n\nThis division applies in the waterfront overlay (WO) combining district.\n\n(B)\n\nThe requirements of this division do not apply to:\n\n(1)\n\na community events use; or\n\n(2)\n\nthe construction or reconstruction of existing or proposed development for which:\n\n(a)\n\na building permit was issued before July 18, 1986;\n\n(b)\n\na certificate of occupancy was issued before July 18, 1986;\n\n(c)\n\na site plan was approved before July 17, 1986, including a phased project or a special\npermit site plan;\n\n(d)\n\na site plan was filed with the City before July 17, 1986 as a condition of zoning,\nand the site plan was previously approved by the council or Town Lake Task Force;\nor\n\n(e)\n\nbuilding plans were filed with the City before July 17, 1986.\n\n(C)\n\nThe requirements of this division supersede the other provisions of this title, to\nthe extent of conflict.\n\nSource: Sections 13-2-700 and 13-2-701; Ord. 990225-70; Ord. 990902-57; Ord. 031211-11.\n\nIn this part:\n\n(1)\n\nBASEWALL means the vertical surface of a building beginning at the finished grade\nup to a level defined by a setback or an architectural treatment, including a cornice\nline or similar projection or demarcation, that visually separates the base of the\nbuilding from the upper portion of the building.\n\n(2)\n\nBOARD means the Small Area Planning Joint Committee of the Planning Commission and\nthe Zoning and Platting Commission.\n\n(3)\n\nPRIMARY SETBACK AREA means the area between a primary setback line and the centerline\nof an identified creek, the shoreline of Town Lake, the shoreline of the Colorado\nRiver, or the boundary of an identified street, as applicable.\n\n(4)\n\nPRIMARY SETBACK LINE means a line that is a prescribed distance from and parallel\nto the centerline of an identified creek, the shoreline of Town Lake, the shoreline\nof the Colorado River, or the boundary of an identified street, as applicable.\n\n(5)\n\nSECONDARY SETBACK AREA means the area between a primary setback line and a secondary\nsetback line.\n\n(6)\n\nSECONDARY SETBACK LINE means a line that is a prescribed distance from and parallel\nto a primary setback line.\n\n(7)\n\nTOWN LAKE CORRIDOR STUDY means the planning document published by the City of Austin\nin 1985 and formally approved by City Council Resolution No. 851031-19.\n\nSource: Section 13-2-1; Ord. 990225-70; Ord. 031211-11; Ord. 20090611-074; Ord. No. 20141211-204, Pt. 25, 7-1-15.\n\n(A)\n\nAn applicant may submit a request for a variance from the following requirements to\nthe Small Area Planning Joint Committee of the Planning Commission and the Zoning\nand Platting Commission for review:\n\n(1)\n",
  "start_line": 19965,
  "end_line": 20707,
  "subsections": [
    "25-2-671-B",
    "25-2-671-C",
    "25-2-671-D",
    "25-2-671-E",
    "25-2-671-F",
    "25-2-671-G",
    "25-2-671-A",
    "25-2-671-B",
    "25-2-671-C",
    "25-2-671-D",
    "25-2-671-E",
    "25-2-671-A",
    "25-2-671-B",
    "25-2-671-C",
    "25-2-671-D",
    "25-2-671-E",
    "25-2-671-F",
    "25-2-671-G",
    "25-2-671-H",
    "25-2-671-I",
    "25-2-671-J",
    "25-2-671-K",
    "25-2-671-A",
    "25-2-671-B",
    "25-2-671-C",
    "25-2-671-A",
    "25-2-671-B",
    "25-2-671-C",
    "25-2-671-A"
  ]
}