{
  "id": "25-2-625",
  "title": "PUBLIC (P) DISTRICT REGULATIONS",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "See Section 25-2-625 (Public District Regulations).\n\nSource: Ord. No. 20231207-001, Pt. 5, 12-18-23.\n\n**Editor's note—**\nOrd. No. 20231207-001, Pt. 6, effective December 18, 2023, repealed § 25-2-511, which pertained to dwelling\nunit occupancy limit and derived from Section 13-2-1; Ord. 990225-70; Ord. 030605-49;\nOrd. 031211-11; Ord. 0411118-59; Ord. 20100923-127; Ord. 20140320-062, Pts. 1, 3, 3-31-14; Ord. No. 20160223-A.1, Pt. 3, 3-5-16.\n\n(A)\n\nExcept as provided in Subsections (B) and (C), a lot may not be reduced in area, width,\nor depth to less than the minimum requirements.\n\n(B)\n\nThis subsection applies to the remainder of a lot if a portion of the original lot\nis acquired for public use. Notwithstanding other provisions of this article, the\nremainder of the lot complies with the lot size requirements of this article if:\n\n(1)\n\nbefore the acquisition, the lot complied with the lot size requirements of this article;\n\n(2)\n\nthe remainder of the lot contains a rectangular space at least 30 feet by 40 feet\nin size and usable for a building, excluding required yards;\n\n(3)\n\nthe remainder of the lot contains an area that is not less than 50 percent of the\nminimum area requirement; and\n\n(4)\n\nthe remainder of the lot has at least 40 feet of street frontage.\n\n(C)\n\nFor a lot that is used exclusively for a public building, or by a public or quasi-public\nagency for a nonresidential use, the entity responsible under Chapter 25-5 (Site Plans) for approving a site plan for the use may reduce the lot size requirements of this\narticle.\n\nSource: Section 13-2-603; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as otherwise provided in this section, a required yard must be open and unobstructed\nfrom finished grade to the sky. This restriction does not apply to a yard or part\nof a yard that is not required by this article.\n\n(B)\n\nA window sill, belt course, cornice, flue, chimney, eave, box window, or cantilevered\nbay window may project two feet into a required yard. The two foot limitation does\nnot apply to a feature required for a passive energy design.\n\n(C)\n\nUncovered steps or a porch or stoop that is not more than three feet above ground\nlevel may project three feet into a required yard.\n\n(D)\n\nA parking area may be located in a required yard, unless prohibited by Article 10\n(Compatibility Standards).\n\n(E)\n\nIn a townhouse and condominium residence (SF-6) or more restrictive district, a pool,\nincluding a swimming pool, reflecting pool, or fountain, may be located in a required\nyard.\n\n(F)\n\nLandscaping may be located in a required yard.\n\n(G)\n\nThis subsection applies to a building located in a multifamily residence medium density\n(MF-3) or more restrictive district. A covered porch that is open on three sides may\nproject five feet into a required front yard, a street side yard, or both.\n\n(H)\n\nA ramp for a new or an existing single-family or duplex residential unit may be constructed\nin a required yard if:\n\n(1)\n\na person with a disability requires access to a dwelling entrance that meets the requirements\nof the Residential Code, Section R320.6 (Visitable dwelling entrance);\n\n(2)\n\nthe ramp:\n\n(a)\n\nis no wider than 48 inches, except that any portion of a landing for the ramp required\nfor turns may be no wider than 60 inches;\n\n(b)\n\nmay have a hand railing, but may not have a roof or walls; and\n\n(c)\n\nthe building official determines that the ramp will not pose a threat to public health\nand safety; and\n\n(3)\n\nencroachment into the required yard:\n\n(a)\n\nis the minimum amount necessary to provide access for a person with a disability;\n\n(b)\n\ndoes not extend more than three feet into a side yard setback; and\n\n(c)\n\nis not located in a rear yard setback unless:\n\n(i)\n\nthe dwelling is located on a corner lot;\n\n(ii)\n\naccess is from an alley; or\n\n(iii)\n\nanother requirement of this title prohibits location of the ramp in the front or side\nyard.\n\nSource: Section 13-2-610; Ord. 990225-70; Ord. 031211-11; Ord. 040826-67; Ord. No. 20140522-078, Pt. 1, 6-2-14; Ord. No. 20151217-093, Pt. 1, 12-28-15.\n\nFor a through lot, a rear yard must comply with the minimum requirements applicable\nto a front yard.\n\nSource: Section 13-2-612; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this section:\n\n(1)\n\nHAZARDOUS PIPELINE means a pipeline designed for the transmission of a \"hazardous\nliquid\", as defined by Title 49, Code of Federal Regulations, Section 195.2, with\nan inside diameter of eight inches or more.\n\n(2)\n\nNEW CONSTRUCTION means the construction after April 20, 2003 of a structure intended\nfor human occupancy, and includes the construction of a new structure, the construction\nof an addition to an existing structure and the reconstruction of a portion of an\nexisting structure. The term excludes an addition to or the reconstruction or replacement\nof a structure existing on April 21, 2003 used for:\n\n(a)\n\nsingle-family residential use;\n\n(b)\n\nsmall lot single-family residential use;\n\n(c)\n\nsingle-family attached residential use;\n\n(d)\n\nduplex residential use;\n\n(e)\n\ntwo-family residential use;\n\n(f)\n\nmobile home residential use; or\n\n(g)\n\nin a neighborhood plan combining district:\n\n(i)\n\ncottage special use;\n\n(ii)\n\nurban home special use; or\n\n(iii)\n\nsecondary apartment special use.\n\n(3)\n\nRESTRICTED PIPELINE AREA includes an area within 25 feet of a hazardous pipeline and\nan area within a hazardous pipeline easement.\n\n(4)\n\nUSE REQUIRING EVACUATION ASSISTANCE includes the following uses:\n\n(a)\n\ncongregate living;\n\n(b)\n\nconvalescent services;\n\n(c)\n\ndetention facilities;\n\n(d)\n\nday care services (commercial);\n\n(e)\n\nhospital (general);\n\n(f)\n\nhospital (limited);\n\n(g)\n\nmedical offices exceeding 5,000 square feet of gross floor area;\n\n(h)\n\nprivate primary educational facilities;\n\n(i)\n\nprivate secondary educational facilities;\n\n(j)\n\npublic primary educational facilities;\n\n(k)\n\npublic secondary educational facilities; and\n\n(l)\n\nretirement housing (large site).\n\n(B)\n\nA use requiring evacuation assistance is prohibited in a structure intended for human\noccupancy that is located within 500 feet of a hazardous pipeline. This prohibition\ndoes not apply to a structure that is located between 200 and 500 feet of a hazardous\npipeline if by resolution the council determines, after receiving a recommendation\nfrom the fire chief, that:\n\n(1)\n\nthe structure has a performance-based design that provides an adequate time period\nfor occupant evacuation to a safe place in the event of a pipeline leak or fire associated\nwith the pipeline, after considering:\n\n(a)\n\nthe requirements of\nChapter 25-12,\nArticle 7 (Uniform Fire Code) and the 2000 edition of the National Fire Protection Association 101 Life Safety\nCode;\n\n(b)\n\nthe site and structure design;\n\n(c)\n\nthe structure's building materials;\n\n(d)\n\nthe structure's distance from the pipeline;\n\n(e)\n\nthe use of radiant energy barriers;\n\n(f)\n\naccess to the site and the structure by emergency responders;\n\n(g)\n\navailable on-site resources for emergency responders;\n\n(h)\n\nthe topography and other natural features;\n\n(i)\n\nthe use of the structure; and\n\n(j)\n\nthe evacuation capability of the occupants;\n\n(2)\n\nthe structure incorporates a system for the early detection and notification of a\npipeline leak, if the fire chief determines that an appropriate system is commercially\navailable; and\n\n(3)\n\nthe performance-based design for occupant evacuation and the early detection and notification\nsystem are certified and sealed by an engineer registered in Texas.\n\n(C)\n\nA person may not build new construction within 200 feet of a hazardous pipeline unless:\n\n(1)\n\nthe fire chief determines that:\n\n(a)\n\nthe new construction has a performance-based design that provides a minimum one-hour\ntime period for occupant evacuation to a safe place in the event of a pipeline leak\nor a fire associated with the pipeline, in accordance with\nChapter 25-12,\nArticle 7 (Uniform Fire Code) or the 2000 edition of the National Fire Protection Association 101 Life Safety\nCode;\n\n(b)\n\nthe new construction incorporates a system for the early detection and notification\nof a pipeline leak, if the fire chief determines that an appropriate system is commercially\navailable; and\n\n(c)\n\nthe performance-based design for occupant evacuation and the early detection and notification\nsystem are certified and sealed by an engineer registered in Texas; or\n\n(2)\n\nthe new construction complies with the standards for construction near a pipeline\nprescribed by the Fire Criteria Manual.\n\n(D)\n\nA person may not place a structure or excavate within a restricted pipeline area.\n\n(1)\n\nThis prohibition does not apply to:\n\n(a)\n\nthe pipeline or an appurtenance;\n\n(b)\n\na facility that produces, consumes, processes, or stores the product transported by\nthe pipeline, including a power generation facility;\n\n(c)\n\na utility line that crosses the restricted pipeline area, including an appurtenance\nto the line;\n\n(d)\n\na utility service connection;\n\n(e)\n\na road;\n\n(f)\n\na surface parking lot; or\n\n(g)\n\na structure or excavation that the director determines does not disturb the pipeline\nor impede its operation.\n\n(2)\n\nBefore a person may place a road, surface parking lot, or utility line in a restricted\npipeline area, the person must deliver to the director a certification by a registered\nengineer stating that the proposed construction activity and structure are designed\nto prevent disturbing the pipeline or impeding its operation.\n\nSource: Ord. 030410-12; Ord. 031211-11.\n\n(A)\n\nConstruction of an amphitheater that is associated with a civic or residential use\nrequires a site plan approved under Section 25-5, Article 3 (Land Use Commission Approved Site Plans), regardless of whether the amphitheater is part of a principal or accessory use.\nReview of the site plan is subject to the criteria in Section 25-5-145 (Evaluation Criteria) and the notice requirements of Section 25-5-144 (Public Hearing and Notice).\n\n(B)\n\nA decision by the Land Use Commission on an application for an amphitheater is subject\nto appeal under Section 25-5-149 (Appeal to Council).\n\n(C)\n\nA lawfully constructed amphitheater may be expanded one time without obtaining the\napproval required under Subsection (A) of this section, provided that the expansion\nis consistent with the applicable site development regulations and does not expand\nthe total area of the amphitheater by more than ten percent.\n\nSource: Ord. 20130228-074.\n\n(A)\n",
  "start_line": 14717,
  "end_line": 15150,
  "subsections": [
    "25-2-625-A",
    "25-2-625-B",
    "25-2-625-C",
    "25-2-625-A",
    "25-2-625-B",
    "25-2-625-C",
    "25-2-625-D",
    "25-2-625-E",
    "25-2-625-F",
    "25-2-625-G",
    "25-2-625-H",
    "25-2-625-A",
    "25-2-625-B",
    "25-2-625-C",
    "25-2-625-D",
    "25-2-625-A",
    "25-2-625-B",
    "25-2-625-C",
    "25-2-625-A"
  ]
}