{
  "id": "25-2-5",
  "title": "INDUSTRIAL USES DESCRIBED",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "For uses as described in Section 25-2-5 (Industrial uses Described), Section 25-2-6 (Civic Uses Described), and Section 25-2-7 (Agricultural Uses Described), a minimum of one bicycle parking space or 10 percent of the proposed motor vehicle\nparking spaces, whichever is greater.\n\n(D)\n\nA required bicycle space must comply with the requirements of the Transportation Criteria\nManual.\n\n(E)\n\nThe location of an off-street bicycle parking facility shall comply with the following\nrequirements:\n\n(1)\n\nA minimum of 50 percent of all required bicycle parking shall be located within 50\nfeet of the principal building entrance which shall not be obscured from public view;\nand\n\n(2)\n\nThe remaining required bicycle parking may be located as follows:\n\na.\n\nin a secure location within 50 feet of other building entryways other than the principal\nbuilding entrance;\n\nb.\n\nat employee only entrances;\n\nc.\n\nwithin a building; or\n\nd.\n\nin a covered motor vehicle parking facility within 50 feet of a street level entrance.\n\n(3)\n\nThe closest bicycle parking facility must be no farther than the closest motor vehicle\nparking space, excluding accessible parking spaces.\n\n(F)\n\nA provision of this article that is applicable to off-street motor vehicle parking\nalso applies to bicycle parking, unless the provision conflicts with this section.\n\n(G)\n\nThe city manager may waive a requirement relating to the number or type of bicycle\nspaces or approve an alternate method of compliance after considering the characteristics\nof the use, the site, and the surrounding area. A waiver may not reduce the number\nof required bicycle spaces to less than two.\n\n(H)\n\nA site or development subject to Subsection 2.3.1.B.2. of Article 2 (Site Development Standards) of Subchapter E of City Code Chapter 25-2 that chooses to provide shower and changing facilities as an option under Table B\n(Additional Measures to Improve Connectivity) shall provide facilities as follows:\n\n(1)\n\nFor buildings with less than 100,000 square feet of gross floor area, a minimum of\ntwo single-user shower-and-changing facilities.\n\n(2)\n\nFor buildings with 100,000 or more square feet of gross floor area, a minimum of four\nsingle-user shower-and-changing facilities.\n\nSource: Ord. 031120-44; Ord. 031211-11; Ord. 20060504-039; Ord. 20130523-104; Ord. No. 20231102-028, Pt. 44, 11-13-23; Ord. No. 20240201-035, Pt. 3, 2-12-24.\n\nA parking facility, circulation area, or queue line constructed or substantially reconstructed\nafter January 1, 1985, must comply with the design standards prescribed in Division\n4 (Design and Construction Standards for Parking and Loading Facilities), the Transportation Criteria Manual, and the landscape standards prescribed in Chapter 25-2, Subchapter C, Article 9 (Landscaping).\n\nSource: Ord. No. 20231102-028, Pt. 45, 11-13-23\n\n**Editor's note—**\nOrd. No. 20231102-028, Pt. 45, effective November 13, 2023, repealed the former § 25-6-478, and enacted\na new § 25-6-478 as set out herein. The former § 25-6-478 pertained to motor vehicle\nreductions general and derived from Ord. 031120-44; Ord. 031211-11; Ord. 040902-58;\nOrd. 20060831-068; Ord. 20130523-104; Ord. 20130829-105; Ord. No. 20141106-120, Pt. 1, 11-17-14.\n\n**Editor's note—**\nOrd. No. 20231102-028, Pt. 46, effective November 13, 2023, repealed § 25-6-501, which pertained to off-site\nparking and derived from Sections 13-5-99 (a), (b), and (e) and 13-5-106(a); Ord.\n990225-70; Ord. 990520-38; Ord. 010607-8; Ord. 031211-11; Ord. 20130411-061; Ord.\n20131017-081.\n\n**Editor's note—**\nOrd. No. 20231102-028, Pt. 47, effective November 13, 2023, repealed § 25-6-502, which pertained to application\nand approval and derived from Section 13-5-99 (a), (c), and (d); Ord. 990225-70; Ord.\n031211-11; Ord. 20130411-061.\n\nA person using off-site parking shall post:\n\n(1)\n\nat least one sign at the off-site parking facility indicating the property or use\nserved by the facility; and\n\n(2)\n\nat least one sign on the site of the use served indicating the location of the off-site\nparking.\n\nSource: Section 13-5-99(f); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA person must provide an off-street loading facility for:\n\n(1)\n\na new building or for a new use established in an existing building; and\n\n(2)\n\nan addition or enlargement of an existing use or a change of occupancy or operation\nthat results in an additional loading space being required;\n\n(B)\n\nFor an off-street loading facility in use on March 1, 1984, a person may not:\n\n(1)\n\nreduce the capacity to less than the number of spaces prescribed by Appendix A (Tables of Off-Street Loading Requirements and Former Off-Street Parking Requirements); or\n\n(2)\n\nalter the design or function in a manner that violates Appendix A (Tables of Off-Street Loading Requirements and Former Off-Street Parking Requirements).\n\n(C)\n\nA loading facility constructed or substantially reconstructed after January 1, 1985,\nmust comply with the design standards prescribed in Division 4 (Design And Construction Standards For Parking And Loading Facilities) and the Transportation Criteria Manual.\n\n(D)\n\nA required loading facility must:\n\n(1)\n\nbe maintained for the duration of the use or existence of the building requiring the\nfacility; and\n\n(2)\n\nbe used exclusively for the purpose of loading and unloading goods, materials, and\nsupplies.\n\nSource: Section 13-5-103; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 48, 11-13-23.\n\n(A)\n\nA person must provide an off-street loading facility for each use in a building or\non a site as prescribed in Appendix A (Tables of Off-Street Loading Requirements and Former Off-Street Parking Requirements).\n\n(B)\n\nMultiple uses or occupancies located in a single building or on one site may be served\nby a common loading space if the director determines that the loading space can adequately\nserve each use.\n\n(C)\n\nFor a common loading space, described under Subsection (B), the director shall apply\nAppendix A (Tables of Off-Street Loading Requirements and Former Off-Street Parking Requirements) to the combination of buildings and uses served by the loading space instead of\nto each individual building and use. The schedule applicable to the use with the greatest\nload requirement shall be used.\n\n(D)\n\nAn off-street loading facility requirement is based on the gross floor area. The gross\nfloor area does not include enclosed or covered areas used for off-street parking\nor loading.\n\n(E)\n\nIn this section, each two square feet of exterior site area used for a commercial\nor industrial use equals one square foot enclosed floor area.\n\nSource: Section 13-5-104; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 49, 11-13-23.\n\n(A)\n\nA parking or loading facility, circulation area, or queue line must comply with the\ndesign and construction standards in this section and in the Transportation Criteria\nManual.\n\n(B)\n\nA parking and loading facility must be maintained free of refuse or debris and must\nbe available for the off-street parking or loading use for which the facility is required.\n\nSource: Section 13-5-105(a) and (f); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe surfacing, curbing, and drainage improvements on a parking or loading facility\nmust provide adequate drainage and prevent the free flow of water to an adjacent property\nor public street or alley.\n\n(B)\n\nA light installed to illuminate a parking facility or paved area must be designed\nto reflect away from a residential use to the maximum extent practicable.\n\n(C)\n\nAn area used for primary circulation, frequent idling of vehicle engines, or loading\nactivity must be designed and located to minimize the effect on an adjoining property,\nincluding the use for screening or sound baffling.\n\nSource: Section 13-5-105(b), (c), and (e); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA parking facility that is in a nonresidential district parking facility and that\nadjoins a residential district must be separated from the residential district by\na wall or fence to screen the residential district from car lights and vehicle storage\nand movement. The wall or fence must be at least four feet in height and must be located\non the common boundary between the parking facility and the residential district for\nthe length of the common boundary.\n\n(B)\n\nA parking facility containing more than 10 spaces and that is in a residential district\nthat adjoins another property in a residential district must be separated from the\nadjoining property by a wall, fence, or landscape to screen the residential district\nfrom car lights and vehicle storage and movement. The wall, fence or landscape must\nbe at least six feet in height and must be located on the common boundary between\nthe parking facility and the adjoining property for the length of the common boundary.\n\n(C)\n\nA screen prescribed under Subsection (A) or (B) must be located on the property line\nunless:\n\n(1)\n\nexisting vegetation will be harmed if the screen is placed on the property line; or\n\n(2)\n\nplacement of the screen on the property line would interfere with an existing drainage\nfeature or utility.\n\n(D)\n\nIf a person places screening on the property other than on the property line, the\nperson must provide lot line monuments along the property line.\n\n(E)\n\nThe director may waive a screening requirement prescribed by Subsection (A) or (B)\nif:\n\n(1)\n\nthe director determines that extraordinary conditions exist as defined in the Environmental\nCriteria Manual; or\n\n(2)\n\nthe property owner who benefits from the screening submits a written statement to\nthe director that the owner would prefer that screening not be provided.\n\n(F)\n\nThe director or the Land Use Commission may modify a design and construction requirement\nof this division for a site subject to site plan review if the director or Land Use\nCommission determines that the modified requirement improves the esthetics or utility\nof the design or provides protection to an adjoining use in a manner equal to or greater\nthan the specific requirements of this division.\n\nSource: Section 13-5-105; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe requirements of this section apply to the:\n\n(1)\n\ncentral business district (CBD);\n\n(2)\n\ndowntown mixed use (DMU) zoning district;\n\n(3)\n\npublic (P) zoning district within the area bounded by Martin Luther King, Jr., Boulevard;\nIH-35; Lady Bird Lake; and Lamar Boulevard; and\n\n(4)\n\nuniversity neighborhood overlay (UNO) district.\n\n(B)\n\nOff-street motor vehicle parking is not required within the central business district\n(CBD) or downtown mixed use (DMU) zoning districts except as provided by this subsection.\nFor purposes of this subsection, off-street parking includes any parking that is designated\nto serve a use and is not located in a public right-of-way, regardless of whether\nthe parking is onsite or offsite.\n\nEditor's note—Amendments to division (B) of this section made by Ord. 20130523-104 did not take\ninto account amendments previously made by Ord. 20130411-061. The amendments enacted\nby Ord. 20130523-104 have therefore been made only to other parts of the section that\ndo not conflict with Ord. 20130411-061. Future legislation will correct the text if\nneeded.\n\n(1)\n\nIf off-street parking is provided, it must include parking for persons with disabilities\nas required by the Building Code and may not include fewer accessible spaces than\nwould be required under Paragraph (2)(a) of this subsection.\n\n(2)\n\nExcept for a use occupying a designated historic landmark or an existing building\nin a designated historic district, off-street motor vehicle parking for persons with\ndisabilities must be provided for a use that occupies 6,000 square feet or more of\nfloor space under the requirements of this paragraph.\n\n(a)\n\nThe following requirements apply if no parking is provided for a use, other than parking\nfor persons with disabilities:\n\n(i)\n\nthe minimum number of accessible parking spaces is calculated by taking 100 percent\nof the parking previously required for the use under Appendix A (Tables of Off-Street Loading Requirements and Former Off-Street Parking Requirements) and using that result to determine the number of accessible spaces required under\nthe Building Code. The accessible spaces may be provided on- or off-site, within 250\nfeet of the use and must be on an accessible route.\n\n(ii)\n\nThe director may waive or reduce the number of accessible spaces required under Paragraph\n(2)(a)(i) if the applicant pays a fee in-lieu to be used by the city to construct\nand maintain accessible parking in the vicinity of the use. The availability of this\noption is contingent on the establishment of a fee by separate ordinance and the adoption\nof a program by the director to administer the fee and establish eligibility criteria.\nA decision by the director that a use is ineligible for a fee in-lieu is final.\n\n(iii)\n\nThe director may waive or reduce the number of accessible spaces required if no accessible\nspaces can be provided consistent with the requirements of Paragraph (2)(a)(i) and\nthe use is ineligible for participation in the fee in-lieu program under Paragraph\n(2)(a)(ii).\n\n(iv)\n\nAn off-site or on-street parking space designated for persons with disabilities that\nis located within 250 feet of a use may be counted towards the number of parking spaces\nthe use is required to provide under Paragraph (2)(a)(i).\n\n(b)\n\nIf any off-street parking is provided for a use, other than parking for persons with\ndisabilities, then the use is subject to the requirements in Paragraph (1).\n\n(3)\n\nExcept as provided in Subsections (C) and (F), the maximum motor vehicle parking facility\nallowed is 60 percent of the number of motor vehicle parking spaces previously required\nby Appendix A (Tables of Off-Street Loading Requirements and Former Off-Street Parking Requirements).\n\n(4)\n\nExcept as provided in Subsections (C) and (D) of this section, a parking garage must",
  "start_line": 49091,
  "end_line": 49468,
  "subsections": [
    "25-2-5-D",
    "25-2-5-E",
    "25-2-5-F",
    "25-2-5-G",
    "25-2-5-H",
    "25-2-5-A",
    "25-2-5-B",
    "25-2-5-C",
    "25-2-5-D",
    "25-2-5-A",
    "25-2-5-B",
    "25-2-5-C",
    "25-2-5-D",
    "25-2-5-E",
    "25-2-5-A",
    "25-2-5-B",
    "25-2-5-A",
    "25-2-5-B",
    "25-2-5-C",
    "25-2-5-A",
    "25-2-5-B",
    "25-2-5-C",
    "25-2-5-D",
    "25-2-5-E",
    "25-2-5-F",
    "25-2-5-A",
    "25-2-5-B"
  ]
}