{
  "id": "25-2-282",
  "title": "LAND USE COMMISSION PUBLIC HEARING AND RECOMMENDATION",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "An appeal is subject to the procedures set forth in Section 25-2-282 (Land Use Commission Public Hearing and Recommendation) and Section 25-2-283 (City Council Zoning Hearing and Action) of the City Code.\n\nSource: Ord. 20080131-132; Ord. 20130627-105; Ord. 20140227-054, Pts. 1, 3, 3-10-14; Ord. No. 20191031-037, Pt. 1, 11-11-19; Ord. No. 20230504-030, Pt. 1, 5-15-23; Ord. No. 20230504-031, Pt. 1, 5-15-23; Ord. No. 20231019-052, Pt. 4, 10-30-23.\n\n(A)\n\nThis section applies in a neighborhood commercial (LR) district.\n\n(B)\n\nA personal improvement services use may not exceed 5,000 square feet of gross floor\narea.\n\n(C)\n\nThis subsection applies to a general retail sales (general) use.\n\n(1)\n\nThe gross floor area may not exceed 5,000 square feet.\n\n(2)\n\nAccess to the site from a local street is prohibited.\n\n(D)\n\nThis subsection applies to a restaurant (general) use.\n\n(1)\n\nThe gross indoor floor area may not exceed 4,000 square feet.\n\n(2)\n\nA restaurant (general) use may operate only after 7:00 a.m. and before 11:00 p.m.\n\n(3)\n\nAn outdoor seating area may not:\n\n(a)\n\nexceed 500 square feet of area; or\n\n(b)\n\nbe located within 50 feet of property with a single-family use or property zoned as\na townhouse and condominium residence (SF-6) or more restrictive district.\n\n(4)\n\nOutdoor entertainment as an accessory use is prohibited.\n\n(5)\n\nOutdoor amplified sound is prohibited.\n\n(6)\n\nA drive-through facility is prohibited.\n\nSource: Ord. 20080131-135; Ord. 20090521-017; Ord. 20120614-055.\n\n(A)\n\nThis section applies in a limited office (LO) district.\n\n(B)\n\nA personal services use may not exceed 1,000 square feet of gross floor area.\n\nSource: Ord. 20111110-107.\n\nIn the downtown mixed use (DMU) zoning district, commercial off-street parking is\na permitted use when it constitutes less than 50 percent of the parking spaces in\na parking structure.\n\nSource: Ord. 20130411-061\n\nThis subpart applies to property zoned central business (CBD) or downtown mixed use\n(DMU).\n\nSource: Ord. 030612-93; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA business that offers a drive-in service must provide a similar service for a pedestrian\nthat does not require the pedestrian to stand or walk in a vehicle lane.\n\n(B)\n\nFor a drive-in service, the total width of the curb cuts on a block face may not exceed\n30 feet.\n\nSource: Ord. 990225-70; Ord. 030612-93; Ord. 031211-11.\n\n(A)\n\nA site plan may not be approved unless the development complies with this section.\n\n(B)\n\nA building must achieve at least a one star rating under the Austin Green Building\nprogram, as prescribed by a rule adopted in accordance with Chapter 1-2 (Adoption of Rules).\n\n(C)\n\nA surface parking facility must be at least partially and periodically obscured from\nthe street by landscaping, a berm, a wall, decorative fencing, or another structure.\n\n(D)\n\nThis subsection prescribes screening requirements for a parking structure.\n\n(1)\n\nThe headlights of automobiles in a parking structure may not be directly visible from\nan adjacent building or a building across a street, other than an alley, from the\nparking structure.\n\n(2)\n\nAutomobiles in a parking structure must be screened from public view.\n\n(3)\n\nThe building code requirements for an open parking garage supersede the requirements\nof this subsection to the extent of conflict.\n\n(E)\n\nThis subsection prescribes additional screening requirements for all land uses except\na major utility facilities use or a local utility services use.\n\n(1)\n\nA trash receptacle, air conditioning or heating equipment, loading area, or external\nstorage must be screened from public view.\n\n(2)\n\nEquipment located on a roof must be screened from the view of a person standing on\nthe farthest edge of an adjacent public street, other than an alley. The director\nof the Watershed Protection and Development Review Department may waive this requirement\nafter determining that screening is not practical.\n\nSource: Ord. 030612-93; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), a site plan may not be approved unless the development\ncomplies with this section.\n\n(B)\n\nThis section does not apply to a site plan for:\n\n(1)\n\nproperty zoned as a historic landmark (H) or historic area (HD) combining district;\n\n(2)\n\nproperty designated as a historic landmark by the state or federal government;\n\n(3)\n\nproperty located in a National Register Historic District established by the federal\ngovernment;\n\n(4)\n\nremodeling of or addition to an existing structure;\n\n(5)\n\nrestoration of a damaged structure within one year of the date of damage;\n\n(6)\n\na change of use;\n\n(7)\n\nproperty located in the area bounded by Seventh Street from San Antonio Street to\nShoal Creek, Shoal Creek from Seventh Street to Fifteenth Street, Fifteenth Street\nfrom Shoal Creek to West Avenue, West Avenue from Fifteenth Street to Martin Luther\nKing, Jr. Boulevard, Martin Luther King, Jr. Boulevard from West Avenue to San Antonio\nStreet, San Antonio Street from Martin Luther King, Jr. Boulevard to Eleventh Street,\nEleventh Street from San Antonio Street to Guadalupe Street, Guadalupe Street from\nEleventh Street to Tenth Street, Tenth Street from Guadalupe Street to San Antonio\nStreet, and San Antonio Street from Tenth Street to Seventh Street; or\n\n(8)\n\nthe following uses:\n\n(a)\n\ncarriage stable;\n\n(b)\n\nfamily home;\n\n(c)\n\ngroup home;\n\n(d)\n\nlocal utility services;\n\n(e)\n\nmajor utility facilities;\n\n(f)\n\noutdoor entertainment;\n\n(g)\n\noutdoor sports and recreation;\n\n(h)\n\npark and recreation services;\n\n(i)\n\nreligious assembly;\n\n(j)\n\nsafety services;\n\n(k)\n\ntransitional housing; or\n\n(l)\n\ntransportation terminal.\n\n(C)\n\nExcept as provided in Subsection (D), for the first four stories of a building that\nare above grade:\n\n(1)\n\nthe maximum front yard setback is ten feet; and\n\n(2)\n\nthe maximum street side yard setback is ten feet.\n\n(D)\n\nThe maximum setbacks prescribed by Subsection (C) do not apply to the portion of a\nbuilding adjacent to a plaza or protected tree.\n\nSource: Ord. 030612-93; Ord. 031211-11; Ord. 041202-16.\n\n(A)\n\nThis section applies in an industrial park (IP), major industry (MI), or limited industrial\nservices (LI) district.\n\n(B)\n\nThe minimum interior yard setback and rear yard setback is:\n\n(1)\n\n50 feet, if adjacent to property zoned as or used for a use permitted in an LA, RR,\nSF-1, SF-2, SF-3, SF-4, SF-5, or SF-6 district;\n\n(2)\n\n25 feet, if adjacent to property zoned as or used for a use permitted in an MF-1,\nMF-2, MF-3, MF-4, MF-5, MF-6, or MH district;\n\n(3)\n\n15 feet, if adjacent to property zoned as or used for a use permitted in an NO, LO,\nGO, CR, LR, or GR district; and\n\n(4)\n\n10 feet, if adjacent to property zoned as or used for a use permitted in an L or less\nrestrictive district.\n\n(C)\n\nWithin the Limited Industrial Service (LI) District, public secondary educational\nfacilities are limited to the senior high school level.\n\nSource: Section 13-2-675; Ord. 990225-70; Ord. 031211-11; Ord. No. 20160623-090, Pt. 3, 7-4-16.\n\nUses permitted in a research and development (R&D) district are established by the\nzoning ordinance establishing the district.\n\nSource: Section 13-2-225; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in a research and development (R&D) district.\n\n(B)\n\nA site must be developed as a campus.\n\n(C)\n\nThe minimum lot size is 5 acres.\n\n(D)\n\nThe maximum lot size is 25 acres.\n\n(E)\n\nThe maximum floor to area ratio is .25 to 1 in the following areas:\n\n(1)\n\nthe Barton Creek watershed, as defined in Ordinance No. 810430-C;\n\n(2)\n\nthe aquifer-related Williamson Creek watershed, as defined in Ordinance No. 801218-W;\n\n(3)\n\nthe Lake Austin watershed, as defined in Ordinance No. 840301-G;\n\n(4)\n\nthe Lake Austin watershed, as defined in Ordinance No. 840308-K; and\n\n(5)\n\nthe Northwest Area, as defined in Ordinance No. 841206-H.\n\n(F)\n\nThe maximum height is 45 feet, except that the height of a building may exceed 45\nfeet by one foot for each additional two feet that the building is set back beyond\n100 feet from the front and side lot lines and beyond 50 feet from the rear lot line,\nup to a maximum height of 90 feet.\n\n(G)\n\nFor the portion of a site within 100 feet of property zoned as or used for a use permitted\nin an LA, RR, SF-1, SF-2, SF-3, SF-4, SF-5, or SF-6 district:\n\n(1)\n\nthe minimum street side yard setback is 100 feet;\n\n(2)\n\nthe minimum interior side yard setback is 100 feet; and\n\n(3)\n\nthe minimum rear yard setback is 50 feet.\n\n(H)\n\nFor the portion of a site within 100 feet of property zoned as or used for a use permitted\nin an MF-1, MF-2, MF-3, MF-4, MF-5, MF-6, or MH district:\n\n(1)\n\nthe minimum street side yard setback is 25 feet;\n\n(2)\n\nthe minimum interior side yard setback is 25 feet; and\n\n(3)\n\nthe minimum rear yard setback is 25 feet.\n\n(I)\n\nFor the portion of a site within 100 feet of property zoned as or used for a use permitted\nin an NO, LO, GO, LR, or GR district:\n\n(1)\n\nthe minimum interior side yard setback is 15 feet; and\n\n(2)\n\nthe minimum rear yard setback is 15 feet.\n\n(J)\n\nFor the portion of a site within 100 feet of property zoned as or used for a use permitted\nin an L or less restrictive district, the minimum rear yard setback is 10 feet.\n\n(K)\n\nThe maximum impervious cover is 50 percent on land with a gradient of 15 percent or\nless. Impervious cover is prohibited on land with a gradient greater than 15 percent.\n\nSource: Section 13-2-676; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies in an agricultural (AG) district.\n\n(B)\n\nFor a permitted use, the minimum front, side, and rear yard setbacks are 100 feet.\n\n(C)\n\nThis subsection applies to a conditional use.\n\n(1)\n\nThe minimum lot area is one acre.\n\n(2)\n\nThe maximum lot area is 1.5 acres.\n\n(3)\n\nThe minimum lot width is 100 feet.\n\n(4)\n\nNot more than one dwelling unit is permitted on each lot.\n\n(5)\n\nOne lot for each 10 acres of site area may be approved for a conditional use.\n\n(6)\n\nThe maximum distance from a rear lot line to the centerline of the nearest public\nroad is 400 feet.\n\n(7)\n\nThe minimum distance between driveways that serve conditional uses on the same site\nand on the same side of the road is 100 feet.\n\n(8)\n\nThe maximum height is the lesser of three stories or 35 feet.\n\n(9)\n\nThe minimum front yard setback is 40 feet.\n\n(10)\n\nThe minimum street side yard setback is 25 feet.\n\n(11)\n\nThe minimum interior side yard setback is 10 feet.\n\n(12)\n\nThe minimum rear yard setback is 20 feet.\n\n(13)\n\nThe maximum building cover is the lesser of 10,000 square feet or 20 percent of the\nlot area.\n\n(14)\n\nThe maximum impervious cover is the lesser of 12,500 square feet or 25 percent of\nthe lot area.\n\nSource: Section 13-2-681; Ord. 990225-70; Ord. 031211-11.\n\nIn an aviation services (AV) district, the following are permitted uses if located\non public property and conditional uses if located on private property:\n\n(1)\n\naviation facilities;\n\n(2)\n\ncommercial or industrial uses that are related to aviation and require direct access\nto an airport facility or aviation services, including assembly or sale of aircraft,\nair frames, air craft engines, aircraft parts or associated components, radios or\nnavigational equipment, and similar products or services;\n\n(3)\n\ncommercial or industrial uses that provide services to airport customers or aviation\nrelated uses, including passenger terminal facilities, air freight services, automobile\nservice stations, automobile rental agencies, restaurants, lounges, convenience shopping,\nbanking services, personal services, hotels and motels, and similar uses;\n\n(4)\n\nagricultural, recreational, or open space uses located within clear zones, approach\nareas, or lands reserved for future airport operations or related services;\n\n(5)\n\ncommunication service facilities; and\n\n(6)\n\ngovernmental, civic, public service, or public institutional uses, and related accessory\nuses.\n\nSource: Section 13-2-226; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nFor publicly owned land in an aviation services (AV) district, this title does not\nprescribe site development regulations.\n\n(B)\n\nFor privately owned land in an AV district:\n\n(1)\n\nsite development regulations are established by the approval of a conditional use\nsite plan; and\n\n(2)\n\napproval of an aviation-related use may not be granted until the owner obtains an\nairport use operating agreement for the intended activity.\n\nSource: Section 13-2-680; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn a public (P) district, the following are permitted uses:\n\n(1)\n\ngovernmental, civic, public service, and public institutional uses;\n\n(2)\n\nresidential uses associated with educational, military, medical, or similar public\nuses;\n\n(3)\n\ncommercial or industrial uses that are accessory to or in support of a principal public\nuse on the same site;\n\n(4)\n\nagricultural uses; and\n\n(5)\n\ntemporary uses.\n\n(B)\n\nA telecommunication tower use is a permitted or conditional use, as determined in",
  "start_line": 17392,
  "end_line": 17965,
  "subsections": [
    "25-2-282-A",
    "25-2-282-B",
    "25-2-282-C",
    "25-2-282-D",
    "25-2-282-A",
    "25-2-282-B",
    "25-2-282-A",
    "25-2-282-B",
    "25-2-282-A",
    "25-2-282-B",
    "25-2-282-C",
    "25-2-282-D",
    "25-2-282-E",
    "25-2-282-A",
    "25-2-282-B",
    "25-2-282-C",
    "25-2-282-D",
    "25-2-282-A",
    "25-2-282-B",
    "25-2-282-C",
    "25-2-282-A",
    "25-2-282-B",
    "25-2-282-C",
    "25-2-282-D",
    "25-2-282-E",
    "25-2-282-F",
    "25-2-282-G",
    "25-2-282-H",
    "25-2-282-I",
    "25-2-282-J",
    "25-2-282-K",
    "25-2-282-A",
    "25-2-282-B",
    "25-2-282-C",
    "25-2-282-A",
    "25-2-282-B",
    "25-2-282-A",
    "25-2-282-B"
  ]
}