{
  "id": "25-2-454",
  "title": "DISTRICT DESIGNATION ORDINANCE AND DESIGNATION ON ZONING MAP",
  "level": 2,
  "parent_id": "chapter-25-2",
  "content": "An applicant must submit proposed supplemental standards as described in Section 25-2-454 (District Designation Ordinance and Designation on Zoning Map) as part of an application to designate an area a creative spaces district.\n\n(4)\n\nThe director of the Economic Development Department is authorized to adopt rules under\nChapter 1-2 (Administrative Rules) that requires an applicant to provide certain information as part of an application\nto designate an area a creative spaces district.\n\n(B)\n\nExcept as provided in Subsection (E), the council may designate an area a creative\nspaces district if:\n\n(1)\n\nthe area is at least three acres;\n\n(2)\n\nthe base zoning for each site within the area is a commercial or less restrictive\nbase zoning district;\n\n(3)\n\nat least 25 percent of the primary uses within the proposed district are existing\ncreative spaces or are proposed to be used as creative spaces; and\n\n(4)\n\nat least 50 percent of the existing uses are non-residential.\n\n(C)\n\nThe council may enlarge an existing creative spaces district if the site to be included\ncontains uses that qualify as existing creative spaces or is proposed to contain new\ncreative spaces and the creative spaces add or will add value to the district.\n\n(D)\n\nExcept as provided in Subsection (E), the council may reduce the boundary of an existing\ncreative spaces district if the site to be excluded:\n\n(1)\n\ndoes not contribute to the preservation or creation of creative space, including affordable\ncreative space;\n\n(2)\n\ndoes not include a creative space; and\n\n(3)\n\nhas not utilized the benefits of the density bonus program.\n\n(E)\n\nLimitations.\n\n(1)\n\nA site within a creative spaces district is not eligible to be combined with any other\ndensity bonus combining district.\n\n(2)\n\nIf a site's base zoning is combined with the planned development area (PDA) combining\ndistrict, the site is not eligible to be included in a creative spaces district.\n\nSource: Ord. No. 20241010-034, Pt. 3, 10-21-24.\n\n(A)\n\nBefore an application can be reviewed by the Land Use Commission, the director of\nthe Planning Department must obtain recommendations from the directors of the following\ndepartments:\n\n(1)\n\nEconomic Development Department; and\n\n(2)\n\nHousing Department.\n\n(B)\n",
  "start_line": 13857,
  "end_line": 13943,
  "subsections": [
    "25-2-454-B",
    "25-2-454-C",
    "25-2-454-D",
    "25-2-454-E",
    "25-2-454-A",
    "25-2-454-B"
  ]
}