{
  "id": "30-1-352",
  "title": "INSPECTION REQUESTS",
  "level": 2,
  "parent_id": "chapter-30-1",
  "content": "provided in Section 30-1-352 (Inspection Requests).\n\n(8)\n\nCITY means the City of Austin, Texas.\n\n(9)\n\nCITY COUNCIL or COUNCIL means the city council of Austin, Texas.\n\n(10)\n\nCOLLECTOR STREET means a street collecting traffic from other streets and serving\nas the most direct route to a thoroughfare.\n\n(11)\n\nCOMMISSIONERS COURT means the commissioners court of Travis County, Texas.\n\n(12)\n\nCOMMON AREA means an area held, designed, or designated for the common use of the\nowners or occupants of a townhouse project, planned unit development, apartment, condominium,\nmobile home park, or subdivision.\n\n(13)\n\nCOMMON SIDE LOT LINE means a side lot line between two or more lots.\n\n(14)\n\nCOMPREHENSIVE PLAN means the plan adopted by the city council in accordance with Article\nX, Section 5 (The Comprehensive Plan), of the City Charter.\n\n(15)\n\nCONDEMNATION includes a purchase or donation of property under the threat of condemnation,\nbut excludes a dedication of property as a condition of zoning, subdivision, site\nplan, or building permit approval.\n\n(16)\n\nCONTRACTOR means a person employed by an owner to develop property.\n\n(17)\n\nCORNER LOT means a lot located at the intersection of two streets, or of two segments\nof a curved street, forming an angle of not more than 135 degrees.\n\n(18)\n\nCOUNTY means Travis County, Texas.\n\n(19)\n\nCURB means a structure located along the edge of a roadway, normally constructed integrally\nwith the gutter, that strengthens and protects the pavement edge and clearly defines\nthe pavement edge.\n\n(20)\n\nDENIAL means a final decision denying an application.\n\n(21)\n\nDESIRED DEVELOPMENT ZONE means the area not within the drinking water protection zone.\n\n(22)\n\nDEVELOPMENT means the construction or reconstruction of a building or road; the placement\nof a structure on land; the excavation, mining, dredging, grading, or filling of land;\nthe removal of vegetation from land; or the deposit of refuse or waste on land. Development\ndoes not include:\n\n(a)\n\nlawn and yard care, including mowing, gardening, tree care, and maintenance of landscaped\nareas;\n\n(b)\n\nremoval of trees or vegetation damaged by natural forces;\n\n(c)\n\nremoval of vegetation or cultivating the soil for agricultural operations, unless\nprohibited by Subsection 30-5-321(B) (Clearing of Vegetation); or\n\n(d)\n\nthe repair, maintenance, or installation of a utility, drainage or street system that\ndoes not disturb land or increase impervious cover.\n\n(23)\n\nDIRECTOR, when used without a qualifier, means the director of the city's Watershed\nProtection And Development Review Department.\n\n(24)\n\nDOMINANT SIDE YARD, when used in reference to a small lot, means the side yard having\nthe larger width.\n\n(25)\n\nDRINKING WATER PROTECTION ZONE means the areas within the Barton Springs Zone, the\nBarton Creek watershed, all water supply rural watersheds, and all water supply suburban\nwatersheds, as described in Section 30-5-2 (Descriptions Of Regulated Areas), that are in the planning jurisdiction.\n\n(26)\n\nDRIVEWAY means a surfaced area providing vehicular access between a street and an\noff-street parking or loading area.\n\n(27)\n\nDRIVEWAY APPROACH means an area between the roadway and private property designed\nfor and intended to provide vehicular access from the roadway to private property.\n\n(28)\n\nDWELLING UNIT means a residential unit other than a mobile home providing complete,\nindependent living facilities including permanent provisions for living, sleeping,\neating, and cooking.\n\n(29)\n\nEXECUTIVE MANAGER means the executive manager of the county's Transportation and Natural\nResources Department.\n\n(30)\n\nFINAL PLAT or PLAT means a map or drawing of a subdivision that is intended for recordation\nin the official public records of the county after approval by the land use commission,\nthe city council, or the commissioners court, as applicable.\n\n(31)\n\nFLAG LOT means a lot that abuts a street by means of a strip of land that does not\ncomply with the requirements of this chapter for minimum lot width, is not less than\n15 feet wide, and is used for access.\n\n(32)\n\nFRONT LOT LINE means:\n\n(a)\n\nfor an interior lot, the lot line abutting the street;\n\n(b)\n\nfor a corner lot, the lot line designated as the front lot line by a subdivision or\nparcel map, or, if none, the shorter lot line abutting a street;\n\n(c)\n\nfor a through lot, the lot line abutting the street that provides the primary access\nto the lot; and\n\n(d)\n\nfor a flag lot, the lot line designated as the front lot line by a subdivision or\nparcel map, or if none, the line determined by the single office to be the front lot\nline.\n\n(33)\n\nFRONT YARD means a yard extending the full width of a lot between the front lot line\nand the front setback line.\n\n(34)\n\nGROSS SITE AREA means the total site area.\n\n(35)\n\nGUTTER means a shallow water drainage area adjacent to a curb.\n\n(36)\n\nHEIGHT, when used in reference to a building, means the vertical distance from the\naverage of the highest and lowest grades adjacent to the building to:\n\n(a)\n\nfor a flat roof, the highest point of the coping;\n\n(b)\n\nfor a mansard roof, the deck line;\n\n(c)\n\nfor a pitched or hip roof, the average height of the highest gable; or\n\n(d)\n\nfor other roof styles, the highest point of the building.\n\n(37)\n\nHILL COUNTRY ROADWAY means a roadway described in Section 30-3-141 (Hill Country Roadways and Corridors Identified).\n\n(38)\n\nHILL COUNTRY ROADWAY CORRIDOR means an area described in Section 30-3-141 (Hill Country Roadways and Corridors Identified).\n\n(39)\n",
  "start_line": 83167,
  "end_line": 83376,
  "subsections": []
}