{
  "id": "30-1-435",
  "title": "NOTICE OF SUSPENSION OR REVOCATION",
  "level": 2,
  "parent_id": "chapter-30-1",
  "content": "after notification of the suspension under Section 30-1-435 (Notice Of Suspension Or Revocation). The single office shall give notice under Section 30-1-153(A) (Notice Of Public Hearing) of the public hearing.\n\n(D)\n\nIf the body determines that the person is not in compliance with a requirement of\nthe variance or special exception, the body may revoke the variance or special exception\nor take other action to obtain compliance.\n\n(E)\n\nThe body's decision to revoke a variance or special exception is effective immediately.\n\nSource: City Code Section 25-1-415; Ord. 031211-11; Ord. 031211-42.\n\nThe single office may immediately revoke a person's approved subdivision construction\nplan that has been suspended if the single office determines that the person:\n\n(1)\n\ndid not comply in a reasonable time with the requirements of this title for which\nthe suspension was ordered; or\n\n(2)\n\nduring the suspension, did not comply with other requirements of this title.\n\nSource: City Code Section 25-1-416; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may give notice to the person affected of the single office's intent\nto suspend or revoke an approved subdivision construction plan under this division.\n\n(B)\n\nThe notice may specify a reasonable time for compliance with this title. If a time\nfor compliance is specified, the single office may not suspend or revoke before the\ntime for compliance has expired.\n\nSource: City Code Section 25-1-417; Ord. 031211-11; Ord. 031211-42.\n\nThe single office shall give notice by certified mail, return receipt requested, under\nSection 30-1-154(B) (Notice Of Applications And Administrative Decisions) of a suspension or revocation\nby the official under this division.\n\nSource: City Code Section 25-1-418; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nIf the single office determines that a person required to obtain a subdivision construction\nplan has not complied with a requirement of this title, the single office may order\nthe person to stop the development of or transportation of construction material to\nthe site until the person complies with the requirements of this title.\n\n(B)\n\nWhile a stop work order is in effect:\n\n(1)\n\na city or county inspection may not be performed, and work requiring an inspection\nmay not be approved; and\n\n(2)\n\na person may not connect a utility at the site.\n\n(C)\n\nIf a stop work order is based on a failed inspection, a person may not further develop\nthe site until the development passes a reinspection.\n\n(D)\n\nIf a stop work order is based on a health or safety hazard, a person may not further\ndevelop the site until the director determines that the development complies with\nthe requirements of this title.\n\n(E)\n\nA city or county employee shall post a stop work order on the site and mail a copy\nof the order to the record owner.\n\nSource: City Code Section 25-1-441; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA person may appeal a stop work order, revocation, or suspension issued under this\narticle by giving written notice to the single office not later than the third day\nafter:\n\n(1)\n\nthe stop work order is posted; or\n\n(2)\n\nthe person receives notice of the revocation or suspension.\n\n(B)\n\nThe notice of appeal must contain:\n\n(1)\n\nthe name and address of the appellant;\n\n(2)\n\na statement of facts;\n\n(3)\n\nthe decision being appealed; and\n\n(4)\n\nthe reasons the decision should be set aside.\n\n(C)\n\nThe single office shall hear the appeal not later than the third working day after\nthe appeal is filed. The appellant, the appellant's expert, and the department may\noffer testimony to the single office.\n\n(D)\n\nThe single office shall affirm or reverse the decision not later than the second working\nday after the hearing. The single office shall give written notice of the decision\nand a statement of the reasons for the decision to the appellant.\n\n(E)\n\nA stop work order, suspension, or revocation remains in effect during the pendency\nof an appeal under this section.\n\nSource: City Code Section 25-1-461; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nCriminal penalties for violations of this title are prescribed by Title 1 (General\nProvisions) of the City Code and Local Government Code Chapter 232 (County Regulation\nOf Subdivisions).\n\n(B)\n\nA separate offense is committed each day that a violation of this title continues.\n\nSource: City Code Section 25-1-462; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nOther than the city council, only the planning commission may initiate an amendment\nto the regulations in this title on behalf of the city.\n\n(B)\n\nOnly the commissioners court may initiate an amendment to the regulations in this\ntitle on behalf of the county.\n\nSource: City Code Section 25-1-501; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThis section prescribes the city's procedure for amending the regulations in this\ntitle.\n\n(B)\n",
  "start_line": 86203,
  "end_line": 86371,
  "subsections": [
    "30-1-435-D",
    "30-1-435-E",
    "30-1-435-A",
    "30-1-435-B",
    "30-1-435-A",
    "30-1-435-B",
    "30-1-435-C",
    "30-1-435-D",
    "30-1-435-E",
    "30-1-435-A",
    "30-1-435-B",
    "30-1-435-C",
    "30-1-435-D",
    "30-1-435-E",
    "30-1-435-A",
    "30-1-435-B",
    "30-1-435-A",
    "30-1-435-B",
    "30-1-435-A",
    "30-1-435-B"
  ]
}