{
  "id": "30-1-132",
  "title": "FISCAL SECURITY",
  "level": 2,
  "parent_id": "chapter-30-1",
  "content": "security under Section 30-1-132 (Fiscal Security) for subdivision improvements.\n\n(B)\n\nFiscal security provided under this section may be used by the city or county, as\nappropriate, to construct the subdivision improvements.\n\nSource: City Code Section 25-4-37; County Code Section 82.401; Ord. 031211-11; Ord.\n031211-42; Ord. No. 20230831-142, Pt. 18, 9-1-23; Ord. No. 20240718-103, Pt. 4, 7-29-24.\n\n(A)\n\nApproval of a plat is not an acceptance by the city or county of an offered dedication.\nDisapproval or denial of a plat is a refusal by the city or county to accept an offered\ndedication shown on a plat.\n\n(B)\n\nThe city or county may accept an offered dedication only by the action of an authorized\nofficial.\n\n(C)\n\nThe commissioners court may accept an offered dedication of a street by issuing a\ncertificate of acceptance.\n\n(D)\n\nA street may not be accepted unless it is constructed in accordance with the applicable\nrequirements and with the required utilities and drainage facilities installed. Entry,\nuse, or improvement by the city or county, as applicable, under a fiscal security\nagreement is not an acceptance of an offered dedication.\n\n(E)\n\nExcept as provided in a fiscal security agreement, an officer or employee of the city\nor county may not enter, use, or improve a street unless the street has been accepted\nby the city or county, as applicable.\n\nSource: City Code Section 25-4-38; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe city and the county shall review and approve, disapprove, or deny a plat vacation,\nreplat, or amending plat in accordance with the standards and procedures in Local\nGovernment Code Section 212.013 (Vacating Plat), Section 212.014 (Replatting Without Vacating Plat), Section 212.015 (Additional Requirements for Certain Replats), and Section 212.016 (Amending Plat).\n\n(B)\n\nThe single office shall provide a single joint notice stating the dates of the city\nand county hearings for a notice required by Local Government Code Section 212.015\n(Additional Requirements for Certain Replats) or Section 212.016 (Amending Plat).\n\n(C)\n\nAn application to vacate a plat expires after one year.\n\nSource: Ord. 20050929-079; Ord. No. 20160421-039, Pt. 18, 4-21-16.\n\n(A)\n\nThe requirements of this section are mandated by state law and supersede any contrary\nprovisions of the City Code.\n\n(B)\n\nIn this section, applicant response means the information provided by the applicant\nto the single office to address the conditions of approval or reasons for disapproval\nof an application for preliminary plan, plat, or subdivision construction plan.\n\n(C)\n\nAn applicant response:\n\n(1)\n\nmust adequately address each condition of approval or reason for the disapproval;\n\n(2)\n\nmust include only changes only as necessary to address the condition of approval or\nreason for disapproval; and\n\n(3)\n\nmay not include substantial changes unrelated to the condition of approval or reason\nfor disapproval.\n\n(D)\n\nUpon receipt of an applicant response to a preliminary plan, plat, or replat the single\noffice shall:\n\n(1)\n\ndetermine if the applicant response meets the requirements in Subsection (C), and\n\n(2)\n\napprove, approve with conditions, or disapprove with reasons, the preliminary, plat,\nor replat not later than 15 days after the applicant response was submitted.\n\n(E)\n\nIf the applicant response as submitted complies with the provisions of Subsection\n(C), and the single office fails to comply with the time limits for action in this\nsection, the application for preliminary plan or plat is approved by operation of\nlaw.\n\nSource: Ord. No. 20190822-117, § 50, 9-1-19; Ord. No. 20230831-142, Pt. 19, 9-1-23.\n\n(A)\n\nA preliminary plan must be approved before a plat may be approved, except as provided\nin Subsection (B).\n\n(B)\n\nA plat may be approved without a preliminary plan if each lot abuts an existing dedicated\npublic street and the single office determines that:\n\n(1)\n\na new street or an extension of a street is not necessary to provide adequate traffic\ncirculation;\n\n(2)\n\nthe applicant has dedicated additional right of way necessary to provide adequate\nstreet width for an existing street abutting a lot; and\n\n(3)\n\ndrainage facilities are not necessary to prevent flooding, or if necessary, the applicant\nhas arranged for the construction of drainage facilities.\n\nSource: City Code Section 25-4-51; County Code Sections 82.201(b)(2)—(8) and 82.203(a);\nOrd. 031211-11; Ord. 031211-42.\n\n(A)\n\nIf a preliminary plan is part of an applicant's plan for a larger development, the\napplicant shall file a master development plan with the single office when the first\napplication for preliminary plan approval is filed.\n\n(B)\n\nA master development plan may be in schematic form, must include the applicant's entire\ndevelopment, and must provide for the safe, healthful, and orderly extension of roads,\nutilities, drainage, and other public facilities.\n\nSource: City Code Section 25-4-52; County Code Section 82.201(b)(9); Ord. 031211-11;\nOrd. 031211-42.\n\n**Editor's note—**\nOrd. No. 20190822-117, § 51, effective September 1, 2019, repealed § 30-2-53, which pertained to concurrent\ncity applications and derived from City Code Section 25-4-53; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nApproval of a preliminary plan supersedes a previously approved preliminary plan for\nthe same land.\n\n(B)\n\nAn applicant may not include land from a previously approved preliminary plan in a\nsubsequent application for approval of a preliminary plan unless all the land, except\nland contained in an approved plat, is included in the application.\n\n(C)\n\nThe single office may waive the requirement of Subsection (B) if the single office\ndetermines that including only a portion of the previously approved preliminary plan\ndoes not substantially impair the orderly planning of roads, utilities, drainage,\nor other public facilities.\n\n(D)\n\nAn interested party may appeal the single office decision under Subsection (C) to\nthe land use commission.\n\nSource: City Code Section 25-4-54; Ord. 031211-11; Ord. 031211-42.\n\n**Editor's note—**\nOrd. No. 20190822-117, § 52, effective September 1, 2019, repealed § 30-2-55, which pertained to notice\nand derived from City Code Section 25-4-55; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office shall promptly deliver a copy of an application for preliminary\nplan approval to each reviewing department or agency after the application is filed.\n\n(B)\n\nA reviewing department or agency shall prepare and deliver to the single office a\nwritten report of comments and recommendations regarding an application for preliminary\nplan approval before the expiration of the staff review period described in this section.\n\n(C)\n\nStaff review period for an application for preliminary plan approval is established\nby the director by administrative rule.\n\n(D)\n\nAn applicant may file with the single office an update to an application for preliminary\nplan approval before expiration of the application.\n\n(E)\n\nThe staff review period of an update to an application for preliminary plan approval\nis established by the director by administrative rule.\n\nSource: City Code Section 25-4-56; Ord. 031211-11; Ord. 031211-42; Ord. 20050929-079;\nOrd. No. 20160421-039, Pt. 19, 4-21-16; Ord. No. 20190822-117, § 53, 9-1-19; Ord. No. 20230831-142, Pt. 20, 9-1-23.\n\nThe single office shall approve an application for preliminary plan approval that\ncomplies with the requirements of this title.\n\nSource: City Code Section 25-4-57; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 54, 9-1-19; Ord. No. 20230831-142, Pt. 21, 9-1-23.\n\n**Editor's note—**\nOrd. No. 20190822-117, § 55, effective September 1, 2019, repealed § 30-2-58, which pertained to council\naction on preliminary plan and derived from City Code Section 25-4-58; Ord. 031211-11;\nOrd. 031211-42.\n\nApproval of a preliminary plan establishes a mutual commitment on behalf of the city\nor county and the applicant to:\n\n(1)\n\nthe subdivision layout for plat approval, including the location and width of proposed\nstreets, lots, blocks, and easements shown on the preliminary plan; and\n\n(2)\n\nthe availability of utilities to serve the subdivided land to the extent shown on\nthe preliminary plan.\n\nSource: City Code Section 25-4-59; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as provided in Subsection (B), an approved preliminary plan expires:\n\n(1)\n\nin the drinking water protection zone, four years after the date of its approval;\nor\n\n(2)\n\nin the desired development zone, ten years after the date of its approval.\n\n(B)\n\nThe appropriate official may extend the expiration date of an approved preliminary\nplan:\n\n(1)\n\ntwice for periods of not more than two years each, if the appropriate official determines\nthat, since the date of the plan's approval, the plan has not significantly changed,\nand the applicable regulations have not significantly changed; or\n\n(2)\n\nfor a period determined by the appropriate official if the applicant agrees with the\nappropriate official to complete the subdivision infrastructure in increments or phases\nthat correspond to the increments or phases of the development.\n\n(Ord. No. 20240718-103, Pt. 6, 7-29-24)\n\n(A)\n\nAn applicant can request a change to an approved preliminary plan, on a form provided\nby the single office, if:\n\n(1)\n\nthe land affected by the change has not received final plat; and\n\n(2)\n\nall the owners of the land affected by the change support the request.\n\n(B)\n\nThe single office may approve a minor deviation from an approved preliminary plan\nif the single office determines that the minor deviation complies with the requirements\nof this subsection. An applicant shall identify the proposed minor deviation on a\ncopy of the preliminary plan submitted to the single office. A formal application\nis not required.\n\n(1)\n\nA minor deviation may not:\n\n(a)\n\nremove a property restriction or subdivision note;\n\n(b)\n\nmodify a waiver or variance;\n\n(c)\n\nchange an easement, except with the director's approval;\n\n(d)\n\nincrease impervious cover;\n\n(e)\n\nmodify a conservation easement, common area, green space, or other open space shown\non the preliminary plan;\n\n(f)\n\naffect property outside the proposed plat;\n\n(g)\n\nincrease the number of lots;\n\n(h)\n\nchange the use of a lot; or\n\n(i)\n\nchange the basic street layout.\n\n(2)\n\nA minor deviation may:\n\n(a)\n\nchange lot size or configuration;\n\n(b)\n\nchange street width or alignment; or\n\n(c)\n\nchange a utility or access easement.\n\n(C)\n\nIf the requested change does not qualify as a minor deviation, the applicant may submit\na separate application to the single office requesting the change. The single office\nmay approve the change if the single office determines that the requested change complies\nwith the requirements of this title.\n\nSource: City Code Section 25-4-61; Ord. 031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 22, 9-1-23; Ord. No. 20240718-103, Pt. 5, 7-29-24.\n\n(A)\n\nAn applicant may appeal the director's disapproval of a preliminary plan application\nto the land use commission or council.\n\n(B)\n\nAn applicant may appeal the county executive's disapproval of a plat application to\nthe commissioners court.\n\n(C)\n\nThe single office shall give notice under Section 30-1-153(A) (Notice of Public Hearing) of the land use commission's, council's, or commissioners court's consideration\nof an appeal.\n\n(D)\n\nAn applicant must receive approval from both the city and county in accordance with\nSection 30-1-91(A) (Final Approval).\n\nSource: Ord. No. 20230831-142, Pt. 23, 9-1-23; Ord. No. 20240718-103, Pt. 7, 7-29-24.\n\n**Editor's note—**\nOrd. No. 20230831-142, Pt. 23, effective September 1, 2023, repealed the former § 30-2-62, and enacted",
  "start_line": 86842,
  "end_line": 87226,
  "subsections": [
    "30-1-132-B",
    "30-1-132-A",
    "30-1-132-B",
    "30-1-132-C",
    "30-1-132-D",
    "30-1-132-E",
    "30-1-132-A",
    "30-1-132-B",
    "30-1-132-C",
    "30-1-132-A",
    "30-1-132-B",
    "30-1-132-C",
    "30-1-132-D",
    "30-1-132-E",
    "30-1-132-A",
    "30-1-132-B",
    "30-1-132-A",
    "30-1-132-B",
    "30-1-132-A",
    "30-1-132-B",
    "30-1-132-C",
    "30-1-132-D",
    "30-1-132-A",
    "30-1-132-B",
    "30-1-132-C",
    "30-1-132-D",
    "30-1-132-E",
    "30-1-132-A",
    "30-1-132-B",
    "30-1-132-A",
    "30-1-132-B",
    "30-1-132-C",
    "30-1-132-A",
    "30-1-132-B",
    "30-1-132-C",
    "30-1-132-D"
  ]
}