{
  "id": "30-1-113",
  "title": "PRELIMINARY PLAN OR PLAT APPLICATION REQUIREMENTS AND EXPIRATION",
  "level": 2,
  "parent_id": "chapter-30-1",
  "content": "\n(A)\n\nThis section establishes a \"stop the clock\" provision tolling the expiration period\nfor an application that requires discretionary review by the Land Use Commission,\nBoard of Adjustment, commissioners court, or city council.\n\n(B)\n\nThe expiration of an application is tolled if, prior to expiration of the application,\nthe single office determines that approval of the application requires:\n\n(1)\n\ndiscretionary review, as authorized under this title, by the Land Use Commission,\nBoard of Adjustment, commissioners court, or city council, other than a zoning change\nor code amendment; and\n\n(2)\n\nthe application meets all other requirements for approval, except for payment of fees,\nposting fiscal surety, and other code requirements as determined by the single office\nunder Section 30-1-113 (Preliminary Plan or Plat Application Requirements and Expiration) or 30-1-116 (Subdivision Construction Plan Application and Requirements).\n\n(C)\n\nIf an applicant obtains all required discretionary approvals from the Land Use Commission,\nBoard of Adjustment, commissioners court or city council, any additional updates of\nthe application must be submitted no later than 60 working days after the date of\nthe approval. An application expires if the applicant does not comply with this deadline.\n\n(D)\n\nAn application expires if the Land Use Commission, Board of Adjustment, commissioners\ncourt, or city council denies a required discretionary approval or fails to take action\nafter considering the matter at a public hearing.\n\n(E)\n\nIf expiration of an application is tolled under this section pending required approval\nby the Land Use Commission, Board of Adjustment, commissioners court, or city council,\nthe expiration period for all other applications associated with the same project\nis also tolled.\n\nSource: Ord. No. 20230831-142, Pt. 9, 9-1-23.",
  "start_line": 84530,
  "end_line": 84574,
  "subsections": []
}