{
  "id": "30-1-22",
  "title": "MEASUREMENTS",
  "level": 2,
  "parent_id": "chapter-30-1",
  "content": "is determined in accordance with Section 30-1-22 (Measurements).\n\n(62)\n\nREAR YARD means a yard extending the full width of a lot between the rear lot line\nand the rear setback line, excluding any area located within the street side yard\nof a corner lot.\n\n(63)\n\nRECORD OWNER means the owner of real property as shown by the deed records of the\ncounty in which the property is located.\n\n(64)\n\nRELEASE means the written certification that a plat or subdivision construction plan\nhas been approved, that the plat or construction plan complies with this title, and\nthat the conditions of approval for the plat or construction plan have been satisfied.\n\n(65)\n\nREVISION means a change in an approved or released plan that is initiated by an applicant.\n\n(66)\n\nRIGHT-OF-WAY means land dedicated or reserved for streets, utilities, or other public\nfacilities.\n\n(67)\n\nROADWAY means the portion of a street right-of-way used for vehicular travel.\n\n(68)\n\nSETBACK LINE means a line within a lot parallel to and measured from a corresponding\nlot line, forming the boundary of a yard and governing the placement of structures\nand uses on the lot.\n\n(69)\n\nSIDE LOT LINE means a lot line intersecting the front lot line and extending a minimum\ndistance of 75 feet.\n\n(70)\n\nSIDEWALK means the paved portion of a pedestrian way.\n\n(71)\n\nSIDE YARD means a yard extending the depth of a lot from the front yard to the rear\nlot line between the side lot line and the side setback line. For a corner lot, a\nstreet side yard is a yard that extends from the front yard to the rear lot line.\n\n(72)\n\nSINGLE OFFICE means the City of Austin - Travis County Single Subdivision Office.\n\n(73)\n\nSITE means a contiguous area intended for development, or the area on which a building\nhas been proposed to be built or has been built. A site may not cross a public street\nor right-of-way.\n\n(74)\n\nSMALL LOT means a lot with an area of less than 5,750 square feet.\n\n(75)\n\nSTAFF means a city or county employee, as applicable.\n\n(76)\n\nSTREET YARD means a yard adjacent to a street and determined on the basis of a street\nlot line.\n\n(77)\n\nSTRUCTURE means a building of any kind, or a piece of work artificially built-up or\ncomposed of parts joined together in a definite manner.\n\n(78)\n\nSUBDIVIDE means:\n\n(a)\n\nto divide land into two or more lots or sites for the purpose of sale or development;\n\n(b)\n\nto resubdivide an existing lot; or\n\n(c)\n\nto combine two or more lots into the same number or fewer lots with different boundaries.\n\n(79)\n\nSUBORDINATE SIDE YARD, when used in reference to a small lot, means the side yard\nhaving the smaller width.\n\n(80)\n\nTHROUGH LOT means a lot, other than a corner lot, abutting more than one street.\n\n(81)\n\nTOWNHOUSE means a dwelling unit having a common wall with or abutting one or more\nadjoining dwelling units in a townhouse group.\n\n(82)\n\nTOWNHOUSE LOT means the portion of a townhouse development that is intended for separate\nownership as the location of a single townhouse and associated private yard area.\n\n(83)\n\nTRANSPORTATION PLAN means the Capital Area Metropolitan Planning Organization long\nrange transportation plan.\n\n(84)\n\nUPDATE means additional information, a preliminary plan, a final plat, or a subdivision\nconstruction plan submitted by an applicant in response to comments by a review entity.\n\n(85)\n\nUSE EASEMENT, when used in reference to a small lot, means an easement granted by\nthe owner of a small lot with the subordinate side yard to the owner of a small lot\nwith a dominant side yard along the common lot line, and which allows the occupant\nof the dwelling unit on the lot having the dominant side yard the use, enjoyment,\nand privacy of the dominant side yard.\n\n(86)\n\nVARIANCE means a waiver of a provision of this title under Article 9, Division 3 (Variances).\n\n(87)\n\nWORKING DAY excludes a Saturday, Sunday, or an official city or county holiday.\n\n(88)\n\nYARD means an open space on a lot adjoining a lot line.\n\n(89)\n\nZERO LOT LINE means a common lot line on which a wall of a structure may be constructed.\n\nSource: City Code Section 25-1-25; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130;\nOrd. No. 20170615-102, Pt. 33, 6-15-17.\n\n(A)\n\nLot area is the net horizontal area within the lot lines, excluding the portion of\nthe lot:\n\n(1)\n\nthat provides street access, if the lot is a flag lot; or\n\n(2)\n\nthat is located below 492.8 feet of elevation above sea level, if the lot is adjacent\nto Lake Austin.\n\n(B)\n\nLot depth is the horizontal distance between the mid-point of the front lot line and\nthe midpoint of the rear lot line.\n\n(C)\n\nExcept as otherwise provided in this title, lot width is measured at the front setback\nline and at a distance of 50 feet to the rear of the front setback line.\n\n(D)\n\nIn determining required yards and setbacks for an irregularly shaped lot or a lot\nbounded by only three lot lines, the rear lot line is:\n\n(1)\n\na line ten feet long;\n\n(2)\n\nparallel to the front lot line; and\n\n(3)\n\nat the most distant location from the front lot line.\n\n(E)\n\nA distance from a structure to a line or location is measured from the exterior face\nof the nearest wall or vertical support of the structure to the line or location.\nFor a structure that does not have a wall or vertical support, the single office shall\ndetermine the point of measurement.\n\nSource: City Code Section 25-1-22; Ord. 031211-11; Ord. 031211-42.\n\nThe city council enacts and amends this title with the concurrence of the commissioners\ncourt. The city council has the duties and powers prescribed by this title and may\nmake determinations relating to certain subdivisions.\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42.\n\nThe commissioners court enacts and amends this title with the concurrence of the city\ncouncil. The commissioners court has the duties and powers prescribed by this title\nand acts as the platting board for certain subdivision applications.\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42; Ord. No. 20230831-142, Pt. 1, 9-1-23.\n\nThe land use commission acts as the platting board for certain subdivision applications.\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42; Ord. No. 20230831-142, Pt. 2, 9-1-23.\n\n(A)\n\nThe managing officials act on behalf of the city and the county to administer the\nAgreement On Subdivision Platting In The Extraterritorial Jurisdiction Between The\nCity Of Austin And Travis County dated April 1, 2002.\n\n(B)\n\nOne managing official is appointed by the city, and one managing official is appointed\nby the county, in accordance with the Agreement On Subdivision Platting In The Extraterritorial\nJurisdiction Between The City Of Austin And Travis County dated April 1, 2002.\n\n(C)\n\nThe managing officials have the duties and powers prescribed by this title.\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42.\n\nThe platting official is a city or county official who has the duties and powers prescribed\nby this title. Whether a city official or a county official acts as the platting official",
  "start_line": 83516,
  "end_line": 83758,
  "subsections": [
    "30-1-22-A",
    "30-1-22-B",
    "30-1-22-C",
    "30-1-22-D",
    "30-1-22-E",
    "30-1-22-A",
    "30-1-22-B",
    "30-1-22-C"
  ]
}