{
  "id": "30-1-118",
  "title": "EXTENSION OF REVIEW PERIOD",
  "level": 2,
  "parent_id": "chapter-30-1",
  "content": "the applicant to extend the initial review pursuant to Section 30-1-118 (Extension of Review Period).\n\n(C)\n\nA condition for approval or reason for disapproval must be written and may not be\narbitrary. The condition or reason must:\n\n(1)\n\nbe directly related to requirements adopted under Texas Local Government Code Chapter\n212 Subchapter A (Regulation of Subdivisions) or Texas Local Government Code Chapter 232 Subchapter A (Subdivision Platting Requirements in General); and\n\n(2)\n\ninclude a citation to the law, including a statute or order, that is the basis for\nthe condition for approval or reason for disapproval.\n\n(D)\n\nIf an application for a preliminary plan or plat is not approved, approved with conditions,\nor disapproved with reasons within a time period prescribed by Subsection (B) the\napplication is approved by operation of law.\n\nSource: County Code Section 82.201(b); Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 46, 9-1-19; Ord. No. 20230831-142, Pt. 14, 9-1-23.\n\n(A)\n\nAn original tract is a tract that:\n\n(1)\n\nis a legal lot or tract; or\n\n(2)\n\nwas a legal lot or tract before being subdivided in violation of ordinance requirements.\n\n(B)\n\nAn applicant shall include all land in the original tract in an application for preliminary\nplan or plat approval.\n\n(C)\n\nThe single office may waive the requirement of Subsection (B) if the single office\ndetermines that:\n\n(1)\n\nsubdividing only a portion of the original tract will not substantially impair the\norderly planning of roads, utilities, drainage, and other public facilities;\n\n(2)\n\nthe portion of the original tract contiguous to the area to be subdivided has direct\naccess to a public street, or the applicant has provided access to a public street\nby dedicating right-of-way at least 50 feet wide;\n\n(3)\n\na reasonable use of the balance of the original tract is possible; and\n\n(4)\n\nthe applicant has mailed, by certified mail, to all owners of land that is a portion\nof the original tract and contiguous to the land included in the application a request\nthat each owner provide written confirmation to the director that:\n\n(a)\n\nthe owner's land is not a legal lot or tract; and\n\n(b)\n\nthe owner must plat the land before the city may approve a development permit or a\nutility company may provide initial or additional service.\n\n(D)\n\nIn making a determination under Subsection (D)(3) that a reasonable use of the balance\nof the original tract is possible, the single office may require that the applicant\nprovide a schematic land plan of the balance of the original tract. The single office\nmay not require that the applicant provide detailed engineering information.\n\n(E)\n\nAn applicant who satisfies the requirement of Subsection (D)(2) by dedicating right-of-way\nto provide access to a public street is not required to construct improvements within\nthe right-of-way.\n\n(F)\n\nAs a condition of a waiver to Subsection (B), the county may require the subdivider\nto enter into a phasing agreement to provide for the orderly development of the property.\n\n(1)\n\nA subdivider must obtain approval of a phasing agreement by the commissioners court\nnot later than the date the first final plat is approved.\n\n(2)\n\nThe single office may make a recommendation on the phasing agreement.\n\n(3)\n\nThe commissioners court may approve a phasing agreement if the commissioners court\ndetermines:\n\n(a)\n\nthe phasing agreement accommodates the development and protects the public interest;\n\n(b)\n\nthe dedication of roads, drainage facilities, parkland, and other infrastructure and\nthe posting of construction security is roughly proportional to the impact of the\ndevelopment of the property; and\n\n(c)\n\nthe phasing agreement has been approved by the county attorney.\n\nSource: City Code Section 25-4-33; County Code Section 82.201(b)(4)—(8); Ord. 031211-11;\nOrd. 031211-42; Ord. No. 20190822-117, § 47, 9-1-19; Ord. No. 20230831-142, Pt. 15, 9-1-23.\n\n(A)\n\nThe director shall determine whether board or commission review of a request associated\nwith an application for preliminary plan or plat approval is required under this section.\nThe director shall schedule an associated request for board or commission review on\nthe earliest available date.\n\n(B)\n\nThe following board or commission must review an associated request before the land\nuse commission may consider the application or the associated request:\n\n(1)\n\nthe urban transportation commission and the environmental commission shall review\na request for an amendment to the transportation plan;\n\n(2)\n\nthe water and wastewater commission and, if requested by the city council, the environmental\ncommission shall review a request for an amendment to the city's water or wastewater\nservice area boundary; and\n\n(3)\n\nthe water and wastewater commission shall review a request for city cost participation\nin construction of water or wastewater facilities.\n\nSource: City Code Section 25-4-34; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 48, 9-1-19; Ord. No. 20230831-142, Pt. 16, 9-1-23.\n\nIf an application for a preliminary plan or plat requires a variance to comply with\nthe provisions of this title, an applicant is required to obtain approval of the variance\nbefore the associated application for a preliminary plan, plat, or subdivision construction\nplan can be approved by the single office.\n\nSource: City Code Section 25-4-35; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 49, 9-1-19; Ord. No. 20230831-142, Pt. 17, 9-1-23.\n\n(A)\n\nThe platting board shall grant a variance from a requirement of Article 3 (Platting Requirements) if the platting board determines that enforcement of the requirement will make subdivision\nof a tract of land impractical and deny the owner all reasonable use of the land.\n\n(B)\n\nFor a mass housing project, a planned unit development, or similar neighborhood unit,\nthe platting board may grant a variance from a requirement of Article 3 (Platting Requirements) if the platting board determines that planned development will provide light and\nair, vehicular and pedestrian circulation, and recreational facilities that are at\nleast equal to the requirements of this title. An applicant must provide the platting\nboard with a written report documenting compliance with this subsection.\n\n(C)\n\nThe platting board may grant a variance from a requirement of Article 3 (Platting Requirements) if the platting board determines that the variance protects the public interest\nand complies with sound engineering principles and practices.\n\nSource: City Code Section 25-4-36; County Code Section 82.201(f); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nBefore the single office may approve a plat, the subdivider shall:\n\n(1)\n\nobtain final approval of subdivision construction plans; post fiscal security as required\nby the county executive for restoration of disturbed areas, boundary streets, and\nsidewalks; and construct the streets, utilities, and drainage facilities in compliance\nwith the requirements of this title; or\n\n(2)\n\nfile an application for approval of subdivision construction plans and provide fiscal",
  "start_line": 86644,
  "end_line": 86841,
  "subsections": [
    "30-1-118-C",
    "30-1-118-D",
    "30-1-118-A",
    "30-1-118-B",
    "30-1-118-C",
    "30-1-118-D",
    "30-1-118-E",
    "30-1-118-F",
    "30-1-118-A",
    "30-1-118-B",
    "30-1-118-A",
    "30-1-118-B",
    "30-1-118-C",
    "30-1-118-A"
  ]
}