{
  "id": "30-1-93",
  "title": "SINGLE OFFICE STRUCTURE AND FUNCTION",
  "level": 2,
  "parent_id": "chapter-30-1",
  "content": "approval of subdivisions, exercised in accordance with Section 30-1-93 (Single Office Structure And Function).\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nExcept as provided in Subsection (B), an administrative rule to implement, administer,\nenforce, or comply with the title, including a standard form, is not valid unless\nadopted by both the city and the county.\n\n(B)\n\nAdministrative rules that relate to the subject matter of this title and that are\nin effect on January 1, 2004 govern this title until amended or repealed in accordance\nwith this section.\n\n(C)\n\nThe city may adopt an administrative rule in accordance with City Code Chapter 1-2\n(Adoption of Rules).\n\n(D)\n\nThe county may adopt an administrative rule by action of the county executive.\n\n(E)\n\nAfter the city and county have both adopted an administrative rule, the managing officials\nshall certify that the administrative rule applies to this title.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130.\n\n(A)\n\nAn applicant must obtain city and county approvals in the following order:\n\n(1)\n\nzoning, for an area annexed by the city for limited purposes;\n\n(2)\n\nsubdivision;\n\n(3)\n\nsite plan; and\n\n(4)\n\nbuilding permit, for an area annexed by the city for limited purposes.\n\n(B)\n\nAn applicant must obtain approvals for subdivision development in the following order:\n\n(1)\n\npreliminary plan, if required;\n\n(2)\n\nplat; and\n\n(3)\n\nsubdivision construction plan.\n\n(C)\n\nAn applicant may concurrently file zoning and site plan applications if no subdivision\nis required.\n\n(D)\n\nAn applicant may concurrently file subdivision, site plan, and building permit applications,\nif no zoning or rezoning is required or requested.\n\n(E)\n\nThe single office may authorize concurrent applications under the following circumstances:\n\n(1)\n\nPlat and preliminary plan if the single office determines the application for the\npreliminary plan only has outstanding deficiencies that are of an administrative nature\nthat will not require significant changes to the layout or design of the subdivision.\n\n(2)\n\nPlat and subdivision construction plan if;\n\n(a)\n\nthe preliminary plan has been approved;\n\n(b)\n\nthe single office determines that the application for the plat only has outstanding\ndeficiencies are of an administrative nature that will not require significant changes\nto the layout or design of the subdivision; and\n\n(c)\n",
  "start_line": 83772,
  "end_line": 83876,
  "subsections": [
    "30-1-93-A",
    "30-1-93-B",
    "30-1-93-C",
    "30-1-93-D",
    "30-1-93-E",
    "30-1-93-A",
    "30-1-93-B",
    "30-1-93-C",
    "30-1-93-D",
    "30-1-93-E"
  ]
}