{
  "id": "30-2-159",
  "title": "PRIVATE STREETS",
  "level": 2,
  "parent_id": "chapter-30-2",
  "content": "Except as provided in Section 30-2-159 (Private Streets) and Subsection (B), each lot in a subdivision shall abut a dedicated public street.\n\n(B)\n\nThe platting board may approve a variance to the requirement of Subsection (A), including\napproval of a subdivision with private access easements, if development of the subdivision\nwith the variance places a minimal burden on the existing road infrastructure and\nall other requirements for a variance are met.\n\n(C)\n\nChapter 30-3, Article 3 (Access) governs access to a lot:\n\n(1)\n\non a roadway designated as a major arterial, freeway, parkway, expressway, or toll\nroad in the transportation plan; or\n\n(2)\n\non a hill country roadway.\n\nSource: City Code Section 25-4-171; County Code Section 82.202(d); Ord. 031211-11;\nOrd. 031211-42.\n\nA through lot in a single-family residential subdivision is permitted if access to\none of the abutting streets is prohibited. If one of the streets abutting a through\nlot is an arterial, access to the arterial is prohibited unless the single office\ndetermines that topography or property size justify access to the arterial.\n\nSource: City Code Section 25-4-172; County Code Section 82.202(m); Ord. 031211-11;\nOrd. 031211-42.\n\nThe side lines of lots must be approximately at right angles to straight street lines\nor radial to curved street lines. An arrangement placing adjacent lots at right angles\nto each other may be disallowed by the single office.\n\nSource: City Code Section 25-4-173; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nIn an area annexed by the city for limited purposes, the site development regulations\nfor the zoning district in which a lot is located determine minimum lot area and minimum\nlot width.\n\n(B)\n\nOutside a limited-purpose area, residential lot requirements are as follows:\n\n(1)\n\nminimum lot area is:\n\n(a)\n\nin a subdivision served by a public wastewater system or central wastewater disposal\nunit:\n\n(i)\n\n5,750 square feet; or\n\n(ii)\n\n6,900 square feet for a corner lot; or\n\n(b)\n\nin a subdivision with private on-site sewage facilities, as determined by the authorized\nagent in accordance with Texas Administrative Code Title 30, Chapter 285 (On-Site Sewage Facilities);\n\n(2)\n\nminimum lot width is:\n\n(a)\n\n50 feet for an interior lot;\n\n(b)\n\n60 feet for a corner lot; or\n\n(c)\n\n33 feet for a lot on a cul-de-sac or curved street; and\n\n(3)\n\nminimum lot frontage, including a flag lot, is:\n\n(a)\n\n15 feet; or\n\n(b)\n\nif a culvert is required for a driveway approach, 30 feet.\n\n(C)\n\nThe single office may reduce the minimum lot frontage prescribed by Subsection (B)\nif the single office determines that access to the lot is restricted to a joint use\ndriveway.\n\nSource: City Code Section 25-4-174; County Code Sections 82.202(o) and 82.302(d)(10);\nOrd. 031211-11; Ord. 031211-42.\n\n(A)\n\nA lot in a subdivision designed with streets without curb and gutter must be one-half\nacre or more in size and have 100 feet or more of street frontage.\n\n(B)\n\nLand designated in a preliminary plan as dedicated for open space or public right-of-way\nmay not be used to calculate a lot size for a lot described in Subsection (A).\n\nSource: City Code Section 25-6-204; County Code Section 82.302(d)(10); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nA flag lot may only be approved in accordance with the requirements of this subsection.\n\n(1)\n\nFlag lot designs may be used where no more than two dwelling units utilize a shared\ndriveway.\n\n(2)\n\nFor developments proposing more than two dwelling units, the single office may grant\na waiver to allow flag lots if:\n\n(a)\n\nthe single office finds that the subdivision:\n\n(i)\n\nhas provided accessibility for emergency responders and associated vehicular traffic;\n\n(ii)\n\nhas adequate room for required utilities;\n\n(iii)\n\nenhances environmental protection;\n\n(iv)\n\nis otherwise compatible with the surrounding neighborhood; and\n\n(b)\n\nthe applicant provides a copy of any existing private deed restrictions for informational\npurposes.\n\n(B)\n\nThe minimum width of a flag lot is:\n\n(1)\n\n20 feet; or\n\n(2)\n\n15 feet if:\n\n(a)\n\ntwo or more contiguous lots share a common driveway and sufficient area is available\noutside the drive on each lot for utility installation; or\n\n(b)\n\nthe applicant can demonstrate access through an alternative route.\n\n(C)\n\nFor a subdivision utilizing a flag lot design, any proposed driveways must be designed\nwith adequate space for all required utilities. A proposed driveway must also:\n\n(1)\n\ncomply with the Utilities Criteria Manual, if applicable; and\n\n(2)\n\ncomply with the Plumbing Code.\n\n(D)\n\nAll addresses utilizing a flag lot design must be displayed at their closest point\nof access to a public street for emergency responders.\n\nSource: Ord. No. 20230831-142, Pt. 34, 9-1-23.\n\n(A)\n\nA subdivision within 100 feet of a public water system must be connected to the public\nwater system. The director may waive this requirement.\n\n(B)\n\nIf a subdivision is to be served by a public water system:\n\n(1)\n\napproval of the water system plans by the director of the Water and Wastewater Utility\nis required;\n\n(2)\n\ninstallation of the water system must comply with the requirements of this title and\nthe Utilities Criteria Manual; and\n\n(3)\n\nwater lines to serve each lot must be installed before a lot may be occupied.\n\nSource: City Code Section 25-4-191; County Code Section 82.302(c)(12); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nA subdivision within 100 feet of a public wastewater system must be connected to the\npublic wastewater system. In the extraterritorial jurisdiction, the director may waive\nthis requirement. In the zoning jurisdiction, this requirement may be waived under\nCity Code Section 25-9-4 (Connection To Organized Wastewater System Required).\n\n(B)\n\nIf a subdivision is to be served by a public wastewater system or community disposal\nsystem, wastewater lines to serve each lot must be installed before a lot may be occupied.\n\nSource: City Code Section 25-4-192; County Code Section 82.203(b)(18); Ord. 031211-11;\nOrd. 031211-42.\n\nIf natural gas from a public utility is available within 2,000 feet of a subdivision,\nthe subdivider shall:\n\n(1)\n\nprepare plans for installation of natural gas lines to serve each lot and install\nthe portions of the lines that are under a street or alley; or\n\n(2)\n\nplace a note on the plat stating that natural gas lines have not been installed.\n\nSource: Section 25-4-193; County Code Section 82.204(e)(5); Ord. 031211-11; Ord. 031211-42.\n\nA subdivider shall arrange with the appropriate utility departments and utility companies\nfor the construction of water, wastewater, and gas utility lines unless the city manager\napproves the installation of utility lines by another entity.\n\nSource: City Code Section 25-4-194; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nTo have municipal water or wastewater service extended to land within the extraterritorial\njurisdiction, a landowner shall file with the director of the Water and Wastewater\nUtility a written request for:\n\n(1)\n\nextension of service; and\n\n(2)\n\nif the land is not covered by the utility's certificate of convenience and necessity,\nannexation by the City.\n\n(B)\n\nThe city may record an owner's request in the county deed records.\n\nSource: City Code Section 25-4-195; Ord. 031211-11; Ord. 031211-42; Ord. 20050929-077.\n\n(A)\n\nThis section applies to a subdivision that is to receive water or wastewater service\nfrom an entity other than the City's Water and Wastewater Utility.\n\n(B)\n\nA plat may not be approved unless the subdivider has complied with the requirements\nof this subsection.\n\n(1)\n\nThe subdivider shall provide the director with a copy of a contract between the subdivider\nand the utility service provider that provides for installing utility lines and furnishing\nadequate utility service.\n\n(2)\n\nWater or wastewater system plans must comply with the requirements of this title and\nthe Utilities Criteria Manual.\n\n(3)\n\nApproval of water or wastewater system plans by the director of the Water and Wastewater\nUtility and the Texas Commission on Environmental Quality is required.\n\n(C)\n\nApproval of the construction of water or wastewater facilities by the director of\nthe Water and Wastewater Utility is required. A city inspector may inspect the facilities\nduring construction. The director of the Water and Wastewater Utility may require\nthat the subdivider pay an inspection fee.\n\nSource: City Code Section 25-4-196; County Code Sections 82.203(b)(18) and 82.204(e)(3);\nOrd. 031211-11; Ord. 031211-42.\n\n(A)\n\nFor a subdivision that is not served by a water utility or sanitary sewer facility,\na plat may not be approved unless the subdivider has complied with the requirements\nof this section.\n\n(B)\n\nIf a subdivision is not to be served by a water utility, the subdivider shall provide\nthe platting official with evidence that a sufficient supply of water suitable for\nhuman consumption may be obtained from surface or subsurface sources in accordance\nwith this subsection.\n\n(1)\n\nIf surface water or a private water supply other than groundwater is proposed as a\nsource of water for the subdivision, the evidence must include the results of tests\nand statements from local and state health authorities, water engineers, and other\ncompetent authorities, and be in compliance with Texas Commission on Environmental\nQuality rules for public water supply.\n\n(2)\n\nIf groundwater is proposed as a source of water for the subdivision, the subdivider\nmust provide credible evidence that sufficient groundwater is available and will continue\nto be available to the subdivision, the subdivider must comply with the county's rules\nregarding the use of groundwater, and the evidence is subject to approval by the county's\nplatting official.\n\n(3)\n\nAny required plans and specification shall be prepared by a registered professional\nengineer and are subject to approval by the platting official.\n\n(C)\n\nIf a subdivision is not to be served by a sanitary sewer utility and the use of private\non-site sewage facilities has not been approved by the authorized agent in accordance\nwith Texas Administrative Code Title 30, Chapter 285 (On-Site Sewage Facilities), the subdivider shall construct a community sewage collection and treatment system\nthat serves each lot. The system must be designed and located in accordance with the\nregulations of the Texas Commission on Environmental Quality and the local health\nauthority. Approval by the platting official of the plans for the system is required.\n\nSource: City Code Section 25-4-197; County Code Section 82.204(c)(18) and (19); Ord.\n031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 35, 9-1-23.\n\nA subdivision that is to be served by private on-site sewage facilities must comply\nwith the requirements of the authorized agent adopted in accordance with Texas Administrative\nCode Title 30, Chapter 285 (On-Site Sewage Facilities). The authorized agent shall review a preliminary plan or plat and report its findings\nto the single office.\n\nSource: City Code Section 25-4-198; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA plat may not be approved unless the subdivider has complied with the requirements\nof this section, if applicable.\n\n(B)\n\nThis section applies to the residential portion of a subdivision in the service area\nof the city's electric utility department if the subdivision is located:\n\n(1)\n\nat least partially inside the city limits; or\n\n(2)\n\noutside the city limits, and the subdivider has requested annexation.\n\n(C)\n\nA subdivider shall pay street lighting charges to the electric utility department.\nThe director may waive this requirement if the director determines that street lighting\nis not necessary, the requirement imposes an unreasonable hardship on the applicant,\nor obtaining payment for street lighting is impractical.\n\n(D)\n\nThe city shall use a payment collected under this section to install street lights\nin the residential areas of the subdivision for which it was collected.\n\n(E)\n\nThe city shall refund a payment collected under this section to the subdivider if\nthe city does not install street lights within two years after the date the subdivider\nmakes the payment.\n\n(F)\n\nThis section does not require the city to install street lights in a subdivision that\nhas not been annexed.\n\nSource: City Code Section 25-4-199; Ord. 031211-11; Ord. 031211-42.\n\nIn this division:\n\n(1)\n\nDIRECTOR, when used without a qualifier, means:\n\n(a)\n\nif the city is the park service provider, the director of the city's Parks and Recreation\nDepartment; or\n\n(b)\n\nif the county is the park service provider, the county executive.\n\n(2)\n",
  "start_line": 88049,
  "end_line": 88480,
  "subsections": [
    "30-2-159-B",
    "30-2-159-C",
    "30-2-159-A",
    "30-2-159-B",
    "30-2-159-C",
    "30-2-159-A",
    "30-2-159-B",
    "30-2-159-A",
    "30-2-159-B",
    "30-2-159-C",
    "30-2-159-D",
    "30-2-159-A",
    "30-2-159-B",
    "30-2-159-A",
    "30-2-159-B",
    "30-2-159-A",
    "30-2-159-B",
    "30-2-159-A",
    "30-2-159-B",
    "30-2-159-C",
    "30-2-159-A",
    "30-2-159-B",
    "30-2-159-C",
    "30-2-159-A",
    "30-2-159-B",
    "30-2-159-C",
    "30-2-159-D",
    "30-2-159-E",
    "30-2-159-F"
  ]
}