{
  "id": "30-2-84",
  "title": "PLAT APPROVAL AUTHORITY AND CRITERIA",
  "level": 2,
  "parent_id": "chapter-30-2",
  "content": "or the council in accordance with Section 30-2-84 (Plat Approval Authority and Criteria).\n\n(C)\n\nThe county's final approval authority is exercised by the county executive or commissioners\ncourt in accordance with Section 30-2-84 (Plat Approval Authority and Criteria).\n\nSource: Local Government Code, City Code, County Code, City/County subdivision agreement;\nOrd. 031211-11; Ord. 031211-42; Ord. 20120524-130.\n\n(A)\n\nIn this section, \"discretionary authority\" means the authority to make a discretionary\ndetermination relating to a subdivision variance or waiver. The term excludes final\napproval of a preliminary plan or final plat.\n\n(B)\n\nThis section allocates discretionary authority between the city and county.\n\n(C)\n\nExcept as provided in Subsection (D), discretionary authority is exercised by the\nplatting board or the platting official.\n\n(1)\n\nThe platting board is:\n\n(a)\n\nfor the city, the land use commission; and\n\n(b)\n\nfor the county, the commissioners court.\n\n(2)\n\nThe platting official is:\n\n(a)\n\nfor the city, the director; and\n\n(b)\n\nfor the county, the county executive.\n\n(D)\n\nThe commissioners court may exercise authority allocated to the county's platting\nofficial.\n\n(E)\n\nExcept as provided in Subsections (G) and (H), the city has all discretionary authority\nin a near-term annexation area.\n\n(F)\n\nExcept as provided in Subsections (G) and (H), outside a near-term annexation area:\n\n(1)\n\nthe county has discretionary authority over issues relating to transportation, floodplain\nmanagement, or stormwater conveyance;\n\n(2)\n\nthe city has discretionary authority over issues relating to:\n\n(a)\n\nwater, wastewater, electric, and telecommunication utilities;\n\n(b)\n\nthe environment, including stormwater quality controls; or\n\n(c)\n\nAustin - Bergstrom International Airport; and\n\n(3)\n\nfor all other issues, the single office shall determine whether the city or the county\nhas discretionary authority.\n\n(G)\n\nIf a parcel of land is excepted or exempted from the city requirement to plat by Chapter 30-2, Article 1 (Subdivision Compliance) but is subject to the county requirement to plat, the county platting official and\ncounty platting board exercise all discretionary authority.\n\n(H)\n\nIf a parcel of land is excepted or exempted from the county requirement to plat by\nChapter 30-2, Article 1 (Subdivision Compliance) but is subject to the city requirement to plat, the city platting official and city\nplatting board exercise all discretionary authority.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130.\n\n(A)\n\nThe single office shall review and make decisions relating to subdivisions.\n\n(B)\n\nWhen this title prescribes a duty or power to be exercised by the single office, a\nconsensus of the single office staff shall exercise the duty or power.\n\n(C)\n\nIf the single office staff does not reach a consensus on an issue, the managing officials\nshall make a single determination and exercise the duty or power.\n\n(D)\n\nFor each subdivision application, the single office shall designate a staff person\nto serve as a single point of contact for the applicant and to assist the applicant\nin processing the application.\n\n(E)\n\nThe managing officials shall jointly designate from among their employees a manager\nof the single office who shall have authority and responsibility to oversee the coordinated\nreview of applications.\n\n(F)\n\nThis subsection divides responsibility for subdivision review between the city and\nthe county according to subject matter and geographic area. If a subdivision is located\nin more than one of the geographic areas described below, then the subdivision is\ncategorized according to the geographic area in which the largest part of the subdivision\nis located.\n\n(1)\n\nA case manager is provided by:\n\n(a)\n\nthe county in the portion of the desired development zone that is outside a near-term\nannexation area; or\n\n(b)\n\nthe city in the drinking water protection zone or a near-term annexation area.\n\n(2)\n\nTransportation matters are reviewed by:\n\n(a)\n\nthe county outside a near-term annexation area; or\n\n(b)\n\nthe city in a near-term annexation area.\n\n(3)\n\nDrainage matters for a subdivision that does not participate in regional stormwater\nmanagement are reviewed by:\n\n(a)\n\nthe county outside a near-term annexation area; or\n\n(b)\n\nthe city in a near-term annexation area.\n\n(4)\n\nDrainage matters for a subdivision that participates in regional stormwater management\nare reviewed by the city in all geographic areas.\n\n(5)\n\nEnvironmental and utility matters are reviewed by the city in all geographic areas.\n\n(6)\n\nInspection of infrastructure installation is performed by the city in all geographic\nareas.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42; Ord. 20050929-079;\nOrd. No. 20230831-142, Pt. 5, 9-1-23.\n\nA record owner or the record owner's agent may file an application for a permit or\napproval required by this title. The single office may require an applicant to provide\nevidence of the applicant's authority to file an application.\n\nSource: City Code Section 25-1-81; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA person who seeks to subdivide land, vacate a plat, or construct subdivision infrastructure\nmust file with the single office an application for approval of a:\n\n(1)\n\npreliminary plan;\n\n(2)\n\nfinal plat;\n\n(3)\n\namending plat;\n\n(4)\n\nreplat;\n\n(5)\n\nplat vacation; or\n\n(6)\n\nsubdivision construction plan.\n\n(B)\n\nThe city and county shall review and make a determination on each application in accordance\nwith this title.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may propose rules to be adopted by the city and county establishing\nthe requirements for an application, including timelines for completing staff review\nas well as when an application may be updated to meet the requirements of Title 30 and other applicable regulations. The rules adopted must be in accordance with the",
  "start_line": 84084,
  "end_line": 84321,
  "subsections": [
    "30-2-84-C",
    "30-2-84-A",
    "30-2-84-B",
    "30-2-84-C",
    "30-2-84-D",
    "30-2-84-E",
    "30-2-84-F",
    "30-2-84-G",
    "30-2-84-H",
    "30-2-84-A",
    "30-2-84-B",
    "30-2-84-C",
    "30-2-84-D",
    "30-2-84-E",
    "30-2-84-F",
    "30-2-84-A",
    "30-2-84-B",
    "30-2-84-A"
  ]
}