{
  "id": "30-2-33",
  "title": "SINGLE OFFICE ACTION WITHIN 30 DAYS",
  "level": 2,
  "parent_id": "chapter-30-2",
  "content": "timelines for action established within Section 30-2-33 (Single Office Action within 30 Days).\n\n(B)\n\nThe single office may permit an applicant to omit required information from an application\nthat the single office determines is not material to a decision on the application.\n\n(C)\n\nAn application for preliminary plan or plat expires 180 days after the application\nis filed unless the application has been approved.\n\n(D)\n\nAn application that has been disapproved with reasons may be updated to address those\nreasons until the application expires.\n\n(E)\n\nExcept as provided in Subsection (B), the single office shall consider an application\nfiled only if the applicant has paid the required fee and provided the information\nrequired by the single office consistent with state law.\n\n(1)\n\nThe applicant has 45 days to provide all the information required by the single office\nafter the application is submitted.\n\n(2)\n\nIf an application is rejected as incomplete, the single office shall provide the applicant\nwith a written explanation identifying the deficiencies and the information required\nto complete the application 10 working days after the application is received.\n\n(3)\n\nAn application expires if it is not complete on or before the 45-day after the application\nis submitted. An applicant may submit an update to provide additional information\nand to correct deficiencies at any time before the application expires.\n\nSource: City Code Section 25-1-82; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 41, 9-1-19; Ord. No. 20230831-142, Pt. 6, 9-1-23; Ord. No. 20240718-103, Pt. 1, 7-29-24.\n\n(A)\n\nIn this section:\n\n(1)\n\nCMSW means an area defined as a closed municipal solid waste landfill in Texas Administrative\nCode, Title 30, Section 330.951.\n\n(2)\n\nLANDFILL AREA means an area marked on a map created by the City and maintained in\nthe Watershed Protection and Development Review Department showing all known CMSWL\nand including property within:\n\n(a)\n\nthe known boundary of a CMSWL;\n\n(b)\n\n200 feet around the estimated boundary if the boundary is not known; or\n\n(c)\n\n1500 feet from the estimated center of the CMSWL if neither a known boundary nor an\nestimated boundary is known.\n\n(B)\n\nThis section applies to an application for approval that may permit the construction\nor alteration of a residential, commercial, or public enclosed structure that is designed\nfor use by humans and that is located on:\n\n(1)\n\na site over 1 acre in size; or\n\n(2)\n\na site located within a landfill area.\n\n(C)\n\nThe single office may not approve an application for subdivision unless the applicant\nhas delivered to the single office:\n\n(1)\n\ncertification from a licensed professional engineer that the site does not overlie\na CMSWL; or\n\n(2)\n\nif the site overlies a CMSWL:\n\n(a)\n\na development permit from the Texas Commission on Environmental Quality; or\n\n(b)\n\nwritten notification from the Texas Commission on Environmental Quality that a development\npermit is not required; or\n\n(3)\n\ncertification from a licensed professional engineer that the applicant will conduct\nsoil testing under the requirements of the Texas Commission on Environmental Quality\nduring construction of the foundation to determine whether the site overlies a CMSWL.\n\nSource: City Code Section 25-1-83; Ord. 031211-11; Ord. 031211-42; Ord. 20080925-138.\n\n(A)\n\nThe single office may establish regular cycles for consideration of applications by\ncity staff, boards, commissions, and the council. The managing officials shall advise\nthe council and commissioners court of the creation or change of a cycle.\n\n(B)\n\nAn established cycle supersedes conflicting requirements of this title applicable\nto the city, except those mandated by state law.\n\nSource: City Code Section 25-1-84; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may propose rules to be adopted by the city and county establishing\nthe requirements for a subdivision construction plan application, including timelines\nfor completing staff review as well as when an application may be updated to meet\nthe requirements of this title and other applicable regulations.\n\n(B)\n\nThe single office is authorized to certify a subdivision construction plan if it complies\nwith this subsection.\n\n(1)\n\nAn application is complete if the applicant has paid the required fee and provided\nthe information required to be included in the application no later than the 45th\nday after it was submitted. The single office may permit an applicant to omit required\ninformation from an application that the single office determines is not material\nto a decision on the application.\n\n(2)\n\nWhen the single office rejects an application as incomplete, the single office shall\nprovide the applicant with a written explanation that identifies the deficiencies\nand the information needed to complete the application. The single office must provide\nthe written explanation within 10 working days after receipt of the application.\n\n(3)\n\nAn application expires if it is not complete on or before the 45th day after the application\nis submitted. An applicant may submit an update to provide additional information\nand correct any deficiencies at any time before the 45th day.\n\n(4)\n\nA certification that the subdivision construction application is administratively\ncomplete is valid for 45 days after the certification has been issued.\n\n(C)\n\nThe single office is authorized to review the subdivision construction plan application\nif the applicant pays the required fee and the application has a valid certification\nof completion. If the application has not yet been certified, the certification is\nno longer valid, or the submitted subdivision construction plan does not match the\ncertified materials, the single office will not review the application but shall provide\nthe applicant with a written explanation identifying the deficiencies 10 working days\nafter the application is received.\n\n(D)\n\nAn application for subdivision construction plan expires one year after the application\nis accepted unless the application has been approved.\n\nSource: Ord. No. 20230831-142, Pt. 7, 9-1-23.\n\n**Editor's note—**\nOrd. No. 20230831-142, Pt. 7, effective September 1, 2023, repealed the former § 30-1-116, and enacted",
  "start_line": 84322,
  "end_line": 84506,
  "subsections": [
    "30-2-33-B",
    "30-2-33-C",
    "30-2-33-D",
    "30-2-33-E",
    "30-2-33-A",
    "30-2-33-B",
    "30-2-33-C",
    "30-2-33-A",
    "30-2-33-B",
    "30-2-33-A",
    "30-2-33-B",
    "30-2-33-C",
    "30-2-33-D"
  ]
}