{
  "id": "30-2-86",
  "title": "APPEAL OF DISAPPROVAL OF PLAT",
  "level": 2,
  "parent_id": "chapter-30-2",
  "content": "a new § 30-2-86 as set out herein. The former § 30-2-86 pertained to effect of preliminary\nplan expiration and derived from City Code Section 25-4-86; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA subdivision within the extraterritorial jurisdiction containing lots intended for\nresidential use must include a cover page containing:\n\n(1)\n\na location map for the subdivision;\n\n(2)\n\nthe name of the subdivision; and\n\n(3)\n\nthe following notice:\n\nCONSUMER PROTECTION NOTICE FOR HOMEBUYERS\n\nIF YOU ARE BUYING A LOT IN THIS SUBDIVISION, YOU SHOULD DETERMINE WHETHER THE SUBDIVISION\nAND THE LAND AROUND IT ARE INSIDE OR OUTSIDE THE CITY LIMITS.\n\nTHIS CAN AFFECT THE ENJOYMENT AND VALUE OF YOUR HOME. DEPENDING ON STATE LAW AND OTHER\nFACTORS, LAND OUTSIDE THE CITY LIMITS MAY BE SUBJECT TO FEWER LOCAL GOVERNMENT CONTROLS\nOVER THE DEVELOPMENT AND USE OF LAND THAN INSIDE THE CITY LIMITS.\n\nTHE SUBDIVISION'S RESTRICTIVE COVENANTS MAY CREATE PRIVATELY ENFORCEABLE RESTRICTIONS\nAGAINST INCOMPATIBLE LAND USES WITHIN THE SUBDIVISION, WHETHER IT IS INSIDE OR OUTSIDE\nTHE CITY LIMITS.\n\nDEPENDING ON STATE LAW AND OTHER FACTORS, HOWEVER, OUTSIDE THE CITY LIMITS NEITHER\nPRIVATE NOR GOVERNMENTAL RESTRICTIONS MAY BE AVAILABLE TO (1) RESTRICT EITHER THE\nNATURE OR EXTENT OF DEVELOPMENT NEAR THE SUBDIVISION, OR (2) PROHIBIT LAND USES NEAR\nTHE SUBDIVISION THAT ARE INCOMPATIBLE WITH A RESIDENTIAL NEIGHBORHOOD.\n\n(B)\n\nThe subdivision name and the consumer protection notice required by Subsection (A)\nof this section must be printed in bolded capital letters one-half inch high.\n\nSource: 20110623-132.\n\nThe single office shall approve a subdivision construction plan that complies with\nthe Comprehensive Plan and the requirements of this title.\n\nSource: Ord. No. 20230831-142, Pt. 29, 9-1-23.\n\n(A)\n\nThe single office shall grant or deny an application for a permit or approval required\nby this title within the timeframe established by state law.\n\n(B)\n\nNothing in this section limits any exceptions to the deadlines provided for in state\nlaw.\n\nSource: Ord. No. 20230831-142, Pt. 30, 9-1-23.\n\n**Editor's note—**\nOrd. No. 20230831-142, Pt. 30, effective September 1, 2023, repealed the former § 30-2-101, and enacted",
  "start_line": 87392,
  "end_line": 87455,
  "subsections": [
    "30-2-86-A",
    "30-2-86-B",
    "30-2-86-A",
    "30-2-86-B"
  ]
}