{
  "id": "30-2-62",
  "title": "APPEAL OF DISAPPROVAL OF A PRELIMINARY PLAN",
  "level": 2,
  "parent_id": "chapter-30-2",
  "content": "a new § 30-2-62 as set out herein. The former § 30-2-62 pertained to expiration of\napproved preliminary plan and derived from City Code Section 25-4-62 and City/County\nsubdivision agreement; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130.\n\nAn application for approval of a plat may include all or a portion of the land included\nin an approved preliminary plan.\n\nSource: City Code Section 25-4-81; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office shall promptly deliver a copy of an application for plat approval\nto each reviewing department or agency after the application has been filed.\n\n(B)\n\nAfter the application is filed, a reviewing department or agency shall prepare and\ndeliver to the single office a written report of comments and recommendations regarding\nan application for plat approval not later than the deadline established by the single\noffice by administrative rule.\n\n(C)\n\nAfter the application is filed, the single office shall determine whether an application\nfor plat approval complies with the criteria for approval and give notice under Section 30-1-154(B) (Notice of Applications and Administrative Decisions) of the determination not later than the deadline established by the single office\nby administrative rule.\n\n(D)\n\nAn applicant may file with the single office an update to an application for plat\napproval before the application expires under the expiration period established under\nSubsection (F).\n\n(E)\n\nAfter an update is filed, the single office shall determine whether an update to an\napplication for plat approval complies with the criteria for approval.\n\n(F)\n\nAn application:\n\n(1)\n\nExpires 180 days after the application is filed unless the application has been approved.\n\n(2)\n\nThat has been disapproved with stated reasons may be updated to address those reasons\nuntil the application expires.\n\nSource: City Code Section 25-4-82; Ord. 031211-11; Ord. 031211-42; Ord. No. 20160421-039, Pt. 21, 4-21-16; Ord. No. 20190822-117, § 57, 9-1-19; Ord. No. 20230831-142, Pt. 24, 9-1-23; Ord. No. 20240718-103, Pt. 8, 7-29-24.\n\nThe applicant must include the following note on the proposed plat: The owner of this\nsubdivision and the owner's successors and assigns are responsible for construction\nof subdivision improvements that comply with City of Austin and Travis County regulations.\nThe owner understands that plat vacation or replatting may be required, at the owner's\nexpense, if plans to construct this subdivision do not comply with the regulations.\nApproval of this subdivision does not guarantee future approval of variances to the\nCity of Austin and Travis County regulations that may be required at later stages\nof development.\n\nSource: City Code Section 25-4-83; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 58, 9-1-19; Ord. No. 20230831-142, Pt. 25, 9-1-23; Ord. No. 20240718-103, Pt. 9, 7-29-24.\n\n(A)\n\nThe director has approval authority for the City. The director shall approve a plat\nthat complies with the comprehensive plan and requirements of this title.\n\n(B)\n\nThe county executive has approval authority for the county. The county executive shall\napprove a plat that complies with the comprehensive plan and requirements of this\ntitle.\n\n(C)\n\nApproval of a plat is conditioned on the applicant's posting the fiscal security required\nby this title in the amount determined by the single office. After the single office\ncertifies on the plat that the applicant has posted the fiscal security:\n\n(1)\n\nfor a city approval:\n\n(a)\n\nthe presiding officer of the land use commission shall endorse the plat to certify\nthe land use commission's approval;\n\n(b)\n\nthe mayor shall endorse the plat to certify the council's approval; or\n\n(c)\n\nthe director shall endorse the plat to certify the director's approval; and\n\n(2)\n\nfor a county approval:\n\n(a)\n\nthe county executive shall endorse the plat to certify the county executive's approval;\nor\n\n(b)\n\nthe county clerk shall endorse the plat to certify the commissioners court approval.\n\n(D)\n\nApproval of a plat expires on the 90th day after the approval date if the single office\nhas not certified that the applicant has posted fiscal security.\n\nSource: City Code Section 25-4-84; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130;\nOrd. No. 20190822-117, § 59, 9-1-19; Ord. No. 20230831-142, Pt. 26, 9-1-23.\n\n(A)\n\nThe single office shall record an approved plat in each county where land included\nin the plat is located.\n\n(B)\n\nThe single office may not record a plat unless the city and each county have approved\nthe plat.\n\n(C)\n\nAn applicant must provide all of the items and fees required to record the plat with\nthe county clerk within 80 business days from the date of plat approval.\n\n(D)\n\nAn application for plat approval expires on the 81st business day after such approval\nunless Subsection (C) of this section is satisfied.\n\nSource: City Code Section 25-4-85; Ord. 031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 27, 9-1-23.\n\n(A)\n\nAn applicant can appeal the director's disapproval of a plat application to the land\nuse commission or council.\n\n(B)\n\nAn applicant can appeal the county executive's disapproval of a plat application to\ncommissioners court.\n\n(C)\n\nThe single office shall give notice under Section 30-1-153(A) (Notice of Public Hearing) of the land use commission's, council's, or commissioners court's consideration\nof an appeal.\n\n(D)\n\nAn applicant must receive approval from both the city and county in accordance with\nSection 30-1-91(A) (Final Approval).\n\nSource: Ord. No. 20230831-142, Pt. 28, 9-1-23; Ord. No. 20240718-103, Pt. 10, 7-29-24.\n\n**Editor's note—**\nOrd. No. 20230831-142, Pt. 28, effective September 1, 2023, repealed the former § 30-2-86, and enacted",
  "start_line": 87227,
  "end_line": 87391,
  "subsections": [
    "30-2-62-A",
    "30-2-62-B",
    "30-2-62-C",
    "30-2-62-D",
    "30-2-62-E",
    "30-2-62-F",
    "30-2-62-A",
    "30-2-62-B",
    "30-2-62-C",
    "30-2-62-D",
    "30-2-62-A",
    "30-2-62-B",
    "30-2-62-C",
    "30-2-62-D",
    "30-2-62-A",
    "30-2-62-B",
    "30-2-62-C",
    "30-2-62-D"
  ]
}