{
  "id": "30-2-212",
  "title": "PARK SERVICE PROVIDER DETERMINATION",
  "level": 2,
  "parent_id": "chapter-30-2",
  "content": "PARK SERVICE PROVIDER means the city or the county, as determined by Section 30-2-212 (Park Service Provider Determination).\n\nSource: City/County subdivision agreement; County Code Section 82.208; Ord. 031211-11;\nOrd. 031211-42; Ord. 20120524-130.\n\n(A)\n\nA determination of whether the city or the county is the park service provider is\nbased on the earlier of:\n\n(1)\n\nthe date an application for preliminary plan approval is filed; or\n\n(2)\n\nthe date an application for final plat approval is filed.\n\n(B)\n\nThe governmental body that has a park nearest to the proposed subdivision is the park\nservice provider, unless the managing officials agree otherwise.\n\nSource: City/County subdivision agreement; County Code Section 82.208; Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nThe parkland dedication requirements of this division apply to all residential subdivisions,\nexcept as provided in Subsection (B).\n\n(B)\n\nThe following are exempt from the requirements of this part:\n\n(1)\n\na plat with not more than four single-family lots that may be approved without a preliminary\nplan;\n\n(2)\n\na resubdivision of land that does not increase the number of dwelling units;\n\n(3)\n\na subdivision for which a preliminary plan was approved after June 30, 1984 and before\nJuly 8, 1985; and\n\n(4)\n\nif the city is the park service provider, a subdivision of land within a municipal\nutility district that has a consent agreement and land use plan approved by the city\nthat provides for the dedication of parkland or recreational facilities or the payment\nof fees instead of dedication of the parkland or facilities.\n\nSource: City Code Section 25-4-211; County Code Section 82.208; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nA subdivider of a residential subdivision shall provide for the parkland needs of\nthe residents by the dedication of suitable land for park and recreational purposes\nunder this division.\n\n(B)\n\nThe area to be dedicated must be shown on the preliminary plan and the plat and included\nin the dedication statement. The subdivider shall dedicate to the park service provider\nall parkland required by this division when a plat is approved.\n\n(C)\n\nThe amount of parkland required to be dedicated by the subdivider to the park service\nprovider is five acres for every 1,000 residents, as determined by the following formula:\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/30-2-214-C.png)\n\n(D)\n\nIn calculating the amount of parkland to be dedicated under this section, the number\nof residents in each dwelling unit is based on density as follows:\n\n| Dwelling Units Per Acre | Residents In Each Dwelling Unit |\n| --- | --- |\n| Not more than 6 | 2.8 |\n| Dwelling Units Per Acre | Residents In Each Dwelling Unit |\n| More than 6 and not more than 12 | 2.2 |\n| More than 12 | 1.7 |\n\n(E)\n\nIn calculating the amount of parkland to be dedicated under this section, density\nfor a multifamily subdivision is assumed to be the highest permitted in the zoning\ndistrict, or if the property is not zoned, 24 dwelling units per acre. The subdivider\nmay reduce the assumed density by restricting density in a restrictive covenant enforceable\nby the park service provider and approved by the park service provider's attorney.\n\nSource: City Code Section 25-4-212; County Code Section 82.208; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nLand to be dedicated as parkland must comply with the standards in the Administrative\nCriteria Manual and this section, and if the city is the park service provider, the\ncomprehensive plan and the Park And Recreation Action Plan.\n\n(B)\n\nThe director shall determine whether land offered for dedication complies with the\nstandards for dedication.\n\n(C)\n\nFifty percent of acreage in the 100-year floodplain that is dedicated as parkland\nmay be credited toward fulfilling the requirements of this part if the adjoining land\nwithin the 25-year floodplain, if any, is also dedicated as parkland. The land within\nthe 25-year floodplain may not be credited toward fulfilling the requirements of this\npart.\n\n(D)\n\nLand identified on the Critical Areas Map maintained by the Watershed Protection and\nDevelopment Review Department that does not otherwise comply with the standards for\nparkland dedication may be accepted as dedicated parkland if the director determines\nthat the land will provide recreational or educational opportunities for the surrounding\ncommunity. In this event, 50 percent of the acreage may be credited toward fulfilling\nthe requirements of this part.\n\nSource: City Code Section 25-4-213; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe director may allow up to a 50 percent credit toward fulfilling the requirements\nof this part for privately owned and maintained park and recreational facilities that\nare for use by the residents of a subdivision.\n\n(B)\n\nIf the city is the park service provider, the director may allow up to a 100 percent\ncredit toward fulfilling the requirements of this part for private parkland in a subdivision\nlocated outside the city limits, if the subdivider agrees to dedicate the private\nparkland to the city when the city annexes the subdivision for all purposes.\n\n(C)\n\nPrivate parkland excludes yards, setback areas, and open spaces required by this title.\n\nSource: City Code Section 25-4-214; County Code Section 82.208; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nThe director may require a subdivider to deposit with the park service provider a\ncash payment or fiscal security instead of the dedication of parkland if:\n\n(1)\n\nless than six acres is required to be dedicated; or\n\n(2)\n\nthe land available for dedication does not comply with the standards for dedication.\n\n(B)\n\nA deposit is calculated by multiplying the number of acres of parkland required to\nbe dedicated by the average value of an acre of land in the subdivision. The average\nvalue of an acre of land in the subdivision is calculated by dividing the fair market\nvalue of the land in the subdivision by the number of acres in the subdivision. To\nmake this calculation, the subdivider may select one of the following fair market\nvalue determinations:\n\n(1)\n\nthe current fair market value of the land as shown on the records of the tax appraisal\ndistrict;\n\n(2)\n\nthe current fair market value of the land as determined by a qualified real estate\nappraiser at the subdivider's expense, if the director approves the appraiser and\ncertifies that the appraisal fairly reflects the land value; or\n\n(3)\n\nthe current fair market value of the land as determined by a qualified real estate\nappraiser employed by the park service provider.\n\n(C)\n\nA deposit must be placed in the park service provider's park improvement fund. The\ndeposit must be used for the acquisition or improvement of parks that will benefit\nthe residents of the subdivision and that are located in the service area defined\nby the park service provider.\n\n(D)\n\nThe park service provider shall expend a deposit within five years from the date it\nis received. This period is extended by five years if, at the expiration of the initial\nfive year period, less than 50 percent of the residential units in the subdivision\nhave been constructed.\n\n(E)\n\nIf the park service provider does not expend a deposit by the deadline described in\nSubsection (D), and the actual number of residential units constructed is less than\nthe number assumed at the time the deposit was calculated, the owner may request a\nrefund. The request must be in writing and filed with the director not later than\n180 days after the expiration of the time period described in Subsection (D). A refund\nis calculated by multiplying the percentage of the reduction in the number of residential\nunits times the amount of the deposit. A refund may not exceed the unexpended amount\nof a deposit.\n\nSource: City Code Section 25-4-215; County Code Section 82.208; Ord. 031211-11; Ord.\n031211-42.\n\nThe single office may request that the subdivider provide information relating to\nproposed parkland to determine whether the proposed parkland complies with this division.\n\nSource: City Code Section 25-4-216; County Code Section 82.208; Ord. 031211-11; Ord.\n031211-42; Ord. No. 20230831-142, Pt. 36, 9-1-23.\n\n(A)\n\nThis section applies to a subdivision with townhouse lots.\n\n(B)\n\nCommon areas must be identified on the plat. An applicant shall provide for maintenance\nof and payment of taxes on common areas.\n\n(C)\n\nBefore an application proposing townhouse lots can be approved, an applicant shall\nsubmit to the single office a legal opinion that describes the rights and duties of\nthe owners, the legal status of common areas and facilities, and the provisions for\ntaxation and maintenance of the common areas.\n\n(D)\n\nAn applicant shall submit to the single office a site plan showing the locations and\ndimensions of buildings, accessory uses, and other improvements.\n\nSource: City Code Section 25-4-231; Ord. 031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 37, 9-1-23.\n\n(A)\n\nThis section applies to a subdivision with small lots.\n\n(B)\n\nA small lot subdivision may not be approved unless service is available to each lot\nin the subdivision from public water and centralized sewer systems.\n\n(C)\n\nA small lot subdivision must comply with the following requirements:\n\n(1)\n\nMinimum lot area is:\n\n(a)\n\n3,600 square feet, except for a corner lot; and\n\n(b)\n\n4,500 square feet for a corner lot.\n\n(2)\n\nMinimum lot width is:\n\n(a)\n\n40 feet for an interior lot;\n\n(b)\n\n50 feet for a corner lot; and\n\n(c)\n\n40 feet for a lot on a cul-de-sac or curved street, except it may be 33 feet at the\nfront lot line.\n\n(3)\n\nMinimum front yard setback is 20 feet.\n\n(4)\n\nMinimum street side yard setback is ten feet.\n\n(5)\n\nA lot may have one zero lot line.\n\n(6)\n\nThe combined side yard setbacks of a lot may be not less than ten feet.\n\n(7)\n\nExcept for a patio or patio cover, the minimum distance between structures on adjoining\nlots is ten feet. The minimum distance between a patio or patio cover and the roof\nline of a structure on an adjoining lot is six feet.\n\n(8)\n\nThe wall of a structure built adjacent to a zero lot line or within five feet of a\ncommon side lot line must be solid and opaque and may not contain an opening.\n\n(9)\n\nMinimum rear yard setback is five feet, excluding drainage easements.\n\n(10)\n\nMinimum setback is ten feet between a rear access easement and a building or fence.\n\n(11)\n\nMaximum building coverage is 45 percent.\n\n(12)\n\nMaximum impervious cover is 55 percent.\n\n(13)\n\nMaximum building height is 35 feet.\n\n(14)\n\nA lot may have not more than one dwelling unit.\n\n(15)\n\nTwo off-street parking spaces, are required for each dwelling unit.\n\n(16)\n\nA maintenance easement is required in the dominant side yard of a lot.\n\n(17)\n\nA use easement is required in the subordinate side yard of a lot.\n\n(18)\n\nA lot that is less than 50 feet wide and that fronts on a collector street must have\na private access easement along the rear property line.\n\n(19)\n\nMinimum pavement width of a private access easement is 25 feet. In the extraterritorial\njurisdiction, the minimum pavement width is 25 feet or the width required by the county,\nwhichever is greater.\n\n(20)\n\nA lot may not front on an arterial street.\n\n(21)\n\nUnderground utility service to all lots is required.\n\n(22)\n\nMaintenance of a common area or access easement is the responsibility of the adjoining\nproperty owner or the homeowners' association, in accordance with the required declaration\nof covenants, easements, and restrictions.\n\n(D)\n\nThe single office may not record a plat of a small lot subdivision unless a declaration\nof covenants, easements, and restrictions or similar document has been approved by\nthe city attorney, recorded, and referenced on the plat. The document must contain\nthe following:\n\n(1)\n\na statement that the subdivision is developed under this section and incorporating\nthe requirements of this section by reference;\n\n(2)\n\na description of the requirements of Subsections (C)(1) through (14) and an imposition\nof those requirements as a restriction running with the land; and\n\n(3)\n\na restriction of the use of the property to:\n\n(a)\n\none-family dwellings except mobile homes;\n\n(b)\n\naccessory uses permitted in an SF-3 district;\n\n(c)\n\nparks, playgrounds, open space, and common areas providing recreational amenities\nto the subdivision; and\n\n(d)\n\ngrowing agricultural crops;\n\n(4)\n\nprovisions for the maintenance easements and use easements required by this section;\nand\n\n(5)\n\nprovisions obligating the adjoining property owner or the homeowners' association\nto maintain common areas and access easements.\n\nSource: City Code Section 25-4-232; County Code Section 82.202(o); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nThis section applies to a subdivision with single-family attached residential lots.\n\n(B)\n\nA subdivision with single-family attached residential lots is permitted on:\n\n(1)\n\nunplatted land;\n\n(2)\n\na platted duplex lot that is vacant; or\n\n(3)\n\na platted lot developed with a duplex on or before March 1, 1987, if the duplex complies\nwith current regulations.\n\n(C)\n\nSingle-family attached residential lots may be created only in multiples of two lots\nper site, and each lot must be served by public water and sewage systems.\n\n(D)\n\nA lot may be subject to, or benefited by, private utility easements.\n\n(E)\n\nA lot must comply with the following requirements:\n\n(1)\n\nMinimum site area is 7,000 square feet.\n\n(2)\n\nMinimum lot area is 3,000 square feet.\n\n(3)\n\nMinimum lot width is:\n\n(a)\n\n25 feet, except for a lot on a cul-de-sac or curved street; and\n\n(b)\n\n20 feet on a cul-de-sac or curved street.\n\n(4)\n\nA lot may have not more than one dwelling unit.\n\n(5)\n\nMaximum height is 35 feet.\n\n(6)\n\nMinimum front yard setback is 25 feet.\n\n(7)\n\nMinimum street side yard setback is 15 feet.\n\n(8)\n\nMinimum interior side yard setback is five feet, except between attached units.\n\n(9)\n\nMinimum rear yard setback is 10 feet.\n\n(10)\n\nMaximum building coverage is 40 percent.\n\n(11)\n\nMaximum impervious coverage is 45 percent.\n\n(12)\n\nAt least two off-street parking spaces are required for a dwelling. The driveway may\ncount as one of the spaces.\n\n(F)\n\nA plat of a single family attached subdivision may not be recorded unless a declaration\nof covenants, easements, and restrictions or similar document has been approved by\nthe city attorney, recorded, and referenced on the plat. The document must:\n\n(1)\n\nrequire that development and use of the lots comply with this title;\n\n(2)\n\nrequire that construction of a dwelling unit comply with City Code Chapter 25-12, Article 1 (Uniform Building Code), Article 4 (Electrical Code), Article 5 (Uniform Mechanical Code), Article 6 (Uniform Plumbing Code), and Article 7 (Uniform Fire Code).\n\n(G)\n\nThis subsection applies to the sale of a single-family attached residential lot.\n\n(1)\n\nA seller shall deliver to the purchaser:\n\n(a)\n\na copy of the document described in Subsection (F); and\n\n(b)\n\na notice stating that the property will be conveyed under the terms of the document,\nand that the purchaser is advised to consult an attorney concerning the purchaser's\nrights and obligations under the document.\n\n(2)\n\nA purchaser may terminate the sale contract without penalty:\n\n(a)\n\nwithin five days of the purchaser's receipt of the document and notice under Subsection\n(G)(1); or\n\n(b)\n\nat any time before closing, if the seller does not deliver the document and notice.\n\nSource: City Code Section 25-4-233; Ord. 031211-11; Ord. 031211-42.\n\n## CHAPTER 30-3. - TRANSPORTATION.\n\nThis article applies to land for which an owner files an application for preliminary\nplan or final plat approval.\n\nSource: City Code Section 25-6-21; Ord. 031211-11; Ord. 031211-42.\n\nThe provisions of this article relating to the reservation of right-of-way and waiver\nof reservation of right-of-way requirements do not preclude the city or county from\nestablishing a building line on a right-of-way under state law.\n\nSource: City Code Section 25-6-22; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe city and county reserve right-of-way along a roadway designated:\n\n(1)\n\nin the transportation plan;\n\n(2)\n\nin the collector plan approved in accordance with Section 30-3-73 (Collector street plan); or\n\n(3)\n\nin an established city or county capital improvement project.\n\n(B)\n\nThe extent and location of the right-of-way reserved under Subsection (A) must conform\nto the transportation plan, approved collector plan, or capital improvement project.\n\nSource: City Code Section 25-6-51; County Code Section 82.202(f)(3); Ord. 031211-11;\nOrd. 031211-42.\n",
  "start_line": 88481,
  "end_line": 89082,
  "subsections": [
    "30-2-212-A",
    "30-2-212-B",
    "30-2-212-A",
    "30-2-212-B",
    "30-2-212-A",
    "30-2-212-B",
    "30-2-212-C",
    "30-2-212-D",
    "30-2-212-E",
    "30-2-212-A",
    "30-2-212-B",
    "30-2-212-C",
    "30-2-212-D",
    "30-2-212-A",
    "30-2-212-B",
    "30-2-212-C",
    "30-2-212-A",
    "30-2-212-B",
    "30-2-212-C",
    "30-2-212-D",
    "30-2-212-E",
    "30-2-212-A",
    "30-2-212-B",
    "30-2-212-C",
    "30-2-212-D",
    "30-2-212-A",
    "30-2-212-B",
    "30-2-212-C",
    "30-2-212-D",
    "30-2-212-A",
    "30-2-212-B",
    "30-2-212-C",
    "30-2-212-D",
    "30-2-212-E",
    "30-2-212-F",
    "30-2-212-G",
    "30-2-212-A",
    "30-2-212-B"
  ]
}