{
  "id": "30-2-102",
  "title": "UPDATES PERMITTED AFTER APPLICATION IS DENIED",
  "level": 2,
  "parent_id": "chapter-30-2",
  "content": "a new ยง 30-2-102 as set out herein. The former ยง 30-2-102 pertained to expiration\nof subdivision construction and derived from City Code Section 25-4-102; Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nConstruction management for a subdivision is governed by Chapter 30-1, Article 10 (Subdivision Construction).\n\n(B)\n\nIssuance of a certificate of compliance for a subdivision is governed by Chapter 30-1, Article 11 (Certificates Of Compliance).\n\nSource: City Code Section 25-4-103; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may release a subdivision construction plan if:\n\n(1)\n\nthe single office approves the subdivision construction plan; and\n\n(2)\n\nthe applicant posts the required fiscal security with the single office.\n\n(B)\n\nThe single office's release of a subdivision construction plan authorizes the applicant\nto begin development in accordance with the plan.\n\nSource: Ord. No. 20230831-142, Pt. 32, 9-1-23.\n\n(A)\n\nA subdivision construction plan expires three years after the date of its approval\nunless:\n\n(1)\n\nthe land use commission and the commissioners court both approve a later expiration\ndate when they approve the plat;\n\n(2)\n\nbefore the plan expires, site work is commenced and diligently pursued to completion;\nor\n\n(3)\n\nthe single office extends the expiration date under Subsection (B).\n\n(B)\n\nAn applicant may request that the single office extend the expiration date of a subdivision\nconstruction plan by filing a written request and justification with the single office\nbefore the expiration date.\n\n(1)\n\nThe single office may extend the expiration date of the plan once for a period of\none year if the single office determines:\n\n(a)\n\nthere is good cause for the extension;\n\n(b)\n\nthere has not been a significant change in development conditions affecting the plan;\nand\n\n(c)\n\nthe plan continues to comply with the criteria for its approval and release.\n\n(2)\n\nAn applicant may appeal the single office's decision under this subsection to the\nland use commission and the commissioners court.\n\n(3)\n\nThe single office shall give notice under Section 30-1-153(A) (Notice of Public Hearing) of the land use commission's consideration of an appeal.\n\n(4)\n\nThe land use commission and the commissioners court shall each conduct a public hearing\non an appeal before taking action.\n\n(5)\n\nAn appeal may be granted only by joint action of the land use commission and the commissioners\ncourt.\n\n(C)\n\nIf the land use commission and the commissioners court approve different expiration\ndates, the earlier date controls.\n\nSource: Ord. No. 20230831-142, Pt. 33, 9-1-23.\n\n(A)\n\nA surveyor shall mark each boundary corner, intermediate property corner, curve point,\nand angle point of a subdivision with a permanent marker identified in the most recent\nedition of the Manual of Practice for Land Surveying in Texas, published by the Texas\nSociety of Professional Surveyors.\n\n(B)\n\nOne boundary corner shall be marked with a concrete monument, unless a concrete monument\nexists on an adjacent platted subdivision within 1,300 feet of the proposed plat.\n\n(C)\n\nPermanent markers along boundary lines may be spaced not more than 1,300 feet apart.\n\n(D)\n\nIf a subdivision includes or is bounded by a 100-year floodplain or newly dedicated\nstreet, a permanent benchmark is required.\n\nSource: City Code Section 25-4-131; County Code Section 82.204(c)(16) and (17); Ord.\n031211-11; Ord. 031211-42.\n\n(A)\n\nEasements for public utilities and drainage ways shall be retained in all subdivisions\nin the widths and locations determined necessary by the single office. All easements\nshall be dedicated to public use for the named purpose and shall be aligned to minimize\nconstruction and future maintenance costs.\n\n(B)\n\nOff-street loading and unloading facilities shall be provided on all commercial and\nindustrial lots. The subdivider shall note this requirement on a preliminary plan\nand a plat.\n\n(C)\n\nA private alley is permitted if a plat note provides for alley maintenance by the\nadjoining property owners or a property owners association.\n\n(1)\n\nExcept as provided in Paragraph (2), the minimum alley width is 30 feet, and the minimum\npavement width is 20 feet.\n\n(2)\n\nFor a residential alley, the minimum alley width is 20 feet, and the minimum pavement\nwidth is 15 feet.\n\nSource: City Code Section 25-4-132; County Code Section 82.202(p); Ord. 031211-11;\nOrd. 031211-42; Ord. 20131017-046.\n\nIf the single office determines that easements in areas adjoining a proposed subdivision\nare necessary to provide adequate drainage or utility service, the subdivider shall\nobtain the easements or make arrangements with the city or county, as appropriate,\nto obtain them.\n\nSource: City Code Section 25-4-133; County Code Section 82.202(i); Ord. 031211-11;\nOrd. 031211-42.\n\nStreets of a new subdivision shall be aligned with existing streets on adjoining property\nunless the platting board determines that topography, requirements of traffic circulation,\nthe comprehensive plan in a near-term annexation area, or other considerations make\nit desirable to vary the alignment.\n\nSource: City Code Section 25-4-151; County Code Section 82.202(b); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nA street may terminate in a cul-de-sac if the single office determines that the most\ndesirable plan requires laying out a dead-end street.\n\n(B)\n\nA platting board variance is required for a dead-end street more than 2,000 feet long.\n\n(C)\n\nThe platting official may approve a deviation from the cul-de-sac design described\nin the Transportation Criteria Manual if the platting official determines that topography,\ndensity, adequate traffic circulation, or unusual conditions necessitate a different\ndesign.\n\n(D)\n\nThis subsection applies to a dead-end street that terminates at the boundary of an\nundeveloped property with an established right of access across the property being\nsubdivided. The boundary line must form a chord in the cul-de-sac that is equal in\nlength to the right of way width.\n\nSource: City Code Section 25-4-152; County Code Section 82.202(j); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nA block may not exceed 1,200 feet in length, except as provided in this section.\n\n(B)\n\nA residential block that is parallel and adjacent to an arterial street may be up\nto 1,500 feet in length.\n\n(C)\n\nA commercial or industrial block may be up to 2,000 feet in length if the single office\ndetermines that there is adequate traffic circulation and utility service.\n\n(D)\n\nThe single office may approve a longer block length if the single office determines\nthat the proposed block length adequately meets the requirements of traffic circulation,\nutility service, topography, and the comprehensive plan in a near-term annexation\narea.\n\n(E)\n\nAn applicant may appeal a single office determination under Subsection (C) or (D)\nto the platting board.\n\nSource: City Code Section 25-4-153; County Code Section 82.202(l); Ord. 031211-11;\nOrd. 031211-42.\n\nA street or street intersection, whether public or private, shall be designed and\nconstructed in accordance with the Transportation Criteria Manual.\n\nSource: City Code Section 25-4-154; County Code Section 82.302(a); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nNew streets in subdivisions shall be named to provide continuity of name with existing\nstreets and to prevent conflict with identical or similarly spelled or pronounced\nnames in other parts of the planning jurisdiction.\n\n(B)\n\nAn applicant may suggest a street name. Approval of a street name by the city's 911\ncomputer mapping division is required before a final plat may be approved.\n\nSource: City Code Section 25-4-155; County Code Section 82.303(a); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nThe location of a street sign is determined by the most recent version of the Texas\nManual On Uniform Control Devices.\n\n(B)\n\nThe subdivider shall provide street name signs for street intersections with traffic\nsignals.\n\n(C)\n\nThe subdivider shall provide and install pole mounted street name signs at street\nintersections without traffic signals.\n\nSource: City Code Section 25-4-156; County Code Section 82.303; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nBefore a plat may be approved, a subdivider shall submit to the single office a traffic\ncontrol plan for the installation of traffic control signs and devices, pavement striping,\nand pavement markers. Approval of the traffic control plan by the single office is\nrequired.\n\n(B)\n\nA subdivider is responsible for installing a traffic control feature described in\nthe traffic control plan. The fabrication and installation of a traffic control feature\nmust be in accordance with the Texas Manual of Uniform Traffic Control Devices.\n\nSource: County Code Section 82.303; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nIn this section:\n\n(1)\n\nACCESS STREET means a street that provides access to a subdivision by connecting to\nan external street.\n\n(2)\n\nEXTERNAL STREET means a street that is outside the boundaries of a subdivision, and\nthat is:\n\n(a)\n\na publicly maintained street;\n\n(b)\n\na street that is offered for dedication and for which a construction performance bond\nis posted pending acceptance of the dedication; or\n\n(c)\n\na private street that complies with the requirements of this title and each applicable\ncriteria manual.\n\n(B)\n\nExcept as otherwise provided in this section:\n\n(1)\n\na new subdivision must have at least two access streets; and\n\n(2)\n\neach of the two access streets must connect to a different external street.\n\n(C)\n\nA new subdivision may have one access street if the single office determines that:\n\n(1)\n\nthe access street:\n\n(a)\n\ndoes not cross an area with a high wildland fire protection rating, as determined\nin accordance with the National Fire Protection Association Bulletin 299, \"Protection\nof Life and Property from Wildfire\", published in 1992;\n\n(b)\n\nis not inundated by more than nine inches of water by a 100-year flood, as determined\nin accordance with the Drainage Criteria Manual; and\n\n(c)\n\nhas a paved width of at least 36 feet from the intersection of the access street with\nthe external street for a distance of:\n\n(i)\n\n100 feet; or\n\n(ii)\n\n50 feet if the access street has curb and gutter; and\n\n(2)\n\nthe access street:\n\n(a)\n\nis not more than 2,000 feet in length, and provides access to not more than 30 single-family\nresidential dwellings; or\n\n(b)\n\nis an arterial or collector street, and its intersection with the external street\nwill function at a level of service of \"C\" or better during construction and after\nbuild-out of the subdivision, as determined by an intersection analysis that is:\n\n(i)\n\napproved by the platting official; and\n\n(ii)\n\nif the subdivision generates more than 1,000 vehicle trips a day, prepared by a registered\nprofessional engineer in accordance with the Transportation Criteria Manual or Transportation\nResearch Board Special Report 209, \"Highway Capacity Manual\", published in 1994.\n\n(D)\n\nA new subdivision may have one access street if the single office determines that\nproviding more than one access street is undesirable, unnecessary, or impractical\nafter considering:\n\n(1)\n\ntraffic circulation;\n\n(2)\n\ntraffic safety;\n\n(3)\n\nflood and fire safety;\n\n(4)\n\ntopography;\n\n(5)\n\nthe density of the subdivision and surrounding developed property;\n\n(6)\n\nwhether later development of adjacent property is anticipated to provide additional\naccess;\n\n(7)\n\nwhether traffic through the subdivision should be limited;\n\n(8)\n\nthe environmental effect of a cut or fill, waterway crossing, or other surface disturbance\nnecessary to provide more than one access street;\n\n(9)\n\nwhether the access street is a divided street;\n\n(10)\n\nwhether adverse effects, if any, from permitting one access street are mitigated,\nincluding whether secondary pedestrian access is provided; and\n\n(11)\n\nwhether the subdivider:\n\n(a)\n\nowns adjacent property through which access can be provided;\n\n(b)\n\nhas the right to provide a second access street across another person's property;\nor\n\n(c)\n\nis able to develop the subdivision if more than one access street is required.\n\nSource: City Code Section 25-4-157; County Code Section 82.202(c); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nThe platting board may approve a variance allowing a private street in a subdivision\nif the requirements of this section are met.\n\n(B)\n\nIn this section, the meaning of \"adjacent property\" is limited to a property that\nis adjacent to the proposed subdivision and that has an established right of access\nthrough a proposed private street.\n\n(C)\n\nWritten approval of the owner of adjacent property is required to establish a private\nstreet.\n\n(D)\n\nIf the only access to adjacent property is through a proposed private street:\n\n(1)\n\nthe owner of the proposed subdivision must prepare and file in the county's official\npublic records a joint access agreement that allows unrestricted access through the\nprivate street to the adjacent property; and\n\n(2)\n\nthe owner of the adjacent property must prepare and file in the county's official\npublic records a joint access agreement that requires private streets and street maintenance\nwhen the adjacent property is developed.\n\n(E)\n\nA property owners association must be responsible for maintenance of the private street.\n\n(F)\n\nThe subdivider must obtain the approval of the single office of the following documents\nrelating to the property owners association:\n\n(1)\n\ncovenants, conditions, and restrictions that provide for ownership, maintenance, fee\nassessment, and association dues; and\n\n(2)\n\nbylaws that provide for membership and voting rights.\n\n(G)\n\nA private street must have a direct connection to a dedicated public street or another\napproved private street.\n\n(H)\n\nA private street may not be the only connection between two public streets.\n\n(I)\n\nThe subdivider must identify a private street on the plat as a separate access, drainage,\nand public utility easement and as a separate lot.\n\n(J)\n\nThe subdivider must install standard street names at each intersection.\n\n(K)\n\nThe subdivider must post a sign indicating \"private street\" at each intersection of\na private street with a public street.\n\n(L)\n\nIf the subdivider proposes use of a security gate:\n\n(1)\n\nthe gate must be at least 40 feet from the right-of-way of the nearest intersecting\nstreet; and\n\n(2)\n\nthe subdivider must:\n\n(a)\n\nprovide the single office with plans showing the location of the gate; and\n\n(b)\n\nobtain approval of the gate design from the city, county, emergency service provider,\nand other governmental entity with jurisdiction, if any.\n\n(M)\n\nThe subdivider must place the following notes on the plat:\n\nAll private streets shown on this plat [list street names] and any security gates\nor devices controlling access to the streets will be owned and maintained by the property\nowners association of this subdivision.\n\nThe undersigned owner subdivides [number] acres of land out of the [number] acre tract\nin accordance with this plat, to be known as \"[subdivision name]\" subdivision, subject\nto the covenants and restrictions shown on this plat, and dedicates to the owners\nof the lots in the subdivision, public utilities serving the subdivision, emergency\nservices providers with jurisdiction, and public service agencies, the use of all\nthe private street and other easements shown on this plat, subject to any easements\nor restrictions previously granted and not released. The maintenance of and payment\nof real property taxes on the private streets are the responsibility of the owner\nof the subdivision or property owners association under that certain instrument of\nrecord under Document Number [number], of the Official Public Records of Travis County,\nTexas. An express easement is granted across the private streets and any common areas\nfor the use of all governmental functions, vehicular and nonvehicular, including fire\nand police protection, solid and other waste material pickup, and any other purpose\na governmental entity deems necessary. Owner agrees that all governmental entities\nand their agents and employees are not responsible or liable for any damage occurring\nto the surface of the private street or any common area as a result of use by governmental\nvehicles.\n\nSource: County Code Section 82.206; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n",
  "start_line": 87477,
  "end_line": 88048,
  "subsections": [
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-C",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-C",
    "30-2-102-D",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-C",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-C",
    "30-2-102-D",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-C",
    "30-2-102-D",
    "30-2-102-E",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-C",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-C",
    "30-2-102-D",
    "30-2-102-A",
    "30-2-102-B",
    "30-2-102-C",
    "30-2-102-D",
    "30-2-102-E",
    "30-2-102-F",
    "30-2-102-G",
    "30-2-102-H",
    "30-2-102-I",
    "30-2-102-J",
    "30-2-102-K",
    "30-2-102-L",
    "30-2-102-M",
    "30-2-102-A"
  ]
}