{
  "id": "30-3-21",
  "title": "RESERVATION OF RIGHT-OF-WAY",
  "level": 2,
  "parent_id": "chapter-30-3",
  "content": "031211-11; Ord. 031211-42.\n\n(A)\n\nIf the single office determines that all or a portion of a right-of-way is needed\nto accommodate the estimated traffic generated by a proposed development, the applicant\nmay be required to dedicate:\n\n(1)\n\nan amount of land not to exceed 150 feet for a roadway that is subject to reservation\nof right-of-way under Section 30-3-21 (Reservation Of Right-Of-Way) and that is internal to a proposed subdivision or development\nproject; or\n\n(2)\n\nan amount of land not to exceed 50 percent of the total right-of-way requirement for\nan existing or proposed roadway that:\n\n(a)\n\nis subject to reservation of right-of-way under Section 30-3-21 (Reservation Of Right-Of-Way); and\n\n(b)\n\nadjoins a proposed subdivision or development project.\n\n(B)\n\nAn applicant may not be required to dedicate more than 75 feet of land under Subsection\n(A)(2).\n\n(C)\n\nThe single office may require the dedication of right-of-way in an amount greater\nthan established in Subsection (A):\n\n(1)\n\nfor a street that is not subject to reserved right-of-way and that does not comply\nwith the standards in the Transportation Criteria Manual; or\n\n(2)\n\nif the additional right-of-way is necessary to accommodate traffic generated by the\nproposed development.\n\n(D)\n\nThe single office may defer the dedication of right-of-way required at one stage of\nthe development process to a later stage. A person must comply with all dedication\nrequirements before the release of the subsequent application.\n\n(E)\n\nIn addition to the dedication of right-of-way, the single office may require the applicant\nto construct a roadway improvement or may assess a fee instead of requiring construction\nof a roadway improvement to offset the traffic effects generated by the proposed development.\n\n(F)\n\nNotwithstanding the other requirements of this section, roadway improvements are required\nonly to a degree that is roughly proportional to the nature and extent of the impact\nof the proposed development. To the extent that the full amount of right-of-way specified\nin this section is not required to be dedicated, the right-of-way is reserved and\nsubject to Section 30-3-22 (Constructing A Structure Or Improvement In Right-Of-Way Prohibited).\n\nSource: City Code Section 25-6-55; County Code Section 82.202(f) - (g); Ord. 031211-11;",
  "start_line": 89145,
  "end_line": 89212,
  "subsections": []
}