{
  "id": "30-3-42",
  "title": "NOTICE OF WAIVER REQUEST",
  "level": 2,
  "parent_id": "chapter-30-3",
  "content": "Not later than the 90th day after the certification under Section 30-3-42 (Notice Of Waiver Request), the county executive, or in a near-term annexation area\nthe city manager, shall determine whether the city or county, as applicable, is able\nto acquire the reserved right-of-way that is the subject of a waiver request.\n\n(B)\n\nIf the city or county is not able acquire the property single office shall:\n\n(1)\n\nrelease the application from the requirement to comply with the requirements of this\narticle; or\n\n(2)\n\nif no application has been filed, grant the waiver request for the period of time\nthat the city or county, as applicable, is unable to acquire the reserved right-of-way.\n\n(C)\n\nIf the city or county is able acquire the reserved right-of-way, the single office\nshall deny the waiver. The single office may not approve the development application\nfor a period not to exceed six months, pending acquisition of the property. If the\ncity or county has not acquired the property during the six month period, the single\noffice shall continue to process the application.\n\nSource: City Code Section 25-6-83; County Code Section 82.202(f)(4)(B); Ord. 031211-11;\nOrd. 031211-42; Ord. 20060504-039; Ord. 20120524-130.\n\nAn applicant may appeal the single office's denial of a waiver request to the council\nor commissioners court, as appropriate.\n\nSource: City Code Section 25-6-84 ; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nAn applicant may amend a development application to exclude an improvement from a\nreserved right-of-way.\n\n(B)\n\nIf an applicant amends an application to exclude an improvement from a reserved right-of-way,\nthe city or county may discontinue procedures to acquire the reserved right-of-way.\n\nSource: City Code Section 25-6-85 ; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n",
  "start_line": 89337,
  "end_line": 89384,
  "subsections": [
    "30-3-42-B",
    "30-3-42-C",
    "30-3-42-A",
    "30-3-42-B",
    "30-3-42-A"
  ]
}