{
  "id": "chapter-30-4",
  "title": "DRAINAGE",
  "level": 1,
  "parent_id": null,
  "content": "## CHAPTER 30-4. - DRAINAGE.\n\nIn this chapter:\n\n(1)\n\nADVERSE FLOODING IMPACT means an increase in flood risk or hazards.\n\n(2)\n\nDEVELOPMENT APPLICATION means an application required under Title 25 for development, such as an application for subdivision, site plan, or building permit.\n\n(3)\n\nDIRECTOR, when used without a qualifier, means the director of the Watershed Protection\nDepartment, or the director's designee.\n\n(4)\n\nDRAINAGE EASEMENT means an easement or right-of-way for a drainage facility required\nby Section 25-7-152 (Dedication of Easements and Rights-of-Way).\n\n(5)\n\nEROSION HAZARD ZONE means an area where future stream channel erosion is predicted\nto result in damage to or loss of property, buildings, infrastructure, utilities,\nor other valued resources.\n\n(6)\n\nFEMA means the Federal Emergency Management Agency.\n\n(7)\n\nFEMA FLOODPLAIN means a special flood hazard area delineated on a flood insurance\nrate map.\n\n(8)\n\nFLOOD INSURANCE RATE MAP means an official map of a community on which FEMA has delineated\nboth the areas of special flood hazards and the risk premium zones applicable to the\ncommunity.\n\n(9)\n\nATLAS 14 means the National Oceanic and Atmospheric Administration's Precipitation-Frequency\nAtlas 14 of the United States, Volume 11, Version 2.0: Texas.\n\n(10)\n\n100-YEAR FLOODPLAIN means an area within a floodplain subject to a one percent or\ngreater chance of flooding in any year as calculated in accordance with Section 30-4-5 (Determination of the 100-Year Floodplain).\n\n(11)\n\n25-YEAR FLOODPLAIN means an area within a floodplain subject to a four percent or\ngreater chance of flooding in any year as calculated in accordance with Section 30-4-6 (Determination of the 25-Year Floodplain).\n\n(12)\n\nWATERWAY means a watercourse, drainage way, branch, creek, or stream including, but\nnot limited to, the limits of the 100-year and 25-year floodplains.\n\nSource: Ord. 20131017-046; Ord. No. 20191114-064, Pts. 27, 28, 11-25-19.\n\nUnless authorized by a subdivision construction plan approved under County Code Chapter\n64 (Regulations for Flood Management and Guidelines for Development Permits), or a development application approved under City Code Title 25, a person may not place, or cause to be placed, an obstruction in a waterway.\n\nSource: Ord. 20131017-046.\n\nThe person in control of real property traversed by a waterway shall keep the waterway\nfree from an obstruction that is not authorized by a development application approved\nunder Title 25 or County Code Chapter 64.\n\nSource: Ord. 20131017-046.\n\nA pool of standing water in a waterway that is caused by an unauthorized obstruction\nin the waterway is declared to be a nuisance.\n\nSource: Ord. 20131017-046.\n\nFor purposes of this chapter, the 100-year floodplain shall be:\n\n(A)\n\nFor areas amended to incorporate Atlas 14 data, the 100-year floodplain calculated\nunder fully developed conditions as prescribed by the Drainage Criteria Manual as\namended to incorporate Atlas 14 data;\n\n(B)\n\nFor areas not yet amended to incorporate Atlas 14 data, the 500-year floodplain either\nas depicted on the FEMA Flood Insurance Rate Map as of January 6, 2016, as subsequently\nrevised, or as calculated under existing conditions as prescribed by the Drainage\nCriteria Manual using data predating Atlas 14; or\n\n(C)\n\nFor the Colorado River, the 100-year floodplain as depicted on the FEMA Flood Insurance\nRate Map dates January 6, 2016, or as subsequently revised.\n\nSource: Ord. No. 20191114-064, Pt. 30, 11-25-19.\n\nFor purposes of this chapter, the 25-year floodplain shall be:\n\n(A)\n\nFor areas amended to incorporate Atlas 14 data, the 25-year floodplain calculated\nunder fully developed conditions as prescribed by the Drainage Criteria Manual as\namended to incorporate Atlas 14 data;\n\n(B)\n\nFor area not yet amended to consider Atlas 14 data, the 100-year floodplain calculated\nunder fully developed conditions as prescribed by the Drainage Criteria Manual using\ndata predating Atlas 14; or\n\n(C)\n\nFor the Colorado River, the 25-year floodplain as calculated under existing conditions\nas prescribed by the Drainage Criteria Manual using data predating Atlas 14.\n\nSource: Ord. No. 20191114-064, Pt. 30, 11-25-19.\n\n(A)\n\nExcept as provided in Subsection (B), stormwater runoff shall be computed on the basis\nof a fully developed contributing drainage area or watershed as determined under the\nDrainage Criteria Manual.\n\n(B)\n\nWhen determining the runoff generated from the 500-year flood for the purpose of determining\nthe 100-year floodplain under Subsection (B) of Section 30-4-5 (Determination of the 100-Year Floodplain), stormwater runoff shall be computed on the basis of an existing developed contributing\ndrainage area or watershed.\n\nSource: Ord. 20131017-046; Ord. No. 20191114-064, Pt. 29, 11-25-19.\n\n(A)\n\nFor a preliminary plan or plat application to demonstrate that the proposed development\nwould not result in an adverse impact to adjacent properties, the single office may\nrequire the owner of real property to provide, at the owner's expense, a drainage\nstudy for the total area to be developed to demonstrate compliance with applicable\ndrainage regulations.\n\n(B)\n\nFor subdivision construction plans, the single office may require the owner of real\nproperty to provide, at the owner's expense and as a condition for development application\napproval, a drainage study for the total area to be ultimately developed.\n\n(C)\n\nThe drainage study must be in accordance with the Drainage Criteria Manual.\n\n(D)\n\nIf a drainage study is required under this section, the single office may not accept\nfor review a development application for any portion of the proposed development until\nthe single office has received the required drainage study.\n\nSource: Ord. 20131017-046; Ord. No. 20230831-142, Pt. 39, 9-1-23.\n\n(A)\n\nFor a preliminary plan or plat application to demonstrate that the proposed development\ndoes not create negative erosion impacts, the owner of real property may provide,\nat the owner's expense, an erosion hazard zone analysis if:\n\n(1)\n\nwithin 100 feet of the centerline of a waterway with a drainage area of 64 acres or\ngreater;\n\n(2)\n\nwithin 100 feet of the ordinary high-water mark of the Colorado River downstream from\nLonghorn Dam, as defined by Code of Federal Regulations Title 33, Section 328.3 (Definitions); or\n\n(3)\n\nlocated where significant erosion is present.\n\n(B)\n\nFor subdivision construction plan applications, the single office may require the\nowner of real property to provide, at the owner's expense and as a condition for development\napplication approval, an analysis to establish the erosion hazard zone if the proposed\ndevelopment is:\n\n(1)\n\nwithin 100 feet of the centerline of a waterway with a drainage area of 64 acres or\ngreater;\n\n(2)\n\nwithin 100 feet of the ordinary high water mark of the Colorado River downstream from\nLonghorn Dam, as defined by Code of Federal Regulations Title 33, Section 328.3 (Definitions); or\n\n(3)\n\nlocated where significant erosion is present.\n\n(C)\n\nThe erosion hazard zone analysis must be in accordance with the Drainage Criteria\nManual.\n\n(D)\n\nIf an erosion hazard zone analysis is required under this section, the single office\nmay not accept for review a development application for any portion of the proposed\ndevelopment until the single office has received the required erosion hazard zone\nanalysis.\n\nSource: Ord. 20131017-046; Ord. No. 20170615-102, Pt. 34, 6-15-17; Ord. No. 20230831-142, Pt. 40, 9-1-23.\n\n(A)\n\nThe director shall designate and maintain official floodplain maps.\n\n(B)\n\nIf an official floodplain map is not delineated, the owner of property to be developed\nshall calculate the boundaries of the 100-year floodplain in accordance with the Drainage\nCriteria Manual and submit the calculation to the single office for approval.\n\n(C)\n\nIf the single office determines that FEMA regulations require a submission to the\nagency of a request for a flood insurance rate map revision, the single office may\nrequire that the revision request to FEMA be submitted by the owner of property to\nbe developed.\n\n(D)\n\nA person who files a development application shall depict, as applicable:\n\n(1)\n\non a preliminary plan or subdivision construction plan:\n\n(a)\n\na 100-year floodplain;\n\n(b)\n\na FEMA floodplain; and\n\n(c)\n\na drainage easement or proposed drainage easement;\n\n(2)\n\non a final plat:\n\n(a)\n\na drainage easement; and\n\n(b)\n\na portion of a FEMA floodplain that is outside a drainage easement.\n\n(E)\n\nIf a portion of a FEMA floodplain is outside a drainage easement, the owner of property\nto be developed shall, on a final plat:\n\n(1)\n\nidentify the portion of the FEMA floodplain that is outside the drainage easement,\nincluding the community and panel number of the flood insurance rate map; and\n\n(2)\n\ninclude a note that:\n\n(a)\n\nrefers the reader to federal and local regulations governing development in a FEMA\nfloodplain;\n\n(b)\n\nstates that flood insurance may be required; and\n\n(c)\n\ndescribes efforts to revise the flood insurance rate map.\n\nSource: Ord. 20131017-046.\n\n(A)\n\nA development application may not be approved unless:\n\n(1)\n\nthe proposed development application demonstrates sufficient capacity for the design\nflood, as determined under the Drainage Criteria Manual;\n\n(2)\n\neach proposed improvement is sufficiently strong to resist:\n\n(a)\n\nexternal pressure caused by earth or building; and\n\n(b)\n\ninternal pressure or abrasion caused by water or debris;\n\n(3)\n\nthe proposed grades will not permit water to gather in a pool that may become stagnant,\nexcluding variable pools in creek beds as a result of natural channel design;\n\n(4)\n\ntemporary and permanent measures to control erosion are sufficient to minimize siltation\nof the waterway, as determined under the Environmental Criteria Manual; and\n\n(5)\n\nthe proposed development:\n\n(a)\n\nwill not result in additional adverse flooding impact on other property;\n\n(b)\n\nexcept as provided by Subsection (B), to the greatest extent feasible preserves the\nnatural and traditional character of the land and the waterway located within the\n100-year floodplain;\n\n(c)\n\nexcept as provided by Subsection (C), includes on-site control of the two-year peak\nflow, as determined under the Drainage Criteria Manual and the Environmental Criteria\nManual;\n\n(d)\n\nwill not result in additional erosion impacts on other property; and\n\n(e)\n\nlocates all proposed improvements outside the erosion hazard zone, unless protective\nworks are provided as prescribed in the Drainage Criteria Manual.\n\n(B)\n\nA development application that proposes floodplain modification shall comply with\nSection 30-5-364 (Floodplain Modification).\n\n(C)\n\nA proposed development may provide off-site control of the two-year peak flow if the\noff-site control does not cause:\n\n(1)\n\nan adverse water quality impact from increased in-stream peak flow; or\n\n(2)\n\nstreambank erosion.\n\nSource: Ord. 20131017-046.\n\n(A)\n\nThe single office may not approve a preliminary plan, plat, or subdivision application\nif the application proposes an alteration or improvement of a bed or bank of a waterway\nunless the plan or specification is accompanied by a certificate bearing the seal\nof a Texas professional engineer certifying that:\n\n(1)\n\nthe hydraulic and structural design is adequate; and\n\n(2)\n\nthe proposed alteration or improvement complies with the ordinances of the city and\ncounty, the Drainage Criteria Manual, and the laws of this state.\n\n(B)\n\nSubsection (A) does not prohibit the single office from accepting a plan or specification\nfor a minor alteration or improvement that, in the judgment of the single office,\ndoes not require certification by a Texas professional engineer.\n\nSource: Ord. 20131017-046; Ord. No. 20230831-142, Pt. 41, 9-1-23.\n\nIf a development application requires the completion or partial completion of a drainage\nimprovement before a building may be constructed on a lot, a building permit, certificate\nof compliance, or development permit may not be issued for the lot unless the single\noffice approves the issuance.\n\nSource: Ord. 20131017-046.\n\nThe design and construction of a drainage facility or improvement must:\n\n(1)\n\nbe in accordance with the Drainage Criteria Manual; and\n\n(2)\n\nprovide for maintenance and protection from erosion in accordance with the Environmental\nCriteria Manual.\n\nSource: Ord. 20131017-046.\n\n(A)\n\nThe single office must approve the plans and specifications for a storm drain, bridge,\nor culvert.\n\n(B)\n\nThe county's Transportation and Natural Resources Department or the City Manager may\ninspect the construction of each storm drain, bridge, or culvert.\n\nSource: Ord. 20131017-046.\n\n(A)\n\nThe owner or developer of property to be developed is responsible for the conveyance\nof all stormwater flowing through the property, including stormwater that:\n\n(1)\n\nis directed to the property by other developed property; or\n\n(2)\n\nnaturally flows through the property because of the topography.\n\n(B)\n\nFuture upstream development shall be accounted for as determined under the Drainage\nCriteria Manual.\n\n(C)\n\nIf the construction or improvement of a storm drainage facility is required along\na property line that is common to more than one property owner, the owner proposing\nto develop the property is, at the time the property is developed, responsible for\neach required facility on either side of the common property line.\n\n(D)\n\nThe responsibility of the owner proposing to develop the property includes the responsibility\nto dedicate or obtain the dedication of any right-of-way or easement necessary to\naccommodate the required construction or improvement of the storm drainage facility.\n\n(E)\n\nIf an owner of property proposes to develop only a portion of that property, a stormwater\ndrainage facility to serve that portion of the property proposed for immediate development\nor use is required, unless the platting official determines that construction or improvement\nof a drainage facility outside that portion of the property to be developed is essential\nto the development or use of the property to be developed.\n\n(F)\n\nThe owner or developer shall provide adequate off-site drainage improvements to accommodate\nthe full effects of the development. The city or county may assist the owner or developer\nin the acquisition of an interest in property necessary to provide an off-site improvement,\nif the owner or developer:\n\n(1)\n\nby affidavit, certifies that a bona fide attempt to provide the off-site drainage\nimprovements has not been successful; and\n\n(2)\n\nprovides an adequate guarantee that the owner or developer will:\n\n(a)\n\nfinance the entire cost of acquiring the necessary property interest; and\n\n(b)\n\nretain full responsibility for construction of the required off-site improvement.\n\nSource: Ord. 20131017-046.\n\n(A)\n\nThe owner of real property proposed to be developed shall dedicate to the public an\neasement or right-of way for a drainage facility, open or enclosed, and stormwater\nflow to the limits of the 100-year floodplain, as prescribed in the Drainage Criteria\nManual.\n\n(B)\n\nAn easement or right-of-way required by Subsection (A) must be of sufficient width\nto provide continuous access for the operation, maintenance, or repair of a drainage\nfacility as prescribed in the Drainage Criteria Manual.\n\n(C)\n\nThe owner of the property shall dedicate any additional easement or right-of-way that\nis necessary to allow continuous access for the operation, maintenance, or rehabilitation\nof a drainage facility.\n\n(D)\n\nA part of a lot or tract of land that is located in an easement or right-of-way required\nby this section may be included as part of the area of the lot or tract of land in\nthe calculation of density or impervious cover.\n\nSource: Ord. 20131017-046.\n\n(A)\n\nIn this section:\n\n(1)\n\nCOMMERCIAL DEVELOPMENT means all development other than Residential Development.\n\n(2)\n\nCOMMERCIAL BASIN means a required detention basin or appurtenance that receives stormwater\nrunoff from a Commercial Development.\n\n(3)\n\nDCM STANDARDS means the provisions in the Drainage Criteria Manual regarding maintenance\nof a required detention basin or appurtenance.\n\n(4)\n\nRESIDENTIAL DEVELOPMENT means development of two dwelling units or less per lot.\n\n(5)\n\nRESIDENTIAL BASIN means a required detention basin or appurtenance that receives stormwater\nrunoff from a Residential Development.\n\n(B)\n\nThe record owner of a commercial development shall maintain the commercial basin serving\nthe commercial development in accordance with the DCM standards, whether or not the\ncommercial basin is located on the same property as the commercial development. The\nrecord owner shall provide the City proof of the right to access and maintain the\ncommercial basin if it is not located on the same property as the commercial development.\n\n(C)\n\nIf more than one commercial development is served by a single commercial basin, the\nrecord owners of the commercial basin and all commercial developments served by the\ncommercial basin shall be jointly and severally responsible for maintenance of the\ncommercial basin in accordance with the DCM standards.\n\n(D)\n\nAlternative maintenance arrangements are authorized as follows:\n\n(1)\n\nThe director may authorize an alternative arrangement for maintenance of a commercial\nbasin in accordance with the DCM standards. If an alternative arrangement is approved\nby the director, the City Attorney shall determine whether an agreement is necessary;\nthe agreement must be approved by the City Attorney and filed of record.\n\n(2)\n\nThe executive manager of the Travis County Transportation and Natural Resources Department\nmay authorize an alternative arrangement for maintenance of a residential basin in\naccordance with the DCM standards. If an alternative arrangement is approved by the\nexecutive manager, the county attorney shall determine whether an agreement is necessary;\nthe agreement must be approved by the county attorney and filed of record.\n\n(E)\n\nThe City shall inspect each commercial basin that is not a subsurface basin at least\nonce every three years to ensure that the commercial basin is being maintained in\naccordance with the DCM standards, but will not inspect basins maintained by the County\nunder Subsection (H). If the commercial basin fails inspection requiring an additional\ninspection, the director may charge a re-inspection fee.\n\n(F)\n\nThe record owner of a subsurface commercial basin must provide the Watershed Protection\nDepartment with a maintenance plan and an annual report from a registered engineer\nverifying that the basin is in proper operating condition.\n\n(G)\n\nThe record owner of a residential development shall maintain the residential basin\nserving the residential development in accordance with the DCM standards, whether\nor not the residential basin is located on the same property as the residential development.\nThe record owner may assign maintenance responsibility to a duly established Homeowner's\nAssociation upon written approval by the executive manager of the Travis County Transportation\nand Natural Resources Department. The record owner of a subsurface residential basin\nmust provide the Travis County Transportation and Natural Resources Department with\na maintenance plan and an annual report from a registered engineer verifying that\nthe basin is in proper operating condition.\n\n(H)\n\nThe county shall maintain a detention basin or appurtenance that is an integral part\nof a county road.\n\n(I)\n\nSection 30-5-231 (Water Quality Control Maintenance and Inspection) provides for maintenance of water quality controls.\n\nSource: Ord. 20131017-046.\n",
  "start_line": 89877,
  "end_line": 90499,
  "subsections": []
}