{
  "id": "chapter-30-1",
  "title": "GENERAL PROVISIONS AND PROCEDURES",
  "level": 1,
  "parent_id": null,
  "content": "## CHAPTER 30-1. - GENERAL PROVISIONS AND PROCEDURES.\n\nThis title applies to the subdivision of land in the portion of the City of Austin's\nextraterritorial jurisdiction that is within Travis County, including the areas that\nthe city has annexed for limited purposes.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nRequirements of this title are cumulative of requirements that are imposed by other\nordinances, rules, or regulations, or by private easements, covenants, restrictions,\nor agreements. If a conflict occurs, the requirements of this title control.\n\n(B)\n\nIf there is a difference of meaning or implication between the text of a provision\nof this title and an illustration or table, the text controls.\n\nSource: City Code Section 25-1-3; County Code Section 82.101; Ord. 031211-11; Ord.\n031211-42.\n\nUnless a different definition is expressly provided, in this title:\n\n(1)\n\nAGRICULTURAL OPERATIONS means:\n\n(a)\n\nproducing crops for human food, animal feed, planting seed, or fiber;\n\n(b)\n\nfloriculture, viticulture, horticulture, or silviculture;\n\n(c)\n\nraising or keeping livestock or poultry;\n\n(d)\n\nwildlife management; and\n\n(e)\n\nplanting cover crops or leaving land idle for the purpose of participating in any\ngovernmental program or normal crop or livestock rotation procedure.\n\n(2)\n\nAPPROVAL means:\n\n(a)\n\na final decision granting or approving an application; or\n\n(b)\n\nan approval granted subject to modifications or conditions.\n\n(3)\n\nATTACHED, when used with reference to two or more buildings, means having one or more\ncommon walls or being joined by a covered porch, loggia, or passageway.\n\n(4)\n\nBLOCK means one or more lots, tracts, or parcels of land bounded by streets, railroads,\nor subdivision boundary lines.\n\n(5)\n\nBUILDING COVERAGE means the area of a lot covered by buildings or roofed areas, but\nexcludes ground level paving, landscaping, open recreational facilities, incidental\nprojecting eaves, balconies, and similar features.\n\n(6)\n\nBUILDING LINE means a line beyond which a building must be set back from the street\nline.\n\n(7)\n\nCENTRAL DISPATCHER means a person designated by the single office to perform the tasks\nprovided in Section 30-1-352 (Inspection Requests).\n\n(8)\n\nCITY means the City of Austin, Texas.\n\n(9)\n\nCITY COUNCIL or COUNCIL means the city council of Austin, Texas.\n\n(10)\n\nCOLLECTOR STREET means a street collecting traffic from other streets and serving\nas the most direct route to a thoroughfare.\n\n(11)\n\nCOMMISSIONERS COURT means the commissioners court of Travis County, Texas.\n\n(12)\n\nCOMMON AREA means an area held, designed, or designated for the common use of the\nowners or occupants of a townhouse project, planned unit development, apartment, condominium,\nmobile home park, or subdivision.\n\n(13)\n\nCOMMON SIDE LOT LINE means a side lot line between two or more lots.\n\n(14)\n\nCOMPREHENSIVE PLAN means the plan adopted by the city council in accordance with Article\nX, Section 5 (The Comprehensive Plan), of the City Charter.\n\n(15)\n\nCONDEMNATION includes a purchase or donation of property under the threat of condemnation,\nbut excludes a dedication of property as a condition of zoning, subdivision, site\nplan, or building permit approval.\n\n(16)\n\nCONTRACTOR means a person employed by an owner to develop property.\n\n(17)\n\nCORNER LOT means a lot located at the intersection of two streets, or of two segments\nof a curved street, forming an angle of not more than 135 degrees.\n\n(18)\n\nCOUNTY means Travis County, Texas.\n\n(19)\n\nCURB means a structure located along the edge of a roadway, normally constructed integrally\nwith the gutter, that strengthens and protects the pavement edge and clearly defines\nthe pavement edge.\n\n(20)\n\nDENIAL means a final decision denying an application.\n\n(21)\n\nDESIRED DEVELOPMENT ZONE means the area not within the drinking water protection zone.\n\n(22)\n\nDEVELOPMENT means the construction or reconstruction of a building or road; the placement\nof a structure on land; the excavation, mining, dredging, grading, or filling of land;\nthe removal of vegetation from land; or the deposit of refuse or waste on land. Development\ndoes not include:\n\n(a)\n\nlawn and yard care, including mowing, gardening, tree care, and maintenance of landscaped\nareas;\n\n(b)\n\nremoval of trees or vegetation damaged by natural forces;\n\n(c)\n\nremoval of vegetation or cultivating the soil for agricultural operations, unless\nprohibited by Subsection 30-5-321(B) (Clearing of Vegetation); or\n\n(d)\n\nthe repair, maintenance, or installation of a utility, drainage or street system that\ndoes not disturb land or increase impervious cover.\n\n(23)\n\nDIRECTOR, when used without a qualifier, means the director of the city's Watershed\nProtection And Development Review Department.\n\n(24)\n\nDOMINANT SIDE YARD, when used in reference to a small lot, means the side yard having\nthe larger width.\n\n(25)\n\nDRINKING WATER PROTECTION ZONE means the areas within the Barton Springs Zone, the\nBarton Creek watershed, all water supply rural watersheds, and all water supply suburban\nwatersheds, as described in Section 30-5-2 (Descriptions Of Regulated Areas), that are in the planning jurisdiction.\n\n(26)\n\nDRIVEWAY means a surfaced area providing vehicular access between a street and an\noff-street parking or loading area.\n\n(27)\n\nDRIVEWAY APPROACH means an area between the roadway and private property designed\nfor and intended to provide vehicular access from the roadway to private property.\n\n(28)\n\nDWELLING UNIT means a residential unit other than a mobile home providing complete,\nindependent living facilities including permanent provisions for living, sleeping,\neating, and cooking.\n\n(29)\n\nEXECUTIVE MANAGER means the executive manager of the county's Transportation and Natural\nResources Department.\n\n(30)\n\nFINAL PLAT or PLAT means a map or drawing of a subdivision that is intended for recordation\nin the official public records of the county after approval by the land use commission,\nthe city council, or the commissioners court, as applicable.\n\n(31)\n\nFLAG LOT means a lot that abuts a street by means of a strip of land that does not\ncomply with the requirements of this chapter for minimum lot width, is not less than\n15 feet wide, and is used for access.\n\n(32)\n\nFRONT LOT LINE means:\n\n(a)\n\nfor an interior lot, the lot line abutting the street;\n\n(b)\n\nfor a corner lot, the lot line designated as the front lot line by a subdivision or\nparcel map, or, if none, the shorter lot line abutting a street;\n\n(c)\n\nfor a through lot, the lot line abutting the street that provides the primary access\nto the lot; and\n\n(d)\n\nfor a flag lot, the lot line designated as the front lot line by a subdivision or\nparcel map, or if none, the line determined by the single office to be the front lot\nline.\n\n(33)\n\nFRONT YARD means a yard extending the full width of a lot between the front lot line\nand the front setback line.\n\n(34)\n\nGROSS SITE AREA means the total site area.\n\n(35)\n\nGUTTER means a shallow water drainage area adjacent to a curb.\n\n(36)\n\nHEIGHT, when used in reference to a building, means the vertical distance from the\naverage of the highest and lowest grades adjacent to the building to:\n\n(a)\n\nfor a flat roof, the highest point of the coping;\n\n(b)\n\nfor a mansard roof, the deck line;\n\n(c)\n\nfor a pitched or hip roof, the average height of the highest gable; or\n\n(d)\n\nfor other roof styles, the highest point of the building.\n\n(37)\n\nHILL COUNTRY ROADWAY means a roadway described in Section 30-3-141 (Hill Country Roadways and Corridors Identified).\n\n(38)\n\nHILL COUNTRY ROADWAY CORRIDOR means an area described in Section 30-3-141 (Hill Country Roadways and Corridors Identified).\n\n(39)\n\nINTERESTED PARTY means a person who meets the criteria established by Section 30-1-152 (Interested Parties).\n\n(40)\n\nINTERIOR LOT means a lot other than a corner lot.\n\n(41)\n\nINTERIOR LOT LINE means a lot line not abutting a street.\n\n(42)\n\nINTERIOR YARD means a yard, not adjacent to a street, that is determined on the basis\nof an interior lot line.\n\n(43)\n\nJOINT USE DRIVEWAY means a driveway located entirely on partially on a tract of land\nthat is available for use by an adjoining tract of land as ingress or egress to a\npublic street.\n\n(44)\n\nLAND USE COMMISSION means the Planning Commission or the Zoning and Platting Commission,\nas determined in accordance with City Code Section 25-1-46 (Land Use Commission).\n\n(45)\n\nLOCAL STREET means a street that serves traffic within a neighborhood or limited residential\ndistrict, and which is not necessarily continuous through several residential districts.\n\n(46)\n\nLOT means:\n\n(a)\n\na parcel of real property with a unique designation shown on a plat, record of survey,\nparcel map, or subdivision map recorded in the office of the county clerk; or\n\n(b)\n\na parcel of real property established under zoning or subdivision regulations.\n\n(47)\n\nLOT LINE means a line or series of connected line segments bounding a lot.\n\n(48)\n\nMAINTENANCE EASEMENT, when used in reference to a small lot, means an easement granted\nby the owner of one lot to the owner of an adjoining lot for maintenance of a dwelling\nwithin five feet of a common side lot line.\n\n(49)\n\nMANAGING OFFICIAL means a person who acts on behalf of the city or the county to administer\nthe Agreement On Subdivision Platting In The Extraterritorial Jurisdiction Between\nThe City Of Austin And Travis County dated April 1, 2002, as amended. One managing\nofficial is appointed by the city, and one managing official is appointed by the county,\nin accordance with the agreement.\n\n(50)\n\nMUNICIPAL UTILITY DISTRICT means a district created under Chapters 50 and 54 of the\nTexas Water Code.\n\n(51)\n\nNEAR-TERM ANNEXATION AREA means an area in the city's extraterritorial jurisdiction\nthat:\n\n(a)\n\nis included in the city's municipal annexation plan adopted in accordance with Subchapter\nC, Chapter 43, Local Government Code;\n\n(b)\n\nhas been or is being annexed for limited purposes under Subchapter F, Chapter 43,\nLocal Government Code, unless the date for full purpose annexation is postponed to\na date more than three years after the date of limited purpose annexation in accordance\nwith Local Government Code Section 43.127;\n\n(c)\n\nis the subject of an agreement to which the city and the county are parties and that\nprovides assurances to the county for the design, construction, and maintenance of\ninfrastructure, including infrastructure for transportation, floodplain management,\nor stormwater conveyance; or\n\n(d)\n\nis described on Appendix \"A\".\n\n(52)\n\nNEIGHBORHOOD ORGANIZATION means an association that has registered as a neighborhood\norganization.\n\n(53)\n\nNOTICE OWNER means the owner of real property as shown on the records of the tax appraisal\ndistrict in the county in which the property is located.\n\n(54)\n\nPEDESTRIAN WAY means the portion of a street right-of-way not used for a roadway.\n\n(55)\n\nPLANNED UNIT DEVELOPMENT means land developed as a single unit under unified control.\n\n(56)\n\nPLANNING JURISDICTION means the city and its extraterritorial jurisdiction.\n\n(57)\n\nPLATTING BOARD means the land use commission or the commissioners court, as determined\nby Section 30-1-92 (Discretionary Authority).\n\n(58)\n\nPLATTING OFFICIAL means the director or the county executive, as determined by Section 30-1-92 (Discretionary Authority).\n\n(59)\n\nPRELIMINARY PLAN means a map or drawing of a proposed plat, intended for consideration\nby the land use commission, the city council, or the commissioners court, as applicable,\nin accordance with the requirements of this title.\n\n(60)\n\nPROPERTY means real property.\n\n(61)\n\nREAR LOT LINE means the lot line that does not intersect the front lot line, or that\nis determined in accordance with Section 30-1-22 (Measurements).\n\n(62)\n\nREAR YARD means a yard extending the full width of a lot between the rear lot line\nand the rear setback line, excluding any area located within the street side yard\nof a corner lot.\n\n(63)\n\nRECORD OWNER means the owner of real property as shown by the deed records of the\ncounty in which the property is located.\n\n(64)\n\nRELEASE means the written certification that a plat or subdivision construction plan\nhas been approved, that the plat or construction plan complies with this title, and\nthat the conditions of approval for the plat or construction plan have been satisfied.\n\n(65)\n\nREVISION means a change in an approved or released plan that is initiated by an applicant.\n\n(66)\n\nRIGHT-OF-WAY means land dedicated or reserved for streets, utilities, or other public\nfacilities.\n\n(67)\n\nROADWAY means the portion of a street right-of-way used for vehicular travel.\n\n(68)\n\nSETBACK LINE means a line within a lot parallel to and measured from a corresponding\nlot line, forming the boundary of a yard and governing the placement of structures\nand uses on the lot.\n\n(69)\n\nSIDE LOT LINE means a lot line intersecting the front lot line and extending a minimum\ndistance of 75 feet.\n\n(70)\n\nSIDEWALK means the paved portion of a pedestrian way.\n\n(71)\n\nSIDE YARD means a yard extending the depth of a lot from the front yard to the rear\nlot line between the side lot line and the side setback line. For a corner lot, a\nstreet side yard is a yard that extends from the front yard to the rear lot line.\n\n(72)\n\nSINGLE OFFICE means the City of Austin - Travis County Single Subdivision Office.\n\n(73)\n\nSITE means a contiguous area intended for development, or the area on which a building\nhas been proposed to be built or has been built. A site may not cross a public street\nor right-of-way.\n\n(74)\n\nSMALL LOT means a lot with an area of less than 5,750 square feet.\n\n(75)\n\nSTAFF means a city or county employee, as applicable.\n\n(76)\n\nSTREET YARD means a yard adjacent to a street and determined on the basis of a street\nlot line.\n\n(77)\n\nSTRUCTURE means a building of any kind, or a piece of work artificially built-up or\ncomposed of parts joined together in a definite manner.\n\n(78)\n\nSUBDIVIDE means:\n\n(a)\n\nto divide land into two or more lots or sites for the purpose of sale or development;\n\n(b)\n\nto resubdivide an existing lot; or\n\n(c)\n\nto combine two or more lots into the same number or fewer lots with different boundaries.\n\n(79)\n\nSUBORDINATE SIDE YARD, when used in reference to a small lot, means the side yard\nhaving the smaller width.\n\n(80)\n\nTHROUGH LOT means a lot, other than a corner lot, abutting more than one street.\n\n(81)\n\nTOWNHOUSE means a dwelling unit having a common wall with or abutting one or more\nadjoining dwelling units in a townhouse group.\n\n(82)\n\nTOWNHOUSE LOT means the portion of a townhouse development that is intended for separate\nownership as the location of a single townhouse and associated private yard area.\n\n(83)\n\nTRANSPORTATION PLAN means the Capital Area Metropolitan Planning Organization long\nrange transportation plan.\n\n(84)\n\nUPDATE means additional information, a preliminary plan, a final plat, or a subdivision\nconstruction plan submitted by an applicant in response to comments by a review entity.\n\n(85)\n\nUSE EASEMENT, when used in reference to a small lot, means an easement granted by\nthe owner of a small lot with the subordinate side yard to the owner of a small lot\nwith a dominant side yard along the common lot line, and which allows the occupant\nof the dwelling unit on the lot having the dominant side yard the use, enjoyment,\nand privacy of the dominant side yard.\n\n(86)\n\nVARIANCE means a waiver of a provision of this title under Article 9, Division 3 (Variances).\n\n(87)\n\nWORKING DAY excludes a Saturday, Sunday, or an official city or county holiday.\n\n(88)\n\nYARD means an open space on a lot adjoining a lot line.\n\n(89)\n\nZERO LOT LINE means a common lot line on which a wall of a structure may be constructed.\n\nSource: City Code Section 25-1-25; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130;\nOrd. No. 20170615-102, Pt. 33, 6-15-17.\n\n(A)\n\nLot area is the net horizontal area within the lot lines, excluding the portion of\nthe lot:\n\n(1)\n\nthat provides street access, if the lot is a flag lot; or\n\n(2)\n\nthat is located below 492.8 feet of elevation above sea level, if the lot is adjacent\nto Lake Austin.\n\n(B)\n\nLot depth is the horizontal distance between the mid-point of the front lot line and\nthe midpoint of the rear lot line.\n\n(C)\n\nExcept as otherwise provided in this title, lot width is measured at the front setback\nline and at a distance of 50 feet to the rear of the front setback line.\n\n(D)\n\nIn determining required yards and setbacks for an irregularly shaped lot or a lot\nbounded by only three lot lines, the rear lot line is:\n\n(1)\n\na line ten feet long;\n\n(2)\n\nparallel to the front lot line; and\n\n(3)\n\nat the most distant location from the front lot line.\n\n(E)\n\nA distance from a structure to a line or location is measured from the exterior face\nof the nearest wall or vertical support of the structure to the line or location.\nFor a structure that does not have a wall or vertical support, the single office shall\ndetermine the point of measurement.\n\nSource: City Code Section 25-1-22; Ord. 031211-11; Ord. 031211-42.\n\nThe city council enacts and amends this title with the concurrence of the commissioners\ncourt. The city council has the duties and powers prescribed by this title and may\nmake determinations relating to certain subdivisions.\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42.\n\nThe commissioners court enacts and amends this title with the concurrence of the city\ncouncil. The commissioners court has the duties and powers prescribed by this title\nand acts as the platting board for certain subdivision applications.\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42; Ord. No. 20230831-142, Pt. 1, 9-1-23.\n\nThe land use commission acts as the platting board for certain subdivision applications.\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42; Ord. No. 20230831-142, Pt. 2, 9-1-23.\n\n(A)\n\nThe managing officials act on behalf of the city and the county to administer the\nAgreement On Subdivision Platting In The Extraterritorial Jurisdiction Between The\nCity Of Austin And Travis County dated April 1, 2002.\n\n(B)\n\nOne managing official is appointed by the city, and one managing official is appointed\nby the county, in accordance with the Agreement On Subdivision Platting In The Extraterritorial\nJurisdiction Between The City Of Austin And Travis County dated April 1, 2002.\n\n(C)\n\nThe managing officials have the duties and powers prescribed by this title.\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42.\n\nThe platting official is a city or county official who has the duties and powers prescribed\nby this title. Whether a city official or a county official acts as the platting official\nis determined by Section 30-1-92 (Discretionary Authority).\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42.\n\nThe platting board has the duties and powers prescribed by this title relating to\nthe approval of subdivisions. The land use commission or the commissioners court may\nact as the platting board, as determined by Section 30-1-92 (Discretionary Authority).\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42.\n\nThe single office has the duties and powers prescribed by this title relating to the\napproval of subdivisions, exercised in accordance with Section 30-1-93 (Single Office Structure And Function).\n\nSource: Based on City Code Chapter 25-1, Article 3 (Accountable Entities); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nExcept as provided in Subsection (B), an administrative rule to implement, administer,\nenforce, or comply with the title, including a standard form, is not valid unless\nadopted by both the city and the county.\n\n(B)\n\nAdministrative rules that relate to the subject matter of this title and that are\nin effect on January 1, 2004 govern this title until amended or repealed in accordance\nwith this section.\n\n(C)\n\nThe city may adopt an administrative rule in accordance with City Code Chapter 1-2\n(Adoption of Rules).\n\n(D)\n\nThe county may adopt an administrative rule by action of the county executive.\n\n(E)\n\nAfter the city and county have both adopted an administrative rule, the managing officials\nshall certify that the administrative rule applies to this title.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130.\n\n(A)\n\nAn applicant must obtain city and county approvals in the following order:\n\n(1)\n\nzoning, for an area annexed by the city for limited purposes;\n\n(2)\n\nsubdivision;\n\n(3)\n\nsite plan; and\n\n(4)\n\nbuilding permit, for an area annexed by the city for limited purposes.\n\n(B)\n\nAn applicant must obtain approvals for subdivision development in the following order:\n\n(1)\n\npreliminary plan, if required;\n\n(2)\n\nplat; and\n\n(3)\n\nsubdivision construction plan.\n\n(C)\n\nAn applicant may concurrently file zoning and site plan applications if no subdivision\nis required.\n\n(D)\n\nAn applicant may concurrently file subdivision, site plan, and building permit applications,\nif no zoning or rezoning is required or requested.\n\n(E)\n\nThe single office may authorize concurrent applications under the following circumstances:\n\n(1)\n\nPlat and preliminary plan if the single office determines the application for the\npreliminary plan only has outstanding deficiencies that are of an administrative nature\nthat will not require significant changes to the layout or design of the subdivision.\n\n(2)\n\nPlat and subdivision construction plan if;\n\n(a)\n\nthe preliminary plan has been approved;\n\n(b)\n\nthe single office determines that the application for the plat only has outstanding\ndeficiencies are of an administrative nature that will not require significant changes\nto the layout or design of the subdivision; and\n\n(c)\n\nthe subdivision construction plan has been certified complete under Section 25-1-84 (Subdivision Construction Application Requirements and Expiration).\n\nSource: City Code Section 25-1-61; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 38, 9-1-19; Ord. No. 20230831-142, Pt. 3, 9-1-23.\n\n(A)\n\nA person considering development in the planning jurisdiction may request that the\nsingle office prepare an assessment of the proposed development. The city and county\nencourage a development assessment for a residential project of more than 200 acres,\nor a commercial or mixed use project of more than 50 acres.\n\n(B)\n\nA development assessment is based on information provided by the requestor and the\nrequirements applicable at the time of the request.\n\n(C)\n\nA development assessment includes:\n\n(1)\n\nan explanation of the procedures and requirements of this title for zoning and rezoning,\nsubdivision, site plan approval, and building permits;\n\n(2)\n\nan estimate of fees; and\n\n(3)\n\nan identification of potential major issues for the project, including whether:\n\n(a)\n\nfor an area annexed by the city for limited purposes, the proposed land use conforms\nto the comprehensive plan and current zoning;\n\n(b)\n\nproposed arterials, if any, comply with the transportation plan;\n\n(c)\n\nproposed collector streets, if any, are adequate for the projected traffic;\n\n(d)\n\nthere are significant environmental issues;\n\n(e)\n\nthere are significant drainage or floodplain issues;\n\n(f)\n\nadequate utilities are available; and\n\n(g)\n\nthe proposed density or floor area:\n\n(i)\n\nis consistent with the requirements of this title;\n\n(ii)\n\nfor an area annexed by the city for limited purposes, is appropriate, considering\nthe surrounding land use or zoning; and\n\n(iii)\n\nis consistent with watershed requirements.\n\n(D)\n\nThe single office shall deliver a development assessment to the requestor within 21\ndays after the request is received. After its delivery, the requestor may seek a meeting\nwith the single office to discuss the development assessment.\n\nSource: City Code Section 25-1-62; Ord. 031211-11; Ord. 031211-42.\n\nIn this section, subdivision means preliminary plan, plat, or subdivision construction\nplan.\n\n(A)\n\nA person considering subdivision development in the extra territorial jurisdiction\nmay request that the director prepare a project assessment of the proposed development.\n\n(B)\n\nA project assessment may be submitted before submitting an application if the application\nas designed requires consideration of discretionary approvals such as:\n\n(1)\n\nA variance or waiver from a provision in Title 25 or Title 30;\n\n(2)\n\nA variance or waiver from criteria manuals adopted to implement the provisions of\nTitle 25 or Title 30;\n\n(3)\n\nAn alternative method of compliance allowed under Title 25, Title 30, or the associated criteria manuals;\n\n(4)\n\nA recommendation from an advisory board or commission; or\n\n(5)\n\nOther discretionary considerations as specified by rule.\n\n(C)\n\nA project assessment is based on information provided by the requestor.\n\n(D)\n\nA project assessment includes:\n\n(1)\n\nan explanation of the procedures and requirements of Title 25 and Title 30 for subdivision development;\n\n(2)\n\nan identification of potential major issues for the project, including whether:\n\n(a)\n\nthe proposed land use conforms to the Comprehensive Plan and current zoning;\n\n(b)\n\nproposed arterials, if any, comply with the Transportation Plan;\n\n(c)\n\nproposed collector streets, if any, are adequate for the projected traffic;\n\n(d)\n\nthere are significant environmental issues;\n\n(e)\n\nthere is an official floodplain map delineated;\n\n(f)\n\nadequate utilities are available; and\n\n(g)\n\nthe proposed density is:\n\n(i)\n\nconsistent with the requirements of Title 25 and Title 30;\n\n(ii)\n\nappropriate, considering the surrounding land use or zoning; and\n\n(iii)\n\nconsistent with watershed requirements.\n\n(E)\n\nA recommendation included in a project assessment is not a final determination on\na variance or waiver. A recommendation included in a project assessment remains valid\nfor 180 days.\n\n(F)\n\nAfter the request is received, the director shall deliver a project assessment to\nthe requestor within the time frame established by the director by administrative\nrule. After its delivery, the requestor may seek a meeting with the director or the\ndirector's designee to discuss the project assessment.\n\nSource: Ord. No. 20190822-117, Pts. 39, 40, 9-1-19; Ord. No. 20230831-142, Pt. 4, 9-1-23.\n\n**Editor's note—**\nOrd. No. 20190822-117, Pts. 39, 40, effective September 1, 2019, repealed the former § 30-1-73, and enacted\na new § 30-1-73 as set out herein. The former § 30-1-73 pertained to disapproval and\ndenial and derived from City Code Section 25-1-63; Ord. 031211-11; Ord. 031211-42.\n\nAn approval of a preliminary plan, final plat, or subdivision construction plan transfers\nwith the ownership of the land.\n\nSource: City Code Section 25-1-64; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nIn accordance with Local Government Code Chapters 212 and 232, a preliminary plan\nor final plat must receive final approval from both the city and the county, unless\nan approval by the city or county is not required under Chapter 30-2, Article 1 (Subdivision Compliance).\n\n(B)\n\nThe city's final approval authority is exercised by the director, land use commission,\nor the council in accordance with Section 30-2-84 (Plat Approval Authority and Criteria).\n\n(C)\n\nThe county's final approval authority is exercised by the county executive or commissioners\ncourt in accordance with Section 30-2-84 (Plat Approval Authority and Criteria).\n\nSource: Local Government Code, City Code, County Code, City/County subdivision agreement;\nOrd. 031211-11; Ord. 031211-42; Ord. 20120524-130.\n\n(A)\n\nIn this section, \"discretionary authority\" means the authority to make a discretionary\ndetermination relating to a subdivision variance or waiver. The term excludes final\napproval of a preliminary plan or final plat.\n\n(B)\n\nThis section allocates discretionary authority between the city and county.\n\n(C)\n\nExcept as provided in Subsection (D), discretionary authority is exercised by the\nplatting board or the platting official.\n\n(1)\n\nThe platting board is:\n\n(a)\n\nfor the city, the land use commission; and\n\n(b)\n\nfor the county, the commissioners court.\n\n(2)\n\nThe platting official is:\n\n(a)\n\nfor the city, the director; and\n\n(b)\n\nfor the county, the county executive.\n\n(D)\n\nThe commissioners court may exercise authority allocated to the county's platting\nofficial.\n\n(E)\n\nExcept as provided in Subsections (G) and (H), the city has all discretionary authority\nin a near-term annexation area.\n\n(F)\n\nExcept as provided in Subsections (G) and (H), outside a near-term annexation area:\n\n(1)\n\nthe county has discretionary authority over issues relating to transportation, floodplain\nmanagement, or stormwater conveyance;\n\n(2)\n\nthe city has discretionary authority over issues relating to:\n\n(a)\n\nwater, wastewater, electric, and telecommunication utilities;\n\n(b)\n\nthe environment, including stormwater quality controls; or\n\n(c)\n\nAustin - Bergstrom International Airport; and\n\n(3)\n\nfor all other issues, the single office shall determine whether the city or the county\nhas discretionary authority.\n\n(G)\n\nIf a parcel of land is excepted or exempted from the city requirement to plat by Chapter 30-2, Article 1 (Subdivision Compliance) but is subject to the county requirement to plat, the county platting official and\ncounty platting board exercise all discretionary authority.\n\n(H)\n\nIf a parcel of land is excepted or exempted from the county requirement to plat by\nChapter 30-2, Article 1 (Subdivision Compliance) but is subject to the city requirement to plat, the city platting official and city\nplatting board exercise all discretionary authority.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130.\n\n(A)\n\nThe single office shall review and make decisions relating to subdivisions.\n\n(B)\n\nWhen this title prescribes a duty or power to be exercised by the single office, a\nconsensus of the single office staff shall exercise the duty or power.\n\n(C)\n\nIf the single office staff does not reach a consensus on an issue, the managing officials\nshall make a single determination and exercise the duty or power.\n\n(D)\n\nFor each subdivision application, the single office shall designate a staff person\nto serve as a single point of contact for the applicant and to assist the applicant\nin processing the application.\n\n(E)\n\nThe managing officials shall jointly designate from among their employees a manager\nof the single office who shall have authority and responsibility to oversee the coordinated\nreview of applications.\n\n(F)\n\nThis subsection divides responsibility for subdivision review between the city and\nthe county according to subject matter and geographic area. If a subdivision is located\nin more than one of the geographic areas described below, then the subdivision is\ncategorized according to the geographic area in which the largest part of the subdivision\nis located.\n\n(1)\n\nA case manager is provided by:\n\n(a)\n\nthe county in the portion of the desired development zone that is outside a near-term\nannexation area; or\n\n(b)\n\nthe city in the drinking water protection zone or a near-term annexation area.\n\n(2)\n\nTransportation matters are reviewed by:\n\n(a)\n\nthe county outside a near-term annexation area; or\n\n(b)\n\nthe city in a near-term annexation area.\n\n(3)\n\nDrainage matters for a subdivision that does not participate in regional stormwater\nmanagement are reviewed by:\n\n(a)\n\nthe county outside a near-term annexation area; or\n\n(b)\n\nthe city in a near-term annexation area.\n\n(4)\n\nDrainage matters for a subdivision that participates in regional stormwater management\nare reviewed by the city in all geographic areas.\n\n(5)\n\nEnvironmental and utility matters are reviewed by the city in all geographic areas.\n\n(6)\n\nInspection of infrastructure installation is performed by the city in all geographic\nareas.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42; Ord. 20050929-079;\nOrd. No. 20230831-142, Pt. 5, 9-1-23.\n\nA record owner or the record owner's agent may file an application for a permit or\napproval required by this title. The single office may require an applicant to provide\nevidence of the applicant's authority to file an application.\n\nSource: City Code Section 25-1-81; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA person who seeks to subdivide land, vacate a plat, or construct subdivision infrastructure\nmust file with the single office an application for approval of a:\n\n(1)\n\npreliminary plan;\n\n(2)\n\nfinal plat;\n\n(3)\n\namending plat;\n\n(4)\n\nreplat;\n\n(5)\n\nplat vacation; or\n\n(6)\n\nsubdivision construction plan.\n\n(B)\n\nThe city and county shall review and make a determination on each application in accordance\nwith this title.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may propose rules to be adopted by the city and county establishing\nthe requirements for an application, including timelines for completing staff review\nas well as when an application may be updated to meet the requirements of Title 30 and other applicable regulations. The rules adopted must be in accordance with the\ntimelines for action established within Section 30-2-33 (Single Office Action within 30 Days).\n\n(B)\n\nThe single office may permit an applicant to omit required information from an application\nthat the single office determines is not material to a decision on the application.\n\n(C)\n\nAn application for preliminary plan or plat expires 180 days after the application\nis filed unless the application has been approved.\n\n(D)\n\nAn application that has been disapproved with reasons may be updated to address those\nreasons until the application expires.\n\n(E)\n\nExcept as provided in Subsection (B), the single office shall consider an application\nfiled only if the applicant has paid the required fee and provided the information\nrequired by the single office consistent with state law.\n\n(1)\n\nThe applicant has 45 days to provide all the information required by the single office\nafter the application is submitted.\n\n(2)\n\nIf an application is rejected as incomplete, the single office shall provide the applicant\nwith a written explanation identifying the deficiencies and the information required\nto complete the application 10 working days after the application is received.\n\n(3)\n\nAn application expires if it is not complete on or before the 45-day after the application\nis submitted. An applicant may submit an update to provide additional information\nand to correct deficiencies at any time before the application expires.\n\nSource: City Code Section 25-1-82; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 41, 9-1-19; Ord. No. 20230831-142, Pt. 6, 9-1-23; Ord. No. 20240718-103, Pt. 1, 7-29-24.\n\n(A)\n\nIn this section:\n\n(1)\n\nCMSW means an area defined as a closed municipal solid waste landfill in Texas Administrative\nCode, Title 30, Section 330.951.\n\n(2)\n\nLANDFILL AREA means an area marked on a map created by the City and maintained in\nthe Watershed Protection and Development Review Department showing all known CMSWL\nand including property within:\n\n(a)\n\nthe known boundary of a CMSWL;\n\n(b)\n\n200 feet around the estimated boundary if the boundary is not known; or\n\n(c)\n\n1500 feet from the estimated center of the CMSWL if neither a known boundary nor an\nestimated boundary is known.\n\n(B)\n\nThis section applies to an application for approval that may permit the construction\nor alteration of a residential, commercial, or public enclosed structure that is designed\nfor use by humans and that is located on:\n\n(1)\n\na site over 1 acre in size; or\n\n(2)\n\na site located within a landfill area.\n\n(C)\n\nThe single office may not approve an application for subdivision unless the applicant\nhas delivered to the single office:\n\n(1)\n\ncertification from a licensed professional engineer that the site does not overlie\na CMSWL; or\n\n(2)\n\nif the site overlies a CMSWL:\n\n(a)\n\na development permit from the Texas Commission on Environmental Quality; or\n\n(b)\n\nwritten notification from the Texas Commission on Environmental Quality that a development\npermit is not required; or\n\n(3)\n\ncertification from a licensed professional engineer that the applicant will conduct\nsoil testing under the requirements of the Texas Commission on Environmental Quality\nduring construction of the foundation to determine whether the site overlies a CMSWL.\n\nSource: City Code Section 25-1-83; Ord. 031211-11; Ord. 031211-42; Ord. 20080925-138.\n\n(A)\n\nThe single office may establish regular cycles for consideration of applications by\ncity staff, boards, commissions, and the council. The managing officials shall advise\nthe council and commissioners court of the creation or change of a cycle.\n\n(B)\n\nAn established cycle supersedes conflicting requirements of this title applicable\nto the city, except those mandated by state law.\n\nSource: City Code Section 25-1-84; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may propose rules to be adopted by the city and county establishing\nthe requirements for a subdivision construction plan application, including timelines\nfor completing staff review as well as when an application may be updated to meet\nthe requirements of this title and other applicable regulations.\n\n(B)\n\nThe single office is authorized to certify a subdivision construction plan if it complies\nwith this subsection.\n\n(1)\n\nAn application is complete if the applicant has paid the required fee and provided\nthe information required to be included in the application no later than the 45th\nday after it was submitted. The single office may permit an applicant to omit required\ninformation from an application that the single office determines is not material\nto a decision on the application.\n\n(2)\n\nWhen the single office rejects an application as incomplete, the single office shall\nprovide the applicant with a written explanation that identifies the deficiencies\nand the information needed to complete the application. The single office must provide\nthe written explanation within 10 working days after receipt of the application.\n\n(3)\n\nAn application expires if it is not complete on or before the 45th day after the application\nis submitted. An applicant may submit an update to provide additional information\nand correct any deficiencies at any time before the 45th day.\n\n(4)\n\nA certification that the subdivision construction application is administratively\ncomplete is valid for 45 days after the certification has been issued.\n\n(C)\n\nThe single office is authorized to review the subdivision construction plan application\nif the applicant pays the required fee and the application has a valid certification\nof completion. If the application has not yet been certified, the certification is\nno longer valid, or the submitted subdivision construction plan does not match the\ncertified materials, the single office will not review the application but shall provide\nthe applicant with a written explanation identifying the deficiencies 10 working days\nafter the application is received.\n\n(D)\n\nAn application for subdivision construction plan expires one year after the application\nis accepted unless the application has been approved.\n\nSource: Ord. No. 20230831-142, Pt. 7, 9-1-23.\n\n**Editor's note—**\nOrd. No. 20230831-142, Pt. 7, effective September 1, 2023, repealed the former § 30-1-116, and enacted\na new § 30-1-116 as set out herein. The former § 30-1-116 pertained to sequence of\nreview and derived from City Code Section 25-1-85; Ord. 031211-11; Ord. 031211-42;\nOrd. No. 20190822-117, Pt. 42, 9-1-19.\n\nThe single office shall inform a city board or commission of the dates that other\nboards or commissions are scheduled to consider an application. A city board or commission\nshall act diligently to finish its review in accordance with the schedule.\n\nSource: City Code Section 25-1-86; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may extend a review period of a preliminary plan or plat for an\nadditional 30 days if the applicant submits a written request for an extension before\nthe time limitations described in Section 30-2-33 (Single Office Action within 30 Days). The review period can only be extended one time.\n\n(B)\n\nIf the single office approves an extension request under Subsection (A), the single\noffice shall approve, approve with conditions, or disapprove no later than the expiration\nof the extended review period.\n\nSource: Ord. No. 20230831-142, Pt. 8, 9-1-23; Ord. No. 20240718-103, Pt. 2, 7-29-24.\n\n(A)\n\nThis section establishes a \"stop the clock\" provision tolling the expiration period\nfor an application that requires discretionary review by the Land Use Commission,\nBoard of Adjustment, commissioners court, or city council.\n\n(B)\n\nThe expiration of an application is tolled if, prior to expiration of the application,\nthe single office determines that approval of the application requires:\n\n(1)\n\ndiscretionary review, as authorized under this title, by the Land Use Commission,\nBoard of Adjustment, commissioners court, or city council, other than a zoning change\nor code amendment; and\n\n(2)\n\nthe application meets all other requirements for approval, except for payment of fees,\nposting fiscal surety, and other code requirements as determined by the single office\nunder Section 30-1-113 (Preliminary Plan or Plat Application Requirements and Expiration) or 30-1-116 (Subdivision Construction Plan Application and Requirements).\n\n(C)\n\nIf an applicant obtains all required discretionary approvals from the Land Use Commission,\nBoard of Adjustment, commissioners court or city council, any additional updates of\nthe application must be submitted no later than 60 working days after the date of\nthe approval. An application expires if the applicant does not comply with this deadline.\n\n(D)\n\nAn application expires if the Land Use Commission, Board of Adjustment, commissioners\ncourt, or city council denies a required discretionary approval or fails to take action\nafter considering the matter at a public hearing.\n\n(E)\n\nIf expiration of an application is tolled under this section pending required approval\nby the Land Use Commission, Board of Adjustment, commissioners court, or city council,\nthe expiration period for all other applications associated with the same project\nis also tolled.\n\nSource: Ord. No. 20230831-142, Pt. 9, 9-1-23.\n\n(A)\n\nThe fees required under this title shall be established by separate city or county\nordinance. In establishing a fee, the city and county shall each take into account\nthe division of responsibility between city and county staff prescribed by Section 30-1-93 (Single Office Structure and Function) and the Agreement on Subdivision Platting in the Extraterritorial Jurisdiction Between\nthe City of Austin and Travis County dated April 1, 2002, as amended.\n\n(B)\n\nBefore the single office accepts an application, the city and county shall each calculate\nthe fees due, and the single office shall collect both fees from the applicant.\n\nSource: City Code Section 25-1-111; Ord. 031211-11; Ord. 031211-42; Ord. 20050929-079.\n\n(A)\n\nAn applicant shall post fiscal security required under this title with the single\noffice.\n\n(B)\n\nThe single office shall determine whether fiscal security is payable to the city,\nthe county, or both.\n\n(C)\n\nThe amount of fiscal security posted by an applicant shall equal the estimated cost\nto the city or county to do the work for which the fiscal security is required. A\nqualified professional must provide the single office with a detailed estimate of\nthe cost. The single office's approval of the estimate is required.\n\n(D)\n\nAn applicant may post as fiscal security:\n\n(1)\n\na cash deposit;\n\n(2)\n\na performance bond; or\n\n(3)\n\na letter of credit.\n\n(E)\n\nThe single office shall return the fiscal security to the applicant if the single\noffice determines that:\n\n(1)\n\nthe applicant has obtained a certificate of compliance or final acceptance letter\nfor the work for which the fiscal security was posted; or\n\n(2)\n\nthe obligation to do the work for which the fiscal security was posted has terminated.\n\n(F)\n\nThe single office may draw on the fiscal security and pay the cost of fulfilling the\napplicant's obligations if the single office determines that an applicant has breached\nthe obligations secured by the fiscal security. The single office shall pay the balance\nof the fiscal security, if any, to the applicant. The applicant is liable to the single\noffice for the cost that exceeds the amount of fiscal security, if any.\n\nSource: City Code Section 25-1-112; Ord. 031211-11; Ord. 031211-42.\n\nThis article applies to an application to be considered by a city board or commission\nor the city council.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nAn interested party is a person who has an interest in a matter that is the subject\nof a public hearing or administrative decision. A person has an interest if the person:\n\n(1)\n\nis the applicant or the record owner of property that is the subject of a public hearing\nor administrative decision; or\n\n(2)\n\ncommunicates an interest in a matter; and\n\n(a)\n\noccupies a primary residence that is within 500 feet of the site of the proposed development;\n\n(b)\n\nis the record owner of property within 500 feet of the site of the proposed development;\n\n(c)\n\nis an officer of an environmental or neighborhood organization that has an interest\nin the site of the proposed development or whose declared boundaries are within 500\nfeet of the site of the proposed development; or\n\n(d)\n\nhas a utility account address located within 500 feet of the site of the proposed\ndevelopment, as shown in the City utility records on the date of the filing of the\napplication.\n\n(B)\n\nA person communicates an interest in a matter that is the subject of a public hearing\nby:\n\n(1)\n\ndelivering a written statement that generally identifies the issues of concern to\nthe body conducting the hearing, either before or during the public hearing; or\n\n(2)\n\nappearing and speaking for the record at the public hearing.\n\n(C)\n\nA person communicates an interest in a matter that is the subject of an administrative\ndecision by delivering a written statement to the single office or by making telephone\ncontact with the single office. The communication must:\n\n(1)\n\ngenerally identify the issues of concern;\n\n(2)\n\ninclude the person's name, telephone phone number, and mailing address;\n\n(3)\n\nbe delivered before the earliest date on which action on the application may occur;\nand\n\n(4)\n\nif the communication is by telephone, be confirmed in writing not later than seven\ndays after the earliest date on which action on the application may occur.\n\nSource: City Code Section 25-1-131; Ord. 031211-11; Ord. 031211-42; Ord. 20090521-062.\n\n(A)\n\nFor a notice required to be given under this subsection, the single office shall give\nnotice of a public hearing before a board or commission by mailing notice not later\nthan the 11th day before the date of the hearing to:\n\n(1)\n\nthe applicant;\n\n(2)\n\na notice owner of property located within 500 feet of the subject property;\n\n(3)\n\na neighborhood organization;\n\n(4)\n\na party to an appeal; and\n\n(5)\n\nutility account addresses located within 500 feet of the site of the proposed development,\nas shown in the City utility records on the date of the filing of the application.\n\n(B)\n\nFor a notice required to be given under this subsection, the single office shall give\nnotice of a public hearing before the council by:\n\n(1)\n\npublishing notice not later than the 16th day before the date of the public hearing;\nand\n\n(2)\n\nmailing notice not later than the 16th day before the date of the hearing to:\n\n(a)\n\nthe applicant;\n\n(b)\n\na notice owner of property located within 500 feet of the subject property;\n\n(c)\n\na neighborhood organization;\n\n(d)\n\na party to an appeal; and\n\n(e)\n\nutility account addresses located within 500 feet of the site of the proposed development,\nas shown in the City utility records on the date of the filing of the application.\n\n(C)\n\nFor a notice required to be given under this subsection, the single office shall give\nnotice of a public hearing before a board or commission or the council by:\n\n(1)\n\nmailing notice to a neighborhood organization not later than the 11th day before the\ndate of a hearing scheduled before a board or commission and not later than the 16th\nday before the date of a hearing scheduled before the council;\n\n(2)\n\npublishing notice not later than the 16th day before the date of a hearing before\nthe council; and\n\n(3)\n\nposting a sign on the property stating the date and time of the public hearing.\n\n(D)\n\nThis subsection applies to public hearings on two or more matters related to the same\nproperty or development.\n\n(1)\n\nOne notice may be provided if the hearings are scheduled:\n\n(a)\n\non the same date before the same body; or\n\n(b)\n\nbefore two or more bodies not later than the 45th day after the date of a notice.\n\n(2)\n\nThe single office shall provide notice not later than the date the earliest notice\nis required.\n\n(E)\n\nNotice provided under this section must:\n\n(1)\n\ngenerally describe the subject matter of the public hearing;\n\n(2)\n\nidentify the applicant and the location of the subject property;\n\n(3)\n\nidentify the body holding the public hearing and the date, time, and place of the\npublic hearing;\n\n(4)\n\nif the decision of the body holding the public hearing may be appealed, describe the\nprocedure and requirements for an appeal; and\n\n(5)\n\ninclude the address and telephone number of the office from which additional information\nmay be obtained.\n\nSource: City Code Section 25-1-132; Ord. 031211-11; Ord. 031211-42; Ord. 20090521-062.\n\n(A)\n\nFor notice required to be given under this subsection, the single office shall mail\nnotice not later than the 14th day after the filing of an application to the:\n\n(1)\n\napplicant;\n\n(2)\n\nnotice owner of real property located within 500 feet of the subject property;\n\n(3)\n\nneighborhood organization; and\n\n(4)\n\nutility account addresses located within 500 feet of the site of the proposed development,\nas shown in the City utility records on the date of the filing of the application.\n\n(B)\n\nFor notice required to be given under this subsection, the single office shall mail\nnotice not later than one day after an administrative decision to:\n\n(1)\n\nthe record owner of the subject property; and\n\n(2)\n\ninterested parties.\n\n(C)\n\nNotice provided under this section must:\n\n(1)\n\ndescribe the general nature of the application, including a description of the project;\n\n(2)\n\nidentify the applicant and the location of the site;\n\n(3)\n\ngenerally describe the proposed development;\n\n(4)\n\nidentify the entity that may approve the application;\n\n(5)\n\nstate the earliest date that action under a decision may occur;\n\n(6)\n\ndescribe the procedure and requirements for becoming an interested party;\n\n(7)\n\nif the decision may be appealed, describe the procedure for an appeal; and\n\n(8)\n\ninclude the address and telephone number of the person from whom additional information\nmay be obtained.\n\n(D)\n\nA person may not make a decision on an application for which notice is required to\nbe provided under this section earlier than the 14th day after the date the notice\nis issued. The single office may permit the decision to be made sooner.\n\nSource: City Code Section 25-1-133; Ord. 031211-11; Ord. 031211-42; Ord. 20090521-062.\n\n(A)\n\nThis section applies to notice\n\n(B)\n\nPublished notice is effective on the date a notice is published in a newspaper of\ngeneral circulation in the city.\n\n(C)\n\nMailed notice is effective on the date a letter is deposited in a depository of the\nU.S. Post Office, postage paid, and addressed:\n\n(1)\n\nto an applicant, by mailing notice to the property owner or agent at the address shown\non the application or on a written change of address form filed with the single office;\n\n(2)\n\nto a notice owner of real property, by mailing notice to the owner shown on the records\nof the county tax appraisal district;\n\n(3)\n\nto a record owner of real property, by mailing notice to the owner at the street address\nof the property or, if the property does not have a street address, to the return\naddress shown on the deed; and\n\n(4)\n\nto a neighborhood organization, by mailing notice to the agent or officer of the organization\nat the mailing address specified in the city registration information.\n\n(D)\n\nNotice by certified mail, return receipt requested, is only required if prescribed\nin this title.\n\n(E)\n\nNotice by hand delivery may be substituted for notice by mail if the addressee provides\na receipt of delivery.\n\n(F)\n\nWhen mailed notice to a notice owner is required:\n\n(1)\n\nexcept as provided in Subsection (E)(2), the single office shall prepare the list\nof notice owners; or\n\n(2)\n\nif the county tax appraisal district maintains ownership records on an automated data\nbase that is not accessible by the single office, the applicant shall provide a complete\nlist of notice owners from information obtained from the tax appraisal district and\nshall certify its accuracy on a form provided by the single office.\n\n(G)\n\nThe single office shall notify a neighborhood organization of:\n\n(1)\n\nan application concerning property located completely or partially within the boundaries\nof the neighborhood organization; and\n\n(2)\n\na proposed amendment to the text of this title.\n\nSource: City Code Section 25-1-134; Ord. 031211-11; Ord. 031211-42.\n\nThis division applies to a public hearing before a city board or commission or the\ncity council.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA person shall register to speak at a public hearing with the presiding officer of\nthe body conducting the hearing in the manner provided by the presiding officer.\n\n(B)\n\nA person who registers before the hearing may speak at the time provided in Subsection\n(E). A person who registers after the beginning of a hearing may speak before the\nclose of the hearing with the permission of the presiding officer.\n\n(C)\n\nThe speaker registration shall identify the name and mailing address of the speaker\nand the matter to be addressed.\n\n(D)\n\nA speaker shall state the speaker's name at the beginning of the speaker's presentation\nwhen addressing the body conducting the hearing.\n\n(E)\n\nExcept as provided in Article 9 (Appeals, Variances, and Special City Procedures), a public hearing shall proceed as follows:\n\n(1)\n\npresentation of a report by staff;\n\n(2)\n\npresentation by the applicant, for a hearing on an application;\n\n(3)\n\npresentation by interested parties supporting the application or proposal;\n\n(4)\n\npresentation by interested parties opposing the application or proposal;\n\n(5)\n\nrebuttal by the applicant, for a hearing on an application.\n\n(F)\n\nA member of the body conducting the public hearing may ask questions of a person at\nany time during the hearing. With the approval of the presiding officer, a person\nmay ask a question of another person.\n\n(G)\n\nThe body conducting a public hearing may limit a speaker's time to address the body.\nThe presiding officer may request that a speaker eliminate repetitious or irrelevant\ntestimony.\n\nSource: City Code Section 25-1-151; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe body conducting a public hearing may:\n\n(1)\n\npostpone a public hearing by announcing the postponement on the date and at the time\nand location stated in the notice for the scheduled hearing; and\n\n(2)\n\ncontinue a public hearing to a later date by announcing the continuance after the\nhearing begins.\n\n(B)\n\nIf the body conducting a public hearing postpones or continues a hearing to a specific\ndate and time not later than 60 days after the date on which the postponement or continuance\nis announced, the announcement is adequate notice of the next hearing and additional\nnotice is not required.\n\n(C)\n\nWhen a body conducting a public hearing postpones or continues a hearing, the next\nhearing shall be held at the same location as the original hearing unless a change\nin location is announced at the time of the postponement or continuance.\n\n(D)\n\nIf a body does not specify a hearing date and time at the time that a postponement\nor continuance is announced, notice of the next hearing shall be provided in the manner\nrequired for the original hearing.\n\nSource: City Code Section 25-1-152; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, Pt. 44, 9-1-19; Ord. No. 20230831-142, Pt. 10, 9-1-23.\n\n(A)\n\nThe presiding officer of the body conducting a public hearing may change the location\nof a hearing for good cause.\n\n(B)\n\nThe presiding officer shall post a sign notifying the public of the change of location.\nThe sign must:\n\n(1)\n\nbe prominently displayed at the original location of the hearing on the date and at\nthe time of the original hearing;\n\n(2)\n\nidentify the hearing being relocated;\n\n(3)\n\nstate the time, date, and new location of the hearing; and\n\n(4)\n\nprovided an explanation for relocation.\n\n(C)\n\nThe hearing shall be postponed a sufficient period of time to provide a reasonable\nopportunity for interested parties to travel from the original location to the new\nlocation of the hearing.\n\nSource: City Code Section 25-1-153; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe body conducting a public hearing shall record each public hearing on audio tape\nor video tape.\n\n(B)\n\nThe official record of a public hearing includes:\n\n(1)\n\nthe audio tape or video tape recording of the public hearing;\n\n(2)\n\nwritten staff reports; and\n\n(3)\n\ndocumentary evidence submitted during a public hearing.\n\n(C)\n\nA person may review the official record of a public hearing.\n\n(D)\n\nThe custodian of the records of the body conducting the hearing may establish rules\nregarding the time and location for review of the record.\n\nSource: City Code Section 25-1-154; Ord. 031211-11; Ord. 031211-42.\n\nThis division applies to a public hearing before the commissioners court.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42.\n\nThe commissioners court is governed by the procedures prescribed by County Code Chapter\n1 (Commissioners Court Rules of Procedure).\n\nSource: County Code Chapter 1; Ord. 031211-11; Ord. 031211-42.\n\nRobert's Rules of Order are the official parliamentary rules for the commissioners\ncourt, except as otherwise provided by state law.\n\nSource: County Code Section 1.014; Ord. 031211-11; Ord. 031211-42.\n\nPersons who give testimony to the commissioners court must first identify themselves\nand state whether they represent another person or entity.\n\nSource: County Code Section 1.004(a); Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nEach commissioners court meeting is audio tape recorded.\n\n(B)\n\nThe audio tape is available for review in the county clerk's office for a period of\nat least two years from the date of the meeting.\n\nSource: County Code Section 1.004(b); Ord. 031211-11; Ord. 031211-42.\n\nThis division applies to an appeal to a city board or commission or the city council.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA person has standing to appeal a decision if:\n\n(1)\n\nthe person is an interested party; and\n\n(2)\n\na provision of this title identifies the decision as one that may be appealed by that\nperson.\n\n(B)\n\nA body holding a public hearing on an appeal shall determine whether a person has\nstanding to appeal the decision.\n\nSource: City Code Section 25-1-181; Ord. 031211-11; Ord. 031211-42.\n\nA person with standing to appeal may initiate an appeal by filing a notice of appeal\nwith the single office not later than:\n\n(1)\n\nthe 14th day after the date of the decision of a board or commission, including the\nland use commission;\n\n(2)\n\nthe 20th day after an administrative decision; or\n\n(3)\n\nfor an appeal authorized by State law, the date specified by State law.\n\nSource: City Code Section 25-1-182; Ord. 031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 11, 9-1-23; Ord. No. 20240718-103, Pt. 3, 7-29-24.\n\nThe notice of appeal must be on a form prescribed by the single office and must include:\n\n(1)\n\nthe name, address, and telephone number of the appellant;\n\n(2)\n\nthe name of the applicant, if the appellant is not the applicant;\n\n(3)\n\nthe decision being appealed;\n\n(4)\n\nthe date of the decision;\n\n(5)\n\na description of the appellant's status as an interested party; and\n\n(6)\n\nthe reasons the appellant believes the decision does not comply with the requirements\nof this title.\n\nSource: City Code Section 25-1-183; Ord. 031211-11; Ord. 031211-42.\n\nThe single office shall notify an applicant in writing if there is an interested party\nto an administrative decision.\n\nSource: City Code Section 25-1-184; Ord. 031211-11; Ord. 031211-42.\n\nOn receipt of a notice of appeal or an amendment of a notice, the single office shall\npromptly notify the presiding officer of the body to which the appeal is made and,\nif the applicant is not the appellant, the applicant.\n\nSource: City Code Section 25-1-185; Ord. 031211-11; Ord. 031211-42.\n\nIf requested by an interested party, the single office shall schedule a meeting to\ndiscuss and attempt to resolve the issues raised by an appeal of an administrative\ndecision. The single office shall notify all interested parties of a meeting scheduled\nunder this section. All interested parties may attend the meeting.\n\nSource: City Code Section 25-1-186; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nAn approved plan or permit is suspended on the timely filing of an appeal of the plan\nor permit.\n\n(B)\n\nDevelopment affected by an appeal may not occur pending the final disposition of the\nappeal.\n\nSource: City Code Section 25-1-187; Ord. 031211-11; Ord. 031211-42.\n\nA public hearing on an appeal shall be scheduled for the first available meeting for\nwhich notice of the hearing can be timely provided.\n\nSource: City Code Section 25-1-188; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office shall give notice under Section 30-1-153(A) (Notice of Public Hearing) of a public hearing on an appeal to a board or commission.\n\n(B)\n\nThe single office shall give notice under Section 30-1-153(B) (Notice of Public Hearing) of a public hearing on an appeal to the council.\n\nSource: City Code Section 25-1-189; Ord. 031211-11; Ord. 031211-42.\n\nThe appellant must establish that the decision being appealed is contrary to applicable\nlaw or regulations.\n\nSource: City Code Section 25-1-190; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nBefore opening a hearing, a body hearing an appeal shall decide preliminary issues\nraised by the parties, including whether to postpone or continue the hearing and whether\nthe appellant has standing to appeal.\n\n(B)\n\nA public hearing on an appeal shall proceed in the following order:\n\n(1)\n\na report from staff;\n\n(2)\n\na presentation by the appellant;\n\n(3)\n\ncomment by persons supporting the appeal;\n\n(4)\n\ncomment by persons opposing the appeal; and\n\n(5)\n\na rebuttal by the appellant.\n\nSource: City Code Section 25-1-191; Ord. 031211-11; Ord. 031211-42.\n\nA body hearing an appeal may, in accordance with the requirements of this title, exercise\nthe power of the official or body whose decision is appealed. A decision may be upheld,\nmodified, or reversed.\n\nSource: City Code Section 25-1-192; Ord. 031211-11; Ord. 031211-42.\n\nThis division applies to an appeal to the commissioners court.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42.\n\nAppeals to the commissioners court shall be in accordance with County Code Chapter\n1 (Commissioners Court Rules of Procedure).\n\nSource: County Code Chapter 1; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA person may file an application for a variance with the single office for a variance\nto be granted by the platting board or the council.\n\n(B)\n\nAn application may include a request for:\n\n(1)\n\nvariances from regulations applicable to the same site; or\n\n(2)\n\nsimilar variances on two or more adjacent parcels with similar characteristics.\n\n(C)\n\nThe single office may require that the applicant provide information that the single\noffice determines is necessary to evaluate the variance request.\n\nSource: City Code Section 25-1-211; Ord. 031211-11; Ord. 031211-42.\n\nFor an application for a variance requiring consideration by the platting board, the\nsingle office shall prepare and file a report with the platting board not later than\nthe 11th day before the public hearing.\n\nSource: City Code Section 25-1-212; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThis section applies to an application for a variance from the requirements of Chapter 30-5, Subchapter A (Water Quality).\n\n(B)\n\nThe environmental commission shall consider an application for a variance and forward\nits recommendation to the land use commission.\n\n(C)\n\nThe land use commission shall consider the environmental commission's recommendation\nbefore acting on a variance.\n\nSource: City Code Section 25-1-213; Ord. 031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 12, 9-1-23.\n\nThe single office shall give notice under Section 30-1-153(A) (Notice of Public Hearing) of a public hearing on an application for a variance required to be heard by the\nland use commission.\n\nSource: City Code Section 25-1-214; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as otherwise provided in this chapter, the land use commission shall act on\nan application for a variance not later than the next meeting after the public hearing\nis closed.\n\n(B)\n\nThe platting board may:\n\n(1)\n\napprove an application for a variance;\n\n(2)\n\napprove an application for a variance with modifications; or\n\n(3)\n\ndeny an application for a variance.\n\n(C)\n\nThe platting board may require that a variance be:\n\n(1)\n\nrevocable;\n\n(2)\n\neffective for a specified time period; or\n\n(3)\n\nsubject to one or more conditions.\n\nSource: City Code Section 25-1-215; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as provided in Subsection (B), a decision on a variance is effective immediately.\n\n(B)\n\nIf a variance is appealable, a decision on the variance is effective either:\n\n(1)\n\nat the expiration of the time period during which an appeal may be filed; or\n\n(2)\n\nif a notice of appeal is filed, when a final decision on the appeal is made.\n\nSource: City Code Section 25-1-216; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as provided in Subsection (B), a variance expires:\n\n(1)\n\nexcept as provided in Subsection (A)(2), one year after the effective date of the\nvariance; or\n\n(2)\n\non the date established as a condition of approval.\n\n(B)\n\nA variance expires on the date an approved plan or permit expires if:\n\n(1)\n\nan application for approval of a plan or permit is submitted before a variance expires\nunder Subsection (A); or\n\n(2)\n\nthe variance is granted in association with the approved plan or permit.\n\nSource: City Code Section 25-1-217; Ord. 031211-11; Ord. 031211-42.\n\nIf an application for a variance is denied or a variance is revoked, a person may\nnot file an application for the same or a similar variance on the same or a substantially\nthe same site for a period of one year from the date of denial or revocation.\n\nSource: City Code Section 25-1-218; Ord. 031211-11; Ord. 031211-42.\n\nA special exception allows a person to use or develop land in a manner not otherwise\npermitted by this title.\n\nSource: City Code Section 25-1-231; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA person claiming a vested right to develop property that becomes subject to the city's\nzoning or extraterritorial jurisdiction may file an application for a special exception\nwith the single office.\n\n(B)\n\nAn application must be on a form prescribed by the single office and must include:\n\n(1)\n\nthe name and address of the applicant;\n\n(2)\n\nthe address and legal description of the property;\n\n(3)\n\nif the applicant is not the record owner of the property, proof that the applicant\nis the owner's agent;\n\n(4)\n\nthe date the property became subject to the city's zoning or extraterritorial jurisdiction;\n\n(5)\n\nif the property was annexed, the date the council scheduled public hearings on the\nannexation and the date notice of the public hearings was published in a newspaper\nof general circulation;\n\n(6)\n\nif a governmental agency has approved or permitted development of the property in\naccordance with the claimed vested right, or if an application for an approval or\npermit is pending:\n\n(a)\n\nthe date the application was filed; and\n\n(b)\n\nthe date the application was approved;\n\n(7)\n\nevidence that establishes reliance by the applicant on the status quo immediately\nbefore the property became subject to the city's zoning or extraterritorial jurisdiction;\nand\n\n(8)\n\nevidence of a substantial and irrevocable commitment of resources uniquely suited\nto the proposed plan of development and which cannot be substantially recovered except\nby developing the property substantially as proposed.\n\n(C)\n\nThe single office may require the applicant to submit additional information that\nthe director determines is necessary to evaluate the vested right claim.\n\nSource: City Code Section 25-1-232; Ord. 031211-11; Ord. 031211-42.\n\nThe single office shall give notice under Section 30-1-154(A) (Notice Of Applications And Administrative Decisions) of an application for a\nspecial exception.\n\nSource: City Code Section 25-1-233; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may grant or deny a special exception under Subsection (B).\n\n(B)\n\nThe single office shall acknowledge and determine the scope of a vested right if the\nsingle office determines that:\n\n(1)\n\nthe applicant reasonably relied on the status quo immediately before the property\nbecame subject to the city's zoning or extraterritorial jurisdiction;\n\n(2)\n\nthe applicant has made a substantial and irrevocable commitment of resources uniquely\nsuited to a proposed plan of development and that cannot be substantially recovered\nexcept by developing the property substantially as proposed;\n\n(3)\n\nthe applicant has made a reasonable effort, under the circumstances and considering\nthe stage of development of the property, to accommodate the public interest in enforcement\nof all applicable provisions of this title; and\n\n(4)\n\nthe proposed use or development, if finished in accordance with an approved special\nexception, will not endanger the public health, safety, or general welfare.\n\n(C)\n\nThe single office may condition approval of a special exception under this section\non the applicant's compliance with requirements established by the single office.\n\n(D)\n\nThe single office's decision must:\n\n(1)\n\nbe in writing;\n\n(2)\n\nstate the findings and conclusions;\n\n(3)\n\ndescribe the scope and limitations of the special exception; and\n\n(4)\n\ndescribe conditions of approval, if any.\n\n(E)\n\nAn interested party may appeal the single office's decision under this section to\nthe land use commission.\n\nSource: City Code Section 25-1-234; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nAn application for an adjustment under Chapter 30-5, Subchapter A (Water Quality) may be considered only in connection with the review\nof:\n\n(1)\n\na site plan;\n\n(2)\n\na subdivision; or\n\n(3)\n\nother specific development project or proposal.\n\n(B)\n\nAn applicant may file an application for an adjustment with the director.\n\n(C)\n\nAn application for an adjustment must be on a form prescribed by the director and\nmust include:\n\n(1)\n\nthe names and addresses of the applicant and the owner;\n\n(2)\n\nthe address and legal description of the property;\n\n(3)\n\nproof that the applicant is either the record owner or the record owner's agent;\n\n(4)\n\nidentification of the section of Chapter 30-5, Subchapter A (Water Quality) that, as applied to the development project or proposal,\nthe applicant claims violates the United States Constitution, the Texas Constitution,\nor federal or state statute, and the provisions violated;\n\n(5)\n\na statement of the factual basis for applicant's claims;\n\n(6)\n\na legal brief supporting applicant's claims; and\n\n(7)\n\na description of the adjustment requested, and an explanation of how the adjustment\nis the minimum required to comply with the conflicting law and provides maximum protection\nof water quality.\n\nSource: City Code Section 25-1-251; Ord. 031211-11; Ord. 031211-42; Ord. 20131017-046.\n\nThis section prescribes the order of process for an application for adjustment.\n\n(1)\n\nThe city law department shall review an application for adjustment and advise the\ncity manager.\n\n(2)\n\nThe city manager shall present the application and the city manager's recommendation\nto the council.\n\n(3)\n\nThe council shall determine whether application of Chapter 30-5, Subchapter A (Water Quality) to the applicant's development project or proposal\nviolates the United States Constitution, the Texas Constitution, or federal or state\nstatute. An affirmative determination requires a three-quarters vote of the city council.\nIf the council does not make an affirmative determination, the application is denied.\n\n(4)\n\nThis subsection applies if the council makes an affirmative determination under Subsection\n(3).\n\n(a)\n\nThe Watershed Protection Department shall review the application and advise the city\nmanager.\n\n(b)\n\nThe city manager shall present the application and the city manager's recommendation\nto the council at a public hearing.\n\n(c)\n\nAfter a public hearing, the city council shall:\n\n(i)\n\ndetermine the minimum adjustment required to comply with the conflicting law and provide\nmaximum protection of water quality; and\n\n(ii)\n\ngrant the adjustment.\n\nSource: City Code Section 25-1-252; Ord. 031211-11; Ord. 031211-42; Ord. 20131017-046.\n\nThis article applies to development that occurs under an approved subdivision construction\nplan.\n\nSource: City Code Section 25-1-281; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as provided in Subsection (C), the owner of a project, or owner representative,\nshall participate in a preconstruction conference with the single office before starting\nconstruction under an approved subdivision construction plan.\n\n(B)\n\nAn owner, or owner representative, shall request that the single office schedule the\npreconstruction conference when the owner pays the required inspection fees.\n\n(C)\n\nThe single office may waive the requirement for a preconstruction conference.\n\nSource: City Code Section 25-1-282; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office shall provide notice of the conference to the following persons\nor entities not later than the second day before the conference:\n\n(1)\n\nowner representative;\n\n(2)\n\nconsulting engineer;\n\n(3)\n\ncontractors;\n\n(4)\n\naffected utilities; and\n\n(5)\n\nappropriate staff.\n\n(B)\n\nBefore convening a preconstruction conference, the single office shall distribute\napproved plans for the development to the persons and entities receiving notice of\nthe conference.\n\nSource: City Code Section 25-1-283; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe conference participants shall exchange telephone numbers and addresses at the\nconference.\n\n(B)\n\nThe participants shall discuss:\n\n(1)\n\nthe sequence of construction;\n\n(2)\n\nstart dates and schedule of events;\n\n(3)\n\nerosion and sedimentation controls;\n\n(4)\n\ntraffic control barricades;\n\n(5)\n\nsite supervision;\n\n(6)\n\nemergency response;\n\n(7)\n\nspecial conditions or provisions of plans or specifications;\n\n(8)\n\nfinal acceptance guidelines; and\n\n(9)\n\npublishing and distribution of minutes of the conference.\n\nSource: City Code Section 25-1-284; Ord. 031211-11; Ord. 031211-42.\n\nBefore construction begins, the owner's consulting engineer shall prepare and distribute\nminutes of the preconstruction conference. Conference participants may file exceptions\nto the minutes. The engineer shall distribute copies of exceptions to the conference\nparticipants and shall include the exceptions in the inspection file.\n\nSource: City Code Section 25-1-285; Ord. 031211-11; Ord. 031211-42.\n\nThe single office shall deliver copies of the released subdivision construction plans\nand approved plan revisions to the appropriate staff for inspection.\n\nSource: City Code Section 25-1-311; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe central dispatcher shall coordinate contact between a permittee and an inspector.\n\n(B)\n\nA permittee shall contact the central dispatcher to request an inspection.\n\n(C)\n\nThe single office may:\n\n(1)\n\nrequire that a request be made 48 hours before the date the inspection is desired;\nand\n\n(2)\n\nspecify the manner in which the request is made.\n\n(D)\n\nThe central dispatcher shall maintain inspection requests for the single office.\n\nSource: City Code Section 25-1-286; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA permittee may not begin work under a permit until an inspection record card is posted\non the site.\n\n(B)\n\nThe permittee shall post the card in a readily accessible location.\n\n(C)\n\nAn inspector shall note each inspection on the record card.\n\n(D)\n\nThe permittee shall post the record card until a final report is issued indicating\ncompletion of the required work.\n\nSource: City Code Section 25-1-287; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe owner shall request an inspection of erosion and sedimentation controls and tree\nprotection measures after the owner installs the controls and measures.\n\n(B)\n\nThe single office shall schedule the inspection. The owner, consulting engineer, and\ncontractor shall attend the inspection.\n\n(C)\n\nDuring the inspection, the owner shall:\n\n(1)\n\ndemonstrate that the erosion and sedimentation controls and tree protection measures\ncomply with the Environmental Criteria Manual; and\n\n(2)\n\npresent a plan to the inspector that includes future erosion and sedimentation controls,\ndrainage, and utility and street layout.\n\n(D)\n\nAfter two days notice to the owner, the inspector may modify the approved erosion\ncontrol and construction sequencing if:\n\n(1)\n\nthe inspector determines that the plans are inadequate;\n\n(2)\n\nthe inspector confirms the determination with the single office; and\n\n(3)\n\nthe single office provides written approval of the modification.\n\n(E)\n\nThe inspector may make minor changes to the erosion control and construction sequencing\nplans without written approval from single office if the modification upgrades erosion\ncontrols or reflects construction progress.\n\n(F)\n\nExcept as provided in Subsection (G), the owner may not begin construction until the\nsingle office determines that the erosion and sedimentation controls and tree protection\nmeasures comply with applicable requirements.\n\n(G)\n\nIf the single office does not conduct an inspection on or before the fifth day after\nreceiving a request, the owner may proceed with construction.\n\nSource: City Code Section 25-1-288; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as provided in Subsection (B), the single office may charge a reinspection\nfee if at the time that an inspector attempts to conduct an inspection, the permittee:\n\n(1)\n\nhas not finished the work to be inspected;\n\n(2)\n\nhas not finished corrections previously required by an inspector;\n\n(3)\n\nhas not posted the record inspection card;\n\n(4)\n\ndoes not make approved plans readily available to the inspector; or\n\n(5)\n\ndoes not provide access to the work on the scheduled inspection date.\n\n(B)\n\nWork that was rejected at the first inspection for failure to comply with a technical\ncode may be reinspected without payment of a reinspection fee.\n\n(C)\n\nIf a reinspection fee is due, additional inspections may not be performed until the\nreinspection fee is paid.\n\nSource: City Code Section 25-1-289; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nApproximately 10 days before work under the subdivision construction plans is finished,\nthe owner shall notify the single office in writing that the work is substantially\ncomplete and shall request a report listing the work to be completed.\n\n(B)\n\nOn the day that the owner provides notice under Subsection (A), the consulting engineer\nshall submit a construction summary report to the single office.\n\nSource: City Code Section 25-1-312; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nNot later than the fourth day after the owner gives written notice that work under\na subdivision construction plan is substantially complete, the single office shall:\n\n(1)\n\nreview the work; and\n\n(2)\n\nprepare a report identifying work that does not comply with the construction plans\nand work that must be performed before the accountable official issues a final acceptance\nletter.\n\n(B)\n\nWhen the owner finishes the work listed in the report issued under Subsection (A),\nthe single office shall modify the report to reflect completion of the required work.\n\nSource: City Code Section 25-1-313; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office shall schedule a final acceptance meeting at the site and shall\ninvite the:\n\n(1)\n\nconsulting engineer;\n\n(2)\n\ncontractors, as appropriate;\n\n(3)\n\naffected utilities; and\n\n(4)\n\nappropriate staff;\n\n(B)\n\nThe single office may not issue a final acceptance letter until:\n\n(1)\n\nwork identified in the accountable official's report has been completed;\n\n(2)\n\nthe following items have been submitted:\n\n(a)\n\nconstruction summary report;\n\n(b)\n\nconsulting engineer's concurrence letter;\n\n(c)\n\nreproducible plans, certified \"as built\" by the consulting engineer;\n\n(d)\n\nif required, one-year warranty bonds;\n\n(e)\n\ncash or cashier's check for balances due, if any; and\n\n(3)\n\nif the owner executed a developer contract, the conditions of the contract have been\nsatisfied.\n\n(C)\n\nThe single office shall issue an acceptance letter to an owner who meets the requirements\nof Subsection (B). If the owner has not satisfied all requirements, the single office\nshall issue a list of requirements that the owner must satisfy.\n\nSource: City Code Section 25-1-314; Ord. 031211-11; Ord. 031211-42.\n\nA person may not use or occupy a structure unless the single office has issued a certificate\nof compliance for the subdivision infrastructure.\n\nSource: City Code Section 25-1-361; Ord. 031211-11; Ord. 031211-42.\n\nThe single office shall issue a certificate of compliance if the development has been\ncompleted in accordance with the construction plans and other ordinance requirements\nfor subdivision infrastructure.\n\nSource: City Code Section 25-1-362; Ord. 031211-11; Ord. 031211-42.\n\nA person shall comply with the requirements of this title.\n\nSource: City Code Section 25-1-391; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA permit holder must, as a condition of the permit, to allow city or county inspectors\nto enter and inspect the land or premises that is the subject of the permit.\n\n(B)\n\nAn applicant for an approval under this title shall agree in writing to allow city\nand county inspectors to enter and inspect the land or premises that is the subject\nof the application during approval and development.\n\n(C)\n\nEntry and inspection under this section must be at a reasonable time for the purpose\nof investigating or enforcing the requirements of this title.\n\n(D)\n\nIf the premises are occupied, the city or county inspector shall present the inspector's\ncredentials and request entry. If the premises are unoccupied, the inspector shall\nattempt to contact a responsible person and request entry.\n\nSource: City Code Section 25-1-392; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may suspend an approved subdivision construction plan if the single\noffice determines that:\n\n(1)\n\nthe subdivision construction plan was approved in error; or\n\n(2)\n\nthe development does not comply with this title.\n\n(B)\n\nA suspension is effective until the single office determines that the applicant has\ncomplied with the requirements of this title.\n\nSource: City Code Section 25-1-412; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nIf the single office determines that a person is not in compliance with a requirement\nof a variance or special exception, the single office may suspend the variance or\nspecial exception pending compliance.\n\n(B)\n\nThe body granting the variance or special exception shall hold a public hearing and\ndetermine whether the person is in compliance with the requirements of the variance\nor special exception.\n\n(C)\n\nThe land use commission shall hold the public hearing not later than the 45th day\nafter notification of the suspension under Section 30-1-435 (Notice Of Suspension Or Revocation). The single office shall give notice under Section 30-1-153(A) (Notice Of Public Hearing) of the public hearing.\n\n(D)\n\nIf the body determines that the person is not in compliance with a requirement of\nthe variance or special exception, the body may revoke the variance or special exception\nor take other action to obtain compliance.\n\n(E)\n\nThe body's decision to revoke a variance or special exception is effective immediately.\n\nSource: City Code Section 25-1-415; Ord. 031211-11; Ord. 031211-42.\n\nThe single office may immediately revoke a person's approved subdivision construction\nplan that has been suspended if the single office determines that the person:\n\n(1)\n\ndid not comply in a reasonable time with the requirements of this title for which\nthe suspension was ordered; or\n\n(2)\n\nduring the suspension, did not comply with other requirements of this title.\n\nSource: City Code Section 25-1-416; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may give notice to the person affected of the single office's intent\nto suspend or revoke an approved subdivision construction plan under this division.\n\n(B)\n\nThe notice may specify a reasonable time for compliance with this title. If a time\nfor compliance is specified, the single office may not suspend or revoke before the\ntime for compliance has expired.\n\nSource: City Code Section 25-1-417; Ord. 031211-11; Ord. 031211-42.\n\nThe single office shall give notice by certified mail, return receipt requested, under\nSection 30-1-154(B) (Notice Of Applications And Administrative Decisions) of a suspension or revocation\nby the official under this division.\n\nSource: City Code Section 25-1-418; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nIf the single office determines that a person required to obtain a subdivision construction\nplan has not complied with a requirement of this title, the single office may order\nthe person to stop the development of or transportation of construction material to\nthe site until the person complies with the requirements of this title.\n\n(B)\n\nWhile a stop work order is in effect:\n\n(1)\n\na city or county inspection may not be performed, and work requiring an inspection\nmay not be approved; and\n\n(2)\n\na person may not connect a utility at the site.\n\n(C)\n\nIf a stop work order is based on a failed inspection, a person may not further develop\nthe site until the development passes a reinspection.\n\n(D)\n\nIf a stop work order is based on a health or safety hazard, a person may not further\ndevelop the site until the director determines that the development complies with\nthe requirements of this title.\n\n(E)\n\nA city or county employee shall post a stop work order on the site and mail a copy\nof the order to the record owner.\n\nSource: City Code Section 25-1-441; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA person may appeal a stop work order, revocation, or suspension issued under this\narticle by giving written notice to the single office not later than the third day\nafter:\n\n(1)\n\nthe stop work order is posted; or\n\n(2)\n\nthe person receives notice of the revocation or suspension.\n\n(B)\n\nThe notice of appeal must contain:\n\n(1)\n\nthe name and address of the appellant;\n\n(2)\n\na statement of facts;\n\n(3)\n\nthe decision being appealed; and\n\n(4)\n\nthe reasons the decision should be set aside.\n\n(C)\n\nThe single office shall hear the appeal not later than the third working day after\nthe appeal is filed. The appellant, the appellant's expert, and the department may\noffer testimony to the single office.\n\n(D)\n\nThe single office shall affirm or reverse the decision not later than the second working\nday after the hearing. The single office shall give written notice of the decision\nand a statement of the reasons for the decision to the appellant.\n\n(E)\n\nA stop work order, suspension, or revocation remains in effect during the pendency\nof an appeal under this section.\n\nSource: City Code Section 25-1-461; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nCriminal penalties for violations of this title are prescribed by Title 1 (General\nProvisions) of the City Code and Local Government Code Chapter 232 (County Regulation\nOf Subdivisions).\n\n(B)\n\nA separate offense is committed each day that a violation of this title continues.\n\nSource: City Code Section 25-1-462; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nOther than the city council, only the planning commission may initiate an amendment\nto the regulations in this title on behalf of the city.\n\n(B)\n\nOnly the commissioners court may initiate an amendment to the regulations in this\ntitle on behalf of the county.\n\nSource: City Code Section 25-1-501; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThis section prescribes the city's procedure for amending the regulations in this\ntitle.\n\n(B)\n\nExcept as provided in Section 30-1-483 (Joint Action Required), the council may amend this title after a public hearing.\nThe council must receive a recommendation required by Subsection (C) before opening\na public hearing or acting on an amendment.\n\n(C)\n\nPlanning commission review of a proposed amendment of this title is required. The\nplanning commission must hold a public hearing on the proposed amendment before forwarding\nits recommendation to the council.\n\n(D)\n\nNotice of a public hearing required by this section shall be provided in accordance\nwith Section 30-1-153(C) (Notice Of Public Hearing).\n\nSource: City Code Section 25-1-502; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThis section prescribes the county's procedure for amending the regulations in this\ntitle.\n\n(B)\n\nThe commissioners court is governed by the procedures prescribed by County Code Chapter\n1 (Commissioners Court Rules Of Procedure).\n\nSource: County Code Chapter 1; Ord. 031211-11; Ord. 031211-42.\n\nAn amendment to this title is effective only after it is enacted by both the city\ncouncil and the commissioners court.\n\nSource: City/County subdivision agreement; Ord. 031211-11; Ord. 031211-42.\n\nAPPENDIX A\n\n| Map Legend | Area Name | Case Number | LP Type | Acreage Annexed | Acreage Remaining to be Converted | Ordinance Number | Effective Date |\n| --- | --- | --- | --- | --- | --- | --- | --- |\n| LP Development Agreement/Municipal Utility District | | | | | | | |\n| Development Agreement | Portions of Davenport West PUD | C7a-88-007 A | PZ | 247.00 | 109.00 | 881215-T | 12/25/1988 |\n| MUD | Moore's Crossing | C7a-95-013 | PZ/HS | 799.09 | 799.09 | SB1396 | 1/1/1996 |\n| Development Agreement | Motorola | C7L-98-002 | PZ/HS | 446.00 | 249.00 | 980827-C | 9/7/1998 |\n| MUD | Galloway Tract | C7L-98-003 | PZ/HS | 19.00 | 19.00 | 990204-G | 2/15/1999 |\n| Development Agreement | Balfour Tract | C7L-99-001 | PZ/HS | 588.00 | 588.00 | 990722-08 | 8/2/1999 |\n| Development Agreement | Edwards Crossing | C7L-00-001 | PZ/HS | 298.00 | 298.00 | 000323-89 | 4/3/2000 |\n| Development Agreement | Interport Tract | C7L-00-003 | PZ | 652.00 | 652.00 | 000907-50 | 9/18/2000 |\n| Development Agreement | Wildhorse Ranch Tract | C7L-01-002 | PZ | 1,957.00 | 1,957.00 | 020214-42 | 2/25/2002 |\n| Development Agreement | Boston Ln SW Parkway | C7A-86-008 | PZ | 474.00 | 474.00 | 860717-V | 7/27/1986 |\n| Development Agreement | The Uplands | C7AR-87-008 | PZ | 2,684.00 | 2684.00 | 871224-A | 12/31/1987 |\n| Municipal Annexation Plan/Strategic Partnership Agreement | | | | | | | |\n| MAP | Walnut Creek | C7a-05-002 | PZ/PZHS | 315.00 | 315.00 |  |  |\n| MAP | Springfield Phase C | C7a-05-003 |  | 0.0 | 55.91 |  |  |\n| MAP | Pearce Lane Ross Road area | C7a-06-001 |  | 0.0 | 277.0 |  |  |\n| Preserve/Lake Austin Shoreline/Fully Platted/Built | | | | | | | |\n| Lake Austin Shoreline | Lake Austin Shoreline | C7A-82-002 | PZHS | 2240.00 |  | 820506-D | 5/6/1982 |\n| Preserve | Barton Creek Greenbelt | C7A-83-005 | PZHS | 23.00 |  | 840202-B,C,D | 2/2/1984 |\n| Platted/Built | IH-35 North/Four Seasons | C7A-83-011 | PZHS | 1402.00 |  | 840913-E/F | 9/13/1984 |\n| Platted/Built | Howard Lane | C7A-84-020A | PZHS | 2097.00 |  | 841115-CCC | 11/15/1984 |\n| Platted/Built | NW Area Upper Bull Creek | C7A-84-021 | PZHS | 9894.00 |  | 841115-DDD | 11/15/1984 |\n| Platted/Built | US 290 & Hwy 71 | C7A-85-010 | PZ | 1113.60 |  | 860116-G | 1/26/1986 |\n| Preserve/Platted/   Built | NW Area: Tract I | C7A-85-034aA | PZ | 5747.20 |  | 860109-C | 1/19/1986 |\n| Platted/Built | NW Area: Tract II | C7A-85-034ba | PZ | 11,155.2 0 |  | 851219-P | 12/29/1985 |\n| Other Limited Purpose Area | | | | | | | |\n|  | Loop 360 Corridor | C7A-80-001 | PZHS | 1,006.24 |  | 800522-A | 6/1/1980 |\n|  | Loop 360 Corridor | C7A-82-003A | PZHS | 527.92 |  | 831027-C/B | 10/27/1983 |\n|  | Loop 360 Corridor | C7A-83-002 | PZHS | 77.90 |  | 841115-II KK | 11/15/1984 |\n|  | Loop 360 Corridor | C7A-83-007 | PZHS | 1,303.00 |  | 830721-C | 7/31/1983 |\n|  | RM 620 | C7A-84- C7A-84-001 | PZHS | 706.00 |  | 840503-G | 5/3/1984 |\n|  | Hwy 71 | C7A-84-008 | PZHS | 1510.00 |  | 841115-OO | 11/15/1984 |\n|  | RM 620 | C7a-84-010a | PZHS | 559.00 |  | 841115-QQ | 11/15/1984 |\n",
  "start_line": 83082,
  "end_line": 86442,
  "subsections": []
}