{
  "id": "chapter-30-3",
  "title": "TRANSPORTATION",
  "level": 1,
  "parent_id": null,
  "content": "## CHAPTER 30-3. - TRANSPORTATION.\n\nThis article applies to land for which an owner files an application for preliminary\nplan or final plat approval.\n\nSource: City Code Section 25-6-21; Ord. 031211-11; Ord. 031211-42.\n\nThe provisions of this article relating to the reservation of right-of-way and waiver\nof reservation of right-of-way requirements do not preclude the city or county from\nestablishing a building line on a right-of-way under state law.\n\nSource: City Code Section 25-6-22; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe city and county reserve right-of-way along a roadway designated:\n\n(1)\n\nin the transportation plan;\n\n(2)\n\nin the collector plan approved in accordance with Section 30-3-73 (Collector street plan); or\n\n(3)\n\nin an established city or county capital improvement project.\n\n(B)\n\nThe extent and location of the right-of-way reserved under Subsection (A) must conform\nto the transportation plan, approved collector plan, or capital improvement project.\n\nSource: City Code Section 25-6-51; County Code Section 82.202(f)(3); Ord. 031211-11;\nOrd. 031211-42.\n\nExcept as provided in Section 30-3-26 (Agreement For Temporary Use Of Reserved Right-Of-Way) and Section 30-3-41 (Waiver Request), a person may not erect a structure or make an improvement in a\nreserved right-of-way.\n\nSource: City Code Section 25-6-52; County Code Section 82.202(f)(4); Ord. 031211-11;\nOrd. 031211-42.\n\nA setback line prescribed under this title is measured from the boundary of the reserved\nright-of-way adjacent to the property unless waived under Section 30-3-43 (Action On Waiver).\n\nSource: City Code Section 25-6-53; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office shall determine the alignment of reserved right-of-way during:\n\n(1)\n\nthe review and approval process for a development application; or\n\n(2)\n\nif an applicant files a waiver request under Section 30-3-41 (Waiver Request), not later than the 60th day after the waiver request is filed.\n\n(B)\n\nThe alignment of reserved right-of-way is based on:\n\n(1)\n\nthe alignment established in the transportation plan, collector plan, or capital improvement\nproject; and\n\n(2)\n\nengineering criteria, including grade, curvature, and the existence of a flood plain.\n\n(C)\n\nIn an area designated for a state roadway project, alignment may be established by\nthe Texas Department of Transportation.\n\n(D)\n\nFor an existing or platted street, the alignment is based on:\n\n(1)\n\nthe existing centerline established before an additional dedication from the opposite\nside of the right-of way occurs; or\n\n(2)\n\nif the centerline of the street is proposed to be shifted from its present alignment,\nthe proposed centerline.\n\n(E)\n\nIf the alignment for a roadway cannot be determined under Subsection (D), the reserved\nright-of-way shall be established equally on each side of the centerline of the existing\nroadway.\n\nSource: City Code Section 25-6-54; County Code Section 82.202(f)(3) and (4); Ord.\n031211-11; Ord. 031211-42.\n\n(A)\n\nIf the single office determines that all or a portion of a right-of-way is needed\nto accommodate the estimated traffic generated by a proposed development, the applicant\nmay be required to dedicate:\n\n(1)\n\nan amount of land not to exceed 150 feet for a roadway that is subject to reservation\nof right-of-way under Section 30-3-21 (Reservation Of Right-Of-Way) and that is internal to a proposed subdivision or development\nproject; or\n\n(2)\n\nan amount of land not to exceed 50 percent of the total right-of-way requirement for\nan existing or proposed roadway that:\n\n(a)\n\nis subject to reservation of right-of-way under Section 30-3-21 (Reservation Of Right-Of-Way); and\n\n(b)\n\nadjoins a proposed subdivision or development project.\n\n(B)\n\nAn applicant may not be required to dedicate more than 75 feet of land under Subsection\n(A)(2).\n\n(C)\n\nThe single office may require the dedication of right-of-way in an amount greater\nthan established in Subsection (A):\n\n(1)\n\nfor a street that is not subject to reserved right-of-way and that does not comply\nwith the standards in the Transportation Criteria Manual; or\n\n(2)\n\nif the additional right-of-way is necessary to accommodate traffic generated by the\nproposed development.\n\n(D)\n\nThe single office may defer the dedication of right-of-way required at one stage of\nthe development process to a later stage. A person must comply with all dedication\nrequirements before the release of the subsequent application.\n\n(E)\n\nIn addition to the dedication of right-of-way, the single office may require the applicant\nto construct a roadway improvement or may assess a fee instead of requiring construction\nof a roadway improvement to offset the traffic effects generated by the proposed development.\n\n(F)\n\nNotwithstanding the other requirements of this section, roadway improvements are required\nonly to a degree that is roughly proportional to the nature and extent of the impact\nof the proposed development. To the extent that the full amount of right-of-way specified\nin this section is not required to be dedicated, the right-of-way is reserved and\nsubject to Section 30-3-22 (Constructing A Structure Or Improvement In Right-Of-Way Prohibited).\n\nSource: City Code Section 25-6-55; County Code Section 82.202(f) - (g); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nThe county or, in a near-term annexation area, the city may by written agreement authorize\nuse of reserved right-of-way for a temporary structure or improvement, including a\nparking area, detention pond, landscaping, or sign.\n\n(B)\n\nThe agreement must contain:\n\n(1)\n\nan expiration date for the use of the right-of-way;\n\n(2)\n\nthe method the city or county, as applicable, will use to notify the property owner\nthat a temporary improvement must be removed;\n\n(3)\n\na requirement that the property owner replace the improvements on the remainder of\nthe property when the temporary improvements are removed, if the improvements are\nrequired by the City Code or this title;\n\n(4)\n\nthe applicant's address for notification; and\n\n(5)\n\na penalty for failure to remove a temporary improvement.\n\nSource: City Code Section 25-6-56; County Code Section 82.202(f)(4)(A); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nAn applicant who files a development application that proposes to erect a structure\nor construct an improvement in a reserved right-of-way or in a required setback from\nreserved right-of-way must:\n\n(1)\n\nexecute an agreement under Section 30-3-26 (Agreement For Temporary Use Of Reserved Right-Of-Way); or\n\n(2)\n\nsubmit a request for waiver of the reservation requirements of this article with the\ndevelopment application.\n\n(B)\n\nAn owner of property reserved for right-of-way who does not have a development application\npending with the city or county may apply for a waiver of the reservation requirements\nof this article if 15 percent or more of the property is or would be subject to the\nreservation requirements of Section 30-3-21 (Reservation Of Right-Of-Way).\n\n(C)\n\nA waiver granted under Subsection (B) is only effective until the single office determines\nthat acquisition of a reserved right-of-way is feasible.\n\nSource: City Code Section 25-6-81; County Code Section 82.202(f)(4)(B); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nAfter receiving a waiver request, the single office shall establish the alignment\nof a relevant roadway and, if a development application has been filed, shall apply\nthe dedication standards under Section 30-3-25 (Dedication Of Right-Of-Way).\n\n(B)\n\nIf an application covers an area designated as a state roadway project, the single\noffice shall:\n\n(1)\n\nnotify the Texas Department of Transportation that:\n\n(a)\n\na request for a waiver has been filed; and\n\n(b)\n\nif applicable, that a development application has been filed proposing construction\nin a reserved right-of-way or setback from reserved right-of-way; and\n\n(2)\n\nrequest field notes from the Texas Department of Transportation.\n\n(C)\n\nIf the proposed structure or improvement is located in reserved right-of-way subject\nto dedication, the single office shall require that the application be amended to\nshow the land to be dedicated.\n\n(D)\n\nThe single office shall certify that:\n\n(1)\n\nthe dedication requirements have been applied to the application and that a request\nfor a waiver to erect a structure or construct an improvement in the reserved right-of-way\nhas been filed; or\n\n(2)\n\na request for waiver of the reservation requirements of this article has been filed\nby an applicant who does not have a development application pending before the city\nor county and that 15 percent or more of the property is or would be subject to the\nreservation requirements of this article.\n\nSource: City Code Section 25-6-82; County Code Section 82.202(f)(4)(B); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nNot later than the 90th day after the certification under Section 30-3-42 (Notice Of Waiver Request), the county executive, or in a near-term annexation area\nthe city manager, shall determine whether the city or county, as applicable, is able\nto acquire the reserved right-of-way that is the subject of a waiver request.\n\n(B)\n\nIf the city or county is not able acquire the property single office shall:\n\n(1)\n\nrelease the application from the requirement to comply with the requirements of this\narticle; or\n\n(2)\n\nif no application has been filed, grant the waiver request for the period of time\nthat the city or county, as applicable, is unable to acquire the reserved right-of-way.\n\n(C)\n\nIf the city or county is able acquire the reserved right-of-way, the single office\nshall deny the waiver. The single office may not approve the development application\nfor a period not to exceed six months, pending acquisition of the property. If the\ncity or county has not acquired the property during the six month period, the single\noffice shall continue to process the application.\n\nSource: City Code Section 25-6-83; County Code Section 82.202(f)(4)(B); Ord. 031211-11;\nOrd. 031211-42; Ord. 20060504-039; Ord. 20120524-130.\n\nAn applicant may appeal the single office's denial of a waiver request to the council\nor commissioners court, as appropriate.\n\nSource: City Code Section 25-6-84 ; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nAn applicant may amend a development application to exclude an improvement from a\nreserved right-of-way.\n\n(B)\n\nIf an applicant amends an application to exclude an improvement from a reserved right-of-way,\nthe city or county may discontinue procedures to acquire the reserved right-of-way.\n\nSource: City Code Section 25-6-85 ; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe platting official may grant a variance from the dedication requirements of Section 30-3-25 (Dedication Of Right-Of-Way) if the platting official determines that the requirements:\n\n(1)\n\nplace an undue hardship on the property owner because of special circumstances applicable\nto the property; or\n\n(2)\n\nrender the property unsuitable for an economically feasible use.\n\n(B)\n\nAn applicant may appeal the denial of a variance to the council or commissioners court,\nas appropriate.\n\nSource: City Code Section 25-6-86 ; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as provided in Subsections (B) and (C), a roadway, street, or alley must be\ndesigned and constructed in accordance with the Transportation Criteria Manual and\nCity of Austin Standards and Standard Specifications.\n\n(B)\n\nThe platting official may approve a local street that is less than 50 feet in width\nif a street of narrower width is warranted by topographical conditions, a drainage\nchannel, proposed limited development on one side of the street, or other special\ncondition.\n\n(C)\n\nA roadway, street, or alley may be designed and constructed without curb and gutter\nif it is located in a subdivision that is more than two miles from the city limits\nand has a density of less than two and one-half lots or dwelling units for each acre.\n\nSource: City Code Section 25-6-171; County Code Section 82.302(a); Ord. 031211-11;\nOrd. 031211-42.\n\nAn arterial street must comply with the transportation plan.\n\nSource: City Code Section 25-6-172; County Code Section 82.202(f)(4); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nThe single office shall make recommendations to the planning commission and the commissioners\ncourt regarding the designation of collector streets.\n\n(B)\n\nThe planning commission and the commissioners court, acting jointly, shall designate\ncollector streets after receiving the recommendations required under Subsection (A).\n\nSource: City Code Section 25-6-173; Ord. 031211-11; Ord. 031211-42.\n\nThe county executive, or in a near-term annexation area the city manager, may allow\na person to construct one-half of a divided arterial roadway adjoining a subdivision\nafter determining that:\n\n(1)\n\nthe pavement width of the proposed roadway is at least 24 feet; and\n\n(2)\n\nthe roadway can safely be used as a two-way street until construction of the entire\ndivided roadway is completed.\n\nSource: City Code Section 25-6-174; County Code Section 82.202(g); Ord. 031211-11;\nOrd. 031211-42; Ord. 20060504-039; Ord. 20120524-130.\n\nThis division applies to a subdivision if a part of the subdivision is in a water\nsupply rural watershed or water supply suburban watershed.\n\nSource: City Code Section 25-6-201; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe right-of-way and street design for a local or collector street in a residential\narea located in a critical water quality zone or a water quality buffer zone must\ncomply with the alternative geometric design criteria for streets without curbs and\ngutters prescribed in the Transportation Criteria Manual.\n\n(B)\n\nA street in a critical water quality zone or a water quality buffer zone other than\na street described in Subsection (A) may comply with the alternative geometric design\ncriteria in the Transportation Criteria Manual if the county executive, or in a near-term\nannexation area the city manager, determines that the design is consistent with transportation\nprinciples.\n\n(C)\n\nA street in an upland zone may be designed to comply with the alternative geometric\ndesign criteria in the Transportation Criteria Manual if the county executive, or\nin a near- term annexation area the city manager, determines that the design is consistent\nwith transportation principles.\n\nSource: City Code Section 25-6-202; County Code Section 82.302(a); Ord. 031211-11;\nOrd. 031211-42; Ord. 20060504-039; Ord. 20120524-130.\n\nAn applicant must designate the type of street cross-section design to be used in\na preliminary subdivision at the time that the plan is filed.\n\nSource: City Code Section 25-6-203; County Code Section 82.302(a); Ord. 031211-11;\nOrd. 031211-42.\n\nThe county executive, or in a near-term annexation area the city manager, may modify\na curb and gutter requirement or the minimum width of a right-of-way prescribed in\nthe Transportation Criteria Manual for a local or collector street after considering:\n\n(1)\n\na report from the single office that assesses the adequacy with which a proposed alternative\ndesign deals with storm water drainage, traffic safety, and general public welfare;\n\n(2)\n\nthe applicant's written statement in support of the modification; and\n\n(3)\n\nthe applicant's preliminary plan for street construction under the proposed modification.\n\nSource: City Code Section 25-6-205; County Code Section 82.302(a); Ord. 031211-11;\nOrd. 031211-42; Ord. 20060504-039; Ord. 20120524-130.\n\n(A)\n\nIn this section, \"major roadway\" means a roadway that is designated as a major arterial,\nexpressway, parkway, freeway, or toll road in the transportation plan.\n\n(B)\n\nExcept as provided in Subsections (C) and (D), a subdivision plat may not provide\nfor direct access from a lot to a major roadway unless the lot contains 200 feet or\nmore of frontage on the major roadway and alternative access is not available.\n\n(C)\n\nThe platting official shall permit access to a major roadway from a property with\nless than 200 feet of frontage on a major roadway if the property is subject to right-of-way\ncondemnation and if the platting official determines that:\n\n(1)\n\nthe property possessed more than 200 feet of frontage on the roadway before condemnation;\n\n(2)\n\nthe proposed driveway is not located in a controlled access area;\n\n(3)\n\nthe proposed driveway is the lesser of 100 feet or 60 percent of the frontage from\nthe intersection; and\n\n(4)\n\nthe driveway does not create a public safety hazard.\n\n(D)\n\nIf direct access to a major roadway is not authorized under Subsection (B) and alternative\naccess is not available, the platting official shall permit one driveway approach\nfrom the property to a major roadway.\n\n(E)\n\nThe platting official may require joint access to a major roadway for adjoining lots\nthat have insufficient frontage to allow a driveway approach for each lot under the\nrequirements of the Transportation Criteria Manual.\n\nSource: City Code Section 25-6-381; County Code Section 82.202(d)(6); Ord. 031211-11;\nOrd. 031211-42.\n\nOn the request of a condemning authority or property owner before acquisition of a\nright-of-way occurs, the platting official may modify the access requirements of this\ndivision and the Transportation Criteria Manual for a property in a major roadway\narea that is subject to right-of-way condemnation if the modification does not create\na public safety hazard or have an adverse effect on traffic operation.\n\nSource: City Code Section 25-6-382; County Code Section 82.202(d)(6)(E); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nExcept as provided in Subsection (B), a hill country roadway corridor is the land\nwithin the city's zoning jurisdiction located within 1,000 feet from each side of\nthe right-of-way of the following hill country roadways:\n\n(1)\n\nLoop 360, from US 290 West to US 183;\n\n(2)\n\nRM 620, from SH 71 to Anderson Mill Road;\n\n(3)\n\nRM 2222, from Highland Hills Drive to RM 620;\n\n(4)\n\nRM 2244, from Loop 360 to SH 71; and\n\n(5)\n\nSouthwest Parkway.\n\n(B)\n\nA hill country roadway or hill country roadway corridor excludes land within 1,000\nfeet of the right-of-way of US 183 or US 290 West.\n\nSource: City Code Sections 25-2-1103, 25-2-1104; Ord. 031211-11; Ord. 031211-42.\n\nThe minimum distance between local streets that intersect with a hill country roadway\nmust be 600 feet. The minimum distance between collector streets that intersect with\na hill country roadway must be 1,320 feet.\n\nSource: City Code Section 25-6-412; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as provided by Subsection (B), the design and construction of a connecting\nstreet that intersects with an existing divided hill country roadway must align with\nan existing median break on a hill country roadway.\n\n(B)\n\nThe single office may approve the construction of a connecting street that does not\nalign with an existing median break if alignment is not practicable.\n\nSource: City Code Section 25-6-413; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may require an improvement at the intersection of a hill country\nroadway with another street if the traffic impact from the proposed development would\ncreate safety concerns.\n\n(B)\n\nThe single office may approve the construction of a grade-separated interchange on\na hill country roadway that provides access for a single development if:\n\n(1)\n\nthe interchange is located at the intersection of a hill country roadway and an arterial\nstreet; or\n\n(2)\n\nthe location of the interchange provides spacing for weaving maneuvers at ramps.\n\nSource: City Code Section 25-6-414; Ord. 031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 38, 9-1-23.\n\n(A)\n\nA maximum of two access points is permitted from any one site to a hill country roadway.\n\n(B)\n\nThe single office may prohibit access to a hill country roadway from:\n\n(1)\n\na tract that has access to a street that intersects with a hill country roadway; or\n\n(2)\n\na tract that has frontage on a hill country roadway and that has access to a hill\ncountry roadway through an existing joint-use access easement or driveway.\n\n(C)\n\nIf access to a hill country roadway from a site described in Subsection (B) is permitted,\nthe single office shall limit access to one driveway unless:\n\n(1)\n\nthe estimated daily traffic volume for the single driveway exceeds 5,000 vehicles\nper day;\n\n(2)\n\nthe traffic using the single driveway would exceed the capacity of an intersection\ncontrolled by a stop sign during one peak street traffic hour or the peak site traffic\nhour; or\n\n(3)\n\nbased on the results of a traffic impact analysis, the single office determines that\nan additional driveway is necessary because of traffic conditions.\n\nSource: City Code Section 25-6-415; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe maximum practical spacing between driveways along a hill country roadway must\nbe provided.\n\n(B)\n\nUnless otherwise approved by the single office, a driveway providing access to a hill\ncountry roadway:\n\n(1)\n\nmust be at least 300 feet from the nearest driveway unless the driveway provides the\nonly access available for a tract of land;\n\n(2)\n\nmust have a sight distance of at least 550 feet;\n\n(3)\n\nmay not be on the inside radius of a curve; or\n\n(4)\n\nmay not access a portion of a hill country roadway that has a grade of eight percent\nor more.\n\nSource: City Code Section 25-6-416; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may require an applicant to provide an easement for a joint-use\ndriveway across the applicant's tract generally parallel with the right-of-way of\na hill country roadway for the use of an adjacent property owner that has insufficient\nfrontage for access.\n\n(B)\n\nAccess to a hill country roadway through a joint-use driveway is not permitted for\na tract that does not have frontage on a hill country roadway unless approved by the\nsingle office.\n\nSource: City Code Section 25-6-417; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nIf an applicant is required to construct a joint-use driveway, the owner of an adjacent\ntract benefited by the driveway must participate in the cost of the driveway on a\npro rata basis.\n\n(B)\n\nIf the owner of a tract that benefits from a joint-use driveway is unable to participate\nin the cost of the driveway at the time the driveway is scheduled for construction,\nthe owner of the tract on which the driveway is to be constructed may elect not to\nconstruct the driveway.\n\n(C)\n\nAn owner electing not to construct a driveway under Subsection (B) must leave sufficient\narea for the construction of the driveway.\n\n(D)\n\nIf an owner of a tract on which a driveway is to be constructed elects to construct\nthe driveway before the adjoining tract is developed, the owner of a benefited tract\nshall share in the cost of the driveway at the time the adjoining tract is developed.\n\nSource: City Code Section 25-6-418; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA calculation of the allowable impervious cover on a site on which a joint use driveway\nrequired under this division is located shall exclude:\n\n(1)\n\n110 percent of impervious cover that is required for the sole purpose of providing\naccess from adjoining land to a joint-use driveway located entirely on the site; and\n\n(2)\n\n50 percent of impervious cover that is required to provide a joint-use driveway if\na portion of the driveway is not located on the adjoining land.\n\n(B)\n\nThe impervious cover excluded from the calculation of impervious cover on a site under\nSubsection (A) does not include impervious cover that serves as a parking space or\nan aisle serving a parking space.\n\nSource: City Code Section 25-6-419; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nVehicular access to a tract of land through a joint use driveway is permitted as an\nalternative to direct access to an abutting public or private street.\n\n(B)\n\nA joint use driveway used as alternative access for a single-family residential use\nmay serve not more than eight dwelling units.\n\n(C)\n\nA joint use driveway that serves more than three residential units or non-residential\nlots must:\n\n(a)\n\ncomply with the driveway requirements of the Transportation Criteria Manual adopted\nunder Chapter 25-6 (Transportation); and\n\n(b)\n\nreceive approval from the single office and be included in construction plans submitted\nwith an application for final plat approval.\n\n(D)\n\nA joint use driveway that serves no more than three residential units or non-residential\nlots must:\n\n(a)\n\ncomply with the driveway requirements of the Transportation Criteria Manual adopted\nunder Chapter 25-6 (Transportation); and\n\n(b)\n\nreceive approval from the single office and be included in construction plans submitted\nwith an application for site plan approval.\n\n(E)\n\nConstruction plans for a joint use driveway must comply with the road access requirements\nof the Travis County Fire Code and be approved by the Fire Code Official.\n\nSource: City Code Section 25-6-451; County Code Section 82.302(d)(11); Ord. 031211-11;\nOrd. 031211-42; Ord. 20120426-137.\n\nThe centerline of a driveway on a street without curb and gutter must be at least\n100 feet from the centerline of another driveway on the same side of the street.\n\nSource: County Code Section 82.307(d)(10); Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA person who subdivides property shall install sidewalks in a subdivision in accordance\nwith state and federal accessibility standards and the Transportation Criteria Manual.\nA preliminary subdivision plan and a final plat must indicate the location of a proposed\nsidewalk.\n\n(B)\n\nThe platting board may waive the requirement to install a sidewalk based on criteria\nin the Transportation Criteria Manual.\n\n(C)\n\nThe platting official may approve the construction of a sidewalk on only one side\nof a street if the platting official determines that the limiting sidewalk construction\nto one side of the street is necessary to make the street buildable in compliance\nwith state and federal standards for access by disabled persons.\n\n(D)\n\nA sidewalk that is indicated on a recorded plat or approved site plan shall be installed\nin conjunction with the installation of a type 1 or type 2 driveway approach.\n\n(E)\n\nUntil a sidewalk required under this division is installed:\n\n(1)\n\nthe single office may not issue a certificate of compliance; and\n\n(2)\n\nthe city building official may not issue a certificate of occupancy, if required.\n\n(F)\n\nThe construction of a sidewalk or driveway approach is not complete until all utility\nconnections are complete and a cut required by the utility installation is restored.\n\nSource: City Code Section 25-6-351; County Code Section 82.202(q); Ord. 031211-11;\nOrd. 031211-42.\n",
  "start_line": 89046,
  "end_line": 89876,
  "subsections": []
}