{
  "id": "chapter-25-13",
  "title": "AIRPORT HAZARD AND COMPATIBLE LAND USE REGULATIONS",
  "level": 1,
  "parent_id": null,
  "content": "## CHAPTER 25-13. - AIRPORT HAZARD AND COMPATIBLE LAND USE REGULATIONS.\n\nIn this chapter:\n\n(1)\n\nAIRPORT means Austin-Bergstrom International Airport.\n\n(2)\n\nCONTROLLED COMPATIBLE LAND USE AREA has the meaning ascribed to it by Local Government\nCode Chapter 241.\n\n(3)\n\nNONCONFORMING, when used in reference to a land use, structure, or object of natural\ngrowth, means a land use, structure, or object of natural growth that on the date\nthis chapter became applicable to it:\n\n(a)\n\ndid not comply with the requirements of this chapter;\n\n(b)\n\ncomplied with all other applicable City regulations; and\n\n(c)\n\nfor a structure, the Federal Aviation Administration had issued a determination of\n\"no hazard\" under Code of Federal Regulations Title 14, Part 77.\n\n(4)\n\nSTRUCTURE means a temporary or permanent object constructed or installed by one or\nmore persons and includes a building, tower, smokestack, overhead transmission line,\nmobile object, and earth formation.\n\n(5)\n\nYEARLY DAY-NIGHT AVERAGE SOUND LEVEL means a sound level that is determined in accordance\nwith Code of Federal Regulations, Title 14, Part 150.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nThe airport fulfills an essential community purpose.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nThe Watershed Protection and Development Review Department is responsible for administering\nand enforcing this chapter.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nThe Board of Adjustment shall, in accordance with Local Government Code Chapter 241,\nSubchapter C, hear and decide:\n\n(1)\n\nan appeal from an order, requirement, decision, or determination made by the director\nin the enforcement of this chapter; and\n\n(2)\n\na request for a variance from a requirement of this chapter.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n(A)\n\nCode of Federal Regulations Title 14, Part 77, Subpart C establishes the following\nimaginary surfaces for the airport:\n\n(1)\n\napproach surface;\n\n(2)\n\nconical surface;\n\n(3)\n\nhorizontal surface;\n\n(4)\n\nprimary surface; and\n\n(5)\n\ntransitional surface.\n\n(B)\n\nAirport hazard zones are established as follows:\n\n(1)\n\nland beneath an approach surface is included in an approach zone;\n\n(2)\n\nland beneath a conical surface is included in a conical zone;\n\n(3)\n\nland beneath a horizontal surface is included in a horizontal zone; and\n\n(4)\n\nland beneath a transitional surface is included in a transitional zone.\n\n(C)\n\nThe airport hazard zones described in this section are depicted on an Airport Hazard\nZone Map on file with the City Department of Aviation.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B) and Article 4 (Nonconforming Uses, Structures,\nAnd Objects; Marking And Lighting), a person may not allow a structure or object of\nnatural growth to exceed the height limits of this subsection.\n\n(1)\n\nFor an approach zone, the maximum height coincides with the elevation of the approach\nsurface.\n\n(2)\n\nFor a conical zone, the maximum height coincides with the elevation of the conical\nsurface.\n\n(3)\n\nFor a horizontal zone, the maximum height coincides with the elevation of the horizontal\nsurface.\n\n(4)\n\nFor a transitional zone, the maximum height coincides with the elevation of the transitional\nsurface.\n\n(B)\n\nThe height limits of Subsection (A) do not apply to a structure or object of natural\ngrowth with a maximum height of 50 feet above the natural ground level.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n(A)\n\nAn airport hazard is a land use, structure, or object of natural growth located in\nthe controlled compatible land use area that:\n\n(1)\n\nexceeds the height limits of Section 25-13-22 (Height Limits);\n\n(2)\n\ninterferes with visual, radar, radio, or other systems for tracking, acquiring data\nrelating to, monitoring, or controlling aircraft;\n\n(3)\n\ninterferes with a pilot's ability to distinguish between airport lights and other\nlights, results in glare in the eyes of a pilot, or impairs visibility in the vicinity\nof the airport;\n\n(4)\n\ncreates a wildlife hazard, as defined by Code of Federal Regulations Title 14, Part\n139; or\n\n(5)\n\notherwise endangers or interferes with the landing, taking off, or maneuvering of\nan aircraft.\n\n(B)\n\nExcept as provided in Article 4 (Nonconforming Uses, Structures, And Objects; Marking\nAnd Lighting), a person may not create or maintain an airport hazard.\n\nSource: Ord. 010809-78; Ord. 020418-18; Ord. 031211-11.\n\n(A)\n\nWithin the controlled compatible land use area, the following airport overlay zones\nare created:\n\n(1)\n\nAirport overlay zone one (AO-1) consists of the portions of the controlled compatible\nland use area that have a yearly day-night average sound level of at least 70 decibels\nand not more than 75 decibels.\n\n(2)\n\nAirport overlay zone two (AO-2) consists of the portions of the controlled compatible\nland use area that have a yearly day-night average sound level of at least 65 decibels\nand not more than 70 decibels.\n\n(3)\n\nAirport overlay zone one (AO-3) consists of the portions of the controlled compatible\nland use area that have a yearly day-night average sound level of less than 65 decibels\nand are located within approximately one-half mile of the 65 decibel contour line.\n\n(B)\n\nThe controlled compatible land use area and the airport overlay zones are depicted\non the Austin-Bergstrom International Airport Land Use Map on file with the City Department\nof Aviation. The director of the Department of Aviation shall determine the location\nor meaning of a boundary or other feature on the map.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nIn the controlled compatible land use area, a person may not engage in a land use\nunless:\n\n(1)\n\nthe land use is permitted under this article; and\n\n(2)\n\nin the zoning jurisdiction, the land use is permitted under Chapter 25-2 (Zoning).\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nThe director shall determine the appropriate land use classification for an existing\nor proposed use or activity.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n(A)\n\nThe Airport Overlay Land Use Table in Subsection (C) prescribes the land uses that\nare permitted, permitted under certain conditions including noise level reduction\nmeasures, or prohibited in the airport overlay zones. Chapter 25-12, Article 1, Division 2 (Noise Level Reduction Measures For Certain Airport Compatible\nLand Uses) prescribes the noise level reduction measures required by this section\nfor certain land uses.\n\n(B)\n\nIn the Airport Overlay Land Use Table:\n\n(1)\n\n\"P\" means the land use and related structures are permitted.\n\n(2)\n\n\"P-25db\" means the land use and related structures are permitted, but measures to\nachieve a minimum outdoor-to-indoor noise level reduction of 25 decibels are required\nfor a structure.\n\n(3)\n\n\"P-30db\" means the land use and related structures are permitted, but measures to\nachieve a minimum outdoor-to-indoor noise level reduction of 30 decibels are required\nfor a structure.\n\n(4)\n\n\"P-25db certain areas\" means the land use and related structures are permitted, but\nmeasures to achieve a minimum outdoor-to-indoor noise level reduction of 25 decibels\nare required for a portion of a building that is a public reception area, an office,\na noise sensitive area, or an area where the normal noise level is low.\n\n(5)\n\n\"P-sound system\" means the land use and related structures are permitted, but a special\nsound reinforcement system is required.\n\n(6)\n\n\"P-25db residential\" means the land use and related structures are permitted, but\nmeasures to achieve a minimum outdoor-to-indoor noise level reduction of 25 decibels\nare required for a residential building.\n\n(7)\n\n\"P-30db residential\" means the land use and related structures are permitted, but\nmeasures to achieve a minimum outdoor-to-indoor noise level reduction of 30 decibels\nare required for a residential building.\n\n(8)\n\n\"R\" means that the land use and related structures are restricted by Section 25-13-45 (Residential And School Uses In Airport Overlay Zone Three).\n\n(9)\n\n\"X\" means the land use and related structures are prohibited.\n\n(C)\n\nAirport Overlay Land Use Table.\n\n| Land Use | AO-1 | AO-2 | AO-3 |\n| --- | --- | --- | --- |\n| Residential Uses |  |  |  |\n| All residential | X | X | R |\n| Public Uses |  |  |  |\n| Schools | X | X | R |\n| Hospitals and nursing homes | P-30db | P-30db | P-25db |\n| Churches, auditoriums, and concert halls | P-30db | P-30db | P-25db |\n| Government services | P-25db | P | P |\n| Transportation | P-25db certain areas | P | P |\n| Parking | P-25db certain areas | P | P |\n| Commercial Uses |  |  |  |\n| Hotel or motel | P-30db | P-25db | P-25db |\n| Offices, business and professional | P-25db | P | P |\n| Wholesale and retail - building materials, hardware, and farm equipment | P-25db certain areas | P | P |\n| Retail trade - general | P-25db | P | P |\n| Utilities | P-25db certain areas | P | P |\n| Communication | P-25db | P | P |\n| Manufacturing and Production Uses |  |  |  |\n| Manufacturing, general | P-25db certain areas | P | P |\n| Photographic and optical | P-25db | P | P |\n| Farming, ranching, and forestry | P-30db residential | P-25db residential | P-25db residential |\n| Mining and fishing, resource production and extraction | P | P | P |\n| Recreational Uses |  |  |  |\n| Outdoor sports arenas and spectator sports | P-sound system | P-sound system | P-sound system |\n| Outdoor music shells, amphitheaters | X | X | X |\n| Nature exhibits and zoos | X | P | P |\n| Amusements, parks, resorts, and camps | P | P | P |\n| Golf courses, riding stables, and water recreation | P-25db | P | P |\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n(A)\n\nThis section applies to a residential use or a school use located in airport overlay\nzone three.\n\n(B)\n\nThe uses are permitted only on property that:\n\n(1)\n\nis included in a recorded final plat on August 20, 2001;\n\n(2)\n\nis located in a municipal utility district on August 20, 2001; or\n\n(3)\n\nis located in a neighborhood plan combining district on December 31, 2001.\n\n(C)\n\nExcept as provided in Subsection (D), the noise level reduction measures prescribed\nby Section 25-12-12 (Measures To Achieve A Noise Level Reduction Of 25 Decibels) are required.\n\n(D)\n\nThis subsection applies to a structure constructed before August 20, 2001.\n\n(1)\n\nNoise level reduction measures are required. For the original structure, this requirement\nis satisfied by:\n\n(a)\n\ncompliance with the Energy Code in effect on August 20, 2001; or\n\n(b)\n\nincorporation of measures to achieve an outdoor-to-indoor noise level reduction of\nat least 25 decibels, as determined by the building official.\n\n(2)\n\nA portion of the structure that is replaced, rebuilt, or expanded must comply with\nthe noise level reduction measures prescribed by Section 25-12-12 (Measures To Achieve A Noise Level Reduction Of 25 Decibels).\n\n(E)\n\nA use or related structure that does not meet the requirements of this section is\nprohibited.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nExcept as otherwise provided in this article, this chapter does not require:\n\n(1)\n\na change in a nonconforming land use;\n\n(2)\n\nthe removal, lowering, or other change of a nonconforming structure or object of natural\ngrowth; or\n\n(3)\n\nany other interference in the continuation of a nonconforming land use.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nA person may not resume a nonconforming land use that the director determines has\nbeen abandoned.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nA person may not replace a nonconforming object of natural growth that has been removed\nor destroyed.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n(A)\n\nExcept as otherwise provided in Subsection (B) and Section 25-13-82 (Restriction On Permits), a person may repair, replace, rebuild, or expand a nonconforming\nstructure. The portion of a nonconforming structure that is replaced, rebuilt, or\nexpanded must comply with the noise level reduction measures prescribed by Article\n3 (Compatible Land Uses), if any.\n\n(B)\n\nMaintenance or improvement of a nonconforming structure that is prohibited by Article\n3 (Compatible Land Uses) is limited to:\n\n(1)\n\nthat required by law to comply with minimum health and safety standards; and\n\n(2)\n\nthe implementation of outdoor-to-indoor noise level reduction measures.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nThe director or the Board of Adjustment may require as a condition of approval of\na permit or variance that the owner of a structure or object of natural growth install,\noperate, and maintain on the structure or object of natural growth any markers and\nlights necessary to indicate to aircraft the presence of an airport hazard.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), a person must obtain a permit under this chapter\nfrom the director before the person may:\n\n(1)\n\nconstruct a new structure;\n\n(2)\n\nsubstantially change or repair an existing structure;\n\n(3)\n\nestablish a new use, or substantially change an existing use;\n\n(4)\n\nreplace, rebuild, or substantially change or repair a nonconforming structure;\n\n(5)\n\nreplace, substantially change, allow to grow higher, or replant a nonconforming object\nof natural growth.\n\n(B)\n\nA permit under this chapter is not required for a structure or object of natural growth\nthat:\n\n(1)\n\nis not more than 75 feet in height above the natural ground level;\n\n(2)\n\ndoes not exceed the height limits of Section 25-13-22 (Height Limits); and\n\n(3)\n\nis permitted under Section 25-13-42 (Land Uses).\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nThe director may not issue a permit that allows:\n\n(1)\n\nthe establishment of an airport hazard described in Section 25-13-23 (Airport Hazards Described And Prohibited);\n\n(2)\n\nthe establishment of a use that is prohibited by, or does not conform to the requirements\nof, Article 3 (Compatible Land Uses);\n\n(3)\n\nthe height of a nonconforming structure or object of natural growth to become greater\nthan:\n\n(a)\n\nthe height on the date this chapter became applicable to it; or\n\n(b)\n\nif the height has been reduced since that date, the height on the date of the permit\napplication; or\n\n(4)\n\na nonconforming structure, object of natural growth, or use that is an airport hazard\nto become a greater hazard than:\n\n(a)\n\nthe hazard presented on the date this chapter became applicable to it; or\n\n(b)\n\nif the degree of the hazard has been reduced since that date, the hazard presented\non the date of the permit application.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\nThe director shall issue a permit if the application complies with the requirements\nof this chapter.\n\nSource: Ord. 010809-78; Ord. 031211-11.\n\n# TITLE 30. - AUSTIN/TRAVIS COUNTY SUBDIVISION REGULATIONS.\n\n§ 25-13-83 - PERMIT ISSUANCE.\nCODE COMPARATIVE TABLE\n\n* TITLE 30. - AUSTIN/TRAVIS COUNTY SUBDIVISION REGULATIONS.\n* CHAPTER 30-1. - GENERAL PROVISIONS AND PROCEDURES.\n* ARTICLE 1. - APPLICABILITY; CONFLICTS.\n* § 30-1-1 - APPLICABILITY.\n* § 30-1-2 - CONFLICTS.\n* ARTICLE 2. - DEFINITIONS; MEASUREMENTS.\n* § 30-1-21 - DEFINITIONS.\n* § 30-1-22 - MEASUREMENTS.\n* ARTICLE 3. - ACCOUNTABLE ENTITIES.\n* § 30-1-41 - CITY COUNCIL.\n* § 30-1-42 - COMMISSIONERS COURT.\n* § 30-1-43 - LAND USE COMMISSION.\n* § 30-1-44 - MANAGING OFFICIALS.\n* § 30-1-45 - PLATTING OFFICIAL.\n* § 30-1-46 - PLATTING BOARD.\n* § 30-1-47 - SINGLE OFFICE.\n* ARTICLE 4. - ADMINISTRATIVE RULES.\n* § 30-1-61 - ADMINISTRATIVE RULES.\n* ARTICLE 5. - APPLICATION AND APPROVAL.\n* Division 1. - General Provisions.\n* § 30-1-71 - ORDER OF PROCESS.\n* § 30-1-72 - DEVELOPMENT ASSESSMENT.\n* § 30-1-73 - PROJECT ASSESSMENT.\n* § 30-1-74 - TRANSFER OF SUBDIVISION APPROVAL.\n* Division 2. - Approval and Authority; Single Office.\n* § 30-1-91 - FINAL APPROVAL.\n* § 30-1-92 - DISCRETIONARY AUTHORITY.\n* § 30-1-93 - SINGLE OFFICE STRUCTURE AND FUNCTION.\n* Division 3. - Filing; Review.\n* § 30-1-111 - AUTHORITY TO FILE AN APPLICATION.\n* § 30-1-112 - APPLICATION FILING AND REVIEW.\n* § 30-1-113 - PRELIMINARY PLAN OR PLAT APPLICATION REQUIREMENTS AND EXPIRATION.\n* § 30-1-114 - APPLICATIONS RELATING TO A CLOSED MUNICIPAL SOLID WASTE LANDFILL.\n* § 30-1-115 - PROCESSING CYCLES.\n* § 30-1-116 - SUBDIVISION CONSTRUCTION PLAN APPLICATION REQUIREMENTS AND EXPIRATION.\n* § 30-1-117 - BOARD AND COMMISSION SCHEDULE.\n* § 30-1-118 - EXTENSION OF REVIEW PERIOD.\n* § 30-1-119 - TOLLING OF APPLICATION PERIOD.\n* ARTICLE 6. - FEES AND FISCAL SECURITY.\n* § 30-1-131 - FEES.\n* § 30-1-132 - FISCAL SECURITY.\n* ARTICLE 7. - INTERESTED PARTIES AND NOTICE.\n* § 30-1-151 - APPLICABILITY.\n* § 30-1-152 - INTERESTED PARTIES.\n* § 30-1-153 - NOTICE OF PUBLIC HEARING.\n* § 30-1-154 - NOTICE OF APPLICATIONS AND ADMINISTRATIVE DECISIONS.\n* § 30-1-155 - PROCEDURES AND REQUIREMENTS FOR NOTICE.\n* ARTICLE 8. - PUBLIC HEARING PROCEDURES.\n* Division 1. - City Procedure.\n* § 30-1-171 - APPLICABILITY.\n* § 30-1-172 - CONDUCT OF PUBLIC HEARINGS.\n* § 30-1-173 - POSTPONEMENT AND CONTINUATION OF PUBLIC HEARINGS.\n* § 30-1-174 - CHANGE OF LOCATION OF PUBLIC HEARINGS.\n* § 30-1-175 - RECORD OF PUBLIC HEARING.\n* Division 2. - County Procedures.\n* § 30-1-191 - APPLICABILITY.\n* § 30-1-192 - PROCEDURE GENERALLY.\n* § 30-1-193 - ROBERT'S RULES OF ORDER.\n* § 30-1-194 - TESTIMONY TO COMMISSIONERS COURT.\n* § 30-1-195 - RECORD OF PUBLIC HEARING.\n* ARTICLE 9. - APPEALS, VARIANCES, SPECIAL EXCEPTIONS, AND ADJUSTMENTS.\n* Division 1. - City Appeals.\n* § 30-1-221 - APPLICABILITY.\n* § 30-1-222 - STANDING TO APPEAL.\n* § 30-1-223 - INITIATING AN APPEAL.\n* § 30-1-224 - INFORMATION REQUIRED IN NOTICE OF APPEAL.\n* § 30-1-225 - NOTICE TO APPLICANT CONCERNING INTERESTED PARTY.\n* § 30-1-226 - NOTICE TO PRESIDING OFFICER AND APPLICANT.\n* § 30-1-227 - MEETING TO RESOLVE ISSUES.\n* § 30-1-228 - DEVELOPMENT NOT PERMITTED DURING APPEAL.\n* § 30-1-229 - SCHEDULING OF PUBLIC HEARING.\n* § 30-1-230 - NOTICE OF PUBLIC HEARING.\n* § 30-1-231 - APPELLATE BURDEN.\n* § 30-1-232 - CONDUCT OF PUBLIC HEARING.\n* § 30-1-233 - POWER TO ACT ON APPEAL.\n* Division 2. - County Appeals.\n* § 30-1-241 - APPLICABILITY.\n* § 30-1-242 - PROCEDURE GENERALLY.\n* Division 3. - Variances.\n* § 30-1-251 - APPLICATION FOR A VARIANCE.\n* § 30-1-252 - REPORT.\n* § 30-1-253 - REVIEW BY THE ENVIRONMENTAL COMMISSION.\n* § 30-1-254 - PUBLIC HEARING AND NOTICE.\n* § 30-1-255 - ACTION ON AN APPLICATION.\n* § 30-1-256 - EFFECTIVE DATE OF VARIANCE.\n* § 30-1-257 - EXPIRATION OF VARIANCE.\n* § 30-1-258 - RESTRICTION ON SIMILAR APPLICATIONS.\n* Division 4. - Special Exceptions.\n* § 30-1-271 - EFFECT OF SPECIAL EXCEPTION.\n* § 30-1-272 - APPLICATION FOR A SPECIAL EXCEPTION.\n* § 30-1-273 - NOTICE OF APPLICATION.\n* § 30-1-274 - APPROVAL OF A SPECIAL EXCEPTION; APPEAL.\n* Division 5. - Adjustments.\n* § 30-1-291 - APPLICATION FOR ADJUSTMENT.\n* § 30-1-292 - CONSIDERATION OF APPLICATION FOR ADJUSTMENT.\n* ARTICLE 10. - SUBDIVISION CONSTRUCTION.\n* Division 1. - Applicability.\n* § 30-1-321 - APPLICABILITY.\n* Division 2. - Preconstruction Conference.\n* § 30-1-331 - PRECONSTRUCTION CONFERENCE REQUIRED.\n* § 30-1-332 - NOTICE OF CONFERENCE AND DISTRIBUTION OF PLANS.\n* § 30-1-333 - CONFERENCE PROCEDURE.\n* § 30-1-334 - MINUTES OF CONFERENCE.\n* Division 3. - Inspections; Completion of Work.\n* § 30-1-351 - DISTRIBUTION OF APPROVED PLANS.\n* § 30-1-352 - INSPECTION REQUESTS.\n* § 30-1-353 - INSPECTION RECORD CARD.\n* § 30-1-354 - INSPECTION OF EROSION AND SEDIMENTATION CONTROLS AND TREE PROTECTION MEASURES.\n* § 30-1-355 - REINSPECTION FEE.\n* § 30-1-356 - SUBSTANTIAL COMPLETION NOTICE.\n* § 30-1-357 - FINAL INSPECTION.\n* Division 4. - Acceptance.\n* § 30-1-371 - ACCEPTANCE BY THE CITY OR COUNTY.\n* ARTICLE 11. - CERTIFICATES OF COMPLIANCE.\n* § 30-1-391 - CERTIFICATE REQUIRED.\n* § 30-1-392 - ISSUANCE OF CERTIFICATE OF COMPLIANCE.\n* ARTICLE 12. - ENFORCEMENT.\n* Division 1. - Compliance Required; Inspection.\n* § 30-1-421 - COMPLIANCE WITH TITLE REQUIRED.\n* § 30-1-422 - INSPECTION.\n* Division 2. - Suspension and Revocation.\n* § 30-1-431 - SUSPENSION OF APPROVED SUBDIVISION CONSTRUCTION PLAN.\n* § 30-1-432 - SUSPENSION AND REVOCATION OF A VARIANCE OR SPECIAL EXCEPTION.\n* § 30-1-433 - REVOCATION AFTER SUSPENSION.\n* § 30-1-434 - NOTICE OF INTENT TO SUSPEND OR REVOKE.\n* § 30-1-435 - NOTICE OF SUSPENSION OR REVOCATION.\n* Division 3. - Orders.\n* § 30-1-451 - STOP WORK ORDER.\n* Division 4. - Appeal; Criminal Enforcement.\n* § 30-1-461 - APPEAL.\n* § 30-1-462 - CRIMINAL ENFORCEMENT.\n* ARTICLE 13. - AMENDMENT PROCEDURE.\n* § 30-1-481 - INITIATION OF AMENDMENT.\n* § 30-1-482 - AMENDMENT AND REVIEW BY CITY.\n* § 30-1-483 - AMENDMENT AND REVIEW BY COUNTY.\n* § 30-1-484 - JOINT ACTION REQUIRED.\n* CHAPTER 30-2. - SUBDIVISION REQUIREMENTS.\n* ARTICLE 1. - SUBDIVISION COMPLIANCE.\n* § 30-2-1 - COMPLIANCE.\n* § 30-2-2 - EXCEPTION FROM CITY PLATTING REQUIREMENTS.\n* § 30-2-3 - TEMPORARY EXEMPTION FROM CITY PLATTING REQUIREMENTS.\n* § 30-2-4 - COUNTY EXCEPTIONS TO PLATTING REQUIREMENT.\n* ARTICLE 2. - SUBDIVISION PROCEDURE.\n* Division 1. - Procedure Generally.\n* § 30-2-31 - PLANNING COMMISSION AND ZONING AND PLATTING COMMISSION RULES.\n* § 30-2-32 - RESERVED.\n* § 30-2-33 - SINGLE OFFICE ACTION WITHIN 30 DAYS.\n* § 30-2-34 - ORIGINAL TRACT REQUIREMENT.\n* § 30-2-35 - CITY BOARD AND COMMISSION REVIEW OF REQUESTS ASSOCIATED WITH SUBDIVISION APPLICATION.\n* § 30-2-36 - VARIANCE FILING AND CONSIDERATION.\n* § 30-2-37 - VARIANCE DETERMINATION.\n* § 30-2-38 - INFRASTRUCTURE CONSTRUCTION OR FISCAL SECURITY FOR PLAT APPROVAL.\n* § 30-2-39 - ACCEPTANCE OF OFFERED DEDICATION.\n* § 30-2-40 - VACATING PLAT; REPLATTING WITHOUT VACATING PLAT; AMENDING PLAT.\n* § 30-2-41 - ACTION IN 15 DAYS AFTER APPLICANT RESPONSE.\n* Division 2. - Preliminary Plans.\n* § 30-2-51 - PRELIMINARY PLAN REQUIREMENT.\n* § 30-2-52 - MASTER DEVELOPMENT PLAN.\n* § 30-2-53 - RESERVED.\n* § 30-2-54 - PREVIOUSLY APPROVED PRELIMINARY PLAN.\n* § 30-2-55 - RESERVED.\n* § 30-2-56 - STAFF REVIEW OF APPLICATION FOR PRELIMINARY PLAN APPROVAL.\n* § 30-2-57 - ACTION ON PRELIMINARY PLAN.\n* § 30-2-58 - RESERVED.\n* § 30-2-59 - EFFECT OF PRELIMINARY PLAN APPROVAL.\n* § 30-2-60 - EXPIRATION OF APPROVED PRELIMINARY PLAN.\n* § 30-2-61 - CHANGES TO AN APPROVED PRELIMINARY PLAN.\n* § 30-2-62 - APPEAL OF DISAPPROVAL OF A PRELIMINARY PLAN.\n* Division 3. - Final Plats.\n* § 30-2-81 - LAND INCLUDED IN PLAT.\n* § 30-2-82 - REVIEW OF APPLICATION FOR PLAT APPROVAL; EXPIRATION.\n* § 30-2-83 - PLAT ACKNOWLEDGMENT FOR PLAT APPROVAL.\n* § 30-2-84 - PLAT APPROVAL AUTHORITY AND CRITERIA.\n* § 30-2-85 - RECORDATION.\n* § 30-2-86 - APPEAL OF DISAPPROVAL OF PLAT.\n* § 30-2-87 - INFORMATION AND NOTICE REQUIRED ON COVER PAGE.\n* Division 4. - Construction.\n* § 30-2-100 - SUBDIVISION CONSTRUCTION PLAN APPROVAL AUTHORITY AND CRITERIA.\n* § 30-2-101 - ACTION ON SUBDIVISION CONSTRUCTION PLAN; DEADLINE.\n* § 30-2-102 - UPDATES PERMITTED AFTER APPLICATION IS DENIED.\n* § 30-2-103 - CONSTRUCTION MANAGEMENT AND CERTIFICATION.\n* § 30-2-104 - SUBDIVISION CONSTRUCTION PLAN.\n* § 30-2-105 - EXPIRATION OF SUBDIVISION CONSTRUCTION PLAN.\n* ARTICLE 3. - PLATTING REQUIREMENTS.\n* Division 1. - Property Markers, Easements, and Alleys.\n* § 30-2-131 - PROPERTY MARKERS.\n* § 30-2-132 - EASEMENTS AND ALLEYS.\n* § 30-2-133 - EASEMENTS IN AREAS ADJOINING PROPOSED SUBDIVISION.\n* Division 2. - Streets.\n* § 30-2-151 - STREET ALIGNMENT.\n* § 30-2-152 - DEAD-END STREETS.\n* § 30-2-153 - BLOCK LENGTH.\n* § 30-2-154 - STREET DESIGN AND CONSTRUCTION.\n* § 30-2-155 - STREET NAMES.\n* § 30-2-156 - STREET SIGNS.\n* § 30-2-157 - TRAFFIC CONTROL.\n* § 30-2-158 - SUBDIVISION ACCESS STREETS.\n* § 30-2-159 - PRIVATE STREETS.\n* Division 3. - Lots.\n* § 30-2-171 - ACCESS TO LOTS.\n* § 30-2-172 - THROUGH LOTS IN A SINGLE-FAMILY SUBDIVISION.\n* § 30-2-173 - LOT ARRANGEMENT.\n* § 30-2-174 - LOT SIZE.\n* § 30-2-175 - LOTS ON STREETS WITHOUT CURB AND GUTTER.\n* § 30-2-176 - FLAG LOTS.\n* Division 4. - Utilities.\n* § 30-2-191 - WATER LINES.\n* § 30-2-192 - WASTEWATER LINES.\n* § 30-2-193 - GAS LINES.\n* § 30-2-194 - INSTALLATION OF LINES.\n* § 30-2-195 - REQUESTS FOR UTILITY SERVICE.\n* § 30-2-196 - INDEPENDENT UTILITY DISTRICTS AND PRIVATE WATER AND SEWER CORPORATIONS.\n* § 30-2-197 - SUBDIVISIONS WHERE WATER OR WASTEWATER SERVICES ARE NOT AVAILABLE.\n* § 30-2-198 - PRIVATE ON-SITE SEWAGE FACILITY.\n* § 30-2-199 - STREET LIGHTS.\n* Division 5. - Parkland Dedication.\n* § 30-2-211 - DEFINITIONS.\n* § 30-2-212 - PARK SERVICE PROVIDER DETERMINATION.\n* § 30-2-213 - APPLICABILITY.\n* § 30-2-214 - DEDICATION OF PARKLAND REQUIRED.\n* § 30-2-215 - STANDARDS FOR DEDICATED PARKLAND.\n* § 30-2-216 - PRIVATE PARKLAND.\n* § 30-2-217 - PAYMENT INSTEAD OF LAND.\n* § 30-2-218 - SUBMITTAL REQUIREMENTS.\n* Division 6. - Special Subdivisions.\n* § 30-2-231 - TOWNHOUSE LOTS.\n* § 30-2-232 - SMALL LOT SUBDIVISIONS.\n* § 30-2-233 - SINGLE-FAMILY ATTACHED RESIDENTIAL SUBDIVISION.\n* CHAPTER 30-3. - TRANSPORTATION.\n* ARTICLE 1. - RESERVATION AND DEDICATION OF RIGHT-OF-WAY.\n* Division 1. - General Provisions.\n* § 30-3-1 - APPLICABILITY.\n* § 30-3-2 - ESTABLISHING BUILDING LINES.\n* Division 2. - Reservation and Dedication of Right of Way.\n* § 30-3-21 - RESERVATION OF RIGHT-OF-WAY.\n* § 30-3-22 - CONSTRUCTING A STRUCTURE OR IMPROVEMENT IN RIGHT-OF-WAY PROHIBITED.\n* § 30-3-23 - MEASURING SETBACKS.\n* § 30-3-24 - ALIGNMENT.\n* § 30-3-25 - DEDICATION OF RIGHT-OF-WAY.\n* § 30-3-26 - AGREEMENT FOR TEMPORARY USE OF RESERVED RIGHT-OF-WAY.\n* Division 3. - Waivers and Variances.\n* § 30-3-41 - WAIVER REQUEST.\n* § 30-3-42 - NOTICE OF WAIVER REQUEST.\n* § 30-3-43 - ACTION ON WAIVER.\n* § 30-3-44 - APPEAL OF DENIAL OF WAIVER.\n* § 30-3-45 - AMENDING DEVELOPMENT APPLICATION.\n* § 30-3-46 - VARIANCE FROM DEDICATION REQUIREMENTS.\n* ARTICLE 2. - STREET DESIGN.\n* Division 1. - Roadways Generally.\n* § 30-3-71 - STANDARDS FOR DESIGN AND CONSTRUCTION.\n\n§ 25-13-83 - PERMIT ISSUANCE.\nCODE COMPARATIVE TABLE\n",
  "start_line": 82284,
  "end_line": 83081,
  "subsections": []
}