{
  "id": "chapter-25-3",
  "title": "TRADITIONAL NEIGHBORHOOD DISTRICT",
  "level": 1,
  "parent_id": null,
  "content": "## CHAPTER 25-3. - TRADITIONAL NEIGHBORHOOD DISTRICT.\n\nThis chapter regulates the design and development of a traditional neighborhood zoning\ndistrict.\n\nSource: Section 13-9-1; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe purpose of a traditional neighborhood district is to encourage mixed-use, compact\ndevelopment that is sensitive to the environmental characteristics of the land and\nfacilitates the efficient use of services. A traditional neighborhood district diversifies\nand integrates land uses within close proximity to each other, and it provides for\nthe daily recreational and shopping needs of the residents. A traditional neighborhood\ndistrict is a sustainable, long-term community that provides economic opportunity\nand environmental and social equity for the residents.\n\n(B)\n\nA traditional neighborhood district is designed to ensure the development of land\nas a traditional neighborhood. Its design adopts the urban conventions which were\nthe norm in the United States from colonial times until the 1940's. A traditional\nneighborhood district is characterized by the following design elements:\n\n(1)\n\nneighborhoods that are limited in size and oriented toward pedestrian activity;\n\n(2)\n\na variety of housing types, jobs, shopping, services, and public facilities;\n\n(3)\n\nresidences, shops, workplaces, and civic buildings interwoven within the neighborhood,\nall within close proximity;\n\n(4)\n\na network of interconnecting streets and blocks that maintains respect for the natural\nlandscape;\n\n(5)\n\nnatural features and undisturbed areas that are incorporated into the open space of\nthe neighborhood;\n\n(6)\n\na coordinated transportation system with a hierarchy of appropriately designed facilities\nfor pedestrians, bicycles, public transit, and automotive vehicles;\n\n(7)\n\nwell-configured squares, plazas, greens, landscaped streets, preserves, greenbelts,\nand parks woven into the pattern of the neighborhood and dedicated to the collective\nsocial activity, recreation, and visual enjoyment of the populace;\n\n(8)\n\ncivic buildings, open spaces, and other visual features that act as landmarks, symbols,\nand focal points for community identity;\n\n(9)\n\ncompatibility of buildings and other improvements as determined by their arrangement,\nbulk, form, character, and landscaping to establish a livable, harmonious, and diverse\nenvironment;\n\n(10)\n\nprivate buildings that form a consistent, distinct edge and define the border between\nthe public street space and the private block interior; and\n\n(11)\n\narchitecture and landscape that respond to the unique character of the region.\n\nSource: Section 13-9-2; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA traditional neighborhood district consists of an area of not less than 40 contiguous\nacres and not more than 250 contiguous acres. In this chapter, property is considered\ncontiguous even if separated by a public roadway.\n\n(B)\n\nA traditional neighborhood district is divided into at least two types of Areas, and\neach type of Area has different land use and site development regulations. A traditional\nneighborhood district must have one Neighborhood Center Area and at least one Mixed\nResidential Area. A traditional neighborhood district may also have a Neighborhood\nEdge Area, a Workshop Area, or an Employment Center Area.\n\n(C)\n\nA Neighborhood Center Area serves as the focal point of a traditional neighborhood\ndistrict, containing retail, commercial, civic, and public services to meet the daily\nneeds of community residents. A Neighborhood Center is pedestrian-oriented, and it\nis designed to encourage pedestrian movement between a Mixed Residential Area and\na Neighborhood Center Area. A square is required in a Neighborhood Center Area. Retail\nand commercial uses should generally be located adjacent to a square. Neighborhood\nCenter Area uses include retail shops, restaurants, offices, banks, hotels, post office,\ngovernmental offices, churches, community centers, and attached residential dwellings.\n\n(D)\n\nA Mixed Residential Area includes a variety of residential land uses including single-family\nresidential, duplex, townhouse, and multi-family. Residential scale retail and commercial\nuses are permitted within a Mixed Residential area with strict architectural and land\nuse controls. Retail and commercial uses in a Mixed Residential area are required\nto blend into the residential character of the neighborhood. A Mixed Residential area\nincludes open spaces including small squares, pocket parks, community parks, and greenbelts.\nA Mixed Residential Area promotes pedestrian activity through well designed and varied\nstreetscapes that also provide for the safe and efficient movement of vehicular traffic.\nMixed Residential Area uses include single-family homes, condominiums, townhouses,\napartments, offices, restaurants, neighborhood scale retail, and civic uses.\n\n(E)\n\nA Neighborhood Edge Area is the least dense portion of a traditional neighborhood\ndistrict, with larger lots and greater setbacks than the rest of the neighborhood.\nAlleys are not required, and direct vehicular access to the street is permitted. Only\nsingle family residential dwellings are permitted. A Neighborhood Edge Area is appropriate\nalong the perimeter of the neighborhood. A portion of a traditional neighborhood district\nthat adjoins existing or platted conventional low density housing must be designated\nas a Neighborhood Edge Area.\n\n(F)\n\nA traditional neighborhood district may have a Workshop Area, an Employment Center\nArea, or both. Commercial and light industrial uses that are not appropriate for a\nNeighborhood Center Area or a Mixed Residential Area but which serve the local residents\nmay be located in a Workshop Area. Large office and low-impact manufacturing uses\nmay be located within an Employment Center Area. The scale and architectural conventions\nof a traditional neighborhood district apply to a Workshop area and an Employment\nCenter Area.\n\n(G)\n\nCivic uses that are oriented to the general public are permitted in a Neighborhood\nCenter Area and a Mixed Residential Area. These uses are essential components of the\nsocial and physical fabric of a traditional neighborhood district. Special attention\nshould be paid to the location of government offices, libraries, museums, schools,\nchurches, and other prominent public buildings to create focal points and landmarks\nfor the community. The locations of these major public civic uses are designated on\nthe Development Plan at the time of zoning approval.\n\n(H)\n\nOpen space is a significant part of a traditional neighborhood district design. Formal\nand informal open spaces are required. These serve as areas for community gatherings,\nlandmarks, and as organizing elements for the neighborhood. Open space includes squares,\nplazas, greens, preserves, parks, and greenbelts.\n\n(I)\n\nA traditional neighborhood district is designed to be pedestrian oriented. To accomplish\nthis goal, street pattern and design is used to reduce vehicle travel speeds and encourage\npedestrian activity. An interconnected network of streets and alleys is required.\nStreets may be smaller than in conventional development and more varied in size and\nform to control traffic and give character to the neighborhood.\n\nSource: Section 13-9-3; Ord. 990225-70; Ord. 000309-39; Ord. 031211-11.\n\nIn this chapter:\n\n(1)\n\nCOMMUNITY PARKING FACILITY means an off-site parking lot or garage that provides required\nparking for some or all of the uses within a Neighborhood Center Area.\n\n(2)\n\nCRITERIA MANUAL means a manual containing administrative rules adopted in accordance\nwith Chapter 1-2 (Adoption of Rules) of the City Code.\n\n(3)\n\nDIRECTOR means the director of the Neighborhood Planning and Zoning Department of\nthe City of Austin.\n\n(4)\n\nFRONTAGE BUILDOUT means the length of a front building facade compared to the length\nof the front lot line, expressed as a percentage.\n\n(5)\n\nGREEN means an open space available for unstructured recreation, its landscaping consisting\nof grassy areas and trees.\n\n(6)\n\nGREENBELT means a series of connected open spaces that may follow natural features\nsuch as ravines, creeks, or streams.\n\n(7)\n\nMAJOR CIVIC USE includes Administrative and Business Offices use by a governmental\nentity, College and University Facilities use, Cultural Services use, Postal Facilities\nuse, Private Primary Educational Facilities use, Private Secondary Educational Facilities\nuse, Public Primary Educational Facilities use, Public Secondary Educational Facilities\nuse, Religious Assembly use, Safety Services use, and Transportation Terminal use.\n\n(8)\n\nMAJOR PRIVATE OPEN SPACE IMPROVEMENTS include swimming pools, tennis courts, basketball\ncourts, sports fields, recreation centers, and community meeting halls.\n\n(9)\n\nOPEN SPACE includes squares, plazas, greens, preserves, parks, and greenbelts.\n\n(10)\n\nPARK means an open space, available for recreation, its landscape consisting of paved\npaths and trails, some open lawn, trees, open shelters, or recreational facilities.\n\n(11)\n\nPLAZA means open space at the intersection of important streets, set aside for civic\npurposes and commercial activity, including parking, its landscape consisting of durable\npavement and formal tree plantings.\n\n(12)\n\nPRESERVE means open space that preserves or protects endangered species, a critical\nenvironmental feature, or other natural feature.\n\n(13)\n\nPRIVATE OPEN SPACE means open space that is owned and maintained by a Property Owners'\nAssociation or an individual property owner.\n\n(14)\n\nPUBLIC OPEN SPACE means open space that is owned and maintained by the City.\n\n(15)\n\nSIDE YARD HOUSE means a dwelling built adjacent to an interior side lot line with\na yard adjacent to the opposite side lot line.\n\n(16)\n\nSQUARE means open space that may encompass an entire block, is located at the intersection\nof important streets, and is set aside for civic purposes, with landscape consisting\nof paved walks, lawns, trees, and civic buildings.\n\n(17)\n\nSTREETSCAPE means the area within a street right of way that contains sidewalks, street\nfurniture, landscaping, or trees.\n\nSource: Section 13-9-4; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nThe Land Development Code applies to a traditional neighborhood district and development\nwithin it unless this chapter expressly provides otherwise.\n\n(B)\n\nThe requirements of this chapter supersede any inconsistent provisions of the City\nCode or other ordinance.\n\n(C)\n\nThe following provisions of the Land Development Code do not apply to a traditional\nneighborhood district or development within it:\n\n(1)\n\nChapter 25-2, Subchapter B, Article 2, Division 2 (Conditional Overlay Combining Districts), Division 4 (Neighborhood Conservation Combining District), Division 5 (Planned Unit Developments), and Division 6 (Planned Development Areas; Mixed Use Combining Districts);\n\n(2)\n\nChapter 25-2, Subchapter C, Article 3, Division 5 (Combining and Overlay Districts);\n\n(3)\n\nChapter 25-2, Subchapter C, Article 10 (Compatibility Standards);\n\n(4)\n\nSection 25-2-773 (Duplex, Two-Unit and Three-Unit Residential Uses);\n\n(5)\n\nSection 25-2-775 (Townhouses);\n\n(6)\n\nSection 25-2-776 (Condominium Residential Use);\n\n(7)\n\nSection 25-2-894 (Accessory Uses for a Principal Commercial Use);\n\n(8)\n\nSection 25-2-901 (Accessory Apartments);\n\n(9)\n\nChapter 25-4, Article 3 (Platting Requirements), except for Section 25-4-134 (Hazardous Pipelines);\n\n(10)\n\nChapter 25-5 (Site Plans);\n\n(11)\n\nChapter 25-6, Article 4, Division 2 (Roadways in Water Supply Rural Watersheds or Water Supply Suburban Watersheds);\n\n(12)\n\nChapter 25-6, Article 7 (Off-Street Parking and Loading); and\n\n(13)\n\nSection 25-6-171 (Standards for Design and Construction).\n\nSource: Section 13-9-5; Ord. 990225-70; Ord. 030410-12; Ord. 031211-11; Ord. No. Ord. No. 20231207-001, Pt. 18, 12-18-23.\n\nOnly property in the full purpose limits of the city may be designated as a traditional\nneighborhood zoning district.\n\nSource: Ord. 031211-42.\n\nA traditional neighborhood district is a zoning district that is created in the same\nmanner as other zoning districts. The procedures in Chapter 25-2, Subchapter B (Zoning Procedures; Special Requirements for Certain Districts) apply to a traditional neighborhood zoning district. Additional requirements are\ndescribed in this article.\n\nSource: Section 13-9-11; Ord. 990225-70; Ord. 031211-11.\n\nAn application for zoning or rezoning to a traditional neighborhood district may not\nbe accepted for filing before the applicant meets with the director or the director's\ndesignee in a presubmittal meeting. The purpose of the meeting is to acquaint the\ncity staff with the proposed development, provide the applicant with preliminary staff\ncomments, and identify major concerns or the need for additional data. Discussion\ntopics at the meeting must include transportation, the environment, drainage, land\nuse, and design concepts.\n\nSource: Section 13-9-12; Ord. 990225-70; Ord. 031211-11.\n\nAn applicant for a traditional neighborhood district shall prepare a Development Plan\nas part of the zoning application. The Development Plan must contain the following\ninformation:\n\n(1)\n\nlocations and sizes of the Neighborhood Center Area, Mixed Residential Area, and,\nif applicable, Neighborhood Edge Area, Workshop Area, and Employment Center Area;\n\n(2)\n\nlocations of major civic uses;\n\n(3)\n\nlocations of commercial uses in Mixed Residential Areas;\n\n(4)\n\nlayout of the transportation network for all modes of travel;\n\n(5)\n\nlocations and sizes of private open space and public open space;\n\n(6)\n\nlocations and descriptions of proposed major private open space improvements;\n\n(7)\n\na construction phasing plan for major private open space improvements, if needed;\n\n(8)\n\nlocations and types of drainage and water quality controls;\n\n(9)\n\nlocations and types of environmentally sensitive areas, including critical environmental\nfeatures, critical water quality zones, and water quality transition zones;\n\n(10)\n\na tree protection plan, including an aerial photograph, that demonstrates that the\ndesign of the traditional neighborhood district will result in the reasonable preservation\nof protected trees and significant tree clusters;\n\n(11)\n\nthe 100-year floodplain, as calculated to exist under fully developed conditions in\naccordance with the Drainage Criteria Manual;\n\n(12)\n\nthe locations of major utility facilities and easements that are within or immediately\nadjacent to the proposed traditional neighborhood district;\n\n(13)\n\npreliminary architectural standards that are consistent with the architectural objectives\nof this chapter; and\n\n(14)\n\nall additional information required by the director to demonstrate compliance with\nthe traditional neighborhood district concept.\n\nSource: Section 13-9-13; Ord. 990225-70; Ord. 031211-11.\n\nThe Development Plan for the traditional neighborhood district shall be included in\nthe ordinance zoning or rezoning the land as a traditional neighborhood district.\n\nSource: Section 13-9-14; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA minor revision to a Development Plan may not be made to an area that is part of\na final plat. The director may administratively approve minor revisions to a Development\nPlan if the director determines that there are no adverse effects on areas that are\npart of a final plat. The following are minor revisions:\n\n(1)\n\nThe location of a Neighborhood Center Area, a Mixed Residential, a Neighborhood Edge\nArea, a Workshop Area, or an Employment Center Area may be revised if the director\ndetermines that (a) the basic layout of the traditional neighborhood district remains\nthe same, and (b) the district functions as well as before the revision.\n\n(2)\n\nThe size of a Neighborhood Center Area, a Mixed Residential, a Neighborhood Edge Area,\na Workshop Area, or an Employment Center Area may be revised if the size is increased\nor decreased by not more than 10 percent, and the director determines that (a) the\nbasic layout of the traditional neighborhood district remains the same, and (b) the\ndistrict functions as well as before the revision.\n\n(3)\n\nThe location of a major civic use may be revised if the director determines that (a)\nthe revised location is appropriate, and (b) the transportation network, the infrastructure,\nand the overall land use mix are not adversely affected. The director may not approve\na revision that includes the addition of a major civic use within 200 feet of an area\nthat is part of a final plat in a Mixed Residential Area or Neighborhood Edge Area.\n\n(4)\n\nThe location of a commercial use in a Mixed Residential Area may be revised if the\ndirector determines that the revised location is appropriate.\n\n(5)\n\nThe layout of a transportation network may be revised if the director determines that\n(a) the basic layout remains the same, and (b) the revised layout functions as well\nas the previous layout.\n\n(6)\n\nThe location or size of a private open space may be revised if the overall amount\nof private open space acreage does not decrease, and the director determines that\nthe quality and functionality of the revised private open space is the same or better.\nThe director may not approve a revision that includes the deletion of a private open\nspace within 200 feet of an area that is part of a final plat in a Mixed Residential\nArea or Neighborhood Edge Area.\n\n(7)\n\nThe location or size of a public open space may be revised if the overall amount of\npublic open space acreage does not decrease, and the director determines that the\nquality and functionality of the revised public open space is the same or better.\nThe director may not approve a revision that includes the deletion of a public open\nspace within 200 feet of an area that is part of a final plat in a Mixed Residential\nArea or Neighborhood Edge Area. The location or size of a public open space may not\nbe revised without the approval of the director of the Parks and Recreation Department.\n\n(8)\n\nThe location or description of a major private open space improvement may be revised\nif the director determines that the revised improvement is as beneficial to the residents\nas the previous improvement.\n\n(9)\n\nA construction phasing plan for major private open space improvements may be revised\nto extend a deadline by not more than 18 months.\n\n(10)\n\nThe location or type of a drainage or water quality control may be revised if the\ndirector determines that (a) the basic layout of the traditional neighborhood district\nremains the same, and (b) the revised location or type of control functions as well\nas the previous location or type of control.\n\n(11)\n\nThe location or type of an environmentally sensitive area may be revised if the director\ndetermines that the revision more accurately describes the location or type of an\nenvironmentally sensitive area.\n\n(12)\n\nA tree protection plan may be revised if the director determines that the revised\nplan provides the same or more protection for trees overall.\n\n(13)\n\nThe location of a 100 year floodplain may be revised if the director determines that\nthe revision more accurately describes the location of the floodplain.\n\n(14)\n\nThe locations of major utility facilities and easements may be revised if the director\ndetermines that the revised locations are more appropriate or functional.\n\n(15)\n\nA preliminary architectural standard may be revised if the director determines that\nthe revised standard is consistent with the architectural character of the traditional\nneighborhood district.\n\n(B)\n\nAll revisions other than those described in Subsection (A) are major revisions. Major\nrevisions must be approved by the city council through a rezoning of the property.\n\nSource: Section 13-9-15; Ord. 990225-70; Ord. 031211-11.\n\nThe city council may, at the time a traditional neighborhood district is created,\nmodify the permitted uses or the site development regulations set forth in this chapter.\nThe modifications must be included in the ordinance zoning or rezoning the property.\nModifications may be permitted only if justified by exceptional circumstances and\nmust be consistent with the character of the traditional neighborhood district.\n\nSource: Section 13-9-16; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe specific land uses for a Workshop Area or an Employment Center Area must be proposed\nby the applicant, approved by the city council, and included in the ordinance zoning\nor rezoning the property. Those land uses must be consistent with this section.\n\n(B)\n\nA Workshop Area is for commercial and light industrial uses that are not appropriate\nfor a Neighborhood Center Area or Mixed Residential Area but which serve the local\nresidents.\n\n(C)\n\nAn Employment Center Area is for large office and low-impact manufacturing uses.\n\nSource: Section 13-9-17; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nSingle family residential use is permitted in a Neighborhood Edge Area.\n\n(B)\n\nA major civic use is permitted in a Neighborhood Edge Area if shown on the Development\nPlan.\n\n(C)\n\nAll other uses are prohibited in a Neighborhood Edge Area.\n\nSource: Section 13-9-18; Ord. 990225-70; Ord. 031211-11.\n\nThe table below lists the permitted uses within a Neighborhood Center Area and a Mixed\nResidential Area of a traditional neighborhood district. \"MRA\" means Mixed Residential\nArea, \"NCA\" means Neighborhood Center area, \"P\" means that a use is permitted, \"P\\*\"\nmeans that a use is permitted but subject to Section 25-3-105 (Additional Regulations For Neighborhood Center Area), and \"X\" means that a use is\nnot permitted. Uses not listed in the table are not permitted.\n\n| TABLE OF PERMITTED USES | | |\n| --- | --- | --- |\n| Residential Uses | MRA | NCA |\n| Condominiums | P | P\\* |\n| Duplex Residential | P | X |\n| Group Residential | P | P\\* |\n| Lodging House Residential | P | P\\* |\n| Multi-Family Residential | P | P\\* |\n| Retirement Housing (Large Site) | X | P\\* |\n| Retirement Housing (Small Site) | P | P\\* |\n| Single Family Residential | P | X |\n| Townhouse Residential | P | P\\* |\n|  |  |  |\n| Commercial Uses | MRA | NCA |\n| Administrative & Business Office | P | P |\n| Art Gallery | P | P |\n| Art Workshop | X | P |\n| Automotive Rentals | X | P\\* |\n| Automotive Repair Services | X | P\\* |\n| Building Maintenance Services | X | P |\n| Business or Trade School | X | P |\n| Business Support Services | X | P |\n| Cocktail Lounge | P | P |\n| Commercial Blood Plasma Center | X | P |\n| Commercial Off-Street Parking | X | P\\* |\n| Communications Services | X | P |\n| Consumer Convenience Services | P | P |\n| Consumer Repair Services | P | P |\n| Drop-off Recycling Collection Facility | X | P |\n| Electronic Prototype Assembly | X | P |\n| Exterminating Services | X | P |\n| Financial Services | X | P |\n| Food Preparation | X | P |\n| Food Sales | P | P |\n| General Retail Sales (Convenience) | P | P |\n| General Retail Sales (General) | X | P |\n| Hotel-Motel | X | P |\n| Indoor Entertainment | X | P |\n| Indoor Sports & Recreation | X | P |\n| Kennels | X | P\\* |\n| Liquor Sales | X | P |\n| Medical Offices | P | P |\n| Off-site Accessory Parking | X | P |\n| Outdoor Sports & Recreation | P | P |\n| Pawn Shop Services | X | P |\n| Personal Improvement Services | P | P |\n| Personal Services | P | P |\n| Pet Services | P | P |\n| Printing and Publishing | X | P |\n| Professional Office | P | P |\n| Research Assembly Services | X | P |\n| Restaurant (General) | P | P |\n| Restaurant (Limited) | P | P |\n| Service Station | X | P\\* |\n| Software Development | P | P |\n| Theater | X | P |\n|  |  |  |\n| Industrial Uses | MRA | NCA |\n| Custom Manufacturing | X | P |\n|  |  |  |\n| Civic Uses | MRA | NCA |\n| Club or Lodge | P | P |\n| College & University Facilities | X | P |\n| Communication Service Facilities | P | P |\n| Community Recreation (Private) | P | P |\n| Community Recreation (Public) | P | P |\n| Congregate Living | X | P |\n| Convalescent Services | X | P |\n| Cultural Services | P | P |\n| Day Care Services (Commercial) | X | P |\n| Day Care Services (General) | P | P |\n| Day Care Services (Limited) | P | P |\n| Family Home | P | P |\n| Group Home, Class I (General) | P | P |\n| Group Home, Class I (Limited) | P | P |\n| Group Home, Class II | P | P |\n| Guidance Services | X | P |\n| Hospital Services (Limited) | X | P |\n| Local Utility Services | P | P |\n| Major Utility Facilities | P | P |\n| Park & Recreation Services (General) | P | P |\n| Park & Recreation Services (Special) | P | P |\n| Postal Facilities | X | P |\n| Private Primary Educational Facilities | P | P |\n| Private Secondary Educational Facilities | P | P |\n| Public Primary Educational Facilities | P | P |\n| Public Secondary Educational Facilities | P | P |\n| Religious Assembly | P | P |\n| Safety Services | P | P |\n| Telecommunications Tower | X | P\\* |\n| Transportation Terminal | X | P |\n\nSource: Section 13-9-19; Ord. 990225-70; Ord. 031211-11; Ord. 031211-41; Ord. 040617-Z-1.\n\nThe subdivision procedures in Chapter 25-4 (Subdivision) apply to the traditional neighborhood district, except as follows:\n\n(1)\n\nAll property within a traditional neighborhood district must be subdivided under this\nchapter. A previously approved final subdivision plat must be vacated, and a previously\napproved preliminary subdivision plan must be withdrawn.\n\n(2)\n\nThe traditional neighborhood district shall be on one preliminary subdivision plan.\n\n(3)\n\nAn open space area shall be included in the final subdivision plat of adjacent property.\nAll open space areas must be platted as separate open space lots.\n\n(4)\n\nA final subdivision plat may not be approved unless there has been compliance with\nthe provisions of this chapter relating to a Property Owners' Association, Architectural\nStandards, Land Use Allocations, Drainage, and Water Quality.\n\n(5)\n\nA final subdivision plat for more than 50 percent of the land area covered by the\npreliminary subdivision plan may not be approved until construction of the community\nmeeting hall has begun. Once begun, the construction of the community meeting hall\nmust be diligently pursued to completion.\n\n(6)\n\nImprovements to private open spaces, except those included in a construction phasing\nplan for major private open space improvements, shall be constructed by the subdivider\nas part of the subdivision infrastructure.\n\nSource: Section 13-9-31; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nStreet monuments and property markers.\n\n(1)\n\nProperty pins or other forms of permanent markers identified in the most recent edition\nof the Manual of Practice for Land Surveying in Texas, published by the Texas Society\nof Professional Surveyors, shall be placed by the surveyor at all corners of boundary\nlines of a subdivision. Pins and markers may not be spaced more than 1,300 feet apart.\nOne corner of the subdivision shall be identified by a concrete monument unless a\nconcrete monument exists on an adjacent platted subdivision within 1,300 feet of the\nproposed plat.\n\n(2)\n\nIf a concrete monument exists on an adjacent platted subdivision within 1,300 feet\nof the proposed plat, no concrete monuments are required for the proposed plat. In\nthat instance, boundary corners may be set with permanent markers identified in the\nmost recent edition of Manual of Practice for Land Surveying in Texas.\n\n(3)\n\nIntermediate property corners, curve points, and angle points shall be marked by iron\nstakes.\n\n(B)\n\nEasements for public utilities and enclosed or open drainage ways shall be retained\nin all subdivisions in the widths and locations deemed necessary by the director.\nTo the extent practicable, the easements for water lines, wastewater lines, and storm\nsewers shall be located in the street rights-of-way, and the easements for all other\nutilities shall be located in the alley rights-of-way. All the easements shall be\ndedicated to public use for the named purpose and shall be aligned to minimize construction\ncost.\n\n(C)\n\nUtilities shall be located underground unless this requirement is, for good cause,\nwaived by the director, and, if applicable, the director of the Electric Utility Department.\n\n(D)\n\nWhen the director finds that easements in areas adjoining a proposed subdivision are\nnecessary to provide adequate drainage or to serve the subdivision with utilities,\nthe subdivider shall obtain the easements or make arrangements with the City to obtain\nthem.\n\n(E)\n\nStreets of new subdivisions shall be aligned with existing streets on adjoining property\nunless the Land Use Commission determines that the Comprehensive Plan, topography,\nrequirements of traffic circulation, or other considerations make it desirable to\ndepart from the alignment.\n\n(F)\n\nEach lot in a subdivision, except a lot that fronts on a plaza and abuts an alley,\nshall abut a dedicated public street.\n\n(G)\n\nExcept in a Neighborhood Edge Area, each lot in a subdivision shall abut an alley\nunless the director determines that good cause exists to omit an alley or portion\nof an alley.\n\n(H)\n\nAn interconnected network of streets is required unless the director determines that\ngood cause exists to require a different street pattern.\n\n(I)\n\nStreets, alleys, and pedestrian paths shall be designed and constructed in accordance\nwith this chapter, the Traditional Neighborhood District Criteria Manual, the Standards\nCriteria Manual, and the Standard Specifications Criteria Manual.\n\n(J)\n\nNew streets in subdivisions shall be named to provide continuity of name with existing\nstreets and to prevent conflict with identical or similarly spelled or pronounced\nnames in other parts of the city's planning jurisdiction.\n\n(K)\n\nStreet intersections, whether public or private streets, shall be designed in accordance\nwith the provisions of the Traditional Neighborhood District Criteria Manual and the\nTransportation Criteria Manual.\n\n(L)\n\nDead-end streets are prohibited unless the director determines that the most desirable\nplan requires laying out a dead-end street. A dead-end street shall terminate in a\ncourtyard designed in accordance with the Traditional Neighborhood District Criteria\nManual, unless the director determines that topography, density, adequate circulation,\nor other unusual conditions require a deviation from the design criteria in the Traditional\nNeighborhood District Criteria Manual.\n\n(M)\n\nThe side lines of lots in subdivisions shall be approximately at right angles to straight\nstreet lines or radial to curved street lines. An arrangement placing adjacent lots\nat right angles to each other shall be avoided.\n\n(N)\n\nBlock length may not exceed 600 feet. Block width may not exceed 300 feet. The director\nmay approve a block width of not more than 400 feet or a block length of not more\nthan 1000 feet if required because of topography or existing street layout, but a\nblock longer than 800 feet must be traversed by a pedestrian path near the midpoint.\n\n(O)\n\nMinimum lot size, maximum lot size, and minimum lot width are specified in the site\ndevelopment regulations contained in this chapter for a Neighborhood Center Area,\na Mixed Residential Area, a Neighborhood Edge Area, a Workshop Area, and an Employment\nCenter Area. Open space lots must comply with the dimensional requirements of this\nchapter.\n\n(P)\n\nTownhouse lots may be created where each townhouse lot is to be served by a public\nsewage system, subject to the following conditions in addition to those applicable\nto all other subdivisions:\n\n(1)\n\nAll common areas shall be clearly identified on the plat and adequate provisions made\nfor maintenance and taxation.\n\n(2)\n\nThere may be not less than two and not more than eight units in a townhouse group.\n\n(3)\n\nNot more than one townhouse may be located on a lot.\n\n(4)\n\nA legal opinion by an attorney licensed to practice law in the state, accurately describing\nand defining the rights and duties of the owners, the legal status of common areas\nand facilities, and provisions for taxation and maintenance of the common areas, must\naccompany each subdivision with townhouse lots.\n\nSource: Section 13-9-32; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nThis article applies to the design and development of a traditional neighborhood district.\n\nSource: Section 13-9-41; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nConditions, Covenants, and Restrictions for all the property within a traditional\nneighborhood district must be filed in the county real property records by the owner\nbefore a final subdivision plat may be approved, a lot sold, or a building permit\nissued.\n\n(B)\n\nConditions, Covenants, and Restrictions must be approved by the city attorney, and\nthey must:\n\n(1)\n\ncreate a Property Owners' Association with mandatory membership for each property\nowner;\n\n(2)\n\nestablish architectural standards that are in conformity with the requirements of\nthis chapter;\n\n(3)\n\ncreate an Architectural Control Committee to review development for compliance with\nthe architectural standards and issue certificates of approval;\n\n(4)\n\nprovide for the ownership, development, management, and maintenance of private open\nspace (except plazas owned by individual property owners), community parking facilities,\ncommunity meeting hall, and other common areas;\n\n(5)\n\nprovide for the maintenance of the landscaping and trees within the streetscape;\n\n(6)\n\nrequire the collection of assessments from members in an amount sufficient to pay\nfor its functions;\n\n(7)\n\nbe effective for a term of not less than 50 years;\n\n(8)\n\nrequire that the Property Owners' Association obtain the approval of the director\nregarding the disposition and management of private open space, community parking\nfacilities, community meeting hall, and other common areas before it may be dissolved;\nand\n\n(9)\n\nrequire that the Property Owners' Association obtain the approval of the director\nfor amendments to the Conditions, Covenants, and Restrictions which relate to provisions\nrequired by this chapter.\n\nSource: Section 13-9-42; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA community meeting hall for the use of the neighborhood residents is required. The\ncommunity meeting hall is a civic use.\n\n(B)\n\nA community meeting hall must be located so that it is easily accessible to the residents.\nIt may be placed in a square, park, or other suitable open space location.\n\n(C)\n\nThe minimum size of a community meeting hall is 2,000 square feet. A community meeting\nhall must be large enough to meet the needs of the neighborhood residents.\n\nSource: Section 13-9-43; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe Conditions, Covenants, and Restrictions shall establish architectural standards\nfor the property within a traditional neighborhood district. The standards must comply\nwith this section.\n\n(B)\n\nThe architectural standards must achieve the following objectives:\n\n(1)\n\narchitectural compatibility;\n\n(2)\n\nhuman scale design;\n\n(3)\n\nintegration of uses;\n\n(4)\n\nencouragement of pedestrian activity;\n\n(5)\n\nbuildings that relate to and are oriented toward the street and surrounding buildings;\n\n(6)\n\nresidential scale buildings in Mixed Residential Areas;\n\n(7)\n\nbuildings that contain special architectural features to signify entrances to the\nNeighborhood Center Area and important street intersections; and\n\n(8)\n\nNeighborhood Center Area buildings that focus activity on the neighborhood square.\n\n(C)\n\nThe director may adopt guidelines for architectural standards for inclusion in the\nTraditional Neighborhood District Criteria Manual.\n\nSource: Section 13-9-44; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nEach lot within a traditional neighborhood district must be allocated to a particular\nland use category.\n\n(B)\n\nThe amounts of land that must be allocated to particular land use categories, excluding\nstreets, alleys, open spaces, drainage controls, and water quality controls, are as\nfollows:\n\n(1)\n\nFor a Neighborhood Center Area:\n\n(a)\n\nTownhouse, condominium, and multi-family uses shall be allocated not less than 20\npercent of the land area.\n\n(b)\n\nCommercial uses shall be allocated not less than 20 percent of the land area.\n\n(c)\n\nCivic use shall be allocated not less than five percent of the land area, or one-half\nacre, whichever is greater. In a traditional neighborhood district of 100 acres or\nless, the provision of a community meeting hall in the Neighborhood Center satisfies\nthe civic use allocation even if less than one-half acre is used.\n\n(2)\n\nFor a Mixed Residential Area:\n\n(a)\n\nSingle family residential use shall be allocated not less than 50 percent and not\nmore than 80 percent of the land area.\n\n(b)\n\nDuplex use shall be allocated not more than 10 percent of the land area.\n\n(c)\n\nTownhouse, condominium, and multi-family uses shall be allocated not less than 10\npercent of the land area.\n\n(d)\n\nCommercial uses shall be allocated not less than one percent and not more than two\npercent of the land area.\n\n(e)\n\nCivic uses shall be allocated not less than two percent of the land area.\n\n(C)\n\nA preliminary subdivision plan may not be approved until the director approves a Land\nUse Allocation Map, submitted by the owner, that allocates a particular land use category\nto each lot on the preliminary subdivision plan.\n\n(D)\n\nDevelopment and use shall comply with the Land Use Allocation Map.\n\n(E)\n\nThe director may approve a revision to a Land Use Allocation Map if the director finds\nthat (a) the revised land uses are appropriate, and (b) the revision does not adversely\naffect land owners within 200 feet of the boundary line of a revised area.\n\n(F)\n\nA Land Use Allocation Map and the land use allocations required by this section are\neffective for a period of 50 years after the date the map is first approved by the\ndirector.\n\nSource: Section 13-9-45; Ord. 990225-70; Ord. 031211-11.\n\nThe following open space requirements apply within a traditional neighborhood district:\n\n(1)\n\nNot less than 20 percent of the gross land area of the traditional neighborhood district\nmust be open space.\n\n(2)\n\nPublic open space shall conform to the plans, goals, and standards of the Parks and\nRecreation Department and must be approved by the director of the Parks and Recreation\nDepartment.\n\n(3)\n\nThe Parks and Recreation Department shall be consulted regarding the locations and\ntypes of private open space.\n\n(4)\n\nThe portions of drainage and water quality facilities that are usable by the public\nfor recreational purposes, as determined by the director, may be designated as parks\nor greenbelts.\n\n(5)\n\nAt least one square shall be located in the Neighborhood Center Area. The required\nsquare shall be at least one-half acre in size in a traditional neighborhood district\nof 100 acres or less, and the required square shall be at least one acre in size in\na traditional neighborhood district that is larger than 100 acres.\n\n(6)\n\nA square must adjoin streets along at least 75 percent of its perimeter.\n\n(7)\n\nA plaza must adjoin building lots along at least 50 percent of its perimeter.\n\n(8)\n\nAt least one green that is not less than one acre in size must be located within 600\nfeet of the geographic center of the traditional neighborhood district.\n\n(9)\n\nA park may be not less than 10,000 square feet in size.\n\n(10)\n\nA greenbelt may not be located behind dwellings. The director may permit exceptions\nwhere topography, existing street layout, or other good reasons that make this restriction\nimpractical. If a greenbelt is located behind dwellings, access shall be provided\nin accordance with the Traditional Neighborhood Criteria Manual standards.\n\n(11)\n\nA greenbelt must have an average width of not less than 200 feet. A greenbelt may\nbe not less than 50 feet wide. Not more than 10 percent of the uninterrupted length\nof a greenbelt may be the minimum 50 feet width. A greenbelt must have not less than\n25 percent of its boundary abutting a street.\n\n(12)\n\nAt least 90 percent of the lots in a Mixed Residential Area must be within 600 feet\nof a square, plaza, green, or park.\n\nSource: Section 13-9-46; Ord. 990225-70; Ord. 031211-11.\n\nThe parkland dedication provisions of Chapter 25-4, Article 3, Division 5 (Parkland Dedication) apply to a traditional neighborhood\ndistrict, except as follows:\n\n(1)\n\nThe amount of land required to be dedicated for parkland is 25 percent of the open\nspace in a traditional neighborhood district. The formula in Section 25-1-602 (Dedication Of Parkland Required) does not apply.\n\n(2)\n\nAt the time of zoning, the director of the Parks and Recreation Department shall require\none of the following:\n\n(a)\n\ndedication by the subdivider of all or part of the required amount of parkland;\n\n(b)\n\npayment in lieu of dedicated parkland by the subdivider;\n\n(c)\n\ngeneral public access on up to 25 percent of the open space; or\n\n(d)\n\na combination of (a), (b), and (c), not to exceed the equivalent of 25 percent of\nthe open space.\n\n(3)\n\nLand to be dedicated as parkland or to which there will be general public access shall\nbe shown on the Development Plan.\n\n(4)\n\nThe director of the Parks and Recreation Department shall calculate a parkland fee\nat the time of zoning, and shall apportion a parkland fee by acreage to each final\nsubdivision plat. A subdivider shall pay a parkland fee, if required, before a final\nsubdivision plat may be approved.\n\n(5)\n\nThe owner of a tract of land that has been designated for general public access may\nmake and enforce reasonable regulations that are similar to City park regulations.\n\nSource: Section 13-9-47; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe drainage provisions of the Land Development Code apply to development in a traditional\nneighborhood district, except as provided in this section.\n\n(B)\n\nDrainage planning and engineering for a traditional neighborhood district shall be\nfor the district as a whole.\n\n(C)\n\nIn designing drainage facilities, impervious cover calculations shall assume maximum\nimpervious cover for each lot within the traditional neighborhood district.\n\n(D)\n\nDrainage facilities shall be privately owned, with easements granted to the City,\nand maintained for functionality by the City, unless other arrangements are made with\nthe director of the Watershed Protection and Development Review Department.\n\n(E)\n\nA final plat may not be approved unless a drainage master plan for the entire traditional\nneighborhood district has been approved by the director of the Watershed Protection\nand Development Review Department. A final plat may not be approved unless adequate\ndrainage facilities are provided for all property within the plat.\n\nSource: Section 13-9-48; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nThe water quality provisions of the Land Development Code apply to development in\na traditional neighborhood district, except as provided in this section.\n\n(B)\n\nWater quality planning and engineering for a traditional neighborhood district shall\nbe for the district as a whole.\n\n(C)\n\nAllowable impervious cover is calculated in accordance with this subsection.\n\n(1)\n\nIn calculating water quality related development intensities, the term \"site\" shall\ninclude all property within a traditional neighborhood district.\n\n(2)\n\nIn calculating water quality development intensities, a traditional neighborhood district\nis classified as \"commercial development\".\n\n(3)\n\nImpervious cover calculations shall assume the maximum impervious cover allowable\nfor each lot within a traditional neighborhood district.\n\n(D)\n\nImpervious cover limits in a traditional neighborhood district are as follows:\n\n(1)\n\nOverall impervious cover for a traditional neighborhood district is limited to 65\npercent of net site area or the amount permitted in the watershed, whichever is less.\n\n(2)\n\nA Neighborhood Center Area lot, except an open space lot, is limited to impervious\ncover of not more than 90 percent of gross site area.\n\n(3)\n\nA Mixed Residential Area lot, except a commercial lot or an open space lot, is limited\nto impervious cover of not more than 65 percent of gross site area. A commercial lot\nis limited to impervious cover of not more than 90 percent of gross site area.\n\n(4)\n\nA Neighborhood Edge Area lot, except an open space lot, is limited to impervious cover\nof not more than 65 percent of gross site area.\n\n(5)\n\nA Workshop Area lot or Employment Center Area lot, except an open space lot, is limited\nto impervious cover of not more than 80 percent of gross site area.\n\n(6)\n\nOpen space impervious cover limits are as follows:\n\n(a)\n\nAn open space lot that is a plaza or square is limited to impervious cover of not\nmore than 90 percent of gross site area.\n\n(b)\n\nGreenbelts, preserves, parks, and greens are limited to impervious cover of not more\nthan 10 percent of gross site area overall.\n\n(c)\n\nA greenbelt, preserve, park, or green may be restricted by the owner to impervious\ncover of less than 10 percent of the gross site area. The restricted amount shall\nbe used for impervious cover calculations.\n\n(d)\n\nImpervious coverage for greenbelts, preserves, parks, and greens classified as public\nopen space shall be calculated and enforced separately from those classified as private\nopen space.\n\n(E)\n\nWater quality control facilities shall be privately owned, with easements granted\nto the City, and maintained for functionality by the City, unless other arrangements\nare made with the director of the Watershed Protection and Development Review Department.\n\n(F)\n\nA final plat may not be approved unless a water quality master plan for the entire\ntraditional neighborhood district has been approved by the director of the Watershed\nProtection and Development Review Department. A final plat may not be approved unless\nadequate water quality control facilities are provided for all property within the\nplat.\n\n(G)\n\nDevelopment on a lot may not exceed the impervious cover limit set forth in this section.\nA building or construction permit may not be issued for development that exceeds the\nlimit.\n\nSource: Section 13-9-49; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\nThe landscaping requirements of Chapter 25-2, Subchapter C, Article 9 (Landscaping) apply to development within a traditional neighborhood district, except as follows:\n\n(1)\n\nA street yard 1,000 square feet or less in size is not required to be landscaped.\n\n(2)\n\nA parking area with 12 motor vehicle parking spaces or less is not required to have\nlandscaped islands, peninsulas, or medians.\n\nSource: Section 13-9-50; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe roadway designs used within the different areas of the traditional neighborhood\ndistrict may vary depending on the proposed function of the roadway, the anticipated\nadjacent land uses, and the anticipated traffic load. The City encourages the use\nof a variety of designs to lend character to the neighborhood.\n\n(B)\n\nRoadway designs that may be used in a traditional neighborhood district are in the\nTraditional Neighborhood District Criteria Manual.\n\n(C)\n\nThe director may approve the use of innovative roadway designs that are not listed\nin the Traditional Neighborhood District Criteria Manual.\n\nSource: Section 13-9-51; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDirect vehicular access from a lot to an alley in the traditional neighborhood district\nis permitted and preferred. Direct vehicular access from a lot to a street is not\npermitted, except as provided in this section.\n\n(B)\n\nExceptions.\n\n(1)\n\nDirect vehicular access from a lot to a street is permitted in a Neighborhood Edge\nArea or if a lot does not abut an alley.\n\n(2)\n\nThe director may grant vehicular access from a lot to a street if the director determines\nit is warranted by exceptional circumstances.\n\n(C)\n\nIf adjacent lots have direct vehicular access to a street, the director may require\nthat the access be through a common or joint driveway.\n\nSource: Section 13-9-52; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe following parking regulations apply in a traditional neighborhood district:\n\n(1)\n\nA parking lot or garage may not be adjacent to a square or adjacent to or opposite\na street intersection.\n\n(2)\n\nA parking lot shall be located at the rear or side of a building. If located at the\nside, screening shall be provided at the lot line by landscaping or decorative walls\nor fences.\n\n(3)\n\nCompact parking spaces are prohibited.\n\n(4)\n\nThere is no off-street loading requirement for a building with less than 10,000 square\nfeet of gross building area. The director shall determine the location, number, and\ndimensions of the off-street loading for a larger building.\n\n(5)\n\nExcept as approved by the director, parking in alleys is prohibited.\n\n(6)\n\nThere are no minimum parking requirements for motor vehicles, except for accessible\nspace parking. The required minimum number of accessible spaces is determined by the\nrequirements of Section 25-6-471 (Off-Street Parking) and Section 25-6-474 (Parking Facilities for Persons with Disabilities).\n\n(7)\n\nA commercial use parking lot or garage must provide not less than one bicycle parking\nspace for every 10 motor vehicle parking spaces.\n\n(B)\n\nIn a Neighborhood Center Area, not more than 125 percent of the parking previously\nrequired in Appendix A (Tables of Off-Street Loading Requirements and Former Off-Street Parking Requirements) to Chapter 25-6 (Transportation) may be provided on-site.\n\nSource: Section 13-9-53; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 34, 11-13-23.\n\n(A)\n\nParking and loading facilities, circulation areas, and queue lines must comply with\nthe design and construction standards in this section and the Traditional Neighborhood\nDistrict Criteria Manual.\n\n(B)\n\nSurfacing, curbing, and drainage improvements on all parking and loading facilities\nmust preclude the free flow of water onto adjacent properties, public streets, or\nalleys and provide adequate drainage.\n\n(C)\n\nAreas used for primary circulation, for frequent idling of vehicle engines, or for\nloading activities shall be designed and located to minimize impacts on adjoining\nproperties, including provisions for screening or baffling.\n\n(D)\n\nAll parking and loading facilities shall be maintained to assure desirability and\nusefulness of the facility. The facilities shall be maintained free of refuse, debris,\nor other accumulated matter and shall at all times be available for the off-street\nparking or loading for which they are required or intended.\n\nSource: Section 13-9-54; Ord. 990225-70; Ord. 031211-11.\n\nSigns are regulated by Chapter 25-10 (Sign Regulations).\n\nSource: Section 13-9-55; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept for lighting in a public right of way, all exterior lighting must be hooded\nor shielded so that the light source is not directly visible from adjacent properties.\nExterior lighting may not exceed 0.4 foot candles across the source property line.\n\n(B)\n\nThe noise level of mechanical equipment may not exceed 70 decibels at the property\nline.\n\n(C)\n\nThe use of highly reflective surfaces, including reflective glass and reflective metal\nroofs with a pitch of more than a run of seven to a rise of 12, is prohibited. This\nprohibition does not apply to solar panels and copper or painted metal roofs.\n\n(D)\n\nDumpsters and permanently placed refuse receptacles must be located at least 20 feet\nfrom adjacent residential uses. The location of and access to dumpsters or any other\nrefuse receptacles must comply with the Transportation Criteria Manual.\n\n(E)\n\nCommercial, multi-family, and condominium uses must be screened in accordance with\nthis subsection. Yards, fences, vegetative screening, or berms shall be provided to\nscreen off-street parking areas, mechanical equipment, storage areas, and areas for\nrefuse collection. If fences are used for screening, the height may not exceed six\nfeet unless otherwise permitted in the Land Development Code. The property owner is\nresponsible for the upkeep and maintenance of fences, berms, and vegetative screening.\n\nSource: Section 13-9-56; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA principal building must have its main entrance from a street or plaza.\n\n(B)\n\nDevelopment must comply with the Greenbuilder provisions of the Traditional Neighborhood\nDistrict Criteria Manual.\n\n(C)\n\nDrive-through facilities and other facilities that allow people to remain in vehicles\nwhile receiving products or services are prohibited. This prohibition does not apply\nto the fueling facilities of a service station.\n\n(D)\n\nA residential use may be located above the first floor of a commercial building.\n\n(E)\n\nA stoop, open porch, or balcony may extend into the front setback not more than five\nfeet.\n\n(F)\n\nA townhouse must have a private rear yard not less than 200 square feet in size. A\ntownhouse must have a finished first floor elevation not less than eighteen inches\nabove the elevation of the sidewalk at the front lot line.\n\nSource: Section 13-9-57; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe accessory use regulations of Chapter 25-2, Subchapter C, Article 5 (Accessory Uses) apply except as provided in this section.\n\n(B)\n\nNotwithstanding Section 25-2-893 (Accessory Uses for a Principal Residential Use), one accessory dwelling unit containing not more than 700 square feet of gross building\narea is permitted as an accessory to a residential use if the other requirements of\nthis chapter are met.\n\n(C)\n\nNotwithstanding Section 25-2-894 (Accessory Uses for a Principal Commercial Use), commercial uses may include the following as accessory uses, activities, and structures\non the same site or lot:\n\n(1)\n\na commercial use not listed as a permitted use in the same district that:\n\n(a)\n\nis operated primarily for the convenience of employees, clients, or customers of the\nprincipal use;\n\n(b)\n\noccupies less than 10 percent of the total floor area of the use; and\n\n(c)\n\nis located and operated as an integral part of the principal use and does not comprise\na separate business use or activity; or\n\n(2)\n\na parking facility in a Neighborhood Center Area.\n\nSource: Section 13-9-58; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe following site development regulations do not apply to a major civic use:\n\n(1)\n\nmaximum front yard setback;\n\n(2)\n\nminimum front yard setback;\n\n(3)\n\nminimum street side yard setback;\n\n(4)\n\nminimum interior yard setback;\n\n(5)\n\nminimum rear yard setback;\n\n(6)\n\nmaximum building coverage;\n\n(7)\n\nmaximum building footprint; and\n\n(8)\n\nmaximum height.\n\n(B)\n\nThe director shall specify the parameters of the development regulations listed in\nSubsection (A) for each specific development proposal. The parameters shall not be\nmore restrictive than those that would otherwise apply to a civic use.\n\nSource: Section 13-9-59; Ord. 990225-70; Ord. 031211-11.\n\nThis article applies to the design and development of a Neighborhood Center Area.\n\nSource: Section 13-9-61; Ord. 990225-70; Ord. 031211-11.\n\nA Neighborhood Center Area must contain not less than five percent of the gross land\narea of the traditional neighborhood district.\n\nSource: Section 13-9-62; Ord. 990225-70; Ord. 031211-11.\n\nA Neighborhood Center must be easily accessible by pedestrians from all parts of the\nMixed Residential Areas. At least 90 percent of the lots in the Mixed Residential\nAreas must be within 2000 linear feet of a Neighborhood Center Area boundary.\n\nSource: Section 13-9-63; Ord. 990225-70; Ord. 031211-11.\n\nThe following table lists the site development regulations for a Neighborhood Center\nArea.\n\n| REGULATION | SINGLE-FAMILY DUPLEX | TOWNHOUSE | COMMERCIAL MULTIFAMILY CONDOMINIUM |\n| --- | --- | --- | --- |\n| Minimum Lot Size | 2,000 SF   2,500 SF on corner lot | 3,600 SF   4,000 SF on corner lot | 3,600 SF   4,000 SF on corner lot |\n| Maximum Lot Size | 4,000 SF | 43,560 SF | 43,560 SF |\n| Minimum Lot Width 2 | 20 FT   25 FT on corner lot | 40 FT   45 FT on corner lot | 40 FT   45 FT on corner lot |\n| Maximum Site Area | 20,000 SF | 43,560 SF | 43,560 SF |\n| Minimum Frontage Buildout 3 | 80% | 80% | 60% |\n| Maximum Height | 35 FT | 60 FT | 60 FT |\n| Maximum Front Yard Setback | 5 FT | 5 FT | 5 FT |\n| Minimum Front Yard Setback | -0- | -0- | -0- |\n| Minimum Street Side Yard Setback | 5 FT | 5 FT | 5 FT |\n| Minimum Interior Side Yard Setback | -0- | -0- | -0- |\n| Minimum Rear Yard Setback | 5 FT | -0- | 5 FT |\n| Maximum Building Coverage | 70% | 70% | 70% |\n| Maximum Impervious Cover | 90% | 90% | 90% |\n\n1 See Section 25-3-89 (Major Civic Use Site Development Regulations).\n\n2 On a courtyard or curved street, the minimum lot width between the front lot line\nand the minimum front yard setback is 15 feet for a townhouse lot and 30 feet for\nother lots.\n\n3 The director may reduce the minimum frontage buildout to accommodate a protected\ntree or significant tree cluster.\n\nSource: Section 13-9-64; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nAn automotive rental use may keep not more than 20 vehicles on site.\n\n(B)\n\nAn automotive repair services use may not exceed 2400 square feet of gross building\narea.\n\n(C)\n\nA building that is adjacent to a square may be not less than two stories high.\n\n(D)\n\nAn open colonnade may extend into the front setback a maximum of five feet. An unenclosed\nbalcony with a minimum clearance of nine feet above finished grade may extend five\nfeet over a public sidewalk. An awning or walkway covering with a minimum clearance\nof eight feet above finished grade may extend five feet over a public sidewalk.\n\n(E)\n\nA commercial off-street parking use may not exceed one acre in site size. Not more\nthan one commercial off-street parking Use site may be located in a block. A site\nmust be screened from the street by low hedges or walls not less than three feet and\nnot more than four feet in height.\n\n(F)\n\nA kennel use must be conducted entirely within an enclosed structure.\n\n(G)\n\nA residential use with street level living space must have a finished first floor\nelevation not less than eighteen inches above the elevation of the sidewalk at the\nfront lot line. A residential use may not front at ground level on a square.\n\n(H)\n\nA service station use may have the capability of fueling not more than eight vehicles\nat one time.\n\n(I)\n\nA telecommunications tower must be located on top of a building or be an architectural\ncomponent of the building. Free standing towers are prohibited.\n\n(J)\n\nA printing and publishing use may not exceed 5,000 square feet of gross floor area.\n\nSource: Section 13-9-65; Ord. 990225-70; Ord. 031211-11; Ord. 040617-Z-1.\n\nThis article applies to the design and development of a Mixed Residential Area.\n\nSource: Section 13-9-71; Ord. 990225-70; Ord. 031211-11.\n\nThe following table lists the site development regulations for a Mixed Residential\nArea.\n\n| REGULATION | SINGLE-FAMILY DUPLEX | TOWNHOUSE | COMMERCIAL MULTI-FAMILY CONDOMINIUM | CIVIC 1 |\n| --- | --- | --- | --- | --- |\n| Minimum Lot Size | 3,600 SF 2 | 2,000 SF | 3,600 SF | 3,600 SF |\n|  | 4,000 SF on corner lot 2 | 2,500 SF on corner lot | 4,000 SF on corner lot | 4,000 SF on corner lot |\n| Maximum Lot Size | None | 4,000 SF | 20,000 SF | 20,000 SF |\n| Minimum Lot Width 3 | 40 FT 2   45 FT on corner lot 2 | 20 FT   25 FT on corner lot | 40 FT   45 FT on corner lot | 40 FT   45 FT on corner lot |\n| Maximum Site Area | None | 20,000 SF | 20,000 SF | 20,000 SF |\n| Maximum Height | 35 FT | 35 FT | 35 FT | 35 FT |\n| Maximum Front Yard Setback | 15 FT | 10 FT | 10 FT | 10 FT |\n| Minimum Front Yard Setback | 10 FT | 5 FT | 5 FT | 5 FT |\n| Minimum Street Side Yard Setback | 10 FT | 10 FT | 10 FT | 10 FT |\n| Minimum Interior Side Yard Sideback | 5 FT 2 | 0 FT | 5 FT | 5 FT |\n| Maximum Building Coverage | 55% | 55% | 55% | 55% |\n| Maximum Building Footprint | 5,000 SF | 5,000 SF | 5,000 SF | 5,000 SF 4 |\n| Maximum Impervious Cover | 65% | 65% | 65%5 | 65% |\n\n1 See Section 25-3-89 (Major Civic Use Site Development Regulations).\n\n2 See Section 25-3-123 (Side Yard Houses).\n\n3 On a courtyard or curved street, the minimum lot width between the front lot line\nand the minimum front yard setback is 15 feet for a townhouse lot and 30 feet for\nother lots.\n\n4 A community meeting hall may exceed this limitation.\n\n5 Maximum impervious cover for a commercial use is 90%.\n\nSource: Section 13-9-72; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA side yard house is permitted on a lot if the following requirements are met:\n\n(1)\n\nthe lot is in a Mixed Residential Area that has been designated as single family residential\non a Land Use Allocation Map; and\n\n(2)\n\nall the lots in the same block and fronting on the same street comply with Subsection\n(B).\n\n(B)\n\nAn owner of a lot must impose the following limitations on the lot by the filing of\nappropriate deed restrictions:\n\n(1)\n\nA structure may be erected adjacent to an interior side lot line. The wall of a structure\nerected adjacent to an interior side lot line must be solid and opaque with no openings\nof any kind. The eaves of a structure may extend across the interior side lot line\nnot more than three feet.\n\n(2)\n\nExcept for a patio or patio cover, the minimum distance between structures on adjoining\nlots is ten feet. The minimum distance between a patio or patio cover and a structure\non an adjoining lot is six feet.\n\n(3)\n\nAn easement is required on each lot that abuts a lot with a structure adjacent to\na common interior side lot line. The easement is for the purpose of construction and\nmaintenance of the structure and drainage. The easement must be not less than five\nfeet wide and extend the full length of the interior side lot line.\n\n(C)\n\nIf a lot is subject to this section, the following site development regulations apply:\n\n(1)\n\nThe minimum interior side yard setback is zero feet.\n\n(2)\n\nThe minimum required side yard between structures is ten feet.\n\n(3)\n\nThe minimum lot width is 30 feet, or 35 feet on a corner lot.\n\n(4)\n\nThe minimum lot size is 2400 square feet, or 2800 square feet on a corner lot.\n\nSource: Section 13-9-73; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nSimilar land uses should face across streets, and dissimilar land uses should abut\nat rear lot lines or across alleys.\n\n(B)\n\nA commercial use may only be located on the first floor of a building. Up to one-half\nof the second floor may be used for accessory uses that are not open to the public.\n\n(C)\n\nCommercial uses are limited to corner locations that are designated on the Development\nPlan.\n\n(D)\n\nA commercial use may not be open to the public between the hours of 11:00 p.m. and\n6:00 a.m.\n\n(E)\n\nThere may be not more than eight dwelling units in a single structure.\n\n(F)\n\nThere may be not more than one principal structure on a site.\n\n(G)\n\nThere may be not more than one accessory dwelling unit on a site.\n\n(H)\n\nA garage entry may not face the street unless it is at least 20 feet behind the front\nbuilding face of the principal structure.\n\n(I)\n\nA front porch or stoop is required on a single family residential or duplex structure.\n\nSource: Section 13-9-74; Ord. 990225-70; Ord. 031211-11.\n\nThis article applies to the design and development of a Neighborhood Edge Area.\n\nSource: Section 13-9-81; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA Neighborhood Edge Area may be designated along the perimeter of a traditional neighborhood\ndistrict. Unless there is a park, green, greenbelt, or preserve at least 100 feet\nwide, a Neighborhood Edge Area must be designated for those portions of a traditional\nneighborhood district that abut:\n\n(1)\n\nland zoned SF-3 or more restrictive;\n\n(2)\n\nland used for any use permitted in an SF-3 or more restrictive district;\n\n(3)\n\nland included in an approved preliminary subdivision plan or final subdivision plat\nthat is designated on the plan or plat for any use permitted in an SF-3 or more restrictive\ndistrict.\n\n(B)\n\nThe minimum width of a Neighborhood Edge Area is 100 feet. The maximum width of a\nNeighborhood Edge Area is 250 feet, but if the 250 foot width line falls within a\nblock, the width may be extended to the nearest block edge.\n\nSource: Section 13-9-82; Ord. 990225-70; Ord. 031211-11.\n\nThe site development regulations for a Neighborhood Edge Area are as follows:\n\n(1)\n\nMinimum lot size: 5,750 square feet\n\n(2)\n\nMinimum lot width: 50 feet\n\n(3)\n\nMaximum height: 35 feet\n\n(4)\n\nMinimum front setback: 25 feet\n\n(5)\n\nMinimum street side yard setback: 15 feet\n\n(6)\n\nMinimum interior side yard setback: 5 feet\n\n(7)\n\nMinimum rear yard setback: 10 feet\n\n(8)\n\nMaximum building coverage: 55%\n\n(9)\n\nMaximum impervious cover: 65%\n\nSource: Section 13-9-83; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThere may be no more than one principal structure on a site.\n\n(B)\n\nThere may be no more than one accessory dwelling unit on a site.\n\n(C)\n\nA garage entry may not face the street unless it is at least 20 feet behind the front\nbuilding face of the principal structure.\n\nSource: Section 13-9-84; Ord. 990225-70; Ord. 031211-11.\n\nThis article applies to the design and development of a Workshop Area or an Employment\nCenter Area.\n\nSource: Section 13-9-91; Ord. 990225-70; Ord. 031211-11.\n\nThe aggregate size of all Workshop Areas and Employment Center Areas within a traditional\nneighborhood district may not exceed 10 percent of the gross land area.\n\nSource: Section 13-9-92; Ord. 990225-70; Ord. 031211-11.\n\nThe site development regulations for the Workshop Area and Employment Center Area\nare as follows:\n\n(1)\n\nMinimum lot size: 5,000 square feet\n\n(2)\n\nMaximum lot size:\n\n(a)\n\nIn Workshop Area: 5 acres\n\n(b)\n\nIn Employment Center Area: 10 acres\n\n(3)\n\nMaximum site area:\n\n(a)\n\nIn Workshop Area: 5 acres\n\n(b)\n\nIn Employment Center Area: 10 acres\n\n(4)\n\nMinimum lot width: 50 feet\n\n(5)\n\nMinimum frontage buildout: 80%\n\n(6)\n\nMaximum height: 60 feet\n\n(7)\n\nMinimum front yard setback: 0 feet\n\n(8)\n\nMaximum front yard setback: 10 feet\n\n(9)\n\nMinimum side setback: 10 feet\n\n(10)\n\nMinimum rear yard setback: 25 feet\n\n(11)\n\nMaximum building coverage: 65%\n\n(12)\n\nMaximum impervious coverage: 80%\n\n(13)\n\nMaximum floor-to-area ratio: 1:1\n\nSource: Section 13-9-93; Ord. 990225-70; Ord. 031211-11.\n\nA site plan is not required for development in a traditional neighborhood district.\nThe Development Plan, the subdivision regulations, and the plot plan incorporate conventional\nsite plan regulations.\n\nSource: Section 13-9-101; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA building permit is required for a structure within a traditional neighborhood district.\n\n(B)\n\nA construction permit is required for development of more than 1000 square feet of\nsite area if a building permit is not otherwise required.\n\n(C)\n\nA plot plan must be submitted with the building or construction permit application.\nA building or construction permit may not be issued unless a plot plan complies with\nthis chapter and Title 25 (Land Development). A plot plan must provide the following information, if applicable:\n\n(1)\n\nall information required by Chapter 25-11 (Building, Demolition, And Relocation Permits; Special Requirements For Historic\nStructures) or 25-12 (Technical Codes) to be on a plot plan;\n\n(2)\n\nlocations and types of easements;\n\n(3)\n\nthe locations of proposed utility connections;\n\n(4)\n\nthe 100 year floodplain, as calculated to exist under fully developed conditions in\naccordance with the Drainage Criteria Manual;\n\n(5)\n\nbuilding location and gross building square footage;\n\n(6)\n\nproposed use that complies with the Land Use Allocation Map;\n\n(7)\n\nnumber of bedrooms;\n\n(8)\n\nlocations, quantity, and dimensions of sidewalks, pedestrian ramps, driveways, parking\nareas, parking spaces, and off-street loading areas;\n\n(9)\n\ninformation that shows compliance with accessibility requirements;\n\n(10)\n\nlandscaping, screening, and fencing;\n\n(11)\n\nlocations of protected trees, significant tree clusters, and 8-inch survey trees;\n\n(12)\n\nan erosion and sedimentation control plan;\n\n(13)\n\nlot size, setbacks, building height, building coverage, and impervious coverage; and\n\n(14)\n\nother information that may be required by administrative rules.\n\n(D)\n\nA building or construction permit may not be issued unless the Architectural Control\nCommittee of the Property Owners' Association has certified that the proposed development\ncomplies with the architectural standards.\n\nSource: Section 13-9-102; Ord. 990225-70; Ord. 031211-11; Ord. 041202-16.\n",
  "start_line": 40833,
  "end_line": 42945,
  "subsections": []
}