{
  "id": "chapter-25-8",
  "title": "ENVIRONMENT",
  "level": 1,
  "parent_id": null,
  "content": "## CHAPTER 25-8. - ENVIRONMENT.\n\nIn this subchapter:\n\n(1)\n\nBARTON SPRINGS means the springs that comprise the Barton Springs complex associated\nwith Barton Springs Pool, and includes Upper Barton, Old Mill, Eliza, and Parthenia\nsprings.\n\n(2)\n\nBLUFF means a vertical change in elevation of more than 40 feet and an average gradient\ngreater than 400 percent.\n\n(3)\n\nCANYON RIMROCK means a rock substrate that:\n\n(a)\n\nhas a gradient that exceeds 60 percent for a vertical distance of at least four feet;\nand\n\n(b)\n\nis exposed for at least 50 feet horizontally along the rim of the canyon.\n\n(4)\n\nCOMMERCIAL DEVELOPMENT means all development other than open space and residential\ndevelopment.\n\n(5)\n\nCLUSTER HOUSING means a residential housing development that maximizes common open\nspace by grouping housing units to minimize individual yards and has a maximum lot\narea of fifteen thousand (15,000) square feet for detached residential development.\n\n(6)\n\nCRITICAL ENVIRONMENTAL FEATURES means features that are of critical importance to\nthe protection of environmental resources, and includes bluffs, canyon rimrocks, caves,\nfaults and fractures, seeps, sinkholes, springs, and wetlands.\n\n(7)\n\nDIRECTOR, when used without a qualifier, means the director of the Watershed Protection\nDepartment, or the director's designee.\n\n(8)\n\nEROSION HAZARD ZONE means an area where future stream channel erosion is predicted\nto result in damage to or loss of property, buildings, infrastructure, utilities,\nor other valued resources.\n\n(9)\n\nFAULTS AND FRACTURES means significant fissures or cracks in rock that may permit\ninfiltration of surface water to underground cavities or channels.\n\n(10)\n\nFLOODPLAIN MODIFICATION means development that results in any vertical or horizontal\nchange in the cross section of the 100-year floodplain as determined under Section\n25-7-6 (Determination of the 100-Year Floodplain).\n\n(11)\n\nIMPERVIOUS COVER means the total area of any surface that prevents the infiltration\nof water into the ground, such as roads, parking areas, concrete, and buildings.\n\n(12)\n\nMULTI-USE TRAIL means a facility designated for the use of pedestrians, bicycles,\nand/or other non-motorized users and associated bridges.\n\n(13)\n\nOPEN SPACE means a public or private park, multi-use trail, golf cart path, the portions\nof a golf course left in a natural state, and an area intended for outdoor activities\nwhich does not significantly alter the existing natural vegetation, drainage patterns,\nor increase erosion. OPEN SPACE does not include parking lots.\n\n(14)\n\nOWNER includes a lessee.\n\n(15)\n\nPOINT RECHARGE FEATURE means a cave, sinkhole, fault, joint, or other natural feature\nthat lies over the Edwards Aquifer recharge zone and that may transmit a significant\namount of surface water into the subsurface strata.\n\n(16)\n\nWATER QUALITY CONTROL means a structure, system, or feature that provides water quality\nbenefits by treating stormwater run-off.\n\n(17)\n\nWETLAND means a transitional land between terrestrial and aquatic systems where the\nwater table is usually at or near the surface or the land is covered by shallow water,\nand conforms to the Army Corps of Engineers' definition.\n\nSource: Section 13-7-3; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046; Ord. No. 20170615-102, Pt. 5, 6-15-17; Ord. No. 20191114-064, Pt. 10, 11-25-19; Ord. No. 20221027-045, Pt. 4, 11-7-22.\n\n(A)\n\nThis section describes the watersheds, aquifers, and other water quality protection\nzones that are regulated by this subchapter. A map of these areas is maintained by\nthe Watershed Protection Department and made available for reference online and at\nthe offices of the Development Services Department.\n\n(B)\n\nThe director shall determine the boundaries of the areas described in Subsection (D).\n\n(C)\n\nThe director may require an applicant to verify the boundary of an area described\nin Subsection (D). For property within 1,500 feet of an Edwards Aquifer recharge zone\nboundary, the director may require that an applicant provide a certified report from\na geologist or hydrologist verifying the boundary location.\n\n(D)\n\nIn this subchapter:\n\n(1)\n\nBARTON SPRINGS ZONE means the Barton Creek watershed and all watersheds that contribute\nrecharge to Barton Springs, including those portions of the Williamson, Slaughter,\nOnion, Bear and Little Bear Creek watersheds located in the Edwards Aquifer recharge\nor contributing zones.\n\n(2)\n\nBARTON CREEK WATERSHED means the land area that drains to Barton Creek, including\nLittle Barton Creek watershed.\n\n(3)\n\nEDWARDS AQUIFER is the water-bearing substrata that includes the stratigraphic rock\nunits known as the Edwards Group and Georgetown Formation.\n\n(4)\n\nEDWARDS AQUIFER CONTRIBUTING ZONE means all land generally to the west and upstream\nof the Edwards Aquifer recharge zone that provides drainage into the Edwards Aquifer\nrecharge zone.\n\n(5)\n\nEDWARDS AQUIFER RECHARGE ZONE means all land over the Edwards Aquifer that recharges\nthe aquifer, as determined by the surface exposure of the geologic units comprising\nthe Edwards Aquifer, including the areas overlain with quaternary terrace deposits.\n\n(6)\n\nSOUTH EDWARDS AQUIFER RECHARGE ZONE means the portion of the Edwards Aquifer recharge\nzone that is located south of the Colorado River and north of the Blanco River.\n\n(7)\n\nSUBURBAN WATERSHEDS include all watersheds not otherwise classified as urban, water\nsupply suburban, or water supply rural watersheds, and include:\n\n(a)\n\nthe Brushy, Buttercup, Carson, Cedar, Cottonmouth, Country Club East, Country Club\nWest, Decker, Dry Creek East, Elm Creek, Elm Creek South, Gilleland, Harris Branch,\nLake, Lockwood, Maha, Marble, North Fork Dry, Plum, Rattan, Rinard, South Boggy, South\nFork Dry, South Brushy, Walnut, and Wilbarger creek watersheds;\n\n(b)\n\nthe Colorado River watershed downstream of U.S. 183; and\n\n(c)\n\nthose portions of the Onion, Bear, Little Bear, Slaughter, and Williamson creek watersheds\nnot located in the Edwards Aquifer recharge or contributing zones.\n\n(8)\n\nURBAN WATERSHEDS include:\n\n(a)\n\nthe Blunn, Buttermilk, Boggy, East Bouldin, Fort, Harper Branch, Johnson, Little Walnut,\nShoal, Tannehill, Waller, and West Bouldin creek watersheds;\n\n(b)\n\nthe north side of the Colorado River watershed from Johnson Creek to U.S. 183; and\n\n(c)\n\nthe south side of the Colorado River watershed from Barton Creek to U.S. 183.\n\n(9)\n\nWATER SUPPLY RURAL WATERSHEDS include:\n\n(a)\n\nthe Lake Travis watershed;\n\n(b)\n\nthe Lake Austin watershed, excluding the Bull Creek watershed and the area to the\nsouth of Bull Creek and the east of Lake Austin; and\n\n(c)\n\nthe Bear West, Bee, Bohl's Hollow, Cedar Hollow, Coldwater, Commons Ford, Connors,\nCuernavaca, Harrison Hollow, Hog Pen, Honey, Little Bee, Panther Hollow, Running Deer,\nSt. Stephens, Steiner, and Turkey Creek watersheds.\n\n(10)\n\nWATER SUPPLY SUBURBAN WATERSHEDS include:\n\n(a)\n\nthe Bull, Eanes, Dry Creek North, Huck's Slough, Taylor Slough North, Taylor Slough\nSouth, and West Bull creek watersheds;\n\n(b)\n\nthe Lady Bird Lake watershed on the south side of Lady Bird Lake from Barton Creek\nto Tom Miller Dam;\n\n(c)\n\nthe Lady Bird Lake watershed on the north side of Lady Bird Lake from Johnson Creek\nto Tom Miller Dam; and\n\n(d)\n\nthe Lake Austin watershed on the east side of Lake Austin from Tom Miller Dam to Bull\nCreek.\n\nSource: Section 13-7-3 and 13-2-500(d); Ord. 990225-70; Ord. 000309-39; Ord. 010329-18;\nOrd. 031211-11; Ord. 20060209-037; Ord. 20131017-046; Ord. No. 20170615-102, Pt. 6, 6-15-17; Ord. No. 20221027-045, Pt. 5, 11-7-22.\n\n(A)\n\nExcept as provided in Subsection (B), this subchapter applies in the planning jurisdiction.\n\n(B)\n\nFor a preliminary plan, final plat, or subdivision construction plan in the portion\nof the city's extraterritorial jurisdiction that is within Travis County:\n\n(1)\n\nthis subchapter does not apply; and\n\n(2)\n\nTitle 30 (Austin/Travis County Subdivision Regulations) governs.\n\nSource: Section 13-1-4 and 13-7-2(a); Ord. 990225-70; Ord. 031211-11; Ord. 031211-42.\n\nThe requirements of this subchapter apply to land development by the City.\n\nSource: Section 13-7-2(b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis subsection applies to property that has existing development or that is included\nin an approved site plan if the development on the property is reconfigured as a result\nof right-of-way condemnation.\n\n(1)\n\nThe accountable official may approve the replacement of development that existed in\nthe condemned area of the property onto the remainder of the property.\n\n(2)\n\nFor development that may be replaced under Subsection (A)(1), the director of the\nWatershed Protection Department may vary the requirements of this subchapter for development\nin the water quality transition zone and the critical water quality zone and the limitations\nof this subchapter on impervious cover after making a determination that the replacement\ndevelopment will not increase the pollutant loading.\n\n(B)\n\nFor property that had existing development or that was included in a released site\nplan on March 10, 1996, the accountable official may approve additional development\nthat exceeds the impervious cover limitations of this title if the director determines\nthat the increased impervious cover is necessary to comply with the accessibility\nstandards of the Americans With Disabilities Act or the Uniform Building Code.\n\nSource: Sections 13-7-2(d) and (f); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11;\nOrd. 20131017-046.\n\n(A)\n\nExcept as prohibited by Article 13 (Save Our Springs Initiative), a special exception from the requirements of this subchapter may be granted in\naccordance with Chapter 25-1 (General Requirements and Procedures).\n\n(B)\n\nIf a three-quarters majority of the City Council concludes, or a court of competent\njurisdiction renders a final judgment concluding that identified sections of this\nsubchapter, as applied to a specific development project or proposal violate the United\nStates Constitution or the Texas Constitution or are inconsistent with federal or\nstate statutes that may preempt a municipal ordinance or the Austin City Charter,\nthe City Council may, after a public hearing, adjust the application of this subchapter\nto that project to the minimum extent required to comply with the conflicting law.\nAny adjustment shall be structured to provide the maximum protection of water quality.\n\nSource: Sections 13-2-503(a) and 13-7-6; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nThis section applies to property located in an urban or suburban watershed that has\nexisting development if:\n\n(1)\n\nany development constructed without a permit after January 1, 1992, will be removed\nfrom the site and the area restored to pre-development conditions; and\n\n(2)\n\nthe applicant files a site plan application or concurrent subdivision and site plan\napplications and elects to be governed by this section.\n\n(B)\n\nThe requirements of this subchapter do not apply to the redevelopment of the property\nif the redevelopment:\n\n(1)\n\ndoes not increase the existing amount of impervious cover on the site;\n\n(2)\n\nremoves existing impervious cover from within 50 feet of a classified waterway or\n50 feet from the shoreline of a lake and revegetates the area as prescribed by the\nEnvironmental Criteria Manual;\n\n(3)\n\nprovides the level of water quality treatment prescribed by current regulations for\nthe redeveloped area or an equivalent area on the site;\n\n(4)\n\ndoes not increase non-compliance, if any, with Article 7, Division 1 (Critical Water Quality Zone Restrictions), Section 25-8-281 (Critical Environmental Features), or Section 25-8-282 (Wetland Protection);\n\n(5)\n\ncomplies with Article 3 (Environmental Resource Inventory; Pollutant Attenuation Plan) and all construction phase environmental standards in effect at the time of construction,\nincluding Article 5 (Erosion and Sedimentation Control; Overland Flow); and\n\n(6)\n\ndoes not place redevelopment within the Erosion Hazard Zone, unless protective works\nare provided as prescribed in the Drainage Criteria Manual.\n\nSource: Ord. 000406-88; Ord. 031211-11; Ord. 20131017-046; Ord. No. 20170615-102, Pt. 7, 6-15-17; Ord. No. 20221027-045, Pt. 6, 11-7-22.\n\n(A)\n\nThis section applies to property located in the Barton Springs Zone that has existing\ncommercial development if:\n\n(1)\n\nno unpermitted development occurred on the site after January 1, 1992, and\n\n(2)\n\nthe property owner files a site plan application and an election for the property\nto be governed by this section.\n\n(B)\n\nFor property governed by this section, this section supersedes Article 13 (Save Our Springs Initiative), to the extent of conflict.\n\n(C)\n\nIn this section:\n\n(1)\n\nSTANDARD POND means water quality controls that comply with Section 25-8-213 (Water Quality Control Standards) or are approved under Section 25-8-151 (Innovative Management Practices); and\n\n(2)\n\nSOS POND means water quality controls that comply with all requirements of Section 25-8-213 (Water Quality Control Standards) and the pollutant removal requirements of Section 25-8-514(A) (Pollution Prevention Required).\n\n(D)\n\nThe requirements of this subchapter do not apply to the subdivision of property if\nat the time of redevelopment under this section subdivision and site plan applications\nare filed concurrently.\n\n(E)\n\nThe requirements of this subchapter do not apply to the redevelopment of property\nif the redevelopment meets all of the following conditions:\n\n(1)\n\nThe redevelopment may not increase the existing amount of impervious cover on the\nsite.\n\n(2)\n\nThe redevelopment may not increase non-compliance, if any, with Article 7, Division\n1 (Critical Water Quality Zone Restrictions), Section 25-8-281 (Critical Environmental Features), Section 25-8-282 (Wetland Protection), or Section 25-8-482 (Water Quality Transition Zone).\n\n(3)\n\nThe redevelopment must comply with Section 25-8-121 (Environmental Resource Inventory Requirement) and all construction phase environmental requirements in effect at the time of construction,\nincluding Chapter 25-8, Article 5 (Erosion and Sedimentation Control; Overland Flow) and Section 25-8-234 (Fiscal Security in the Barton Springs Zone).\n\n(4)\n\nThe water quality controls on the redevelopment site must provide a level of water\nquality treatment that is equal to or greater than that which was previously provided.\n\n(5)\n\nFor a commercial or multifamily redevelopment, the owner or operator must obtain a\npermit under Section 25-8-233 (Barton Springs Zone Operating Permit) for both standard ponds and SOS ponds.\n\n(6)\n\nFor a site with more than 40 percent net site area impervious cover, the redevelopment\nmust have:\n\n(a)\n\nstandard ponds for the entire site; or\n\n(b)\n\nSOS ponds for a portion of the site, and standard ponds for the remainder of the redeveloped\nsite.\n\n(7)\n\nFor a site with 40 percent or less net site area impervious cover, the redevelopment\nmust have SOS ponds for the entire site.\n\n(8)\n\nThe property owner must mitigate the effects of the redevelopment, if required by\nand in accordance with Subsection (H).\n\n(9)\n\nRedevelopment may not be located within the Erosion Hazard Zone, unless protective\nworks are provided as prescribed in the Drainage Criteria Manual.\n\n(F)\n\nCity Council approval of a redevelopment in accordance with Subsection (G) is required\nif the redevelopment:\n\n(1)\n\nincludes more than 25 dwelling units;\n\n(2)\n\nis located outside the City's zoning jurisdiction;\n\n(3)\n\nis proposed on property with an existing industrial or civic use;\n\n(4)\n\nis inconsistent with a neighborhood plan; or\n\n(5)\n\nwill generate more than 2,000 vehicle trips a day above the estimated traffic level\nbased on the most recent authorized use on the property.\n\n(G)\n\nCity Council shall consider the following factors in determining whether to approve\na proposed redevelopment:\n\n(1)\n\nbenefits of the redevelopment to the community;\n\n(2)\n\nwhether the proposed mitigation or manner of development offsets the potential environmental\nimpact of the redevelopment;\n\n(3)\n\nthe effects of offsite infrastructure requirements of the redevelopment; and\n\n(4)\n\ncompatibility with the City's comprehensive plan.\n\n(H)\n\nRedevelopment of property under this section requires the purchase or restriction\nof mitigation land if the site has a sedimentation/filtration pond.\n\n(1)\n\nThe combined gross site area impervious cover of the mitigation land and the portion\nof the redevelopment site treated by sedimentation/filtration ponds may not exceed\n20 percent.\n\n(2)\n\nThe mitigation requirement may be satisfied by:\n\n(a)\n\npaying into the Barton Springs Zone Mitigation Fund a non-refundable amount established\nby ordinance;\n\n(b)\n\ntransferring to the City in accordance with Paragraph (3) mitigation land approved\nby the director of the Watershed Protection Department within a watershed that contributes\nrecharge to Barton Springs, either inside or outside the City's jurisdiction;\n\n(c)\n\nplacing restrictions in accordance with Paragraph (3) on mitigation land approved\nby the director of the Watershed Protection Department within a watershed that contributes\nrecharge to Barton Springs, either inside or outside the City's jurisdiction; or\n\n(d)\n\na combination of the mitigation methods described in Subparagraphs (a)—(c), if approved\nby the director of the Watershed Protection Department.\n\n(3)\n\nA person redeveloping under this section shall pay all costs of restricting the mitigation\nland or transferring the mitigation land to the City, including the costs of:\n\n(a)\n\nan environmental site assessment without any recommendations for further clean-up,\ncertified to the City not earlier than the 120th day before the closing date transferring\nland to the City;\n\n(b)\n\na category 1(a) land title survey, certified to the City and the title company not\nearlier than the 120th day before the closing date transferring land to the City;\n\n(c)\n\na title commitment with copies of all Schedules B and C documents, and an owner's\ntitle policy;\n\n(d)\n\na fee simple deed, or, for a restriction, a restrictive covenant approved as to form\nby the city attorney;\n\n(e)\n\ntaxes prorated to the closing date;\n\n(f)\n\nrecording fees; and\n\n(g)\n\ncharges or fees collected by the title company.\n\n(I)\n\nThe Watershed Protection Department shall adopt rules to identify criteria for director\napproval under this section to ensure that the proposed mitigation, manner of development,\nand water quality controls offset the potential environmental impact of the redevelopment.\n\nSource: Ord. 20071108-121; Ord. 20131017-046; Ord. No. 20170615-102, Pt. 8, 6-15-17; Ord. No. 20221027-045, Pt. 7, 11-7-22.\n\n(A)\n\nThis section applies to property located in a water supply rural or water supply suburban\nwatershed that has existing commercial development or existing residential development\nwith greater than two dwelling units per lot if:\n\n(1)\n\nany development constructed without a permit after January 1, 1992, will be removed\nfrom the site and the area restored to pre-development conditions; and\n\n(2)\n\nthe applicant files a site plan application or concurrent subdivision and site plan\napplications and elects to be governed by this section.\n\n(B)\n\nIn this section, STANDARD POND means water quality controls that comply with Section 25-8-213 (Water Quality Control Standards) or are approved under Section 25-8-151 (Innovative Management Practices).\n\n(C)\n\nThe requirements of this subchapter do not apply to the redevelopment of property\nif the redevelopment meets all of the following conditions:\n\n(1)\n\nThe redevelopment may not increase the existing amount of impervious cover on the\nsite.\n\n(2)\n\nThe redevelopment may not increase non-compliance, if any, with Article 7, Division\n1 (Critical Water Quality Zone Restrictions), Section 25-8-281 (Critical Environmental Features), Section 25-8-282 (Wetland Protection), Section 25-8-422 (Water Quality Transition Zone), or Section 25-8-452 (Water Quality Transition Zone).\n\n(3)\n\nThe redevelopment must remove any existing impervious cover from within 50 feet of\nthe centerline of a classified waterway or 50 feet from the shoreline of a lake, unless\nnecessary for allowable shoreline access, boat dock, or shoreline modification, and\nrevegetate the area as prescribed in the Environmental Criteria Manual.\n\n(4)\n\nThe redevelopment must comply with Article 3 (Environmental Resource Inventory; Pollutant Attenuation Plan) and all construction phase environmental requirements in effect at the time of construction,\nincluding Chapter 25-8, Article 5 (Erosion and Sedimentation Control; Overland Flow).\n\n(5)\n\nThe water quality controls for the redeveloped areas or an equivalent area on the\nsite must provide a level of water quality treatment that is equal to or greater than\nthat which was previously provided. At a minimum, the site must provide standard ponds\nfor the redeveloped area or an equivalent area on the site.\n\n(6)\n\nThe applicant must mitigate the effects of the redevelopment, if required by and in\naccordance with Subsection (D).\n\n(7)\n\nRedevelopment may not be located within the Erosion Hazard Zone, unless protective\nworks are provided as prescribed in the Drainage Criteria Manual.\n\n(D)\n\nRedevelopment of property under this section requires the purchase or restriction\nof mitigation land.\n\n(1)\n\nThe combined impervious cover of the mitigation land and the portion of the redevelopment\ntreated by sedimentation/filtration ponds may not exceed 20 percent of gross site\narea if in a water supply rural watershed or 40 percent of gross site area if in a\nwater supply suburban watershed.\n\n(2)\n\nThe mitigation requirement may be satisfied by:\n\n(a)\n\npaying into the Water Supply Mitigation Fund a nonrefundable amount established by\nordinance;\n\n(b)\n\ntransferring to the City in accordance with Paragraph (3) mitigation land approved\nby the director within a water supply rural or water supply suburban watershed, either\ninside or outside the City's jurisdiction;\n\n(c)\n\nplacing restrictions in accordance with Paragraph (3) on mitigation land approved\nby the director within a water supply rural or water supply suburban watershed, either\ninside or outside the City's jurisdiction; or\n\n(d)\n\na combination of the mitigation methods described in Subparagraphs (a)—(c), if approved\nby the director.\n\n(3)\n\nAn applicant redeveloping under this section shall pay all costs of restricting the\nmitigation land or transferring the mitigation land to the City, including the costs\nof:\n\n(a)\n\nan environmental site assessment without any recommendations for further clean-up,\ncertified to the City not earlier than the 120th day before the closing date transferring\nland to the City;\n\n(b)\n\na category 1(a) land title survey, certified to the City and the title company not\nearlier than the 120th day before the closing date transferring land to the City;\n\n(c)\n\na title commitment with copies of all Schedules B and C documents, and an owner's\ntitle policy;\n\n(d)\n\na fee simple deed, or, for a restriction, a restrictive covenant approved as to form\nby the City Attorney;\n\n(e)\n\ntaxes prorated to the closing date;\n\n(f)\n\nrecording fees; and\n\n(g)\n\ncharges or fees collected by the title company.\n\n(H)\n\nThe Watershed Protection Department shall adopt rules to identify criteria under this\nsection to ensure that the proposed mitigation, manner of development, and water quality\ncontrols offset the potential environmental impact of the redevelopment.\n\nSource: Ord. 20131017-046; Ord. No. 20170615-102, Pt. 9, 6-15-17; Ord. No. 20221027-045, Pt. 8, 11-7-22.\n\n(A)\n\nIt is the applicant's burden to establish that the findings described in this Section\nhave been met. Except as provided in Subsections (B) and (C), the Land Use Commission\nmay grant a variance from a requirement of this subchapter after determining that:\n\n(1)\n\nthe requirement will deprive the applicant of a privilege available to owners of other\nsimilarly situated property with approximately contemporaneous development subject\nto similar code requirements;\n\n(2)\n\nthe variance:\n\n(a)\n\nis not necessitated by the scale, layout, construction method, or other design decision\nmade by the applicant, unless the design decision provides greater overall environmental\nprotection than is achievable without the variance;\n\n(b)\n\nis the minimum deviation from the code requirement necessary to allow a reasonable\nuse of the property; and\n\n(c)\n\ndoes not create a significant probability of harmful environmental consequences; and\n\n(3)\n\ndevelopment with the variance will result in water quality that is at least equal\nto the water quality achievable without the variance.\n\n(B)\n\nThe Land Use Commission may grant a variance from a requirement of Section 25-8-422 (Water Quality Transition Zone), Section 25-8-452 (Water Quality Transition Zone), Section 25-8-482 (Water Quality Transition Zone), Section 25-8-652 (Restrictions on Development Impacting Lake Austin, Lady Bird Lake, and Lake Walter\nE. Long), or Article 7, Division 1 (Critical Water Quality Zone Restrictions), after determining that:\n\n(1)\n\nthe criteria for granting a variance in Subsection (A) are met;\n\n(2)\n\nthe requirement for which a variance is requested prevents a reasonable, economic\nuse of the entire property; and\n\n(3)\n\nthe variance is the minimum deviation from the code requirement necessary to allow\na reasonable, economic use of the entire property.\n\n(C)\n\nThe Land Use Commission may not grant a variance from a requirement of Article 13\n(Save Our Springs Initiative).\n\n(D)\n\nThe Land Use Commission shall prepare written findings of fact to support the grant\nor denial of a variance request under this section.\n\nSource: Section 13-2-505; Ord. 990225-70; Ord. 010607-8; Ord. 030508-60; Ord. 031211-11;\nOrd. 20131017-046; Ord. No. 20140626-113, Pt. 19, 7-7-14; Ord. No. 20170615-102, Pt. 10, 6-15-17.\n\n(A)\n\nA variance under this section may not vary the requirements of Article 13 (Save Our Springs Initiative).\n\n(B)\n\nThe director may grant a variance from a requirement of:\n\n(1)\n\nSubsection 25-8-213(C) (Water Quality Control Standards);\n\n(2)\n\nSection 25-8-261 (Critical Water Quality Zone Development), only if:\n\n(a)\n\nnecessary to protect public health and safety, or if the type of development requiring\nthe variance directly contributes to a significant, demonstrable environmental benefit,\nas determined by a functional assessment of floodplain health as prescribed by the\nEnvironmental Criteria Manual;\n\n(b)\n\nnecessary to allow an athletic field in existence on October 28, 2013, to be maintained,\nimproved, or replaced;\n\n(c)\n\nnecessary to allow an athletic field to be located in an area not otherwise allowed\nunder Subsection 25-8-261(B)(5);\n\n(d)\n\nnecessary to allow a hard surfaced trail to be located in an area not otherwise allowed\nunder Subsection 25-8-261(B)(3);\n\n(e)\n\nnecessary to allow the specified green stormwater infrastructure to be located in\nan area not otherwise allowed under Subsection 25-8-261(H); or\n\n(f)\n\nexcept in the Barton Springs Zone, necessary to allow a private driveway or private\nstreet to cross a critical water quality zone if the crossing is necessary to provide\nprimary access to the right-of-way or the crossing is required to comply with public\nhealth and safety requirements.\n\n(3)\n\nSection 25-8-261 (Critical Water Quality Zone Development), for development within an urban watershed, only if the proposed development:\n\n(a)\n\nis located not less than 25 feet from the centerline of a waterway;\n\n(b)\n\nis located outside the erosion hazard zone, unless protective works are provided as\nprescribed in the Drainage Criteria Manual;\n\n(c)\n\ndoes not increase non-compliance, if any, with Article 7, Division 1 (Critical Water Quality Zone Restrictions), Section 25-8-281 (Critical Environmental Features) or Section 25-8-282 (Wetland Protection); and\n\n(d)\n\nrestores native vegetation and soils if development is removed from the Critical Water\nQuality Zone;\n\n(4)\n\nSubsection 25-8-262(B) (Critical Water Quality Zone Mobility Crossings), only outside the Barton Springs Zone;\n\n(5)\n\nSection 25-8-281 (Critical Environmental Features);\n\n(6)\n\nSection 25-8-322 (Clearing for a Roadway);\n\n(7)\n\nSection 25-8-341 (Cut Requirements) or Section 25-8-342 (Fill Requirements), for a cut or fill of not more than eight feet:\n\n(a)\n\nin the desired development zone; or\n\n(b)\n\nfor a public primary or secondary educational facility;\n\n(8)\n\nSubsection 25-8-343(A) (Spoil Disposal);\n\n(9)\n\nSection 25-8-365 (Interbasin Diversion); or\n\n(10)\n\nSubsection 25-8-392(B)(6) (Uplands Zone), Subsection 25-8-392(C)(6) (Uplands Zone), Subsection 25-8-423(D) (Uplands Zone), or Subsection 25-8-453(E) (Uplands Zone).\n\n(C)\n\nIt is the applicant's burden to establish that the findings described in this section\nhave been met.\n\n(D)\n\nThe director may grant a variance described in Subsection (B) only after determining\nthat development in accordance with the variance meets the objective of the requirement\nfor which the variance is requested and:\n\n(1)\n\nfor property in the Barton Springs Zone, the variance will result in water quality\nthat is at least equal to the water quality achievable without the variance;\n\n(2)\n\nfor a variance from Subsection 25-8-213(C), that the proposed water quality control is:\n\n(a)\n\nnecessitated by unique site conditions; or\n\n(b)\n\nnecessary to avoid a loss in residential units or building square footage;\n\n(3)\n\nfor a variance from Section 25-8-261, that the development is necessary to allow a private driveway or private street\nto cross a critical water quality zone; The applicant must also demonstrate compliance\nwith the following:\n\n(a)\n\nThe crossing must span the active channel or use open bottom culverts as determined\nby the director.\n\n(b)\n\nIn suburban watersheds, critical water quality zone buffer averaging must be applied\nto the extent feasible in order to minimize the area of the private driveway within\nthe critical water quality zone impacted by the crossing.\n\n(c)\n\nThe location of the crossing must minimize impacts to critical environmental features,\nprotected and heritage trees, and slopes greater than 15%, and must minimize the amount\nof cut or fill necessary for construction.\n\n(d)\n\nThe construction is not located in the Barton Springs Zone.\n\n(4)\n\nfor a variance from Subsection 25-8-261(B)(5), that the proposed work on or placement of the athletic field will have no\nadverse environmental impacts;\n\n(5)\n\nfor a variance from Subsection 25-8-261(H), that the green stormwater infrastructure is:\n\n(a)\n\nnot required for regulatory compliance with 25-8-211 (Water Quality Control Requirement);\n\n(b)\n\ndesigned to capture runoff from existing, untreated impervious cover; and\n\n(c)\n\nproposed in a location that is the minimum necessary departure from the code requirement;\n\n(6)\n\nfor a variance from Section 25-8-281, that the proposed measures preserve all characteristics of the critical environmental\nfeature;\n\n(7)\n\nfor a variance from Section 25-8-341 or Section 25-8-342, the cut or fill is not located on a slope with a gradient of more than 15 percent\nor within 100 feet of a classified waterway;\n\n(8)\n\nfor a variance from Subsection 25-8-343(A), use of the spoil provides a necessary public benefit. Necessary public benefits\ninclude:\n\n(a)\n\nroadways;\n\n(b)\n\nstormwater detention facilities;\n\n(c)\n\npublic or private park sites; and\n\n(d)\n\nbuilding sites that comply with Section 25-8-341 (Cut Requirements), Section 25-8-342 (Fill Requirements), and Chapter 25-7 (Drainage);\n\n(9)\n\nfor a variance from Section 25-8-365, there are no adverse environmental or drainage impacts; or\n\n(10)\n\nfor a variance from Subsection 25-8-392(B)(6), Subsection 25-8-392(C)(6), Subsection 25-8-423(D), or Subsection 25-8-453(E), the variance:\n\n(a)\n\nis the minimum deviation needed to provide necessary improvements for a public mobility\nproject in the right-of-way; and\n\n(b)\n\ndoes not create significant adverse environmental impacts.\n\n(E)\n\nThe director shall prepare written findings to support the grant or denial of a variance\nrequest under this section.\n\nSource: Section 13-2-506; Ord. 990225-70; Ord. 000406-82; Ord. 010329-18; Ord. 031211-11;\nOrd. 20120524-083; Ord. 20131017-046; Ord. No. 20160623-090, Pt. 7, 7-4-16; Ord. No. 20170615-102, Pt. 11, 6-15-17; Ord. No. 20220519-094, Pt. 4, 5-30-22; Ord. No. 20221027-045, Pt. 9, 11-7-22; Ord. No. 20221027-045, Pt. 38, 11-1-23.\n\nThe director shall prepare and maintain for public inspection a written summary of\nvariances granted and denied under Sections 25-8-41 (Land Use Commission Variances) and 25-8-42 (Administrative Variances).\n\nSource: Section 13-2-506(c); Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThis division applies to the impervious cover requirements of this Subchapter.\n\n(B)\n\nThe impervious cover requirements of this Subchapter do not restrict impervious cover\non a single-family or duplex lot but apply to the subdivision as a whole.\n\nSource: Section 13-7-3; Ord. 990225-70; Ord. 031211-11; Ord. 20060126-069.\n\n(A)\n\nNet site area includes only the portions of a site that lie in an uplands zone and\nhave not been designated for surface or subsurface wastewater irrigation.\n\n(B)\n\nFor land described in Subsection (A), net site area is the aggregate of:\n\n(1)\n\n100 percent of the land with a gradient of 15 percent or less;\n\n(2)\n\n40 percent of the land with a gradient of more than 15 percent and not more than 25\npercent; and\n\n(3)\n\n20 percent of the land with a gradient of more than 25 percent and not more than 35\npercent.\n\n(C)\n\nNet site area does not apply in the urban and suburban watersheds.\n\nSource: Section 13-7-3; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046; Ord. No. 20221027-045, Pt. 10, 11-7-22.\n\n(A)\n\nImpervious cover is calculated in accordance with this Section and the Environmental\nCriteria Manual.\n\n(B)\n\nImpervious cover calculations include:\n\n(1)\n\nroads;\n\n(2)\n\ndriveways;\n\n(3)\n\nparking areas;\n\n(4)\n\nbuildings;\n\n(5)\n\nconcrete;\n\n(6)\n\nimpermeable construction covering the natural land surface;\n\n(7)\n\nfor an uncovered wood deck that has drainage spaces between the deck boards and that\nis located over a pervious surface, 50 percent of the horizontal area of the deck;\nand\n\n(8)\n\nthe portion of a site used for the storage of scrap and metal salvage, including auto\nsalvage.\n\n(C)\n\nImpervious cover calculations exclude:\n\n(1)\n\nsidewalks in a public right-of-way or public easement;\n\n(2)\n\nmulti-use trails open to the public and located on public land or in a public easement;\n\n(3)\n\nwater quality controls, excluding subsurface water quality controls;\n\n(4)\n\ndetention basins, excluding subsurface detention basins;\n\n(5)\n\nground level rainwater harvesting cisterns, excluding subsurface cisterns;\n\n(6)\n\ndrainage swales and conveyances;\n\n(7)\n\nthe water surface area of ground level pools, fountains, and ponds;\n\n(8)\n\nareas with gravel placed over pervious surfaces that are used only for landscaping\nor by pedestrians and are not constructed with compacted base;\n\n(9)\n\nporous pavement designed in accordance with the Environmental Criteria Manual, limited\nto only pedestrian walkways and multi-use trails, and located outside the Edwards\nAquifer Recharge Zone;\n\n(10)\n\nfire lanes designed as prescribed by the Environmental Criteria Manual, that consist\nof interlocking pavers, and are restricted from routine vehicle access;\n\n(11)\n\nan access ramp for an existing single-family and duplex residential unit if:\n\n(a)\n\na person with a disability requires access to a dwelling entrance that meets the requirements\nof the Residential Code, Section R320.6 (Visitable dwelling entrance);\n\n(b)\n\nthe building official determines that the ramp will not pose a threat to public health\nand safety;\n\n(c)\n\nthe ramp:\n\n(i)\n\nis no wider than 48 inches, except that any portion of a landing for the ramp required\nfor turns may be no wider than 60 inches; and\n\n(ii)\n\nmay have a hand railing, but may not have a roof or walls; and\n\n(d)\n\nthe ramp is located in a manner that utilizes existing impervious cover to the greatest\nextent possible if:\n\n(i)\n\nimpervious cover on the property is at or above the maximum amount of impervious cover\nallowed by this title; or\n\n(ii)\n\nif placement of the ramp would result in the property exceeding the maximum amount\nof impervious cover allowed by this title; and\n\n(12)\n\na subsurface portion of a parking structure if the director determines that:\n\n(a)\n\nthe subsurface portion of the structure:\n\n(i)\n\nis located within an urban or suburban watershed;\n\n(ii)\n\nis below the grade of the land that existed before construction of the structure;\n\n(iii)\n\nis covered by soil with a minimum depth of two feet and an average depth of not less\nthan four feet; and\n\n(iv)\n\nhas an area not greater than fifteen percent of the site;\n\n(b)\n\nthe structure is not associated with a use regulated by Section 1.2.2 of Subchapter\nF of Chapter 25-2 (Residential Design and Compatibility Standards);\n\n(c)\n\nthe applicant submits an assessment of the presence and depth of groundwater at the\nsite sufficient to determine whether groundwater will need to be discharged or impounded;\n\n(d)\n\nthe applicant submits documentation that the discharge or impoundment of groundwater\nfrom the structure, if any, will be managed to avoid adverse effects on public health\nand safety, the environment, and adjacent property; and\n\n(13)\n\nfor purposes of residential building permit review only, no more than two feet of\nelevated, projecting elements such as eaves, overhangs, cantilevered portions of structures,\nbalconies, awnings, and bay windows. This exemption does not apply to site plans or\nthe calculation of the drainage charge under Section 15-2-5 (Impervious Cover Calculation).\n\nSource: Subsections 13-2-595 (a), (b), and (g); Ord. 990225-70; Ord. 000406-85; Ord.\n010329-18; Ord. 031211-11; Ord. 20060831-068; Ord. 20131017-046; Ord. No. 20140522-078, Pt. 2, 6-2-14; Ord. No. 20170615-102, Pt. 12, 6-15-17; Ord. No. 20221027-045, Pt. 11, 11-7-22.\n\n(A)\n\nThis section applies to impervious cover calculations for duplex or single-family\nlots.\n\n(B)\n\nExcept as provided in Subsection (C):\n\n(1)\n\nfor each lot greater than three acres in size, 10,000 square feet of impervious cover\nis assumed;\n\n(2)\n\nfor each lot greater than one acre and not more than three acres in size, 7,000 square\nfeet of impervious cover is assumed;\n\n(3)\n\nfor each lot greater than 15,000 square feet and not more than one acre in size, 5,000\nsquare feet of impervious cover is assumed;\n\n(4)\n\nfor each lot greater than 10,000 square feet and not more than 15,000 square feet\nin size, 3,500 square feet of impervious cover is assumed;\n\n(5)\n\nfor each lot greater than 5,750 square feet and not more than 10,000 square feet in\nsize, 2,500 square feet of impervious cover is assumed; and\n\n(6)\n\nfor each residential lot not more than 5,750 square feet in size, the amount of impervious\ncover assumed is;\n\n(a)\n\nthe maximum amount of impervious cover allowed under the applicable zoning district\nregulations; or\n\n(b)\n\nfor lots in the extraterritorial jurisdiction, 2,500 square feet of impervious cover.\n\n(C)\n\nFor a lot that is restricted to a lesser amount of impervious cover than prescribed\nby this section, the lesser amount of impervious cover is assumed. The manner in which\nthe lot is restricted is subject to the approval of the director.\n\n(D)\n\nExcept as provided in Subsection (C), this section does not restrict impervious cover\non an individual lot.\n\nSource: Ord. 000406-85; Ord. 010329-18; Ord. 031211-11; Ord. 20060126-069; Ord. No. 20221027-045, Pt. 12, 11-7-22; Ord. No. 20230831-141, Pt. 45, 9-11-23; Ord. No. 20250306-037, Pt. 5, 5-23-25.\n\n(A)\n\nThis section applies to impervious cover calculations for commercial developments.\n\n(B)\n\nAn application for a commercial development must demonstrate that once fully constructed,\nthe development will not exceed applicable maximum impervious cover limitations.\n\n(C)\n\nSubsection (B) does not apply to an application for a roadway improvement with less\nthan 8,000 square feet of new impervious cover. For the purposes of this Section,\nroadway improvements are limited to intersection upgrades, low-water crossing upgrades,\nadditions for bicycle lanes, and additions for mass transit stops.\n\nSource: Ord. 20131017-046; Ord. No. 20170615-102, Pt. 13, 6-15-17.\n\n(A)\n\nThis section classifies the waterways according to drainage area.\n\n(B)\n\nIn all watersheds except urban:\n\n(1)\n\na minor waterway has a drainage area of at least 64 acres and not more than 320 acres;\n\n(2)\n\nan intermediate waterway has a drainage area of more than 320 acres and not more than\n640 acres; and\n\n(3)\n\na major waterway has a drainage area of more than 640 acres.\n\nSource: Sections 13-2-521, 13-2-541, 13-2-561, and 13-2-581; Ord. 990225-70; Ord.\n031211-11; Ord. 20131017-046.\n\n(A)\n\nIn the water supply rural watersheds, water supply suburban watersheds, and Barton\nSprings Zone, a critical water quality zone is established along each waterway classified\nunder Section 25-8-91 (Waterway Classifications).\n\n(1)\n\nThe boundaries of a critical water quality zone coincide with the boundaries of the\n100-year flood plain as determined under Section 25-7-6 (Determination of the 100-Year Floodplain), except:\n\n(a)\n\nfor a minor waterway, the boundaries of the critical water quality zone are located\nnot less than 50 feet and not more than 100 feet from the centerline of the waterway;\n\n(b)\n\nfor an intermediate waterway, the boundaries of the critical water quality zone are\nlocated not less than 100 feet and not more than 200 feet from the centerline of the\nwaterway;\n\n(c)\n\nfor a major waterway, the boundaries of the critical water quality zone are located\nnot less than 200 feet and not more than 400 feet from the centerline of the waterway;\nand\n\n(d)\n\nfor the main channel of Barton Creek, the boundaries of the critical water quality\nzone are located 400 feet from the centerline of the creek.\n\n(2)\n\nNotwithstanding the provisions of Subsections (A)(1)(a), (b), and (c), a critical\nwater quality zone does not apply to a drainage ditch located parallel and adjacent\nto a railroad or public roadway right-of-way if the ditch:\n\n(a)\n\nwas designed and constructed primarily to serve the adjacent railroad or public roadway;\n\n(b)\n\nis not a segment or modification of a natural waterway;\n\n(c)\n\ndoes not possess any natural and traditional character; and\n\n(d)\n\ncannot reasonably be restored to a natural condition due to existing site constraints.\n\n(B)\n\nIn the suburban watersheds, a critical water quality zone is established along each\nwaterway classified under Section 25-8-91 (Waterway Classifications).\n\n(1)\n\nFor a minor waterway, the boundaries of the critical water quality zone are located\n100 feet from the centerline of the waterway.\n\n(2)\n\nFor an intermediate waterway, the boundaries of the critical water quality zone are\nlocated 200 feet from the centerline of the waterway.\n\n(3)\n\nFor a major waterway, the boundaries of the critical water quality zone are located\n300 feet from the centerline of the waterway.\n\n(4)\n\nThe critical water quality zone boundaries may be reduced to not less than 50 feet\nfrom the centerline of a minor waterway, 100 feet from the centerline of an intermediate\nwaterway, 150 feet from the centerline of a major waterway if the overall surface\narea of the critical water quality zone is the same or greater than the surface area\nthat would be provided without the reduction, as prescribed in the Environmental Criteria\nManual.\n\n(5)\n\nNotwithstanding the provisions of Subsections (B)(1), (2), and (3), a critical water\nquality zone does not apply to a drainage ditch located parallel and adjacent to a\nrailroad or public roadway right-of-way if the ditch:\n\n(a)\n\nwas designed and constructed primarily to serve the adjacent railroad or public roadway;\n\n(b)\n\nis not a segment or modification of a natural waterway;\n\n(c)\n\ndoes not possess any natural and traditional character; and\n\n(d)\n\ncannot reasonably be restored to a natural condition due to existing site constraints.\n\n(C)\n\nIn an urban watershed, a critical water quality zone is established along each waterway\nwith a drainage area of at least 64 acres. This does not apply in the area bounded\nby IH-35, Riverside Drive, Barton Springs Road, Lamar Boulevard, and 15th Street.\n\n(1)\n\nThe boundaries of the critical water quality zone coincide with the boundaries of\nthe 100-year floodplain as determined under Section 25-7-6 (Determination of the 100-Year Floodplain), provided that the boundary is not less than 50 feet and not more than 400 feet\nfrom the centerline of the waterway.\n\n(2)\n\nNotwithstanding the provisions of Subsection (C)(1), a critical water quality zone\ndoes not apply to a drainage ditch located parallel and adjacent to a railroad or\npublic roadway right-of-way if the ditch:\n\n(a)\n\nwas designed and constructed primarily to serve the adjacent railroad or public roadway;\n\n(b)\n\nis not a segment or modification of a natural waterway;\n\n(c)\n\ndoes not possess any natural and traditional character; and\n\n(d)\n\ncannot reasonably be restored to a natural condition due to existing site constraints.\n\n(D)\n\nCritical water quality zones are established to include the inundated areas that constitute\nLake Walter E. Long, Lake Austin, Lady Bird Lake, and the Colorado River downstream\nof Lady Bird Lake.\n\n(E)\n\nCritical water quality zones are established along and parallel to the shorelines\nof Lake Travis, Lake Austin, Lady Bird Lake, and Lake Walter E. Long.\n\n(1)\n\nThe shoreline boundary of a critical water quality zone:\n\n(a)\n\nfor Lake Travis, coincides with the 681.0 foot contour line;\n\n(b)\n\nfor Lake Austin, coincides with the 492.8 foot contour line;\n\n(c)\n\nfor Lady Bird Lake, coincides with the 429.0 foot contour line; and\n\n(d)\n\nfor Lake Walter E. Long, coincides with the 554.5 foot contour line.\n\n(2)\n\nThe width of a critical water quality zone, measured horizontally inland, is:\n\n(a)\n\n100 feet; or\n\n(b)\n\nfor a detached single-family residential use, 75 feet.\n\n(F)\n\nCritical water quality zones are established along and parallel to the shorelines\nof the Colorado River downstream of Lady Bird Lake.\n\n(1)\n\nThe shoreline boundary of a critical water quality zone coincides with the river's\nordinary high water mark, as defined by Code of Federal Regulations Title 33, Section\n328.3 (Definitions).\n\n(2)\n\nThe inland boundary of a critical water quality zone coincides with the boundary of\nthe 100-year floodplain as determined under Section 25-7-6 (Determination of the 100-Year Floodplain) except that the width of the critical water quality zone, measured horizontally\ninland, is not less than 200 feet and not more than 400 feet.\n\nSource: Subsections 13-7-23(a), (b), (c), (d), (f), and (g); Ord. 990225-70; Ord.\n990819-99; Ord. 031211-11; Ord. 20080228-116; Ord. 20101209-075; Ord. 20131017-046;\nOrd. No. 20170615-102, Pt. 14, 6-15-17; Ord. No. 20191114-064, Pt. 11, 11-25-19; Ord. No. 20221027-045, Pt. 13, 11-7-22.\n\n(A)\n\nIn the water supply rural watersheds, water supply suburban watersheds, and in the\nBarton Springs zone, excluding Lake Austin, Lake Travis, and Lady Bird Lake, a water\nquality transition zone is established adjacent and parallel to the outer boundary\nof each critical water quality zone.\n\n(B)\n\nThe width of a water quality transition zone is:\n\n(1)\n\nfor a minor waterway, 100 feet;\n\n(2)\n\nfor an intermediate waterway, 200 feet; and\n\n(3)\n\nfor a major waterway, 300 feet.\n\nSource: Sections 13-2-523(a), 13-2-543(a), 13-2-563(a), and 13-2-583(a); Ord. 990225-70;\nOrd. 031211-11; Ord. 20131017-046.\n\nAn uplands zone includes all land and waters not included in a critical water quality\nzone or a water quality transition zone.\n\nSource: Section 13-7-3; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nFor an application for a preliminary plan or plan, an applicant may provide an environmental\nresource inventory in accordance with this section to demonstrate compliance with\napplicable regulations.\n\n(B)\n\nFor all other applications, an applicant shall file an environmental resource inventory\nwith the director for proposed development located on a tract:\n\n(1)\n\nwithin the Edwards Aquifer recharge zone;\n\n(2)\n\ncontaining a critical water quality zone;\n\n(3)\n\nwith a gradient of more than 15 percent; or\n\n(4)\n\ncontaining, or within 150 feet of, a potential or verified wetland feature as identified\nin a map maintained by the Watershed Protection Department and made available for\nreference online and at the offices of the Development Services Department.\n\n(C)\n\nAn environmental resource inventory must:\n\n(1)\n\nidentify critical environmental features and propose protection measures for the features;\n\n(2)\n\nprovide an environmental justification for spoil disposal locations or roadway alignments;\n\n(3)\n\npropose methods to achieve overland flow;\n\n(4)\n\ndescribe proposed industrial uses and the pollution abatement program; and\n\n(5)\n\nbe completed as prescribed by the Environmental Criteria Manual.\n\n(D)\n\nAn environmental resource inventory must include:\n\n(1)\n\na hydrogeologic report in accordance with Section 25-8-122 (Hydrogeologic Report);\n\n(2)\n\na vegetation report in accordance with Section 25-8-123 (Vegetation Report); and\n\n(3)\n\na wastewater report in accordance with Section 25-8-124 (Wastewater Report).\n\n(E)\n\nThe director of the Watershed Protection Department may permit an applicant to exclude\nfrom an environmental resource inventory information required by this section after\ndetermining that the information is unnecessary because of the scope and nature of\nthe proposed development.\n\nSource: Section 13-7-28; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20170615-102, Pt. 15, 6-15-17; Ord. No. 20191114-064, Pt. 12, 11-25-19; Ord. No. 20221027-045, Pt. 14, 11-7-22; Ord. No. 20230831-141, Pt. 46, 9-11-23.\n\nA hydrogeologic report must:\n\n(1)\n\ngenerally describe the topography, soils, and geology of the site;\n\n(2)\n\nidentify springs and significant point recharge features on the site;\n\n(3)\n\ndemonstrate that proposed drainage patterns will protect the quality and quantity\nof recharge at significant point recharge features; and\n\n(4)\n\nidentify all recorded and unrecorded water wells, both on the site and within 150\nfeet of the boundary of the site.\n\nSource: Section 13-7-28(1); Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\nA vegetation report must:\n\n(1)\n\ndemonstrate that the proposed development:\n\n(a)\n\npreserves to the greatest extent practicable the significant trees and vegetation\non the site; and\n\n(b)\n\nprovides maximum erosion control and overland flow benefits from the vegetation;\n\n(2)\n\ninclude one of the following:\n\n(a)\n\na tree survey of all trees with a diameter of at least eight inches measured four\nand one-half feet above natural grade level; or\n\n(b)\n\non approval of the city arborist, stereo aerial photographs that are nine inches by\nnine inches in size, are at a scale of one inch to 400 feet or larger, and were photographedbetween\nthe months of April and November; and\n\n(3)\n\nfor a commercial or multifamily site, include a vegetation survey that shows the approximate\nlocations and types of all significant vegetation.\n\nSource: Section 13-7-28(2); Ord. 990225-70; Ord. 031211-11.\n\nA wastewater report must:\n\n(1)\n\nprovide environmental justification for a sewer line location in a critical water\nquality zone;\n\n(2)\n\naddress construction techniques and standards for wastewater lines;\n\n(3)\n\ninclude calculations of drainfield or wastewater irrigation areas;\n\n(4)\n\ndescribe alternative wastewater disposal systems used over the Edwards Aquifer recharge\nzone; and\n\n(5)\n\naddress on-site collection and treatment systems, their treatment levels, and effects\non receiving watercourses or the Edwards Aquifer.\n\nSource: Section 13-7-28(3); Ord. 990225-70; Ord. 031211-11.\n\nAn applicant proposing an industrial use that is not completely enclosed in a building\nshall provide a pollutant attenuation plan in accordance with the Environmental Criteria\nManual.\n\nSource: Section 13-7-32; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nAn innovative water quality control is a practice that is not specifically prescribed\nin the Environmental Criteria Manual, but is designed to address the requirements\nof Article 6 (Water Quality Controls).\n\n(B)\n\nAn innovative runoff management practice is a practice that is designed to address\nthe requirements of Section 25-8-281 (Critical Environmental Features), enhance the recharge of groundwater and the discharge of springs, and maintain\nthe function of critical environmental features.\n\n(C)\n\nA proposal for an innovative water quality control or runoff management practice proposal\nmust be reviewed and approved by the Watershed Protection Department. Review and approval\nis based on:\n\n(1)\n\ntechnical merit;\n\n(2)\n\ncompliance with the requirements of this title for water quality protection and improvement;\n\n(3)\n\nresource protection and improvement;\n\n(4)\n\nadvantages over standard practices; and\n\n(5)\n\nanticipated maintenance requirements.\n\nSource: Section 13-7-17; Ord. 990225-70; Ord. 031211-11.\n\nA civil engineer registered in Texas must certify a plan or plat as complete, accurate,\nand in compliance with the requirements of this subchapter. The director may waive\nthis requirement after making a determination that the plan or plat includes only\nminor alterations or improvement that do not require the services of an engineer.\n\nSource: Section 13-7-4; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046.\n\nTemporary erosion and sedimentation controls:\n\n(1)\n\nare required for all development until permanent revegetation has been established;\nand\n\n(2)\n\nmust be removed after permanent revegetation has been established.\n\nSource: Sections 13-7-14(a) and (b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDevelopment is not completed until:\n\n(1)\n\npermanent revegetation is established; and\n\n(2)\n\nthe director:\n\n(a)\n\nreceives the engineer's concurrence letter; and\n\n(b)\n\ncertifies installation of the vegetation for acceptance.\n\n(B)\n\nDevelopment must be completed under Subsection (A) before the City may accept maintenance\nresponsibility for streets, drainage facilities, or utilities, or issue a certificate\nof occupancy or compliance, unless the City and the applicant enter into an agreement\nto ensure completion of the revegetation within a named period.\n\nSource: Section 13-7-14(c); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20221027-045, Pt. 15, 11-7-22.\n\nA City inspector may modify an erosion control plan or construction sequencing plan\nin the field:\n\n(1)\n\nwithout notice to the permit holder, if the modification is a minor change to upgrade\nerosion controls or reflect construction progress; and\n\n(2)\n\nafter two days written notice to the permit holder, if:\n\n(a)\n\nthe inspector determines that an erosion control or the construction sequencing is\ninappropriate or inadequate; and\n\n(b)\n\nthe director has confirmed in writing the inspector's determination.\n\nSource: Section 13-7-14(d); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nThis section provides additional erosion and sedimentation control requirements for\ndevelopment in the Barton Springs Zone.\n\n(B)\n\nA temporary erosion and sedimentation control plan and a water quality plan certified\nby a registered professional engineer and approved by the director is required.\n\n(1)\n\nThe plans must describe the temporary structural controls, site management practices,\nor other approved methods that will be used to control of off-site sedimentation until\npermanent revegetation is certified as completed under Section 25-8-182 (Development Completion).\n\n(2)\n\nThe temporary erosion control plan must be phased to be effective at all stages of\nconstruction. Each temporary erosion control method must be adjusted, maintained,\nand repaired as necessary.\n\n(C)\n\nThe director may require a modification of the temporary erosion control plan after\ndetermining that the plan does not adequately control off-site sedimentation from\nthe development. Approval by the director and the engineer who certified the plan\nis required for a major modification of the plan.\n\n(D)\n\nThe owner shall designate a project manager who is responsible for compliance with\nthe erosion and sedimentation control and water quality plan requirements during development.\n\n(E)\n\nThe length of time between clearing and final revegetation of development may not\nexceed 18 months, unless extended by the director.\n\n(F)\n\nIf an applicant does not comply with the deadline in Subsection (E), or does not adequately\nmaintain the temporary erosion and sedimentation controls, the director shall notify\nthe applicant in writing that the City will repair the controls or revegetate the\ndisturbed area at the applicant's expense unless the work is completed or revegetation\nis begun not later than the 15th day after the date of the notice.\n\n(G)\n\nA person commits an offense if the person allows sediment from a construction site\nto enter a waterway by failing to maintain erosion controls or failing to follow the\napproved sequence of construction.\n\nSource: Section 13-7-14(e); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20221027-045, Pt. 16, 11-7-22.\n\n(A)\n\nDrainage patterns must be designed to:\n\n(1)\n\nprevent erosion;\n\n(2)\n\nmaintain infiltration and recharge of local seeps, springs, and waterways;\n\n(3)\n\nattenuate the harm of contaminants collected and transported by stormwater;\n\n(4)\n\nwhere feasible, maintain and restore overland sheet flow, maintain natural drainage\nfeatures and patterns, and disperse runoff back to sheet flow; and\n\n(5)\n\nwhere feasible, direct stormwater to landscape areas including islands, medians, peninsulas,\nand other similar areas. Exceptions to this requirement include:\n\n(a)\n\nperimeter landscape areas that are not required to drain to a stormwater control measure;\n\n(b)\n\nimpervious areas on which the land use or activity may generate highly contaminated\nrunoff, as prescribed by the Environmental Criterial Manual; and\n\n(c)\n\nimpervious areas used for parking or driving of vehicles if located within the Edwards\nAquifer recharge zone.\n\n(B)\n\nThe applicant shall design an enclosed storm drain to mitigate potential adverse impacts\non water quality by using methods to prevent erosion and dissipate discharges from\noutlets. Applicant shall locate discharges to maximize overland flow through buffer\nzones or grass-lined swales wherever practicable.\n\nSource: Section 13-7-29; Ord. 990225-70; Ord. 010329-18; Ord. 010607-8; Ord. 031211-11;\nOrd. 20131017-046; Ord. No. 20221027-045, Pt. 17, 11-7-22.\n\nA site plan may be approved only if the applicant provides fiscal security for:\n\n(1)\n\ninstalling and maintaining erosion and sedimentation controls throughout construction\non the site;\n\n(2)\n\nrevegetating the site; and\n\n(3)\n\nperforming on-site and off-site cleanup.\n\nSource: Ord. 20131017-046.\n\n(A)\n\nIn the Barton Springs Zone, water quality controls are required for all development.\n\n(B)\n\nIn a watershed other than a Barton Springs Zone watershed, water quality controls\nare required for development:\n\n(1)\n\nlocated in the water quality transition zone;\n\n(2)\n\nof a golf course, play field, or similar recreational use, if fertilizer, herbicide,\nor pesticide is applied; or\n\n(3)\n\nif the total of new and redeveloped impervious cover exceeds 8,000 square feet.\n\n(C)\n\nAll new development must provide for removal of floating debris from stormwater runoff.\n\n(D)\n\nThe water quality control requirements in this division do not require water quality\ncontrols on a single-family or duplex lot but apply to the residential subdivision\nas a whole.\n\n(E)\n\nThe water quality control requirements in this division do not require water quality\ncontrols for a roadway improvement with less than 8,000 square feet of new impervious\ncover. For the purposes of this section, roadway improvements are limited to intersection\nupgrades, low-water crossing upgrades, additions for bicycle lanes, and additions\nfor mass transit stops.\n\n(F)\n\nFor a public mobility project in the right-of-way, the calculation of impervious cover\nfor compliance with Subsection (B)(3) or Subsection (E) in any watershed shall:\n\n(1)\n\nbe determined on a watershed basis for development applications that span multiple\nwatersheds; and\n\n(2)\n\ndeduct existing impervious cover that is removed by the same project if the area with\nremoved impervious cover is:\n\n(i)\n\ndecompacted and revegetated as prescribed in the Environmental Criteria Manual and\nthe Standard Specifications Manual; and\n\n(ii)\n\nlocated within the same watershed.\n\nSource: Sections 13-7-18 and 13-7-19; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20170615-102, Pt. 16, 6-15-17; Ord. No. 20220519-094, Pt. 5, 5-30-22.\n\nWater quality controls in accordance with Section 25-8-213 (Water Quality Control Standards) are required for a commercial or multifamily development with more than 20 percent\nimpervious cover that has been granted a waiver of previous water quality requirements\nor a special exception under this subchapter.\n\nSource: Section 13-2-503(c); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA water quality control must be designed in accordance with the Environmental Criteria\nManual.\n\n(1)\n\nThe control must provide at least the treatment level of a sedimentation/filtration\nsystem under the Environmental Criteria Manual.\n\n(2)\n\nAn impervious liner is required for structural water quality controls over the Edwards\nAquifer recharge zone. If a liner is required and there are multiple controls in series,\nliners are only required for the first control in the series.\n\n(3)\n\nThe control must be accessible for maintenance and inspection as prescribed in the\nEnvironmental Criteria Manual.\n\n(B)\n\nA water quality control must capture and treat the water draining to the control from\nthe contributing area. The required capture volume is:\n\n(1)\n\nthe first one-half inch of runoff; and\n\n(2)\n\nfor each 10 percent increase in impervious cover over 20 percent of gross site area,\nan additional one-tenth of an inch of runoff.\n\n(C)\n\nThe required water quality treatment must be provided using green stormwater control\nmeasures, as prescribed in the Environmental Criteria Manual.\n\n(D)\n\nNotwithstanding Subsection (C), all or part of the required water quality treatment\nmay be provided using other water quality controls for:\n\n(1)\n\nareas with land uses or activities that may generate highly contaminated runoff, as\ndescribed in the Environmental Criteria Manual;\n\n(2)\n\na project that provides water quality treatment for currently untreated, developed\noff-site areas of at least ten acres in size; or\n\n(3)\n\nsites with impervious cover of greater than 90 percent gross site area.\n\n(E)\n\nThe location of a water quality control:\n\n(1)\n\nmust avoid recharge features to the greatest extent possible;\n\n(2)\n\nmust be shown on the slope map, preliminary plan, site plan, or subdivision construction\nplan, as applicable; and\n\n(3)\n\nin a water supply rural watershed, may not be in the 40 percent buffer zone, unless\nthe control disturbs less than 50% of the buffer, and is located to maximize overland\nflow and recharge in the undisturbed remainder of the 40 percent buffer zone.\n\n(F)\n\nThis subsection provides additional requirements for the Barton Springs Zone.\n\n(1)\n\nApproval by the Watershed Protection Department is required for a proposed water quality\ncontrol that is not described in the Environmental Criteria Manual. The applicant\nmust substantiate the pollutant removal efficiency of the proposed control with published\nliterature or a verifiable engineering study.\n\n(2)\n\nWater quality controls must be placed in sequence if necessary to remove the required\namount of pollutant. The sequence of controls must be:\n\n(a)\n\nbased on the Environmental Criteria Manual or generally accepted engineering principles;\nand\n\n(b)\n\ndesigned to minimize maintenance requirements.\n\nSource: Sections 13-7-18, 13-7-19, and 13-7-34; Ord. 990225-70; Ord. 010329-18; Ord.\n031211-11; Ord. 20131017-046; Ord. No. 20221027-045, Pt. 18, 11-7-22.\n\n(A)\n\nThe director shall identify and prioritize water quality control facilities for the\nurban watersheds in an Urban Watersheds Structural Control Plan. The Environmental\nCommission shall review the plan annually.\n\n(B)\n\nAn Urban Watersheds Structural Control Fund is established for use in the design and\nconstruction of water quality control facilities in the urban watershed.\n\n(C)\n\nInstead of providing the water quality controls required under Section 25-8-211 (Water Quality Control Requirement), in an urban watershed an applicant may request approval to deposit with the City\na nonrefundable cash payment, based on a formula established by the council. The director\nshall review the request and accept or deny the request based on the standards in\nthe Environmental Criteria Manual.\n\n(D)\n\nThe director shall deposit a payment made under Subsection (C) in the Urban Watersheds\nStructural Control Fund.\n\n(E)\n\nA Suburban and Water Supply Watersheds Structural Control Fund is established for\nuse in the design and construction of water quality control facilities.\n\n(F)\n\nFor a public mobility project in the right-of-way that is located in a suburban, water\nsupply suburban, or water supply rural watershed, an applicant may request approval\nto deposit a nonrefundable cash payment, based on a formula established by the council,\nwith the City instead of providing the water quality controls required under Section 25-8-211 (Water Quality Control Requirement). The director shall review the request and accept or deny the request based on the\nstandards in the Environmental Criteria Manual.\n\n(G)\n\nThe director shall deposit a payment made under Subsection (F) in the Suburban and\nWater Supply Watersheds Structural Control Fund.\n\nSource: Section 13-7-19.1; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20220519-094, Pt. 6, 5-30-22; Ord. No. 20221027-045, Pt. 19, 11-7-22.\n\nA person who redevelops property in an urban watershed and is required to construct\na water quality control may qualify for cost participation by the City for:\n\n(1)\n\nconstruction of the water quality control; or\n\n(2)\n\noptional payment instead of construction of the water quality control under Section 25-8-214 (Optional Payment Instead of Structural Controls in Urban Watersheds).\n\nSource: Section 13-7-19(g); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this section:\n\n(1)\n\nCOMMERCIAL DEVELOPMENT means all development other than Residential Development.\n\n(2)\n\nCOMMERCIAL POND means a required water quality control or appurtenance that receives\nstormwater runoff from a Commercial Development.\n\n(3)\n\nECM STANDARDS means the provisions in the Environmental Criteria Manual regarding\nmaintenance of a required water quality control or appurtenance.\n\n(4)\n\nRESIDENTIAL DEVELOPMENT means development of two dwelling units or less per lot.\n\n(5)\n\nRESIDENTIAL POND means a required water quality control or appurtenance that receives\nstormwater runoff from a Residential Development.\n\n(B)\n\nThe record owner of a commercial development shall maintain the commercial pond serving\nthe commercial development in accordance with the ECM standards, whether or not the\ncommercial pond is located on the same property as the commercial development. The\nrecord owner shall provide the City proof of the right to access and maintain the\ncommercial pond if it is not located on the same property as the commercial development.\n\n(C)\n\nIf more than one commercial development is served by a single commercial pond, the\nrecord owners of the commercial pond and all commercial developments served by the\ncommercial pond shall be jointly and severally responsible for maintenance of the\ncommercial pond in accordance with the ECM standards.\n\n(D)\n\nThe director of the Watershed Protection Department may authorize an alternative arrangement\nfor maintenance of a residential or commercial pond in accordance with the Environmental\nCriteria Manual standards. If an alternative arrangement is approved by the director,\nthe city attorney shall determine whether an agreement is necessary; the agreement\nmust be approved by the city attorney and filed of record.\n\n(E)\n\nThe City shall inspect each commercial pond that is not a subsurface pond at least\nonce every three years to ensure that the commercial pond is being maintained in accordance\nwith the ECM standards. If the commercial pond fails inspection requiring an additional\ninspection, the director of the Watershed Protection Department may charge a re-inspection\nfee.\n\n(F)\n\nThe record owner of a subsurface commercial pond must provide the Watershed Protection\nDepartment with a maintenance plan and an annual report from a registered engineer\nverifying that the pond is in proper operating condition.\n\n(G)\n\nUntil the City accepts a residential pond for maintenance, the record owner(s) of\nthe residential pond and the residential development served shall maintain the residential\npond in accordance with the ECM standards.\n\n(H)\n\nThe City shall be responsible for maintenance of a residential pond only after the\nresidential pond has been accepted for maintenance by the city. The city will accept\na residential pond upon determining that it meets the requirements of the Environmental\nCriteria Manual and, if applicable, Section 25-8-234 (Fiscal Security In The Barton Springs Zone).\n\nSource: Sections 13-7-9 and 13-7-11(a); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11;\nOrd. 20090820-060; Ord. 20131017-046.\n\n(A)\n\nThe director of the Finance Department shall establish a dedicated fund to:\n\n(1)\n\nmonitor water quality controls; and\n\n(2)\n\nmaintain water quality controls for single-family and duplex residential development.\n\n(B)\n\nAn applicant shall pay the required fee into the fund:\n\n(1)\n\nfor development that does not require a site plan, when the applicant posts fiscal\nsecurity for the subdivision or requests that the director of the Development Services\nDepartment record the subdivision plat, whichever occurs first; or\n\n(2)\n\nfor development that requires a site plan, when the site plan is approved.\n\n(C)\n\nThe director of the Watershed Protection Department shall administer the fund, allocate\nthe fund for appropriate projects, and report annually to the council regarding the\nstatus of the fund and the monitoring and maintenance program described in this section.\n\nSource: Section 13-7-10; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20221027-045, Pt. 20, 11-7-22.\n\n(A)\n\nIn the Barton Springs Zone, the owner or operator of a commercial or multifamily development\nis required to obtain an annual operating permit for the required water quality controls.\n\n(B)\n\nTo obtain an annual operating permit, an applicant must:\n\n(1)\n\nprovide the director with:\n\n(a)\n\na maintenance plan; and\n\n(b)\n\nthe information necessary to verify that the water quality controls are in proper\noperating condition; and\n\n(2)\n\npay the required, nonrefundable fee.\n\n(C)\n\nThe director may verify that a water quality control is in proper operating condition\nby either inspecting the water quality control or accepting a report from a registered\nengineer.\n\n(D)\n\nThe director shall issue an operating permit after determining that:\n\n(1)\n\nthe applicant has complied with the requirements of Subsection (B); and\n\n(2)\n\nthe water quality controls are in proper operating condition.\n\n(E)\n\nThe director shall transfer an operating permit to a new owner or operator if, not\nlater than 30 days after a change in ownership or operation, the new owner or operator:\n\n(1)\n\nsigns the operating permit;\n\n(2)\n\naccepts responsibility for the water quality controls; and\n\n(3)\n\ndocuments the transfer on a form provided by the director.\n\nSource: Subsections 13-7-11(b), (c), and (d); Ord. 990225-70; Ord. 010329-18; Ord.\n031211-11; Ord. 20131017-046; Ord. No. 20221027-045, Pt. 21, 11-7-22.\n\n(A)\n\nFor development in the Barton Springs Zone, an applicant shall provide the City with\nfiscal security to ensure that water quality controls are maintained properly. The\ndirector shall calculate the amount of fiscal security in accordance with the formula\nin the Environmental Criteria Manual.\n\n(B)\n\nThe director may not return the fiscal security to the applicant until:\n\n(1)\n\nthe expiration of one year after the completion of the development; and\n\n(2)\n\nthe director receives verification that the controls are constructed in accordance\nwith the approved design by:\n\n(a)\n\nthe applicant's delivery of a certified engineering concurrence letter; and\n\n(b)\n\na report from a City inspector.\n\nSource: Section 13-7-7(b); Ord. 990225-70; Ord. 031211-11.\n\nIn all watersheds, development is prohibited in a critical water quality zone except\nas provided in this Division. Development allowed in the critical water quality zone\nunder this Division shall be revegetated and restored within the limits of construction\nas prescribed by the Environmental Criteria Manual.\n\n(A)\n\nA fence that does not obstruct flood flows is permitted in a critical water quality\nzone.\n\n(B)\n\nOpen space is permitted in a critical water quality zone if a program of fertilizer,\npesticide, and herbicide use is approved by the Watershed Protection Department, subject\nto the conditions in this Subsection.\n\n(1)\n\nIn a water supply rural watershed, water supply suburban, or the Barton Springs Zone,\nopen space is limited to sustainable urban agriculture or a community garden if the\nrequirements in Subsection (B)(4) are met, multi-use trails, picnic facilities, and\noutdoor facilities, excluding stables, corrals for animals and athletic fields.\n\n(2)\n\nA park with a council-adopted plan may include recreational development other than\nthat described in Subsection (B)(1).\n\n(3)\n\nA hard surfaced trail may cross the critical water quality zone pursuant to Section 25-8-262 (Critical Water Quality Zone Mobility Crossings). A hard surfaced trail that does not cross the critical water quality zone may be\nlocated within the critical water quality zone only if:\n\n(a)\n\ndesigned in accordance with the Environmental Criteria Manual;\n\n(b)\n\nlocated outside the erosion hazard zone unless protective works are provided as prescribed\nin the Drainage Criteria Manual;\n\n(c)\n\nlimited to 12 feet in width plus one-foot compacted sub-grade shoulders, unless a\nwider trail is designated in a Council-adopted plan;\n\n(d)\n\nlocated not less than 25 feet from the centerline of a waterway if within an urban\nwatershed;\n\n(e)\n\nlocated not less than 50 feet from the centerline of a minor waterway, 100 feet from\nthe centerline of an intermediate waterway, and 150 feet from the centerline of a\nmajor waterway if within a watershed other than an urban watershed;\n\n(f)\n\nlocated not less than 50 feet from the shoreline of Lake Travis, Lake Austin, Lady\nBird Lake, and Lake Walter E. Long, as defined in Section 25-8-92; and\n\n(g)\n\nlocated not less than 100 feet from the ordinary high water mark of the Colorado River\ndownstream from Longhorn Dam.\n\n(4)\n\nOpen space may include sustainable urban agriculture or a community garden only if:\n\n(a)\n\nin an urban watershed and located not less than 25 feet from the centerline of a waterway,\nor in a watershed other than an urban watershed and located not less than 50 feet\nfrom the centerline of a minor waterway, 100 feet from the centerline of an intermediate\nwaterway, and 150 feet from the centerline of a major waterway;\n\n(b)\n\nlocated not less than 50 feet from the shoreline of Lake Travis, Lake Austin, Lady\nBird Lake, and Lake Walter E. Long, as defined in Section 25-8-92;\n\n(c)\n\nlocated not less than 100 feet from the ordinary high water mark of the Colorado River\ndownstream from Longhorn Dam;\n\n(d)\n\ndesigned in accordance with the Environmental Criteria Manual; and\n\n(e)\n\nlimited to garden plots and paths, with no storage facilities or other structures\nover 500 square feet.\n\n(5)\n\nIn a suburban or urban watershed, open space may include an athletic field only if:\n\n(a)\n\nin an urban watershed and located not less than 25 feet from the centerline of a waterway,\nor in a suburban watershed and located not less than 50 feet from the centerline of\na minor waterway, 100 feet from the centerline of an intermediate waterway, and 150\nfeet from the centerline of a major waterway;\n\n(b)\n\nlocated not less than 50 feet from the shoreline of Lady Bird Lake and Lake Walter\nE. Long, as defined in Section 25-8-92;\n\n(c)\n\nlocated not less than 100 feet from the ordinary high water mark of the Colorado River\ndownstream from Longhorn Dam; and\n\n(d)\n\nthe owner of the athletic field submits to the Watershed Protection Department a maintenance\nplan to keep the athletic field well vegetated and minimize compaction, as prescribed\nin the Environmental Criteria Manual.\n\n(C)\n\nThe requirements of this subsection apply along Lake Travis, Lake Austin, Lake Walter\nE. Long, and Lady Bird Lake.\n\n(1)\n\nA dock, public boat ramp, bulkhead or marina, and necessary access and appurtenances,\nare permitted in a critical water quality zone subject to compliance with Chapter 25-2, Subchapter C, Article 12 (Docks, Bulkheads, and Shoreline Access). For a single-family residential use, necessary access may not exceed the minimum\narea of land disturbance required to construct a single means of access from the shoreline\nto a dock.\n\n(2)\n\nDisturbed areas must be restored in accordance with the Environmental Criteria Manual\nand the following requirements:\n\n(a)\n\nWithin a lakefront critical water quality zone, or an equivalent area within 25 feet\nof a shoreline, restoration must include:\n\n(i)\n\nat least one native shade tree and one native understory tree, per 500 square feet\nof disturbed area; and\n\n(ii)\n\none native shrub per 150 square feet of disturbed area; and\n\n(b)\n\nRemaining disturbed areas must be restored per standard specifications for native\nrestoration.\n\n(3)\n\nWithin the shoreline setback area defined by Section 25-2-551 (Lake Austin (LA) District Regulations) and within the overlay established by Section 25-2-180 (Lake Austin (LA) Overlay District), no more than 30 percent of the total number of shade trees of 8 inches or greater,\nas designated in the Environmental Criteria Manual, may be removed.\n\n(4)\n\nBefore a building permit may be issued or a site plan released, approval by the Watershed\nProtection Department is required for chemicals used to treat building materials that\nwill be submerged in water.\n\n(5)\n\nBank erosion above the 100-year-flood plain may be stabilized within a lakefront critical\nwater quality zone if the restoration meets the requirements of Subsection (B)(2)\nof this section.\n\n(6)\n\nA retaining wall, bulkhead, or other erosion protection device must be designed and\nconstructed to minimize wave return and wave action in compliance with the Environmental\nCriteria Manual. A shoreline modification within the wave action zone with a greater\nthan 45 degree vertical slope for any portion greater than one foot in height is not\nallowed on or adjacent to the shoreline of a lake, unless the shoreline modification\nis located within an existing man-made channel.\n\n(7)\n\nA retaining wall, bulkhead, or other erosion protection device may not capture or\nrecapture land from a lake unless doing so is required to restore the shoreline to\nwhichever of the following boundaries would encroach the least into the lake:\n\n(a)\n\nthe shoreline as it existed 10 years before the date of application, with documentation\nas prescribed by the Environmental Criteria Manual; or\n\n(b)\n\nthe lakeside boundary of the subdivided lot line.\n\n(8)\n\nA bulkhead may be replaced in front of an existing bulkhead once, if:\n\n(a)\n\nthe existing bulkhead was legally constructed;\n\n(b)\n\nconstruction of the replacement bulkhead does not change the location of the shoreline\nby more than 6 inches; and\n\n(c)\n\nthe director determines that there is no reasonable alternative to replacement of\nthe bulkhead in the location of the existing bulkhead.\n\n(9)\n\nDredging is prohibited unless:\n\n(a)\n\nthe area of dredging is less than 25 cubic yards; and\n\n(b)\n\nthe dredging is necessary for navigation safety.\n\n(D)\n\nA utility line, including a storm drain, is prohibited in the critical water quality\nzone, except as provided in Subsection (E) or for a necessary crossing. A necessary\nutility crossing may cross into or through a critical water quality zone only if:\n\n(1)\n\nthe utility line follows the most direct path into or across the critical water quality\nzone to minimize disturbance, unless boring or tunneling is the proposed method of\ninstallation for the entire crossing and all bore pits are located outside of the\ncritical water quality zone;\n\n(2)\n\nthe depth of the utility line and location of associated access shafts are not located\nwithin an erosion hazard zone, unless protective works are provided as prescribed\nin the Drainage Criteria Manual;\n\n(3)\n\nin the Barton Springs Zone, the crossing is approved by the director.\n\n(E)\n\nIn the urban and suburban watersheds, a utility line may be located parallel to and\nwithin the critical water quality zone if:\n\n(1)\n\nin an urban watershed and located not less than 50 feet from the centerline of a waterway,\nor in a watershed other than urban and located not less than 50 feet from the centerline\nof a minor waterway, 100 feet from the centerline of an intermediate waterway, and\n150 feet from the centerline of a major waterway;\n\n(2)\n\nlocated not less than 50 feet from the shoreline of Lady Bird Lake and Lake Walter\nE. Long, as defined in Section 25-8-92;\n\n(3)\n\nlocated not less than 100 feet from the ordinary high water mark of the Colorado River\ndownstream from Longhorn Dam;\n\n(4)\n\ndesigned in accordance with the Environmental Criteria Manual;\n\n(5)\n\nlocated outside the erosion hazard zone, unless protective works are provided as prescribed\nin the Drainage Criteria Manual; and\n\n(6)\n\nthe project includes either riparian restoration of an area within the critical water\nquality zone equal in size to the area of disturbance in accordance with the Environmental\nCriteria Manual, or payment into the Riparian Zone Mitigation Fund of a non-refundable\namount established by ordinance.\n\n(F)\n\nIn-channel detention basins and in-channel wet ponds are allowed in the critical water\nquality zone only if:\n\n(1)\n\nproposed as part of a public capital improvement project or public private partnership;\n\n(2)\n\nno alternative location is feasible; and\n\n(3)\n\ndesigned in accordance with the Environmental Criteria Manual.\n\n(G)\n\nFloodplain modification is prohibited in the critical water quality zone unless the\nmodification proposed:\n\n(1)\n\nis necessary to address an existing threat to public health and safety, as determined\nby the director;\n\n(2)\n\nis designed solely to improve floodplain health as determined by a functional assessment\nof floodplain health as prescribed by the Environmental Criteria Manual; or\n\n(3)\n\nis the minimum necessary for development allowed in the critical water quality zone\nunder Section 25-8-261 (Critical Water Quality Zone Development) or Section 25-8-262 (Critical Water Quality Zone Mobility Crossings) as prescribed by the Environmental Criteria Manual.\n\n(H)\n\nIn the urban and suburban watersheds, vegetative filter strips, rain gardens, biofiltration\nponds, areas used for irrigation or infiltration of stormwater, or other controls\nas prescribed by rule are allowed in the critical water quality zone if:\n\n(1)\n\nin an urban watershed and located not less than 50 feet from the centerline of a waterway,\nor in a watershed other than urban and located no less than 50 feet from the centerline\nof a minor waterway, no less than 100 feet from the centerline of an intermediate\nwaterway, and no less than 150 feet from the centerline of a major waterway;\n\n(2)\n\nlocated not less than 50 feet from the shoreline of Lady Bird Lake and Lake Walter\nE. Long, as defined in Section 25-8-92;\n\n(3)\n\nlocated not less than 100 feet from the ordinary high water mark of the Colorado River\ndownstream from Longhorn Dam;\n\n(4)\n\nlocated outside the 100-year floodplain; and\n\n(5)\n\nlocated outside the erosion hazard zone, unless protective works are provided as prescribed\nin the Drainage Criteria Manual.\n\n(I)\n\nDevelopment associated with power generation, transmission, or distribution at the\nDecker Creek Power Station is allowed in the critical water quality zone.\n\n(J)\n\nA residential lot that is 5,750 square feet or less in size may not include any portion\nof a critical water quality zone.\n\n(K)\n\nAny segment of trail that is a part of the Ann and Roy Butler Hike and Bike Trail,\nas defined by the Parks and Recreation Department, is not subject to Paragraph (B)(3)(c)\nor Subdivision (C)(2) and may be located within 50 feet of Lady Bird Lake if:\n\n(1)\n\nrestoration, as determined by a functional assessment of floodplain health as prescribed\nby the Environmental Criteria Manual, includes a restored area at a minimum ratio\nof 1:1 and a maximum ratio of 2:1 of restored area to disturbed area, or\n\n(2)\n\nalternative compliance as approved by the director is provided.\n\nSource: Sections 13-7-23(e) and (h); Ord. 990225-70; Ord. 010329-18; Ord. 010607-8;\nOrd. 031211-11; Ord. 20131017-046; Ord. No. 20140626-113, Pt. 20, 7-7-14; Ord. No. 20160922-048, Pt. 5, 10-3-16; Ord. No. 20170615-102, Pt. 17, 6-15-17; Ord. No. 20211202-056, Pt. 1, 12-13-21; Ord. No. 20221027-045, Pt. 23, 11-7-22; Ord. No. 20240307-036, Pt. 1, 3-18-24.\n\n(A)\n\nIn an urban watershed, an arterial street, collector street, residential street, or\nrail line may cross a critical water quality zone of any waterway.\n\n(B)\n\nThis subsection applies in a watershed other than an urban watershed.\n\n(1)\n\nA major waterway critical water quality zone may be crossed by a Level 3, 4, or 5\nstreet or rail line identified in the Transportation Plan.\n\n(2)\n\nAn intermediate waterway critical water quality zone may be crossed by a Level 2,\n3, 4, or 5 street or rail line, except:\n\n(a)\n\na Level 2 street crossing must be at least 2,500 feet, measured along the centerline\nof the waterway, from a Level 2, 3, 4, or 5 street crossing on the same waterway;\nor\n\n(b)\n\nin a water supply suburban or water supply rural watershed, or the Barton Springs\nZone, a Level 2 street crossing must be at least one mile, measured along the centerline\nof the waterway, from a Level 2, 3, 4, or 5 street crossing on the same waterway.\n\n(3)\n\nA minor waterway critical water quality zone may be crossed by a Level 2, 3, 4, or\n5 street or rail line, except:\n\n(a)\n\na Level 2 street crossing must be at least 900 feet, measured along the centerline\nof the waterway, from a Level 2, 3, 4, or 5 street crossing on the same waterway;\nor\n\n(b)\n\nin a water supply suburban or water supply rural watershed, or the Barton Springs\nZone, a Level 2 street crossing must be at least 2,000 feet, measured along the centerline\nof the waterway, from a Level 2, 3, 4, or 5 street crossing on the same waterway.\n\n(4)\n\nA minor waterway critical water quality zone may be crossed by a Level 1 or 2 street\nif necessary to provide access to property that cannot otherwise be safely accessed.\n\n(C)\n\nIn all watersheds, multi-use trails may cross a critical water quality zone of any\nwaterway if:\n\n(1)\n\ndesigned in compliance with the Environmental Criteria Manual; and\n\n(2)\n\nthe development demonstrates no additional adverse impact from flood or erosion potential.\n\n(D)\n\nNotwithstanding Subsections (A) and (B) and except in the Barton Springs Zone, a street\nor driveway may cross the critical water quality zone if the street or driveway is\nlocated in a center or corridor as identified on the growth concept map of the Imagine\nAustin Comprehensive Plan, as adopted by Ordinance No. 20120614-058, and if the proposed\ncrossing:\n\n(1)\n\nis necessary to facilitate the development or redevelopment of a designated corridor\nor center as recommended in the Imagine Austin Comprehensive Plan, Chapter 4 (Shaping Austin: Building the Complete Community), growth concept map and related definitions; and\n\n(2)\n\nmaintains the quality and quantity of recharge if located in a center or corridor\ndesignated as a sensitive environmental area in the Edwards Aquifer recharge zone,\nEdwards Aquifer contributing zone, or the South Edwards Aquifer recharge zone, as\ndetermined by the director of the Watershed Protection Department.\n\nSource: Sections 13-7-23(e) and (h); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11;\nOrd. 20131017-046; Ord. No. 20170615-102, Pt. 18, 6-15-17; Ord. No. 20220519-094, Pt. 7, 5-30-22; Ord. No. 20221027-045, Pt. 24, 11-7-22.\n\n(A)\n\nAll floodplain modifications must:\n\n(1)\n\nbe designed to accommodate existing and fully-vegetated hydraulic conditions;\n\n(2)\n\napply sound engineering and ecological practices, prevent and reduce degradation of\nwater quality, and demonstrate the stability and integrity of floodplains and waterways,\nas prescribed in the Environmental Criteria Manual;\n\n(3)\n\nrestore floodplain health, or provide mitigation if restoration is infeasible, to\nsupport natural functions and processes as prescribed in the floodplain modification\ncriteria in the Environmental Criteria Manual; and\n\n(4)\n\ncomply with the requirements of Chapter 25-7 (Drainage), the Drainage Criteria Manual, and the Environmental Criteria Manual.\n\n(B)\n\nFloodplain modification within a critical water quality zone is prohibited except\nas allowed under Section 25-8-261 (Critical Water Quality Zone Development).\n\n(C)\n\nFloodplain modification outside a critical water quality zone is allowed only if the\nmodification proposed:\n\n(1)\n\nis necessary to protect public health and safety by addressing an existing threat,\nas determined by the director;\n\n(2)\n\nis designed solely to improve floodplain health, as determined by a functional assessment\nof floodplain health as prescribed by the Environmental Criteria Manual;\n\n(3)\n\nis located within a floodplain area classified as in fair or poor condition, as determined\nby a functional assessment of floodplain health, and provides restoration or mitigation\nin accordance with the ratios and specifications prescribed in the Environmental Criteria\nManual; or\n\n(4)\n\nis the minimum modification necessary for development allowed under Section 25-8-261 (Critical Water Quality Development) or 25-8-262 (Critical Water Quality Zone Mobility Crossings).\n\n(D)\n\nIf on-site restoration, as prescribed in the Environmental Criteria Manual, is infeasible\nand mitigation is required under this section, it may be satisfied by:\n\n(1)\n\npaying into the Riparian Zone Mitigation Fund a nonrefundable amount established by\nordinance;\n\n(2)\n\ntransferring in fee simple or placing restrictions on mitigation land approved by\nthe director and meeting the following conditions:\n\n(a)\n\nlocated within the same watershed classification;\n\n(b)\n\nin accordance with the procedures in Subsection (H)(3) of Section 25-8-26 (Redevelopment Exception in the Barton Springs Zone);\n\n(c)\n\ndedicated to or restricted for the benefit of the City, or another entity approved\nby the director, and which the City or other approved entity accepts; and\n\n(d)\n\nan amount proportionate to the amount of area within the existing floodplain that\nis proposed to be modified, as prescribed in the Environmental Criteria Manual; or\n\n(3)\n\na combination of the mitigation methods described in Subsections (D)(1) and (D)(2),\nif approved by the director.\n\nSource: Ord. No. 20221027-045, Pt. 25, 11-7-22.\n\n(A)\n\nDrainage patterns for proposed development must be designed to protect critical environmental\nfeatures from the effects of runoff from developed areas, and to maintain the catchment\nareas of recharge features in a natural state. Special controls must be used where\nnecessary to avoid the effects of erosion, or sedimentation, or high rates of flow.\n\n(B)\n\nA residential lot may not include a critical environmental feature or a critical environmental\nfeature buffer zone and may not be located within 50 feet of a critical environmental\nfeature.\n\n(C)\n\nThis subsection prescribes the requirements for critical environmental feature buffer\nzones.\n\n(1)\n\nA buffer zone is established around each critical environmental feature described\nin this subchapter.\n\n(a)\n\nExcept as provided in Subsection (C)(1)(b), the width of the buffer zone is 150 feet\nfrom the edge of the critical environmental feature.\n\n(b)\n\nFor a point recharge feature, the buffer zone coincides with the topographically defined\ncatchment basin, except that the width of the buffer zone from the edge of the critical\nenvironmental feature is:\n\n(i)\n\nnot less than 150 feet;\n\n(ii)\n\nnot more than 300 feet; and\n\n(iii)\n\ncalculated in accordance with the Environmental Criteria Manual.\n\n(2)\n\nWithin a buffer zone described in this subsection:\n\n(a)\n\nthe natural vegetative cover must be retained to the maximum extent practicable;\n\n(b)\n\nconstruction is prohibited; and\n\n(c)\n\nwastewater disposal or irrigation is prohibited.\n\n(3)\n\nIf located at least 50 feet from the edge of the critical environmental feature, the\nprohibition of Subsection (C)(2)(b) does not apply to:\n\n(a)\n\na hiking trail;\n\n(b)\n\na recharge basin approved under Section 25-8-213 (Water Quality Control Standards) that discharges to a point recharge feature; or\n\n(c)\n\nan innovative runoff management practice approved under Section 25-8-151 (Innovative Management Practices) that is designed to address the standards of this section, enhance the recharge\nof groundwater and the discharge of springs, and maintain the function of critical\nenvironmental features.\n\n(4)\n\nPerimeter fencing with not less than one access gate must be installed at the outer\nedge of the buffer zone for all point recharge features. The fencing must comply with\nthe Standard Specifications Manual.\n\n(5)\n\nThe owner must maintain the buffer zone in accordance with standards in the Environmental\nCriteria Manual to preserve the water quality function of the buffer.\n\n(6)\n\nAll critical environmental feature locations and required setbacks must be shown on\npreliminary subdivision plans, site plans, and other permits as determined by the\ndirector.\n\n(7)\n\nAll critical environmental feature locations must be shown on final plats.\n\n(D)\n\nWhen voids in the rock substrate are uncovered during development, the following protocol\nmust be followed:\n\n(1)\n\nconstruction in the area of the void must cease while the applicant conducts a preliminary\ninvestigation of the void as prescribed by the Environmental Criteria Manual.\n\n(2)\n\nThe applicant shall contact a City of Austin Environmental Inspector to schedule further\ninvestigation by the City of the void as prescribed by the Environmental Criteria\nManual if the preliminary investigation indicates that the void:\n\n(a)\n\nis at least one square foot in total area;\n\n(b)\n\nblows air from within the substrate;\n\n(c)\n\nconsistently receives water during any rain event; or\n\n(d)\n\npotentially transmits groundwater.\n\n(3)\n\nConstruction may only proceed after mitigation measures are reviewed and approved\nby the Watershed Protection Department.\n\nSource: Section 13-7-21; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20120524-083;\nOrd. 20131017-046; Ord. No. 20221027-045, Pt. 26, 11-7-22.\n\n(A)\n\nWetlands must be protected in all watersheds except for wetlands located within the\narea bounded by Interstate 35, Riverside Drive, Barton Springs Road, Lamar Boulevard,\nand 15th Street that are not associated with the critical water quality zone of Lady\nBird Lake.\n\n(B)\n\nProtection methods for wetlands require the approval of the director, and may include:\n\n(1)\n\nappropriate setbacks that preserve the wetlands or wetland functions;\n\n(2)\n\nwetland mitigation, including wetland replacement; or\n\n(3)\n\nwetland restoration or enhancement.\n\nSource: Section 13-7-21; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20221027-045, Pt. 27, 11-7-22.\n\n(A)\n\nA person may not construct a roadway or driveway on a slope with a gradient of more\nthan 15 percent unless the construction is necessary to provide primary access to:\n\n(1)\n\nat least two contiguous acres with a gradient of 15 percent or less; or\n\n(2)\n\nbuilding sites for at least five residential units.\n\n(B)\n\nFor construction described in this section, a cut or fill must be revegetated, or\nif a cut or fill has a finished gradient of more than 33 percent, stabilized with\na permanent structure. This does not apply to a stable cut.\n\nSource: Section 13-2-590(a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA person may not construct:\n\n(1)\n\na building or parking structure on a slope with a gradient of more than 25 percent;\nor\n\n(2)\n\nexcept for a parking structure, a parking area on a slope with a gradient of more\nthan 15 percent.\n\n(B)\n\nA person may construct a building or parking structure on a slope with a gradient\nof more than 15 percent and not more than 25 percent if the requirements of this subsection\nare met.\n\n(1)\n\nImpervious cover on slopes with a gradients of more than 15 percent may not exceed\n10 percent of the total area of the slopes.\n\n(2)\n\nThe terracing techniques in the Environmental Criteria Manual are required for construction\nthat is uphill or downhill of a slope with a gradient of more than 15 percent.\n\n(3)\n\nHillside vegetation may not be disturbed except as necessary for construction, and\ndisturbed areas must be restored with native and adapted vegetation as prescribed\nin the Environmental Criteria Manual.\n\n(4)\n\nFor construction described in this section, a cut or fill must be revegetated, or\nif a cut or fill has a finished gradient of more than 33 percent, stabilized with\na permanent structure. This does not apply to a stable cut.\n\nSource: Section 13-2-590(b); Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nA preliminary subdivision plan that proposes a single family residential lot on a\nslope with a gradient of more than 15 percent must include a plan note identifying\nthe lot and describing the requirements of Subsection (B).\n\n(B)\n\nA final plat that proposes a single family residential lot on a slope with a gradient\nof more than 15 percent must include a plat note:\n\n(1)\n\nidentifying the lot; and\n\n(2)\n\nstating the impervious cover and construction requirements for the lot.\n\nSource: Section 13-2-590(c); Ord. 990225-70; Ord. 031211-11.\n\nThis division does not apply in an urban watershed.\n\nSource: Ord. 000406-84; Ord. 031211-11.\n\n(A)\n\nClearing of vegetation is prohibited unless the director determines that the clearing:\n\n(1)\n\nis in accordance with a released site plan or subdivision construction plan;\n\n(2)\n\nis permitted under this section or Section 25-8-322 (Clearing for a Roadway); or\n\n(3)\n\nis not development, as that term is defined in Chapter 25-1 (General Requirements and Procedures).\n\n(B)\n\nClearing of vegetation for agricultural operations is prohibited if an application\nto develop for a non-agricultural use has been granted or is pending. The director\nmay waive this prohibition after determining that the clearing has a bonafide agricultural\npurpose and is unrelated to the proposed development or sale of the land for non-agricultural\nuses.\n\n(C)\n\nA person may clear an area up to 15 feet wide or remove a tree with a diameter of\nnot more than eight inches to perform surveying or geologic testing in preparation\nfor site plan or final plat approval.\n\nSource: Section 13-7-15; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. No. 20170615-102, Pt. 19, 6-15-17.\n\n(A)\n\nA person may clear an area for road construction after site plan or final plat approval\nunder this section.\n\n(B)\n\nRoadway clearing width may not exceed:\n\n(1)\n\ntwice the roadway surface width, or the width of the dedicated right-of-way, whichever\nis less; or\n\n(2)\n\nfor road construction problem areas of less than 300 feet in length, two and one-half\ntimes the roadway width.\n\n(C)\n\nThe director may grant an administrative variance to Subsection (B) if required by\nunusual topographic conditions.\n\n(D)\n\nIf clearing on slopes could result in materials sliding onto areas beyond the clearing\nwidths described in Subsection (B), retaining walls or other preventative methods\nare required.\n\n(E)\n\nThe length of time between rough cutting and final surfacing of roadways may not exceed\n18 months.\n\n(F)\n\nIf the applicant does not meet the deadline described in Subsection (E), the city\nmanager shall notify the applicant in writing that the City will finish the roadways\nor revegetate the disturbed area at the applicant's expense unless the work is completed\nnot later than the 60th day after the date of the notice.\n\nSource: Section 13-7-15; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20060504-039.\n\n(A)\n\nThe site plan or subdivision construction plan must designate the areas to be cleared\nfor temporary storage of spoils or construction equipment. Areas cleared for temporary\nstorage must be located and restored in accordance with the Environmental Criteria\nManual.\n\n(B)\n\nDuring and after site grading operations, the topsoil must be protected and vegetation\nleft in place to the maximum extent practicable.\n\n(C)\n\nFor areas on the site that are to remain pervious after development, any soils that\nare compacted during site grading and construction operations must be decompacted\nin compliance with the Environmental Criteria Manual and the Standard Specifications\nManual.\n\nSource: Section 13-7-15; Ord. 990225-70; Ord. 031211-11; Ord. No. 20221027-045, Pt. 28, 11-7-22.\n\n(A)\n\nCuts on a tract of land may not exceed four feet of depth, except:\n\n(1)\n\nin an urban watershed;\n\n(2)\n\nin a roadway right-of-way;\n\n(3)\n\nfor construction of a building foundation or swimming pool;\n\n(4)\n\nfor construction of a water quality control or detention facility and appurtenances\nfor conveyance such as swales, drainage ditches, and diversion berms, if:\n\n(a)\n\nthe design and location of the facility within the site minimize the amount of cut\nover four feet;\n\n(b)\n\nthe cut is the minimum necessary for the appropriate functioning of the facility;\nand\n\n(c)\n\nthe cut is not located on a slope with a gradient of more than 15 percent or within\n100 feet of a classified waterway;\n\n(5)\n\nfor utility construction or a wastewater drain field, if the area is restored to natural\ngrade;\n\n(6)\n\nin a state-permitted sanitary landfill or a sand or gravel excavation located in the\nextraterritorial jurisdiction, if:\n\n(a)\n\nthe cut is not in a critical water quality zone;\n\n(b)\n\nthe cut does not alter a 100-year floodplain;\n\n(c)\n\nthe landfill or excavation has an erosion and restoration plan approved by the City;\nand\n\n(d)\n\nall other applicable City Code provisions are met.\n\n(7)\n\nfor any cut associated with construction of a multi-use trail, if:\n\n(a)\n\nthe cut is not located on a slope with a gradient of more than 15 percent or within\n100 feet of a classified waterway;\n\n(b)\n\nthe cut is limited to no more than eight feet in depth;\n\n(c)\n\nthe cut is located in a public right-of-way or public easement; and\n\n(d)\n\nthe trail is designed in accordance with the Environmental Criteria Manual; or\n\n(8)\n\nfor construction of a street or driveway necessary to provide primary access if:\n\n(a)\n\nthe construction complies with Division 3 (Construction on Slopes) of this article;\n\n(b)\n\nthe cut is not within a critical water quality zone;\n\n(c)\n\nthe cut is limited to no more than eight feet in depth;\n\n(d)\n\nthe cut over four feet is the minimum amount necessary to comply with safety access\nrequirements and the horizontal and vertical curve requirements of the Transportation\nCriteria Manual; and\n\n(e)\n\nthere is no other feasible alternative for the street or driveway location.\n\nSource: Subsections 13-7-16(b), (c), and (e); Ord. 990225-70; Ord. 031211-11; Ord. No. 20170615-102, Pt. 20, 6-15-17; Ord. No. 20211202-056, Pt. 2, 12-13-21; Ord. No. 20220519-094, Pt. 8, 5-30-22; Ord. No. 20221027-045, Pt. 29, 11-7-22.\n\n(A)\n\nFill on a tract of land may not exceed four feet of depth, except:\n\n(1)\n\nin an urban watershed;\n\n(2)\n\nin a roadway right-of-way or rail line right-of-way;\n\n(3)\n\nunder a foundation with sides perpendicular to the ground, or with pier and beam construction;\n\n(4)\n\nfor construction of a water quality control or detention facility and appurtenances\nfor conveyance such as swales, drainage ditches, and diversion berms, if:\n\n(a)\n\nthe design and location of the facility within the site minimize the amount of fill\nover four feet;\n\n(b)\n\nthe fill is the minimum necessary for the appropriate functioning of the facility;\nand\n\n(c)\n\nthe fill is not located on a slope with a gradient of more than 15 percent or within\n100 feet of a classified waterway;\n\n(5)\n\nfor utility construction or a wastewater drain field;\n\n(6)\n\nin a state-permitted sanitary landfill located in the extraterritorial jurisdiction,\nif:\n\n(a)\n\nthe fill is derived from the landfill operation;\n\n(b)\n\nthe fill is not placed in a critical water quality zone or a 100-year floodplain;\n\n(c)\n\nthe landfill operation has an erosion and restoration plan approved by the City; and\n\n(d)\n\nall other applicable City Code provisions are met; or\n\n(7)\n\nfor fill associated with construction of a multi-use trail, if:\n\n(a)\n\nthe fill is not located on a slope with a gradient of more than 15 percent or within\n100 feet of a classified waterway;\n\n(b)\n\nthe fill is limited to no more than eight feet in depth;\n\n(c)\n\nthe fill is located in a public right-of-way or public easement; and\n\n(d)\n\nthe trail is designed in accordance with the Environmental Criteria Manual.\n\n(8)\n\nfor construction of a street or driveway necessary to provide primary access if:\n\n(a)\n\nthe construction complies with Division 3 (Construction on Slopes) of this article;\n\n(b)\n\nthe fill is not within a critical water quality zone;\n\n(c)\n\nthe fill is limited to no more than eight feet in depth;\n\n(d)\n\nthe fill over four feet is the minimum amount necessary to comply with safety access\nrequirements and the horizontal and vertical curve requirements of the Transportation\nCriteria Manual; and\n\n(e)\n\nthere is no other feasible alternative for the street or driveway location.\n\n(B)\n\nA fill area must be restored and stabilized.\n\n(C)\n\nFill for a roadway must be contained within the roadway clearing width described in\nSection 25-8-322 (Clearing for a Roadway).\n\nSource: Subsections 13-7-16(a), (b), (c), and (e); Ord. 990225-70; Ord. 031211-11;\nOrd. No. 20170615-102, Pt. 21, 6-15-17; Ord. No. 20211202-056, Pt. 3, 12-13-21; Ord. No. 20220519-094, Pt. 9, 5-30-22; Ord. No. 20221027-045, Pt. 30, 11-7-22.\n\n(A)\n\nA spoil disposal site may not be located in a 100-year floodplain or on a slope with\na gradient of more than 15 percent.\n\n(B)\n\nThe location of a spoil disposal site must be reasonably accessible. An access route:\n\n(1)\n\nmust use existing and approved roadways, if possible; and\n\n(2)\n\nmay not be located in a waterway, unless:\n\n(a)\n\na reasonable alternative is not available; or\n\n(b)\n\nthe access route is for the construction of a water quality control.\n\n(C)\n\nA spoil disposal site and an access route shall be restored and revegetated in accordance\nwith the Environmental Criteria Manual.\n\nSource: Section 13-7-20; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nA lot in the Edwards Aquifer recharge zone with private on-site sewage facilities\nmust demonstrate compliance with City Code Chapter 15-5 (Private Sewage Facilities).\n\n(B)\n\nLand application of treated wastewater effluent is prohibited:\n\n(1)\n\non a slope with a gradient of more than 15 percent;\n\n(2)\n\nin a critical water quality zone;\n\n(3)\n\nin a 100-year floodplain;\n\n(4)\n\non the trunk of trees required to be surveyed as prescribed in the Environmental Criteria\nManual;\n\n(5)\n\nin the buffer zone established around a critical environmental feature under Section 25-8-281 (Critical Environmental Features); or\n\n(6)\n\nduring wet weather conditions.\n\nSource: Section 13-7-30; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20170615-102, Pt. 22, 6-15-17.\n\nA certificate of occupancy may not be issued for development subject to this subchapter\nunless the development is in compliance with Chapter 6-5, Article 5 (Discharges Into Storm Sewers or Watercourses).\n\nSource: Section 13-7-24; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nBlasting on property located in the Edwards Aquifer recharge zone is prohibited in\na critical water quality zone or a water quality transition zone, unless the applicant\ndemonstrates that a feasible alternative does not exist.\n\n(B)\n\nBlasting is prohibited within 300 feet of a critical environmental feature, unless\nthe applicant demonstrates that a feasible alternative does not exist.\n\nSource: Section 13-7-31; Ord. 990225-70; Ord. 031211-11.\n\n**Editor's note—**\nOrd. No. 20221027-045, Pt. 31, adopted November 7, 2022, repealed § 25-8-364, which pertained to floodplain\nmodification and derived from Ord. 20131017-046; Ord. No. 20160922-048, Pt. 6, 10-3-16; Ord. No. 20170615-102, Pt. 23, 6-15-17.\n\n(A)\n\nDevelopment may not divert stormwater from one watershed to another, except as authorized\nby this section.\n\n(B)\n\nA proposed diversion of less than 20 percent of the site based on gross site area\nor less than 1 acre, whichever is smaller, may be allowed if the applicant demonstrates\nthat:\n\n(1)\n\nexisting drainage patterns are maintained to the extent feasible; and\n\n(2)\n\nthere are no adverse environmental or drainage impacts.\n\nSource: Ord. 20131017-046.\n\n(A)\n\nThis section establishes impervious cover restrictions for development of a public\nprimary or secondary educational facility.\n\n(B)\n\nIn watersheds other than an urban watershed or the Barton Spring Zone, the maximum\nimpervious cover in an upland zone is 50 percent of net site area or 60 percent of\nnet site area, if transfer of impervious cover is authorized and used.\n\n(C)\n\nIn an urban watershed, maximum impervious cover is the greater of:\n\n(1)\n\n65 percent gross site area; or\n\n(2)\n\nthe impervious cover allowed under Section 25-2-492 (Site Development Regulations) for the base zoning district in which the educational facility is located.\n\n(D)\n\nIn the Barton Springs Zone, maximum impervious cover is established under Article\n13 (Save Our Springs).\n\nSource: Ord. No. 20160623-090, Pt. 8, 7-4-16.\n\n\n\nFootnotes:\n\n--- (**1**) ---\n\n**Editor's note—**\nOrd. No. 20221027-045, Pts. 32, 33, adopted November 7, 2022, repealed §§ 25-8-367, 25-8-368, which pertained\nto shoreline relocation and lakefill and derived from Sections 13-7-49, 13-7-50; Ord.\n990225-70; Ord. 031211-11; Ord. 20131017-046; Ord. 20131017-079; Ord. No. 20140626-113, Pt. 21, 7-7-14; Ord. No. 20160922-048, Pt. 7, 10-3-16.\n\n(A)\n\nThis article applies to development in an urban watershed.\n\n(B)\n\nA person who develops in an urban watershed must comply with the requirements of this\narticle.\n\nSource: Ord. 20131017-046.\n\n(A)\n\nThis section applies to development in an uplands zone. Impervious cover limits in\nthis section are expressed as percentages of gross site area.\n\n(B)\n\nMaximum impervious cover for development within the City's zoning jurisdiction is\nestablished in Section 25-2-492 (Site Development Regulations).\n\n(C)\n\nMaximum impervious cover for development outside the City's zoning jurisdiction is\n80 percent.\n\n(D)\n\nMaximum impervious cover for a public mobility project in the right-of-way is 100\npercent.\n\nSource: Ord. 20131017-046; Ord. No. 20220519-094, Pt. 10, 5-30-22.\n\n(A)\n\nThis article applies to development in a suburban watershed.\n\n(B)\n\nA person who develops in a suburban watershed must comply with the requirements of\nthis article.\n\nSource: Section 13-2-520; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to development in an uplands zone. Impervious cover limits in\nthis section are expressed as percentages of gross site area.\n\n(B)\n\nThis subsection applies in the extraterritorial jurisdiction and in the portions of\nthe Lake, Rattan, Buttercup, South Brushy, and Brushy Creek watersheds that are in\nthe zoning jurisdiction.\n\n(1)\n\nImpervious cover for a single-family residential use with a minimum lot size of 5,750\nsquare feet may not exceed:\n\n(a)\n\n45 percent; or\n\n(b)\n\nif development intensity is transferred under Section 25-8-393 (Transfer of Development Intensity), 50 percent.\n\n(2)\n\nImpervious cover for a duplex or single-family residential use with a lot smaller\nthan 5,750 square feet in size may not exceed:\n\n(a)\n\n55 percent; or\n\n(b)\n\nif development intensity is transferred under Section 25-8-393 (Transfer of Development Intensity), 60 percent.\n\n(3)\n\nImpervious cover for a multifamily residential use may not exceed:\n\n(a)\n\n60 percent; or\n\n(b)\n\nif development intensity is transferred under Section 25-8-393 (Transfer of Development Intensity), 65 percent.\n\n(4)\n\nImpervious cover for a commercial use may not exceed:\n\n(a)\n\n65 percent; or\n\n(b)\n\nif development intensity is transferred under Section 25-8-393 (Transfer of Development Intensity), 70 percent.\n\n(5)\n\nImpervious cover for mixed use may not exceed:\n\n(a)\n\nthe limits in subsection (B)(3) for the portion of the ground floor that is multifamily\nresidential;\n\n(b)\n\nthe limits in subsection (B)(4) for the portion of the ground floor that is commercial;\nand\n\n(c)\n\nimpervious cover for the entire site shall be based on the ratios determined on the\nground floor.\n\n(6)\n\nImpervious cover for a public mobility project in the right-of-way may not exceed\n90 percent.\n\n(C)\n\nThis subsection applies in the portion of the zoning jurisdiction that is outside\nthe Lake, Rattan, Buttercup, South Brushy, and Brushy Creek watersheds.\n\n(1)\n\nImpervious cover for a single-family residential use with a minimum lot size of 5,750\nsquare feet may not exceed:\n\n(a)\n\n50 percent; or\n\n(b)\n\nif development intensity is transferred under Section 25-8-393 (Transfer of Development Intensity), 60 percent.\n\n(2)\n\nImpervious cover for a duplex or single-family residential use with a lot smaller\nthan 5,750 square feet in size may not exceed:\n\n(a)\n\n55 percent; or\n\n(b)\n\nif development intensity is transferred under Section 25-8-393 (Transfer of Development Intensity), 60 percent.\n\n(3)\n\nImpervious cover for a multifamily residential use may not exceed:\n\n(a)\n\n60 percent; or\n\n(b)\n\nif development intensity is transferred under Section 25-8-393 (Transfer of Development Intensity), 70 percent.\n\n(4)\n\nImpervious cover for a commercial use may not exceed:\n\n(a)\n\n80 percent; or\n\n(b)\n\nif development intensity is transferred under Section 25-8-393 (Transfer of Development Intensity), 90 percent.\n\n(5)\n\nImpervious cover for mixed use may not exceed:\n\n(a)\n\nthe limits in Subsection (C)(3) for the portion of the ground floor that is multifamily\nresidential:\n\n(b)\n\nthe limits in Subsection (C)(4) for the portion of the ground floor that is commercial;\nand\n\n(c)\n\nimpervious cover for the entire site shall be based on the ratios determined on the\nground floor.\n\n(6)\n\nImpervious cover for a public mobility project in the right-of-way may not exceed\n90 percent.\n\nSource: Section 13-2-524; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046; Ord. No. 20220519-094, Pt. 11, 5-30-22.\n\n(A)\n\nAn applicant who complies with a provision of this subsection qualifies for the development\nintensity transfer described in the provision, subject to the requirements in Subsection\n(B) and the impervious cover limitations in Section 25-8-392 (Uplands Zone).\n\n(1)\n\nThe applicant may transfer 20,000 square feet of impervious cover to an uplands zone\nfor each acre of land in a critical water quality zone:\n\n(a)\n\ndedicated to the City or another entity approved by the Watershed Protection Department\ndirector in fee simple and which the City or other approved entity accepts; or\n\n(b)\n\non which restrictions are placed to the benefit of the City or other approved entity\nand which the City or other approved entity accepts; and\n\n(c)\n\nthe applicant does not include in impervious calculations elsewhere.\n\n(2)\n\nThe applicant may transfer 20,000 square feet of impervious cover to an uplands zone\nfor each acre of land in an uplands zone:\n\n(a)\n\nlocated either in the 100-year floodplain or in an environmentally sensitive area\nas determined by environmental resource inventory and approved by the director of\nthe Watershed Protection Department; and\n\n(b)\n\ndedicated to the City or another entity approved by the Watershed Protection Department\ndirector in fee simple and which the City or other approved entity accepts; or\n\n(c)\n\non which restrictions are placed to the benefit of the City or other approved entity\nand which the City or other approved entity accepts; and\n\n(d)\n\nthe applicant does not include in impervious calculations elsewhere.\n\n(3)\n\nLand dedicated in fee simple to the City under this subsection may also be to credited\ntoward the parkland dedication requirements of Chapter 25-4, Article 3, Division 5 (Parkland Dedication).\n\n(B)\n\nAn applicant who qualifies for a development intensity transfer under subsection (A)\nmust comply with requirements of this subsection to effect the transfer.\n\n(1)\n\nFor transfers between two subdivided tracts:\n\n(a)\n\nAn applicant may transfer development intensity to a receiving tract that is within\nthe same watershed classification as the transferring tract. This limitation does\nnot apply if the transferring and receiving tracts are both owned by the applicant\nand are separated only by property that is also owned by the applicant.\n\n(b)\n\nAn applicant must concurrently plat the transferring and receiving tracts and must\ntransfer all development intensity at that time.\n\n(c)\n\nAn applicant must note the development intensity transfer on the plats of the transferring\nand receiving tracts, in a manner determined by the director.\n\n(d)\n\nAn applicant must file in the deed records a restrictive covenant, approved by the\ncity attorney, that runs with the transferring tract and describes the development\nintensity transfer.\n\n(2)\n\nFor transfers between two site plans:\n\n(a)\n\nAn applicant may transfer development intensity to a receiving tract that is within\nthe same watershed classification as the transferring tract. This limitation does\nnot apply if the transferring and receiving tracts are both owned by the applicant\nand are separated only by property that is also owned by the applicant.\n\n(b)\n\nThe transfer must be noted on the receiving and transferring site plans;\n\n(c)\n\nAn applicant must file in the deed records a restrictive covenant, approved by the\nCity Attorney, that runs with the transferring tract and describes the development\nintensity transfer.\n\n(d)\n\nThe transfer must occur before the receiving and transferring site plans are released.\n\n(3)\n\nFor transfers within a single site plan, an applicant must file in the deed records\na restrictive covenant, approved by the City Attorney, that runs with the transferring\ntract and describes the development intensity transfer.\n\nSource: Section 13-2-525; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nThis article applies to development in a water supply suburban watershed.\n\n(B)\n\nA person who develops in a water supply suburban watershed must comply with the requirements\nof this article.\n\nSource: Section 13-2-540; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDevelopment is prohibited in a water quality transition zone that lies over the South\nEdwards Aquifer recharge zone, except for:\n\n(1)\n\ndevelopment described in Article 7, Division 1 (Critical Water Quality Zone Restrictions); and\n\n(2)\n\nminor drainage facilities or water quality controls that comply with Section 25-8-263 (Floodplain Modification) and the floodplain modification criteria in the Environmental Criteria Manual.\n\n(B)\n\nIn a water quality transition zone that does not lie over the South Edwards Aquifer\nrecharge zone, the impervious cover of the land area of a site may not exceed 18 percent.\nThis limit on impervious cover does not apply to a public mobility project in the\nright-of-way allowed to cross a critical water quality zone under Section 25-8-262 (Critical Water Quality Zone Mobility Crossings). In determining land area, land in the 100 year floodplain is excluded.\n\n(C)\n\nWater quality controls may be located in a water quality transition zone that does\nnot lie over the South Edwards Aquifer recharge zone.\n\nSource: Sections 13-2-543(b), (c), and (d); Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20220519-094, Pt. 12, 5-30-22; Ord. No. 20221027-045, Pt. 34, 11-7-22.\n\n(A)\n\nThis section applies to development in an uplands zone. Impervious cover limits in\nthis section are expressed as percentages of net site area.\n\n(B)\n\nImpervious cover for a duplex or single-family residential use may not exceed:\n\n(1)\n\n30 percent; or\n\n(2)\n\nif development intensity is transferred under Section 25-8-424 (Transfer of Development Intensity), 40 percent.\n\n(C)\n\nImpervious cover for a commercial, multifamily residential use, or mixed use may not\nexceed:\n\n(1)\n\n40 percent; or\n\n(2)\n\nif development intensity is transferred under Section 25-8-424 (Transfer of Development Intensity), 55 percent.\n\n(D)\n\nImpervious cover for a public mobility project in the right-of-way may not exceed\n65 percent.\n\nSource: Section 13-2-544; Ord. 990225-70; Ord. 990819-99; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20220519-094, Pt. 13, 5-30-22.\n\n(A)\n\nAn applicant who complies with a provision of this section qualifies for the development\nintensity transfer described in the provision, subject to the requirements in subsection\n(B) and the impervious cover limitations in Section 25-8-423 (Uplands Zone).\n\n(1)\n\nThe applicant may transfer 15,000 square feet of impervious cover to an uplands zone\nfor each acre of land in a critical water quality zone or water quality transition\nzone:\n\n(a)\n\ndedicated to the City or another entity approved by the Watershed Protection Department\ndirector in fee simple and which the City or other approved entity accepts; or\n\n(b)\n\non which restrictions are placed to the benefit of the City or other approved entity\nand which the City or other approved entity accepts; and\n\n(c)\n\nthe applicant does not include in impervious calculations elsewhere.\n\n(2)\n\nLand dedicated in fee simple to the City under this subsection may also be credited\ntoward the parkland dedication requirements of Chapter 25-4, Article 3, Division 5 (Parkland Dedication).\n\n(B)\n\nAn applicant who qualifies for a development intensity transfer under Subsection (A)\nmust comply with requirements of this subsection to effect the transfer.\n\n(1)\n\nFor transfers between two subdivided tracts:\n\n(a)\n\nAn applicant may transfer development intensity to a receiving tract that is within\nthe same watershed classification as the transferring tract. This limitation does\nnot apply if the transferring and receiving tracts are both owned by the applicant\nand are separated only by property that is also owned by the applicant.\n\n(b)\n\nAn applicant must concurrently plat the transferring and receiving tracts and must\ntransfer all development intensity at that time.\n\n(c)\n\nAn applicant must note the development intensity transfer on the plats of the transferring\nand receiving tracts, in a manner determined by the director.\n\n(d)\n\nAn applicant must file in the deed records a restrictive covenant, approved by the\ncity attorney, that runs with the transferring tract and describes the development\nintensity transfer.\n\n(2)\n\nFor transfers between two site plans:\n\n(a)\n\nAn applicant may transfer development intensity to a receiving tract that is within\nthe same watershed classification as the transferring tract. This limitation does\nnot apply if the transferring and receiving tracts are both owned by the applicant\nand are separated only by property that is also owned by the applicant.\n\n(b)\n\nThe transfer must be noted on the receiving and transferring site plans;\n\n(c)\n\nAn applicant must file in the deed records a restrictive covenant, approved by the\nCity Attorney, that runs with the transferring tract and describes the development\nintensity transfer.\n\n(d)\n\nThe transfer must occur before the receiving and transferring site plans are released.\n\n(3)\n\nFor transfers within a single site plan, an applicant must file in the deed records\na restrictive covenant, approved by the City Attorney, that runs with the transferring\ntract and describes the development intensity transfer.\n\nSource: Section 13-2-545; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nThis article applies to development in a water supply rural watershed.\n\n(B)\n\nA person who develops in a water supply rural watershed must comply with the requirements\nof this article.\n\nSource: Section 13-2-560; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nDevelopment is prohibited in a water quality transition zone that lies over the South\nEdwards Aquifer recharge zone, except for:\n\n(1)\n\ndevelopment described in Article 7, Division 1 (Critical Water Quality Zone Restrictions); and\n\n(2)\n\nminor drainage facilities or water quality controls that comply with Section 25-8-263 (Floodplain Modification) and the floodplain modification criteria in the Environmental Criteria Manual.\n\n(B)\n\nDevelopment is prohibited in a water quality transition zone that lies outside the\nSouth Edwards Aquifer recharge zone, except for:\n\n(1)\n\ndevelopment described in Article 7, Division 1 (Critical Water Quality Zone Restrictions);\n\n(2)\n\nstreets or public mobility projects in the right-of-way;\n\n(3)\n\nminor drainage facilities or water quality controls that comply with Section 25-8-263 (Floodplain Modification) and the floodplain modification guidelines of the Environmental Criteria Manual;\nand\n\n(4)\n\nduplex or single-family residential development with a minimum lot size of two acres\nand a density of not more than one unit for each three acres, excluding acreage in\nthe 100-year flood plain.\n\n(C)\n\nA lot that lies within a critical water quality zone must also include at least two\nacres in a water quality transition zone or uplands zone.\n\nSource: Sections 13-2-563(b), (c), (d), and (e); Ord. 990225-70; Ord. 031211-11; Ord.\n20131017-046; Ord. No. 20220519-094, Pt. 14, 5-30-22; Ord. No. 20221027-045, Pt. 35, 11-7-22.\n\n(A)\n\nThis section applies to development in an uplands zone. Density and impervious cover\nlimits are based on net site area.\n\n(B)\n\nFor a duplex or single family residential use, density may not exceed:\n\n(1)\n\none unit for each two acres, with a minimum lot size of three-quarters acre; or\n\n(2)\n\nif development intensity is transferred under Section 25-8-454 (Transfer of Development Intensity), one unit for each acre, with a minimum lot size of one-half acre.\n\n(C)\n\nThis subsection applies to cluster housing.\n\n(1)\n\nDensity may not exceed:\n\n(a)\n\none unit for each acre; or\n\n(b)\n\nif development intensity is transferred under Section 25-8-454 (Transfer of Development Intensity), two units for each acre.\n\n(2)\n\nAt least 40 percent of the uplands area of a site must be retained in or restored\nto its natural state to serve as a buffer. The buffer must be contiguous to the development,\nand must receive overland drainage from the developed areas of the site unless a water\nquality control is provided. Use of the buffer is limited to fences, water quality\ncontrols that comply with Subdivision 25-8-213(C)(3) (Water Quality Control Standards), utilities that cannot reasonably be located elsewhere, irrigation lines not associated\nwith wastewater disposal, and access for site construction. A wastewater disposal\narea may not be located in the buffer.\n\n(D)\n\nThis subsection applies to a commercial, multifamily residential use, or mixed use.\n\n(1)\n\nImpervious cover may not exceed:\n\n(a)\n\n20 percent; or\n\n(b)\n\nif development intensity is transferred under Section 25-8-454 (Transfer of Development Intensity), 25 percent.\n\n(2)\n\nAt least 40 percent of the uplands area of a site must be retained in or restored\nto its natural state to serve as a buffer. The buffer must be contiguous to the development,\nand must receive overland drainage from the developed areas of the site unless a water\nquality control is provided. Use of the buffer is limited to fences, water quality\ncontrols that comply with Subdivision 25-8-213(C)(3) (Water Quality Control Standards), utilities that cannot reasonably be located elsewhere, irrigation lines not associated\nwith wastewater disposal, and access for site construction. A wastewater disposal\narea may not be located in the buffer.\n\n(E)\n\nImpervious cover for a public mobility project in the right-of-way may not exceed\n55 percent.\n\nSource: Section 13-2-564; Ord. 990225-70; Ord. 990819-99; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20170615-102, Pt. 24, 6-15-17; Ord. No. 20220519-094, Pt. 15, 5-30-22.\n\n(A)\n\nAn applicant who complies with a provision of this section qualifies for the development\nintensity transfer described in the provision, subject to the requirements in Subsection\n(B) and the impervious cover limitations in Section 25-8-453 (Uplands Zone).\n\n(1)\n\nThe applicant may transfer one single-family residential housing unit or 6,000 square\nfeet of impervious cover for commercial or multifamily development to an uplands zone\nfor each acre of land in a critical water quality zone or water quality transition\nzone:\n\n(a)\n\ndedicated to the City or another entity approved by the Watershed Protection Department\ndirector in fee simple and which the City or other approved entity accepts; or\n\n(b)\n\non which restrictions are placed to the benefit of the City or other approved entity\nand which the City or other approved entity accepts; and\n\n(c)\n\nthe applicant does not include in impervious calculations elsewhere.\n\n(2)\n\nLand dedicated in fee simple to the City under this subsection may also be credited\ntoward the parkland dedication requirements of Chapter 25-4, Article 3, Division 5 (Parkland Dedication).\n\n(B)\n\nAn applicant who qualifies for a development intensity transfer under Subsection (A)\nmust comply with requirements of this subsection to effect the transfer.\n\n(1)\n\nFor transfers between two subdivided tracts:\n\n(a)\n\nAn applicant may transfer development intensity to a receiving tract that is within\nthe same watershed classification as the transferring tract. This limitation does\nnot apply if the transferring and receiving tracts are both owned by the applicant\nand are separated only by property that is also owned by the applicant.\n\n(b)\n\nAn applicant must concurrently plat the transferring and receiving tracts and must\ntransfer all development intensity at that time.\n\n(c)\n\nAn applicant must note the development intensity transfer on the plats of the transferring\nand receiving tracts, in a manner determined by the director.\n\n(d)\n\nAn applicant must file in the deed records a restrictive covenant, approved by the\ncity attorney, that runs with the transferring tract and describes the development\nintensity transfer.\n\n(2)\n\nFor transfers between two site plans:\n\n(a)\n\nAn applicant may transfer development intensity to a receiving tract that is within\nthe same watershed classification as the transferring tract. This limitation does\nnot apply if the transferring and receiving tracts are both owned by the applicant\nand are separated only by property that is also owned by the applicant.\n\n(b)\n\nThe transfer must be noted on the receiving and transferring site plans.\n\n(c)\n\nAn applicant must file in the deed records a restrictive covenant, approved by the\nCity Attorney, that runs with the transferring tract and describes the development\nintensity transfer.\n\n(d)\n\nThe transfer must occur before the receiving and transferring site plans are released.\n\n(3)\n\nFor transfers within a single site plan, an applicant must file in the deed records\na restrictive covenant, approved by the City Attorney, that runs with the transferring\ntract and describes the development intensity transfer.\n\nSource: Section 13-2-565; Ord. 990225-70; Ord. 000309-39; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nThis article applies to development in the Barton Springs Zone.\n\n(B)\n\nA person who develops in the Barton Springs Zone must comply with the requirements\nof:\n\n(1)\n\nthis article; and\n\n(2)\n\nArticle 13 (Save Our Springs Initiative).\n\nSource: Section 13-2-580 and 15-2-584; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nDevelopment is prohibited in a water quality transition zone that lies over the Edwards\nAquifer recharge zone, except for:\n\n(1)\n\ndevelopment described in Article 7, Division 1 (Critical Water Quality Zone Restrictions); and\n\n(2)\n\nminor drainage facilities or water quality controls that comply with Section 25-8-263 (Floodplain Modification) and the floodplain modification criteria of the Environmental Criteria Manual.\n\n(B)\n\nDevelopment is prohibited in a water quality transition zone that lies outside the\nEdwards Aquifer recharge zone, except for:\n\n(1)\n\ndevelopment described in Article 7, Division 1 (Critical Water Quality Zone Restrictions);\n\n(2)\n\nminor drainage facilities or water quality controls that comply with Section 25-8-263 (Floodplain Modification) and the floodplain modification guidelines of the Environmental Criteria Manual;\n\n(3)\n\nstreets; and\n\n(4)\n\nduplex or single-family residential housing with a minimum lot size of two acres and\na density of not more than one unit for each three acres, excluding acreage in the\n100-year floodplain.\n\nSource: Sections 13-2-583(b) and (c); Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20221027-045, Pt. 36, 11-7-22.\n\nDevelopment intensity may not be transferred in the Barton Springs Zone except as\npart of an adjustment under Section 25-8-518 (Limited Adjustment to Resolve Possible Conflicts with Other Laws).\n\nSource: Section 13-2-585; Ord. 990225-70; Ord. 031211-11; Ord. 20131017-046.\n\n(A)\n\nThis article, to be known as the Save Our Springs Initiative, (SOS hereafter) sets\nout special requirements for development of land in watersheds within the City's planning\njurisdiction which contribute to Barton Springs.\n\n(B)\n\nThis article codifies the Save Our Springs Initiative Petition Ordinance as adopted\nby popular vote on August 8, 1992 and amended by the council.\n\nSource: Section 13-7-36.1; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045.\n\nThis article may be repealed or amended only by an affirmative vote of a three-quarters\nmajority of the city council.\n\nSource: Section 13-7-36.2; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045; Ord.\n20131017-046.\n\nThe people of the City declare their intent to preserve a clean and safe drinking\nwater supply, to prevent further degradation of the water quality in Barton Creek,\nBarton Springs, and the Barton Springs Edwards Aquifer, to provide for fair, consistent,\nand cost effective administration of the City's watershed protection ordinances, and\nto promote the public health, safety, and welfare. The City recognizes that the Barton\nSprings Edwards Aquifer is more vulnerable to pollution from urban development than\nany other major groundwater supply in Texas, and that the measures set out in this\narticle are necessary to protect this irreplaceable natural resource.\n\nSource: Section 13-7-36.3; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045.\n\n(A)\n\nIn the watersheds contributing to Barton Springs, no development nor any revision,\nextension, or amendment thereof, may be approved unless it is designed, carried out,\nand maintained on a site-by-site basis to meet the pollution prevention requirements\nset forth below for the life of the project. In order to prevent pollution, impervious\ncover for all such development shall be limited to a maximum of 15 percent in the\nentire recharge zone, 20 percent of the contributing zone within the Barton Creek\nwatershed, and 25 percent in the remainder of the contributing zone. The impervious\ncover limits shall be calculated on a net site area basis. In addition, runoff from\nsuch development shall be managed through water quality controls and onsite pollution\nprevention and assimilation techniques so that no increases occur in the respective\naverage annual loadings of total suspended solids, total phosphorus, total nitrogen,\nchemical oxygen demand, total lead, cadmium, E. coli, volatile organic compounds,\npesticides, and herbicides from the site. For a given project, impervious cover shall\nbe reduced if needed to assure compliance with these pollutant load restrictions.\n\n(B)\n\nWithin the watersheds contributing to Barton Springs, Section 25-8-92 (Critical Water Quality Zones Established) of the Land Development Code is amended so that in no event shall the boundary of\nthe critical water quality zone be less than 200 feet from the centerline of a major\nwaterway or be less than 400 feet from the centerline of the main channel of Barton\nCreek. No pollution control structure, or residential or commercial building, may\nbe constructed in the critical water quality zone in these watersheds.\n\nSource: Section 13-7-36.4; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045; Ord.\n20131017-046; Ord. No. 20170615-102, Pt. 25, 6-15-17.\n\nThe requirements of this article are not subject to the exemptions, special exceptions,\nwaivers, or variances allowed by Article 1 (General Provisions). Adjustments to the application of this article to a specific project may be granted\nonly as set out in Section 25-8-518 (Limited Adjustment To Resolve Possible Conflicts With Other Laws) below.\n\nSource: Section 13-7-36.5; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045.\n\n(A)\n\nThis article does not apply to development on a single platted lot or a single tract\nof land that is not required to be platted before development if the lot or tract\nexisted on November 1, 1991 and the development is either:\n\n(1)\n\nconstruction, renovation, additions to, repair, or development of a single-family,\nsingle-family attached, or a duplex structure used exclusively for residential purposes,\nand construction of improvements incidental to that residential use; or\n\n(2)\n\ndevelopment of a maximum of 8,000 square feet of impervious cover, including impervious\ncover existing before and after the development.\n\n(B)\n\nThis article does not apply to development of public primary or secondary educational\nfacilities if the City and the school district enter into a development agreement\napproved by a three-quarters vote of the city council protecting water quality pursuant\nto Section 13-2-502(n)(7) of the Land Development Code.\n\n(C)\n\nThis article does not apply to the replacement of development which is removed as\na result of right-of-way condemnation.\n\n(D)\n\nThis article does not apply to a roadway improvement with less than 8,000 square feet\nof new impervious cover. For the purposes of this Section, roadway improvements are\nlimited to intersection upgrades, low-water crossing upgrades, additions for bicycle\nlanes, and additions for mass transit stops.\n\nSource: Section 13-7-36.6; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045; Ord.\n20131017-046; Ord. No. 20170615-102, Pt. 26, 6-15-17.\n\nWithin the watersheds contributing to Barton Springs, the following provisions shall\ngovern the expiration of certain prior approvals:\n\n(1)\n\nPreviously Approved Preliminary Subdivision Plan:\n\n(a)\n\nUnless it has or will have expired sooner, a preliminary subdivision plan initially\napproved before the effective date of this article expires one year after the effective\ndate of this article, or two years after its initial approval whichever date is later,\nunless an application for final plat approval is filed before this expiration date\nand a final plat is approved no later than 180 days after filing.\n\n(b)\n\nNo approved preliminary plan, and no portion of an approved preliminary plan, shall\nbe valid or effective after the expiration date established by this part, or shall\nbe extended, revised, or renewed to remain effective after the expiration date, except\naccording to Subsection (3) of this section.\n\n(2)\n\nPreviously Approved Site Plan:\n\n(a)\n\nUnless it has or will have expired sooner, a site plan or phase or portion thereof\ninitially approved before the effective date of this article shall expire one year\nafter the effective date of this article, or three years after its initial approval,\nwhichever date is later, unless:\n\n(i)\n\nAn application is filed before this expiration date for building permits for all structures\nshown on the site plan or phase or portion thereof and designed for human occupancy,\nand the building permits are approved and remain valid and certificates of occupancy\nare issued no later than two years after this expiration date; or\n\n(ii)\n\nIf no building permits are required to construct the structures shown on a site plan\ndescribed in Subsection (2)(a) of this section, construction begins on all buildings\nshown on the site plan or portion or phase thereof before this expiration date, and\nthe buildings are diligently constructed and completed, and certificates of compliance\nor certificates of occupancy are issued no later than two years after this expiration\ndate.\n\n(b)\n\nNo approved site plan, and no separate phase or portion of an approved site plan,\nshall be valid or effective after the expiration date established by this part, or\nshall be extended, revised, or renewed to remain effective after the expiration date,\nexcept according to Subsection (3) of this section.\n\n(3)\n\nApproved Plans Which Comply: An approved preliminary subdivision plan, portion of\na preliminary plan, approved site plan, or separate phase or portion of an approved\nsite plan that complies with this article or that is revised to comply with this article\ndoes not expire under Subsection (1) or (2) of this section and remains valid for\nthe period otherwise established by law.\n\nSource: Section 13-7-36.7; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045.\n\n(A)\n\nThis article is not intended to conflict with the United States Constitution or the\nTexas Constitution or to be inconsistent with federal or state statutes that may preempt\na municipal ordinance or the Austin City Charter.\n\n(B)\n\nThe terms of this article shall be applied consistently and uniformly. If a three-quarters\nmajority of the city council concludes, or a court of competent jurisdiction renders\na final judgment concluding that this article, as applied to a specific development\nproject or proposal violates a law described in Subsection (A) of this section, the\ncity council may, after a public hearing, adjust the application of this article to\nthat project to the minimum extent required to comply with the conflicting law. Any\nadjustment shall be structured to provide the maximum protection of water quality.\n\nSource: Section 13-7-36.8; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045.\n\nThis article is intended to be cumulative of other City ordinances. In case of irreconcilable\nconflict in the application to a specific development proposal between a provision\nof this article and any other ordinance, the provision which provides stronger water\nquality controls on development shall govern. If a word or term used in this article\nis defined in the Austin City Code of 1981, as that code was in effect on November\n1, 1991, that word or term shall have the meaning established by the Austin City Code\nof 1981 in effect on that date, unless modified in this article.\n\nSource: Section 13-7-36.9; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045.\n\nWithin one year of the effective date of this article the City of Austin Environmental\nand Conservation Services Department shall complete a study, with citizen input, assessing\nthe risk of accidental contamination by toxic or hazardous materials of the Barton\nSprings Edwards Aquifer and other streams within the City and its extraterritorial\njurisdiction. The assessment shall inventory the current and possible future use and\ntransportation of toxic and hazardous materials in and through the City, and shall\nmake recommendations for City actions to reduce the risk of accidental contamination\nof the Barton Springs Edwards Aquifer and of other water bodies. Within 60 days of\ncompletion of the study, and following a public hearing, the city council shall take\nsuch actions deemed necessary to minimize risk of accidental contamination of city\nwaters by hazardous or toxic materials.\n\nSource: Section 13-7-36.10; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045.\n\nIn carrying out City efforts to reduce or remedy runoff pollution from currently developed\nareas or to prevent runoff pollution from currently developed or developing areas,\nthe city council shall assure that funds for remedial, retrofit or runoff pollution\nprevention measures shall be spent so as to achieve the maximum water quality benefit,\nand shall assure that the need for future retrofit is avoided whenever feasible.\n\nSource: Section 13-7-36.11; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045.\n\nIf any provision, section, subsection, sentence, clause, or phrase of this article,\nor the application of the same to any person, property, or set of circumstances is\nfor any reason held to be unconstitutional, void, or otherwise invalid, the validity\nof the remaining portions of this article shall not be affected by that invalidity;\nand all provisions of this article are severable for that purpose.\n\nSource: Section 13-7-36.12; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045.\n\nThe adoption of this article is not intended to preclude the adoption, at any time,\nby a majority vote of the city council of stricter water quality requirements upon\ndevelopment in the watersheds contributing to Barton Springs or of further measures\nto restore and protect water quality.\n\nSource: Section 13-7-36.13; Ord. 990225-70; Ord. 031211-11; Ord. 20060216-045.\n\n(A)\n\nExcept as provided in Subsection (B), this article applies in the zoning jurisdiction.\n\n(B)\n\nFor a preliminary plan, final plat, or subdivision construction plan in the portion\nof the city's extraterritorial jurisdiction that is within Travis County:\n\n(1)\n\nthis article does not apply; and\n\n(2)\n\nTitle 30 (Austin/Travis County Subdivision Regulations) governs.\n\nSource: Section 13-7-37(d); Ord. 990225-70; Ord. 031211-11; Ord. 031211-42.\n\nIn this article:\n\n(1)\n\nHERITAGE TREE means a tree that has a diameter of 24 inches or more, measured four\nand one-half feet above natural grade, and is one of the following species:\n\n(a)\n\nAsh, Texas\n\n(b)\n\nCypress, Bald\n\n(c)\n\nElm, American\n\n(d)\n\nElm, Cedar\n\n(e)\n\nMadrone, Texas\n\n(f)\n\nMaple, Bigtooth\n\n(g)\n\nAll Oaks\n\n(h)\n\nPecan\n\n(i)\n\nWalnut, Arizona\n\n(j)\n\nWalnut, Eastern Black\n\nThis list of eligible heritage tree species may be supplemented, but not reduced,\nas prescribed by rule.\n\n(2)\n\nOWNER includes a lessee.\n\n(3)\n\nPROTECTED TREE means a tree with a diameter of 19 inches or more, measured four and\none-half feet above natural grade.\n\n(4)\n\nREMOVAL means an act that causes or may be reasonably expected to cause a tree to\ndie, including:\n\n(a)\n\nuprooting;\n\n(b)\n\nsevering the main trunk;\n\n(c)\n\ndamaging the root system; and\n\n(d)\n\nexcessive pruning.\n\nSource: Section 13-7-38; Ord. 990225-70; Ord. 031211-11; Ord. 20100204-038.\n\n(A)\n\nA city arborist, appointed by the director of the Planning and Development Review\nDepartment, shall implement this article.\n\n(B)\n\nThe Planning and Development Review Department shall adopt administrative rules for\nthe implementation of this subchapter.\n\n(C)\n\nThe rules shall:\n\n(1)\n\ndescribe methods to protect trees against damage during development;\n\n(2)\n\nidentify actions that will constitute removal;\n\n(3)\n\nidentify the root areas that require protection against soil compaction or the effects\nof impervious paving; and\n\n(4)\n\nidentify mitigation measures and methods of calculation for fiscal security to ensure\nperformance of mitigation measures that may be required under article 1 of this subchapter.\n\nSource: Section 13-7-39; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20100204-038.\n\n(A)\n\nAn application for site plan approval must:\n\n(1)\n\ninclude a grading and tree protection plan, as prescribed by the Administrative Manual\nand the Environmental Criteria Manual; and\n\n(2)\n\ndemonstrate that the design will preserve the existing natural character of the landscape,\nincluding the retention of trees eight inches or larger in diameter to the extent\nfeasible.\n\n(B)\n\nIf development under a proposed site plan will remove a tree eight inches or larger\nin diameter, the City may require mitigation, including the planting of replacement\ntrees, as a condition of site plan approval. The director may not release the site\nplan until the applicant satisfies the condition or posts fiscal security to ensure\nperformance of the condition.\n\n(C)\n\nFor an application for preliminary plan, final plat, building permit, or site plan\napproval that proposes the removal of a protected tree, the city arborist must review\nthe application and make a recommendation before the application may be administratively\napproved or presented to the Land Use Commission or city council.\n\n(D)\n\nFor an application for preliminary plan, final plat, building permit, or site plan\napproval that proposes the removal of a heritage tree, the applicant must file a request\nfor a variance to remove the heritage tree under Division 3 of this Article before\nthe application may be administratively approved or presented to the Land Use Commission\nor City Council.\n\nSource: Sections 13-7-40, 13-7-46(c), and 13-7-48; Ord. 990225-70; Ord. 000309-39;\nOrd. 010607-8; Ord. 031211-11; Ord. 20100204-038.\n\n(A)\n\nIf enforcement of a City department policy, rule, or design standard will result in\nremoval of a protected or heritage tree, the Planning and Development Review Department\nmay request that the responsible City department waive or modify the policy, rule,\nor design standard to the extent necessary to save the tree.\n\n(B)\n\nThe responsible City department may waive or modify the policy, rule, or design standard\nafter determining that a waiver or modification will not result in a serious or imminent\nadverse effect.\n\n(C)\n\nThe city manager shall resolve differences of opinion between the Planning and Development\nReview Department and another City department under this section.\n\nSource: Section 13-7-43; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20100204-038.\n\nThe city arborist shall report annually to the Environmental Commission. The report\nshall include, but is not limited to, impacts to protected or heritage trees, tree\npromotional programs, and urban forestry planning efforts.\n\nSource: Ord. 20100204-038; Ord. No. 20141211-204, Pt. 24, 7-1-15; Ord. No. 20170615-102, Pt. 27, 6-15-17.\n\nThe requirements of this subchapter apply to land development and other actions by\nthe City.\n\nSource: Ord. 20100204-038.\n\n(A)\n\nExcept as otherwise provided in this section, a person may not remove a protected\ntree unless the Planning and Development Review Department has issued a permit for\nthe removal under this division.\n\n(B)\n\nA person may, without a permit, remove a damaged protected tree that is an imminent\nhazard to life or property if the tree is removed within seven days of being damaged.\nThe Planning and Development Review Department may extend this deadline for widespread\nand extensive storm damage.\n\n(C)\n\nA person may, without a permit, remove a protected tree if the tree is identified\nfor removal on an approved preliminary plan, final plat or site plan.\n\nSource: Section 13-7-46; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20100204-038.\n\n(A)\n\nFor a protected tree located on public property or a public street or easement, an\napplication for removal of the tree may be filed by:\n\n(1)\n\na City department, public utility, or political subdivision with the authority to\ninstall utility lines or other public facilities in or above the property, street,\nor easement; or\n\n(2)\n\nthe owner of property adjoining the site of the tree.\n\n(B)\n\nFor a protected tree located on private property, an application for removal of the\ntree may be filed by:\n\n(1)\n\nthe owner of the property on which the tree is located; or\n\n(2)\n\nthe city arborist, if the tree is seriously diseased or is a safety hazard.\n\n(C)\n\nAn application for removal of a protected tree must:\n\n(1)\n\nbe filed with the director of the Planning and Development Review Department; and\n\n(2)\n\ninclude the information prescribed by the Administrative Manual.\n\n(D)\n\nAn application fee is not required if the application is for removal under Subsection\n25-8-624(A)(3), (4), or (5) (Approval Criteria).\n\nSource: Section 13-7-47; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20100204-038.\n\nThe city arborist shall promptly inspect a tree for which removal is requested.\n\nSource: Section 13-7-41(a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe Planning and Development Review Department may approve an application to remove\na protected tree only after determining that the tree:\n\n(1)\n\nprevents reasonable access to the property;\n\n(2)\n\nprevents a reasonable use of the property;\n\n(3)\n\nis an imminent hazard to life or property, and the hazard cannot reasonably be mitigated\nwithout removing the tree;\n\n(4)\n\nis dead;\n\n(5)\n\nis diseased, and:\n\n(a)\n\nrestoration to sound condition is not practicable; or\n\n(b)\n\nthe disease may be transmitted to other trees and endanger their health; or\n\n(6)\n\nfor a tree located on public property or a public street or easement:\n\n(a)\n\nprevents the opening of necessary vehicular traffic lanes in a street or alley; or\n\n(b)\n\nprevents the construction of utility or drainage facilities that may not feasibly\nbe rerouted.\n\n(B)\n\nIf an application filed by a political subdivision of the state is approved under\nSubsection (A)(2), the Land Use Commission may, in its discretion, review the approval.\n\n(C)\n\nFor an application to remove a protected tree located on private property, an applicant\nmust request a variance, waiver, exemption, modification, or alternative compliance\nthat would eliminate the reason for removal of the tree.\n\n(1)\n\nThe application to remove the protected tree may not be approved unless the request\nis denied.\n\n(2)\n\nAn application fee is not required for a variance, waiver, exemption, modification,\nor alternative compliance request required by this subsection.\n\n(3)\n\nThis subsection does not apply to an application that may be approved under Subsection\n(A)(3), (4), or (5).\n\n(4)\n\nThe body considering the variance, waiver, exemption, modification or alternative\ncompliance will consider the benefit of preserving the protected tree in determining\nwhether to grant or deny the request for a variance, waiver, exemption, modification\nor alternative compliance from another City Code provision.\n\n(5)\n\nThis subsection does not require an applicant to request a variance, waiver, exemption,\nmodification, or alternative compliance if the director determines that to do so would\nendanger the public health and safety.\n\n(D)\n\nThe Planning and Development Review Department shall require mitigation as a condition\nof application approval. A removal permit may not be issued until the applicant satisfies\nthe condition or posts fiscal security to ensure performance of the condition within\none year.\n\nSource: Section 13-7-41(b), (c), (d), and (f); Ord. 990225-70; Ord. 010329-18; Ord.\n010607-8; Ord. 031211-11; Ord. 20100204-038.\n\n(A)\n\nThe Planning and Development Review Department shall take action on an application\nto remove a protected tree:\n\n(1)\n\nnot later than the 10th working day after the complete application is filed; or\n\n(2)\n\nif a variance, waiver, exemption, modification, or alternative compliance request\nis required by Subsection 25-8-624(C) (Approval Criteria), not later than the 10th working day after the request is denied.\n\n(B)\n\nAn application to remove a tree that is not associated with a pending subdivision,\nsite plan, or building permit application submitted to the City is automatically granted\nif the Planning and Development Review Department does not take action on the application\nbefore the expiration of the applicable deadline in Subsection (A).\n\nSource: Section 13-7-41(a); Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 20100204-038.\n\n(A)\n\nApproval of an application to remove a protected tree is effective immediately.\n\n(B)\n\nAn approval to remove a protected tree expires:\n\n(1)\n\none year after its effective date, provided that the mitigation conditions in the\npermit remain in effect until the conditions are met; or\n\n(2)\n\nfor a development described in Subsection 25-8-621(C) (Permit Required for Removal of Protected Trees; Exceptions), when the development plan expires.\n\nSource: Section 13-7-41(e); Ord. 990225-70; Ord. 031211-11; Ord. 20100204-038.\n\nAn applicant may appeal the denial of an application to remove a protected tree to\nthe Land Use Commission.\n\nSource: Section 13-7-42; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nRemoval of a heritage tree is prohibited unless the Planning and Development Review\nDepartment has issued a permit for the removal under this division.\n\n(B)\n\nA permit to remove a heritage tree may be issued only if a variance is approved under\nSection 25-8-642 (Administrative Variance) or 25-8-643 (Land Use Commission Variance).\n\n(C)\n\nThe requirements in this division apply to trees on private and public property. To\nthe extent of conflict with another section of the Code, this division applies.\n\n(D)\n\nA person may, without a variance, remove a damaged heritage tree that is an imminent\nhazard to life or property if the tree is removed within seven days of being damaged.\nThe director may extend this deadline for widespread and extensive storm damage.\n\nSource: Ord. 20100204-038.\n\n(A)\n\nThe director of the Planning and Development Review Department may grant a variance\nfrom Section 25-8-641 (Removal Prohibited) to allow removal of a heritage tree only after determining, based on the city arborist's\nrecommendation, that the heritage tree:\n\n(1)\n\nis dead;\n\n(2)\n\nis an imminent hazard to life or property, and the hazard cannot reasonably be mitigated\nwithout removing the tree; or\n\n(3)\n\nis diseased and:\n\n(a)\n\nrestoration to sound condition is not practicable; or\n\n(b)\n\nthe disease may be transmitted to other trees and endanger their health.\n\n(B)\n\nNo application fee and no mitigation are required for a variance request under subsection\n(A).\n\n(C)\n\nThe director of the Planning and Development Review Department may grant a variance\nfrom Section 25-8-641 (Removal Prohibited) to allow removal of a heritage tree that does not have at least one stem that is\n30 inches in diameter or larger measured four and one-half feet above natural grade\nonly after determining, based on the city arborist's recommendation, that the heritage\ntree meets the criteria in Section 25-8-624(A) (Approval Criteria) and that:\n\n(1)\n\nthe applicant has applied for and been denied a variance, waiver, exemption, modification,\nor alternative compliance from another City Code provision which would eliminate the\nneed to remove the heritage tree, as required in Section 25-8-646 (Variance Prerequisite); and\n\n(2)\n\nremoval of the heritage tree is not based on a condition caused by the method chosen\nby the applicant to develop the property, unless removal of the heritage tree will\nresult in a design that will allow for the maximum provision of ecological service,\nhistoric, and cultural value of the trees on the site.\n\n(D)\n\nA variance granted under this section:\n\n(1)\n\nshall be the minimum change necessary;\n\n(2)\n\nshall require mitigation as a condition of variance approval for variances requested\nunder Subsection (C) of this section; and\n\n(3)\n\nmay not be issued until the applicant has satisfied the mitigation conditions required\nunder this Subsection (D)(2) or posted fiscal security adequate to ensure performance\nof the mitigation conditions not later than one year after issuance of the variance.\n\n(E)\n\nThe director of the Planning and Development Review Department shall prepare written\nfindings to support the grant or denial of a variance request under Subsection (C)\nof this Section.\n\nSource: Ord. 20100204-038.\n\n(A)\n\nThe Land Use Commission may grant a variance from Section 25-8-641 (Removal Prohibited) to allow removal of a heritage tree that has at least one stem\nthat is 30 inches or larger in diameter measured four and one-half feet above natural\ngrade only after determining, based on the city arborist's recommendation, that the\nheritage tree meets the criteria in Section 25-8-624(A) (Approval Criteria), and that:\n\n(1)\n\nthe applicant has applied for and been denied a variance, waiver, exemption, modification,\nor alternative compliance from another City Code provision which would eliminate the\nneed to remove the heritage tree, as required in Section 25-8-646 (Variance Prerequisites); and\n\n(2)\n\nremoval of the heritage tree is not based on a condition caused by the method chosen\nby the applicant to develop the property, unless removal of the heritage tree will\nresult in a design that will allow for the maximum provision of ecological service,\nhistoric, and cultural value of the trees on the site.\n\n(B)\n\nA variance granted under this section:\n\n(1)\n\nshall be the minimum change necessary;\n\n(2)\n\nshall require mitigation as a condition of variance approval; and\n\n(3)\n\nmay not be issued until the applicant has satisfied the mitigation conditions required\nunder this Subsection (B)(2) or posted fiscal security adequate to ensure performance\nof the mitigation conditions not later than one year after issuance of the variance.\n\n(C)\n\nConsideration of a variance under this section requires review by the Environmental\nCommission.\n\nSource: Ord. 20100204-038; Ord. No. 20141211-204, Pt. 24, 7-1-15; Ord. No. 20170615-102, Pt. 28, 6-15-17.\n\n(A)\n\nAn applicant may appeal denial of an administrative variance under Section 25-8-642 to the Land Use Commission.\n\n(B)\n\nAn appeal under this section requires review by the Environmental Commission.\n\nSource: Ord. 20100204-038; Ord. No. 20141211-204, Pt. 24, 7-1-15; Ord. No. 20170615-102, Pt. 29, 6-15-17.\n\n(A)\n\nFor a heritage tree located on public property or a public street or easement, an\napplication requesting a variance to allow removal of the heritage tree may be filed\nby:\n\n(1)\n\na City department, public utility, or political subdivision with the authority to\ninstall utility lines or other public facilities in or above the property, street,\nor easement; or\n\n(2)\n\nthe owner of property adjoining the site of the tree.\n\n(B)\n\nFor a heritage tree located on private property, an application requesting a variance\nto allow removal of the heritage tree may be filed by:\n\n(1)\n\nthe owner of the property on which the tree is located; or\n\n(2)\n\nthe city arborist, if the tree is seriously diseased or is a safety hazard.\n\n(C)\n\nAn application requesting a variance to allow removal of a heritage tree must:\n\n(1)\n\nbe filed with the director of the Planning and Development Review Department; and\n\n(2)\n\ninclude the fee prescribed by ordinance; and\n\n(3)\n\ninclude the information prescribed by the Administrative Criteria Manual.\n\n(D)\n\nThe application fee is not required if the application is based solely on the criteria\nin Subsections 25-8-624(A)(3), (4) or (5).\n\nSource: Ord. 20100204-038.\n\n(A)\n\nIf a variance, waiver, exemption, modification, or alternative compliance from another\nCity Code provision would eliminate the need for a variance from Section 25-8-641 (Removal Prohibited), before requesting a variance to allow removal of a heritage tree on private property\nthe applicant must:\n\n(1)\n\nrequest a variance, waiver, exemption, modification or alternative compliance from\nthe Code provisions that would eliminate the need to remove the heritage tree; and\n\n(2)\n\nobtain a grant or denial of the variance, waiver, exemption, modification or alternative\ncompliance that would eliminate the need to remove the heritage tree.\n\n(B)\n\nThe request for a variance to allow removal of a heritage tree may not be considered\nunless the variance, waiver, exemption, modification or alternative compliance from\nother City Code provisions is denied.\n\n(C)\n\nThe application fee for a variance from another City Code provision required under\nthis section is waived.\n\n(D)\n\nThis section does not apply to an application for a variance to remove a heritage\ntree based on the criteria in Subsections 25-8-624(A)(3), (4) or (5).\n\n(E)\n\nThe body considering the variance, waiver, exemption, modification, or alternative\ncompliance will consider the benefit of preserving the heritage tree in determining\nwhether to grant or deny the request for a variance, waiver, exemption, modification\nor alternative compliance from another City Code provision.\n\n(F)\n\nThis subsection does not require an applicant to request a variance, waiver, exemption,\nmodification, or alternative compliance if the director determines that to do so would\nendanger the public health and safety.\n\nSource: Ord. 20100204-038.\n\n(A)\n\nThe director of the Planning and Development Review Department shall take action on\na variance request to allow removal of a heritage tree:\n\n(1)\n\nnot later than the 10th working day after the complete application is filed; or\n\n(2)\n\nif a variance, waiver, exemption, modification, or alternative compliance from another\nCity Code provision is required under Subsection 25-8-646 (Variance Prerequisite), not later than the 10th working day after the request is denied.\n\n(B)\n\nIf the application is based on a damaged heritage tree constituting an immediate hazard\nto life or property, the application shall be approved or denied within 24 hours and\nno application fee is required.\n\n(C)\n\nAn application to remove a tree that is not associated with a pending subdivision,\nsite plan, or building permit application submitted to the City is automatically granted\nif the director does not act on the application before the expiration of the applicable\ndeadline.\n\nSource: Ord. 20100204-038.\n\n(A)\n\nApproval of a variance request to allow removal of a heritage tree is effective immediately.\n\n(B)\n\nA variance to allow removal of a heritage tree expires:\n\n(1)\n\none year after its effective date, provided that the mitigation conditions in the\nvariance remain in effect until the conditions are met; or\n\n(2)\n\nfor an application that is associated with a pending subdivision, site plan, or building\npermit submitted to the City, when the development permit expires.\n\nSource: Ord. 20100204-038.\n\n\n\nFootnotes:\n\n--- (**2**) ---\n\n**Editor's note—**\nOrd. No. 20221027-045, § 37, effective November 7, 2022, repealed the former Art. 2, §§ 25-8-691—25-8-696,\nand enacted a new Art. 2 as set out herein. The former Art. 2 pertained to endangered\nspecies and derived from Sections 13-7-72(a)(1), (b), 13-7-72(a)(2), (b), 13-7-72(a),\n13-7-73, 13-7-74, 13-7-80; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20170615-102, Pts. 30—32, 6-15-17.\n\n(A)\n\nThis section applies in areas of the planning jurisdiction that may contain habitat\nfor federally listed threatened or endangered species identified in the map maintained\nby the City online or available for inspection in the office of the Development Services\nDepartment.\n\n(B)\n\nOn submission of an application for a subdivision or site plan in an area described\nin Subsection (A), the applicant must give notice of the application to the appropriate\nauthority, including:\n\n(1)\n\nUnited States Fish and Wildlife Service;\n\n(2)\n\nBalcones Canyonlands Conservation Plan Coordinating Committee Secretary; and\n\n(3)\n\nHays, Travis, or Williamson County, as applicable depending on project location.\n\n(C)\n\nThe notice must include a statement that the development could cause the loss of threatened\nor endangered species habitat.\n\nSource: Ord. No. 20221027-045, Pt. 37, 11-7-22.\n\n(A)\n\nApplicability; Intent.\n\n(1)\n\nThis section applies to a site that is required to provide a compatibility buffer.\n\n(2)\n\nThe intent of these requirements is to create a visual barrier between uses and to\nimprove the urban environment for the future occupants of the development and surrounding\nneighbors while balancing these objectives with the provision of housing.\n\n(B)\n\nIn this section,\n\n(1)\n\nPROPERTY LINE means the property line that is shared with a triggering property; and\n\n(2)\n\nTRIGGERING PROPERTY means a property that:\n\n(a)\n\nincludes at least one dwelling unit but less than four dwelling units; and\n\n(b)\n\nis zoned Urban Family Residence (SF-5) or more restrictive.\n\n(C)\n\nThis subsection applies in all compatibility buffers.\n\n(1)\n\nExcept as provided in this section, a compatibility buffer may not include vertical\nstructures.\n\n(2)\n\nA compatibility buffer may include stormwater control measures and retaining walls.\n\n(3)\n\nA restricted zone within a compatibility buffer may include:\n\n(a)\n\nlandscaping or gardens;\n\n(b)\n\nfences, walls, or berms;\n\n(c)\n\nsurface parking lots, driveways, alleys, or fire lanes;\n\n(d)\n\npaths, walkways, or public use trails, including associated lighting;\n\n(e)\n\nutility infrastructure;\n\n(f)\n\nrefuse receptacles;\n\n(g)\n\nbike racks, benches, and water fountains;\n\n(h)\n\nground-floor private common and private personal open space; and\n\n(i)\n\nmechanical equipment.\n\n(4)\n\nA windowsill, belt course, cornice, flue, chimney, eave, box window, cantilevered\nbay window, or balcony may project two feet into the restricted zone.\n\n(5)\n\nA screening zone may include:\n\n(a)\n\nlandscaping or gardens;\n\n(b)\n\nfences, walls, or berms;\n\n(c)\n\npaths, walkways, or public use trails, including associated lighting and gates;\n\n(d)\n\nutility infrastructure if a utility provider determines that it is necessary;\n\n(e)\n\nbike racks, benches, and water fountains; and\n\n(f)\n\nground-floor private common and private personal open space.\n\n(6)\n\nIn a compatibility buffer, vegetation must be:\n\n(a)\n\nlisted in Appendix N of the Environmental Criteria Manual; and\n\n(b)\n\nirrigated, maintained, and certified in accordance with the Environmental Criteria\nManual.\n\n(7)\n\nNothing in this section requires an applicant to remove healthy and existing vegetation\nlocated within the screening zone.\n\n(8)\n\nIf existing conditions or proposed utility infrastructure or easements prevent full\ncompliance with the requirements of this section, the director may approve an applicant's\nrequest for alternative methods of compliance that aligns with the intent of this\nsection.\n\n(D)\n\nA compatibility buffer that is at least 25 feet in width must comply with this subsection.\n\n(1)\n\nThe compatibility buffer shall include a screening zone and restricted zone.\n\n(2)\n\nScreening Zone.\n\n(a)\n\nThe screening zone is parallel to the property line, begins at the property line,\nand extends ten feet into the property.\n\n(b)\n\nAt 25 linear feet intervals parallel to the property line that is shared with a triggering\nproperty, the screening zone must include a minimum of:\n\n(i)\n\n1 large shade tree;\n\n(ii)\n\n1 small understory tree; and\n\n(iii)\n\n10 shrubs.\n\n(3)\n\nRestricted Zone. The restricted zone is parallel to the property line, begins at the\nedge of the screening zone, and extends an additional 15 feet into the property.\n\n(E)\n\nA compatibility buffer that is more than 15 feet but less than 25 feet in width must\ncomply with this subsection.\n\n(1)\n\nThe compatibility buffer shall include a screening zone and restricted zone.\n\n(2)\n\nScreening Zone.\n\n(a)\n\nThe screening zone is parallel to the property line, begins at the property line,\nand extends ten feet into the property.\n\n(b)\n\nAt 25 linear feet intervals parallel to the property line that is shared with a triggering\nproperty, a screening zone must include a minimum of:\n\n(i)\n\n1 large shade tree;\n\n(ii)\n\n1 small understory tree; and\n\n(iii)\n\n10 shrubs.\n\n(3)\n\nRestricted Zone. The restricted zone is parallel to the property line, begins at the\nedge of the screening zone, and extends into the property to the maximum width of\nthe compatibility buffer.\n\n(F)\n\nA compatibility buffer that is at least 10 feet but no more than 15 feet in width\nmust comply with this subsection.\n\n(1)\n\nThe compatibility buffer shall include a screening zone.\n\n(2)\n\nThe screening zone is parallel to the property line, begins at the property line,\nand extends ten feet into the property.\n\n(3)\n\nAt 25 linear feet intervals parallel to the property line that is shared with a triggering\nproperty, the screening zone must include a minimum of:\n\n(a)\n\ntwo small understory trees; and\n\n(b)\n\n10 shrubs.\n\n(4)\n\nRestricted Zone. The restricted zone is parallel to the property line, begins at the\nedge of the screening zone, and extends into the property to the maximum width of\nthe compatibility buffer.\n\n(G)\n\nA compatibility buffer that is less than 10 feet in width includes a screening zone\nthat extends the width of the compatibility buffer and is parallel to the property\nline that is shared with a triggering property.\n\nSource: Ord. No. 20240229-073, Pt. 4, 3-11-24; Ord. No. 20240530-136, Pt. 1, 6-10-24.\n",
  "start_line": 52066,
  "end_line": 57920,
  "subsections": []
}