{
  "id": "chapter-30-2",
  "title": "SUBDIVISION REQUIREMENTS",
  "level": 1,
  "parent_id": null,
  "content": "## CHAPTER 30-2. - SUBDIVISION REQUIREMENTS.\n\nExcept as otherwise provided in this article, a subdivision must comply with the requirements\nof this title.\n\nSource: City Code Section 25-4-1; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe director may except a parcel of land from the city's requirement to plat if the\ndirector determines that the parcel existed in its current configuration before becoming\nsubject to the city's jurisdiction over subdivision of land.\n\n(B)\n\nThe director may except a parcel of land from the city's requirement to plat if the\ndirector determines that the parcel:\n\n(1)\n\ncontains a health or safety hazard associated with a private sewage facility or private\nwater well or other conditions that adversely affect public health, safety or welfare;\n\n(2)\n\nexisted in its current configuration on August 8, 1992;\n\n(3)\n\nwas served by a private sewage facility or private water well on August 8, 1992;\n\n(4)\n\nis located on an existing street; and\n\n(5)\n\ncomplies with the requirements of this title for roadway frontage.\n\n(C)\n\nThe director may except a parcel of land from the city's requirement to plat if the\ndirector determines that the parcel:\n\n(1)\n\nis five acres or less:\n\n(2)\n\nexisted in its current configuration on August 31, 1987;\n\n(3)\n\nwas receiving utility service that was authorized under the rules of the utility provider\non August 31, 1987;\n\n(4)\n\nis located on an existing street; and\n\n(5)\n\ncomplies with the requirements of this title for roadway frontage.\n\n(D)\n\nAn applicant shall demonstrate to the director that a parcel is excepted under this\nsection from the requirement to plat. An applicant shall provide the director with\nthe current deed to the property, an adequate legal description, and proof of ownership.\n\n(E)\n\nIf the director excepts a parcel from the city's requirement to plat, the director\nshall certify the parcel's exception.\n\n(F)\n\nAn approval to extend or change utility service to a parcel is not a certification\nunder this section or an approval of a plat.\n\nSource: City Code Section 25-4-2; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe director may temporarily exempt a parcel of land from the city's requirement to\nplat if the director determines that the sole use of the parcel is as a community\ngarden. An applicant shall provide the director with the information and documentation\nnecessary to establish the exemption.\n\n(B)\n\nIf the sole use of an exempted parcel changes from a community garden, an exemption\nunder this section expires.\n\n(C)\n\nA parcel temporarily exempted under this section must be platted before it may be\nused for a purpose other than as a community garden.\n\nSource: City Code Section 25-4-3; Ord. 031211-11; Ord. 031211-42; Ord. 20110210-018.\n\n(A)\n\nThe county does not require a plat for:\n\n(1)\n\na tract of land that existed in its current configuration before September 1, 1983;\n\n(2)\n\na manufactured home rental community, as defined by Local Government Code Section\n232.007, if the development complies with the minimum infrastructure requirements\nof County Code Section 82.301(d);\n\n(3)\n\na judicial partition under a final judgment;\n\n(4)\n\nan acquisition by an entity with the power of eminent domain by a condemnation or\ndedication or by contract and conveyance instead of condemnation;\n\n(5)\n\na subdivision that does not lay out a street, alley, square, park, or other area for\npublic use or for the use of a purchaser or owner of a lot adjacent to one of those\nareas, if all the subdivided land:\n\n(a)\n\nis primarily for agricultural use, as defined by Texas Constitution Article III, Section\n1-d, or primarily for farm, ranch, wildlife management, or timber production use,\nas defined by Texas Constitution Article III, Section 1-d-1;\n\n(b)\n\nis divided into four or fewer lots and is to be transferred to a person who is related\nto the owner within the third degree of consanguinity or affinity, as determined by\nGovernment Code Chapter 573;\n\n(c)\n\nconsists of lots of more than 10 acres in area;\n\n(d)\n\nis sold to veterans through the Veteran's Land Board program;\n\n(e)\n\nbelongs to the state or a state agency, board, or commission, or the permanent school\nfund or other dedicated state fund;\n\n(f)\n\nis retained in part by the owner, and transferred in part to a person who will further\nsubdivide the tract in accordance with requirements of this title; or\n\n(g)\n\nis transferred to a person who owned an undivided interest in the original tract,\nand a plat is filed before further development of any part of the tract; or\n\n(6)\n\nproperty that is owned by a political subdivision of the state and located in a floodplain,\nand the lots are sold to adjoining landowners.\n\n(B)\n\nIf the county executive determines that a division of land is excepted from platting\nunder Subsection (A), the county executive shall, at the request of the land owner,\nissue a letter to the owner acknowledging the exception. The county executive may\nrequire that the owner provide certification or documentation that the requirements\nof Subsection (A) are satisfied.\n\nSource: County Code Section 82.105; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130.\n\nThe planning commission and the zoning and platting commission may each adopt rules\nof procedure. Adopted rules are effective when filed with the city clerk.\n\nSource: City Code Section 25-4-31; Ord. 031211-11; Ord. 031211-42.\n\n**Editor's note—**\nOrd. No. 20230831-142, § 13, effective September 1, 2023, repealed § 30-2-32, which pertained to city action\nwithin 30 days and derived from City Code Section 25-4-32; Ord. 031211-11; Ord. 031211-42;\nOrd. No. 20190822-117, Pt. 45, 9-1-19.\n\n(A)\n\nThe requirements of this section supersede any contrary provisions of this title relating\nto action by the single office.\n\n(B)\n\nThe single office shall approve, approve with conditions, or disapprove with reasons\nan application for preliminary plan or plat not later than the 30th day after the\napplication is filed, unless the single office has approved a written request from\nthe applicant to extend the initial review pursuant to Section 30-1-118 (Extension of Review Period).\n\n(C)\n\nA condition for approval or reason for disapproval must be written and may not be\narbitrary. The condition or reason must:\n\n(1)\n\nbe directly related to requirements adopted under Texas Local Government Code Chapter\n212 Subchapter A (Regulation of Subdivisions) or Texas Local Government Code Chapter 232 Subchapter A (Subdivision Platting Requirements in General); and\n\n(2)\n\ninclude a citation to the law, including a statute or order, that is the basis for\nthe condition for approval or reason for disapproval.\n\n(D)\n\nIf an application for a preliminary plan or plat is not approved, approved with conditions,\nor disapproved with reasons within a time period prescribed by Subsection (B) the\napplication is approved by operation of law.\n\nSource: County Code Section 82.201(b); Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 46, 9-1-19; Ord. No. 20230831-142, Pt. 14, 9-1-23.\n\n(A)\n\nAn original tract is a tract that:\n\n(1)\n\nis a legal lot or tract; or\n\n(2)\n\nwas a legal lot or tract before being subdivided in violation of ordinance requirements.\n\n(B)\n\nAn applicant shall include all land in the original tract in an application for preliminary\nplan or plat approval.\n\n(C)\n\nThe single office may waive the requirement of Subsection (B) if the single office\ndetermines that:\n\n(1)\n\nsubdividing only a portion of the original tract will not substantially impair the\norderly planning of roads, utilities, drainage, and other public facilities;\n\n(2)\n\nthe portion of the original tract contiguous to the area to be subdivided has direct\naccess to a public street, or the applicant has provided access to a public street\nby dedicating right-of-way at least 50 feet wide;\n\n(3)\n\na reasonable use of the balance of the original tract is possible; and\n\n(4)\n\nthe applicant has mailed, by certified mail, to all owners of land that is a portion\nof the original tract and contiguous to the land included in the application a request\nthat each owner provide written confirmation to the director that:\n\n(a)\n\nthe owner's land is not a legal lot or tract; and\n\n(b)\n\nthe owner must plat the land before the city may approve a development permit or a\nutility company may provide initial or additional service.\n\n(D)\n\nIn making a determination under Subsection (D)(3) that a reasonable use of the balance\nof the original tract is possible, the single office may require that the applicant\nprovide a schematic land plan of the balance of the original tract. The single office\nmay not require that the applicant provide detailed engineering information.\n\n(E)\n\nAn applicant who satisfies the requirement of Subsection (D)(2) by dedicating right-of-way\nto provide access to a public street is not required to construct improvements within\nthe right-of-way.\n\n(F)\n\nAs a condition of a waiver to Subsection (B), the county may require the subdivider\nto enter into a phasing agreement to provide for the orderly development of the property.\n\n(1)\n\nA subdivider must obtain approval of a phasing agreement by the commissioners court\nnot later than the date the first final plat is approved.\n\n(2)\n\nThe single office may make a recommendation on the phasing agreement.\n\n(3)\n\nThe commissioners court may approve a phasing agreement if the commissioners court\ndetermines:\n\n(a)\n\nthe phasing agreement accommodates the development and protects the public interest;\n\n(b)\n\nthe dedication of roads, drainage facilities, parkland, and other infrastructure and\nthe posting of construction security is roughly proportional to the impact of the\ndevelopment of the property; and\n\n(c)\n\nthe phasing agreement has been approved by the county attorney.\n\nSource: City Code Section 25-4-33; County Code Section 82.201(b)(4)—(8); Ord. 031211-11;\nOrd. 031211-42; Ord. No. 20190822-117, § 47, 9-1-19; Ord. No. 20230831-142, Pt. 15, 9-1-23.\n\n(A)\n\nThe director shall determine whether board or commission review of a request associated\nwith an application for preliminary plan or plat approval is required under this section.\nThe director shall schedule an associated request for board or commission review on\nthe earliest available date.\n\n(B)\n\nThe following board or commission must review an associated request before the land\nuse commission may consider the application or the associated request:\n\n(1)\n\nthe urban transportation commission and the environmental commission shall review\na request for an amendment to the transportation plan;\n\n(2)\n\nthe water and wastewater commission and, if requested by the city council, the environmental\ncommission shall review a request for an amendment to the city's water or wastewater\nservice area boundary; and\n\n(3)\n\nthe water and wastewater commission shall review a request for city cost participation\nin construction of water or wastewater facilities.\n\nSource: City Code Section 25-4-34; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 48, 9-1-19; Ord. No. 20230831-142, Pt. 16, 9-1-23.\n\nIf an application for a preliminary plan or plat requires a variance to comply with\nthe provisions of this title, an applicant is required to obtain approval of the variance\nbefore the associated application for a preliminary plan, plat, or subdivision construction\nplan can be approved by the single office.\n\nSource: City Code Section 25-4-35; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 49, 9-1-19; Ord. No. 20230831-142, Pt. 17, 9-1-23.\n\n(A)\n\nThe platting board shall grant a variance from a requirement of Article 3 (Platting Requirements) if the platting board determines that enforcement of the requirement will make subdivision\nof a tract of land impractical and deny the owner all reasonable use of the land.\n\n(B)\n\nFor a mass housing project, a planned unit development, or similar neighborhood unit,\nthe platting board may grant a variance from a requirement of Article 3 (Platting Requirements) if the platting board determines that planned development will provide light and\nair, vehicular and pedestrian circulation, and recreational facilities that are at\nleast equal to the requirements of this title. An applicant must provide the platting\nboard with a written report documenting compliance with this subsection.\n\n(C)\n\nThe platting board may grant a variance from a requirement of Article 3 (Platting Requirements) if the platting board determines that the variance protects the public interest\nand complies with sound engineering principles and practices.\n\nSource: City Code Section 25-4-36; County Code Section 82.201(f); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nBefore the single office may approve a plat, the subdivider shall:\n\n(1)\n\nobtain final approval of subdivision construction plans; post fiscal security as required\nby the county executive for restoration of disturbed areas, boundary streets, and\nsidewalks; and construct the streets, utilities, and drainage facilities in compliance\nwith the requirements of this title; or\n\n(2)\n\nfile an application for approval of subdivision construction plans and provide fiscal\nsecurity under Section 30-1-132 (Fiscal Security) for subdivision improvements.\n\n(B)\n\nFiscal security provided under this section may be used by the city or county, as\nappropriate, to construct the subdivision improvements.\n\nSource: City Code Section 25-4-37; County Code Section 82.401; Ord. 031211-11; Ord.\n031211-42; Ord. No. 20230831-142, Pt. 18, 9-1-23; Ord. No. 20240718-103, Pt. 4, 7-29-24.\n\n(A)\n\nApproval of a plat is not an acceptance by the city or county of an offered dedication.\nDisapproval or denial of a plat is a refusal by the city or county to accept an offered\ndedication shown on a plat.\n\n(B)\n\nThe city or county may accept an offered dedication only by the action of an authorized\nofficial.\n\n(C)\n\nThe commissioners court may accept an offered dedication of a street by issuing a\ncertificate of acceptance.\n\n(D)\n\nA street may not be accepted unless it is constructed in accordance with the applicable\nrequirements and with the required utilities and drainage facilities installed. Entry,\nuse, or improvement by the city or county, as applicable, under a fiscal security\nagreement is not an acceptance of an offered dedication.\n\n(E)\n\nExcept as provided in a fiscal security agreement, an officer or employee of the city\nor county may not enter, use, or improve a street unless the street has been accepted\nby the city or county, as applicable.\n\nSource: City Code Section 25-4-38; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe city and the county shall review and approve, disapprove, or deny a plat vacation,\nreplat, or amending plat in accordance with the standards and procedures in Local\nGovernment Code Section 212.013 (Vacating Plat), Section 212.014 (Replatting Without Vacating Plat), Section 212.015 (Additional Requirements for Certain Replats), and Section 212.016 (Amending Plat).\n\n(B)\n\nThe single office shall provide a single joint notice stating the dates of the city\nand county hearings for a notice required by Local Government Code Section 212.015\n(Additional Requirements for Certain Replats) or Section 212.016 (Amending Plat).\n\n(C)\n\nAn application to vacate a plat expires after one year.\n\nSource: Ord. 20050929-079; Ord. No. 20160421-039, Pt. 18, 4-21-16.\n\n(A)\n\nThe requirements of this section are mandated by state law and supersede any contrary\nprovisions of the City Code.\n\n(B)\n\nIn this section, applicant response means the information provided by the applicant\nto the single office to address the conditions of approval or reasons for disapproval\nof an application for preliminary plan, plat, or subdivision construction plan.\n\n(C)\n\nAn applicant response:\n\n(1)\n\nmust adequately address each condition of approval or reason for the disapproval;\n\n(2)\n\nmust include only changes only as necessary to address the condition of approval or\nreason for disapproval; and\n\n(3)\n\nmay not include substantial changes unrelated to the condition of approval or reason\nfor disapproval.\n\n(D)\n\nUpon receipt of an applicant response to a preliminary plan, plat, or replat the single\noffice shall:\n\n(1)\n\ndetermine if the applicant response meets the requirements in Subsection (C), and\n\n(2)\n\napprove, approve with conditions, or disapprove with reasons, the preliminary, plat,\nor replat not later than 15 days after the applicant response was submitted.\n\n(E)\n\nIf the applicant response as submitted complies with the provisions of Subsection\n(C), and the single office fails to comply with the time limits for action in this\nsection, the application for preliminary plan or plat is approved by operation of\nlaw.\n\nSource: Ord. No. 20190822-117, § 50, 9-1-19; Ord. No. 20230831-142, Pt. 19, 9-1-23.\n\n(A)\n\nA preliminary plan must be approved before a plat may be approved, except as provided\nin Subsection (B).\n\n(B)\n\nA plat may be approved without a preliminary plan if each lot abuts an existing dedicated\npublic street and the single office determines that:\n\n(1)\n\na new street or an extension of a street is not necessary to provide adequate traffic\ncirculation;\n\n(2)\n\nthe applicant has dedicated additional right of way necessary to provide adequate\nstreet width for an existing street abutting a lot; and\n\n(3)\n\ndrainage facilities are not necessary to prevent flooding, or if necessary, the applicant\nhas arranged for the construction of drainage facilities.\n\nSource: City Code Section 25-4-51; County Code Sections 82.201(b)(2)—(8) and 82.203(a);\nOrd. 031211-11; Ord. 031211-42.\n\n(A)\n\nIf a preliminary plan is part of an applicant's plan for a larger development, the\napplicant shall file a master development plan with the single office when the first\napplication for preliminary plan approval is filed.\n\n(B)\n\nA master development plan may be in schematic form, must include the applicant's entire\ndevelopment, and must provide for the safe, healthful, and orderly extension of roads,\nutilities, drainage, and other public facilities.\n\nSource: City Code Section 25-4-52; County Code Section 82.201(b)(9); Ord. 031211-11;\nOrd. 031211-42.\n\n**Editor's note—**\nOrd. No. 20190822-117, § 51, effective September 1, 2019, repealed § 30-2-53, which pertained to concurrent\ncity applications and derived from City Code Section 25-4-53; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nApproval of a preliminary plan supersedes a previously approved preliminary plan for\nthe same land.\n\n(B)\n\nAn applicant may not include land from a previously approved preliminary plan in a\nsubsequent application for approval of a preliminary plan unless all the land, except\nland contained in an approved plat, is included in the application.\n\n(C)\n\nThe single office may waive the requirement of Subsection (B) if the single office\ndetermines that including only a portion of the previously approved preliminary plan\ndoes not substantially impair the orderly planning of roads, utilities, drainage,\nor other public facilities.\n\n(D)\n\nAn interested party may appeal the single office decision under Subsection (C) to\nthe land use commission.\n\nSource: City Code Section 25-4-54; Ord. 031211-11; Ord. 031211-42.\n\n**Editor's note—**\nOrd. No. 20190822-117, § 52, effective September 1, 2019, repealed § 30-2-55, which pertained to notice\nand derived from City Code Section 25-4-55; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office shall promptly deliver a copy of an application for preliminary\nplan approval to each reviewing department or agency after the application is filed.\n\n(B)\n\nA reviewing department or agency shall prepare and deliver to the single office a\nwritten report of comments and recommendations regarding an application for preliminary\nplan approval before the expiration of the staff review period described in this section.\n\n(C)\n\nStaff review period for an application for preliminary plan approval is established\nby the director by administrative rule.\n\n(D)\n\nAn applicant may file with the single office an update to an application for preliminary\nplan approval before expiration of the application.\n\n(E)\n\nThe staff review period of an update to an application for preliminary plan approval\nis established by the director by administrative rule.\n\nSource: City Code Section 25-4-56; Ord. 031211-11; Ord. 031211-42; Ord. 20050929-079;\nOrd. No. 20160421-039, Pt. 19, 4-21-16; Ord. No. 20190822-117, § 53, 9-1-19; Ord. No. 20230831-142, Pt. 20, 9-1-23.\n\nThe single office shall approve an application for preliminary plan approval that\ncomplies with the requirements of this title.\n\nSource: City Code Section 25-4-57; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 54, 9-1-19; Ord. No. 20230831-142, Pt. 21, 9-1-23.\n\n**Editor's note—**\nOrd. No. 20190822-117, § 55, effective September 1, 2019, repealed § 30-2-58, which pertained to council\naction on preliminary plan and derived from City Code Section 25-4-58; Ord. 031211-11;\nOrd. 031211-42.\n\nApproval of a preliminary plan establishes a mutual commitment on behalf of the city\nor county and the applicant to:\n\n(1)\n\nthe subdivision layout for plat approval, including the location and width of proposed\nstreets, lots, blocks, and easements shown on the preliminary plan; and\n\n(2)\n\nthe availability of utilities to serve the subdivided land to the extent shown on\nthe preliminary plan.\n\nSource: City Code Section 25-4-59; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as provided in Subsection (B), an approved preliminary plan expires:\n\n(1)\n\nin the drinking water protection zone, four years after the date of its approval;\nor\n\n(2)\n\nin the desired development zone, ten years after the date of its approval.\n\n(B)\n\nThe appropriate official may extend the expiration date of an approved preliminary\nplan:\n\n(1)\n\ntwice for periods of not more than two years each, if the appropriate official determines\nthat, since the date of the plan's approval, the plan has not significantly changed,\nand the applicable regulations have not significantly changed; or\n\n(2)\n\nfor a period determined by the appropriate official if the applicant agrees with the\nappropriate official to complete the subdivision infrastructure in increments or phases\nthat correspond to the increments or phases of the development.\n\n(Ord. No. 20240718-103, Pt. 6, 7-29-24)\n\n(A)\n\nAn applicant can request a change to an approved preliminary plan, on a form provided\nby the single office, if:\n\n(1)\n\nthe land affected by the change has not received final plat; and\n\n(2)\n\nall the owners of the land affected by the change support the request.\n\n(B)\n\nThe single office may approve a minor deviation from an approved preliminary plan\nif the single office determines that the minor deviation complies with the requirements\nof this subsection. An applicant shall identify the proposed minor deviation on a\ncopy of the preliminary plan submitted to the single office. A formal application\nis not required.\n\n(1)\n\nA minor deviation may not:\n\n(a)\n\nremove a property restriction or subdivision note;\n\n(b)\n\nmodify a waiver or variance;\n\n(c)\n\nchange an easement, except with the director's approval;\n\n(d)\n\nincrease impervious cover;\n\n(e)\n\nmodify a conservation easement, common area, green space, or other open space shown\non the preliminary plan;\n\n(f)\n\naffect property outside the proposed plat;\n\n(g)\n\nincrease the number of lots;\n\n(h)\n\nchange the use of a lot; or\n\n(i)\n\nchange the basic street layout.\n\n(2)\n\nA minor deviation may:\n\n(a)\n\nchange lot size or configuration;\n\n(b)\n\nchange street width or alignment; or\n\n(c)\n\nchange a utility or access easement.\n\n(C)\n\nIf the requested change does not qualify as a minor deviation, the applicant may submit\na separate application to the single office requesting the change. The single office\nmay approve the change if the single office determines that the requested change complies\nwith the requirements of this title.\n\nSource: City Code Section 25-4-61; Ord. 031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 22, 9-1-23; Ord. No. 20240718-103, Pt. 5, 7-29-24.\n\n(A)\n\nAn applicant may appeal the director's disapproval of a preliminary plan application\nto the land use commission or council.\n\n(B)\n\nAn applicant may appeal the county executive's disapproval of a plat application to\nthe commissioners court.\n\n(C)\n\nThe single office shall give notice under Section 30-1-153(A) (Notice of Public Hearing) of the land use commission's, council's, or commissioners court's consideration\nof an appeal.\n\n(D)\n\nAn applicant must receive approval from both the city and county in accordance with\nSection 30-1-91(A) (Final Approval).\n\nSource: Ord. No. 20230831-142, Pt. 23, 9-1-23; Ord. No. 20240718-103, Pt. 7, 7-29-24.\n\n**Editor's note—**\nOrd. No. 20230831-142, Pt. 23, effective September 1, 2023, repealed the former § 30-2-62, and enacted\na new § 30-2-62 as set out herein. The former § 30-2-62 pertained to expiration of\napproved preliminary plan and derived from City Code Section 25-4-62 and City/County\nsubdivision agreement; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130.\n\nAn application for approval of a plat may include all or a portion of the land included\nin an approved preliminary plan.\n\nSource: City Code Section 25-4-81; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office shall promptly deliver a copy of an application for plat approval\nto each reviewing department or agency after the application has been filed.\n\n(B)\n\nAfter the application is filed, a reviewing department or agency shall prepare and\ndeliver to the single office a written report of comments and recommendations regarding\nan application for plat approval not later than the deadline established by the single\noffice by administrative rule.\n\n(C)\n\nAfter the application is filed, the single office shall determine whether an application\nfor plat approval complies with the criteria for approval and give notice under Section 30-1-154(B) (Notice of Applications and Administrative Decisions) of the determination not later than the deadline established by the single office\nby administrative rule.\n\n(D)\n\nAn applicant may file with the single office an update to an application for plat\napproval before the application expires under the expiration period established under\nSubsection (F).\n\n(E)\n\nAfter an update is filed, the single office shall determine whether an update to an\napplication for plat approval complies with the criteria for approval.\n\n(F)\n\nAn application:\n\n(1)\n\nExpires 180 days after the application is filed unless the application has been approved.\n\n(2)\n\nThat has been disapproved with stated reasons may be updated to address those reasons\nuntil the application expires.\n\nSource: City Code Section 25-4-82; Ord. 031211-11; Ord. 031211-42; Ord. No. 20160421-039, Pt. 21, 4-21-16; Ord. No. 20190822-117, § 57, 9-1-19; Ord. No. 20230831-142, Pt. 24, 9-1-23; Ord. No. 20240718-103, Pt. 8, 7-29-24.\n\nThe applicant must include the following note on the proposed plat: The owner of this\nsubdivision and the owner's successors and assigns are responsible for construction\nof subdivision improvements that comply with City of Austin and Travis County regulations.\nThe owner understands that plat vacation or replatting may be required, at the owner's\nexpense, if plans to construct this subdivision do not comply with the regulations.\nApproval of this subdivision does not guarantee future approval of variances to the\nCity of Austin and Travis County regulations that may be required at later stages\nof development.\n\nSource: City Code Section 25-4-83; Ord. 031211-11; Ord. 031211-42; Ord. No. 20190822-117, § 58, 9-1-19; Ord. No. 20230831-142, Pt. 25, 9-1-23; Ord. No. 20240718-103, Pt. 9, 7-29-24.\n\n(A)\n\nThe director has approval authority for the City. The director shall approve a plat\nthat complies with the comprehensive plan and requirements of this title.\n\n(B)\n\nThe county executive has approval authority for the county. The county executive shall\napprove a plat that complies with the comprehensive plan and requirements of this\ntitle.\n\n(C)\n\nApproval of a plat is conditioned on the applicant's posting the fiscal security required\nby this title in the amount determined by the single office. After the single office\ncertifies on the plat that the applicant has posted the fiscal security:\n\n(1)\n\nfor a city approval:\n\n(a)\n\nthe presiding officer of the land use commission shall endorse the plat to certify\nthe land use commission's approval;\n\n(b)\n\nthe mayor shall endorse the plat to certify the council's approval; or\n\n(c)\n\nthe director shall endorse the plat to certify the director's approval; and\n\n(2)\n\nfor a county approval:\n\n(a)\n\nthe county executive shall endorse the plat to certify the county executive's approval;\nor\n\n(b)\n\nthe county clerk shall endorse the plat to certify the commissioners court approval.\n\n(D)\n\nApproval of a plat expires on the 90th day after the approval date if the single office\nhas not certified that the applicant has posted fiscal security.\n\nSource: City Code Section 25-4-84; Ord. 031211-11; Ord. 031211-42; Ord. 20120524-130;\nOrd. No. 20190822-117, § 59, 9-1-19; Ord. No. 20230831-142, Pt. 26, 9-1-23.\n\n(A)\n\nThe single office shall record an approved plat in each county where land included\nin the plat is located.\n\n(B)\n\nThe single office may not record a plat unless the city and each county have approved\nthe plat.\n\n(C)\n\nAn applicant must provide all of the items and fees required to record the plat with\nthe county clerk within 80 business days from the date of plat approval.\n\n(D)\n\nAn application for plat approval expires on the 81st business day after such approval\nunless Subsection (C) of this section is satisfied.\n\nSource: City Code Section 25-4-85; Ord. 031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 27, 9-1-23.\n\n(A)\n\nAn applicant can appeal the director's disapproval of a plat application to the land\nuse commission or council.\n\n(B)\n\nAn applicant can appeal the county executive's disapproval of a plat application to\ncommissioners court.\n\n(C)\n\nThe single office shall give notice under Section 30-1-153(A) (Notice of Public Hearing) of the land use commission's, council's, or commissioners court's consideration\nof an appeal.\n\n(D)\n\nAn applicant must receive approval from both the city and county in accordance with\nSection 30-1-91(A) (Final Approval).\n\nSource: Ord. No. 20230831-142, Pt. 28, 9-1-23; Ord. No. 20240718-103, Pt. 10, 7-29-24.\n\n**Editor's note—**\nOrd. No. 20230831-142, Pt. 28, effective September 1, 2023, repealed the former § 30-2-86, and enacted\na new § 30-2-86 as set out herein. The former § 30-2-86 pertained to effect of preliminary\nplan expiration and derived from City Code Section 25-4-86; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA subdivision within the extraterritorial jurisdiction containing lots intended for\nresidential use must include a cover page containing:\n\n(1)\n\na location map for the subdivision;\n\n(2)\n\nthe name of the subdivision; and\n\n(3)\n\nthe following notice:\n\nCONSUMER PROTECTION NOTICE FOR HOMEBUYERS\n\nIF YOU ARE BUYING A LOT IN THIS SUBDIVISION, YOU SHOULD DETERMINE WHETHER THE SUBDIVISION\nAND THE LAND AROUND IT ARE INSIDE OR OUTSIDE THE CITY LIMITS.\n\nTHIS CAN AFFECT THE ENJOYMENT AND VALUE OF YOUR HOME. DEPENDING ON STATE LAW AND OTHER\nFACTORS, LAND OUTSIDE THE CITY LIMITS MAY BE SUBJECT TO FEWER LOCAL GOVERNMENT CONTROLS\nOVER THE DEVELOPMENT AND USE OF LAND THAN INSIDE THE CITY LIMITS.\n\nTHE SUBDIVISION'S RESTRICTIVE COVENANTS MAY CREATE PRIVATELY ENFORCEABLE RESTRICTIONS\nAGAINST INCOMPATIBLE LAND USES WITHIN THE SUBDIVISION, WHETHER IT IS INSIDE OR OUTSIDE\nTHE CITY LIMITS.\n\nDEPENDING ON STATE LAW AND OTHER FACTORS, HOWEVER, OUTSIDE THE CITY LIMITS NEITHER\nPRIVATE NOR GOVERNMENTAL RESTRICTIONS MAY BE AVAILABLE TO (1) RESTRICT EITHER THE\nNATURE OR EXTENT OF DEVELOPMENT NEAR THE SUBDIVISION, OR (2) PROHIBIT LAND USES NEAR\nTHE SUBDIVISION THAT ARE INCOMPATIBLE WITH A RESIDENTIAL NEIGHBORHOOD.\n\n(B)\n\nThe subdivision name and the consumer protection notice required by Subsection (A)\nof this section must be printed in bolded capital letters one-half inch high.\n\nSource: 20110623-132.\n\nThe single office shall approve a subdivision construction plan that complies with\nthe Comprehensive Plan and the requirements of this title.\n\nSource: Ord. No. 20230831-142, Pt. 29, 9-1-23.\n\n(A)\n\nThe single office shall grant or deny an application for a permit or approval required\nby this title within the timeframe established by state law.\n\n(B)\n\nNothing in this section limits any exceptions to the deadlines provided for in state\nlaw.\n\nSource: Ord. No. 20230831-142, Pt. 30, 9-1-23.\n\n**Editor's note—**\nOrd. No. 20230831-142, Pt. 30, effective September 1, 2023, repealed the former § 30-2-101, and enacted\na new § 30-2-101 as set out herein. The former § 30-2-101 pertained to subdivision\nconstruction plan and derived from City Code Section 25-4-101; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nA subdivision construction plan application that is denied under Section 30-2-101 (Action on a Subdivision Construction Plan; Deadline) may be updated and resubmitted for review before the application expires. An applicant\nmay update the application in accordance with the timelines adopted under Section 30-1-116 (Subdivision Construction Plan Application Requirements and Expiration).\n\n(B)\n\nIf the single office cannot approve an updated application because the updated application\nfails to comply with the requirements of this title, the single office may provide\na report to the applicant that specifies the reasons why the updated application does\nnot meet the requirements. A comment included in this report is not a final decision\non the updated application.\n\nSource: Ord. No. 20230831-142, Pt. 31, 9-1-23.\n\n**Editor's note—**\nOrd. No. 20230831-142, Pt. 31, effective September 1, 2023, repealed the former § 30-2-102, and enacted\na new § 30-2-102 as set out herein. The former § 30-2-102 pertained to expiration\nof subdivision construction and derived from City Code Section 25-4-102; Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nConstruction management for a subdivision is governed by Chapter 30-1, Article 10 (Subdivision Construction).\n\n(B)\n\nIssuance of a certificate of compliance for a subdivision is governed by Chapter 30-1, Article 11 (Certificates Of Compliance).\n\nSource: City Code Section 25-4-103; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe single office may release a subdivision construction plan if:\n\n(1)\n\nthe single office approves the subdivision construction plan; and\n\n(2)\n\nthe applicant posts the required fiscal security with the single office.\n\n(B)\n\nThe single office's release of a subdivision construction plan authorizes the applicant\nto begin development in accordance with the plan.\n\nSource: Ord. No. 20230831-142, Pt. 32, 9-1-23.\n\n(A)\n\nA subdivision construction plan expires three years after the date of its approval\nunless:\n\n(1)\n\nthe land use commission and the commissioners court both approve a later expiration\ndate when they approve the plat;\n\n(2)\n\nbefore the plan expires, site work is commenced and diligently pursued to completion;\nor\n\n(3)\n\nthe single office extends the expiration date under Subsection (B).\n\n(B)\n\nAn applicant may request that the single office extend the expiration date of a subdivision\nconstruction plan by filing a written request and justification with the single office\nbefore the expiration date.\n\n(1)\n\nThe single office may extend the expiration date of the plan once for a period of\none year if the single office determines:\n\n(a)\n\nthere is good cause for the extension;\n\n(b)\n\nthere has not been a significant change in development conditions affecting the plan;\nand\n\n(c)\n\nthe plan continues to comply with the criteria for its approval and release.\n\n(2)\n\nAn applicant may appeal the single office's decision under this subsection to the\nland use commission and the commissioners court.\n\n(3)\n\nThe single office shall give notice under Section 30-1-153(A) (Notice of Public Hearing) of the land use commission's consideration of an appeal.\n\n(4)\n\nThe land use commission and the commissioners court shall each conduct a public hearing\non an appeal before taking action.\n\n(5)\n\nAn appeal may be granted only by joint action of the land use commission and the commissioners\ncourt.\n\n(C)\n\nIf the land use commission and the commissioners court approve different expiration\ndates, the earlier date controls.\n\nSource: Ord. No. 20230831-142, Pt. 33, 9-1-23.\n\n(A)\n\nA surveyor shall mark each boundary corner, intermediate property corner, curve point,\nand angle point of a subdivision with a permanent marker identified in the most recent\nedition of the Manual of Practice for Land Surveying in Texas, published by the Texas\nSociety of Professional Surveyors.\n\n(B)\n\nOne boundary corner shall be marked with a concrete monument, unless a concrete monument\nexists on an adjacent platted subdivision within 1,300 feet of the proposed plat.\n\n(C)\n\nPermanent markers along boundary lines may be spaced not more than 1,300 feet apart.\n\n(D)\n\nIf a subdivision includes or is bounded by a 100-year floodplain or newly dedicated\nstreet, a permanent benchmark is required.\n\nSource: City Code Section 25-4-131; County Code Section 82.204(c)(16) and (17); Ord.\n031211-11; Ord. 031211-42.\n\n(A)\n\nEasements for public utilities and drainage ways shall be retained in all subdivisions\nin the widths and locations determined necessary by the single office. All easements\nshall be dedicated to public use for the named purpose and shall be aligned to minimize\nconstruction and future maintenance costs.\n\n(B)\n\nOff-street loading and unloading facilities shall be provided on all commercial and\nindustrial lots. The subdivider shall note this requirement on a preliminary plan\nand a plat.\n\n(C)\n\nA private alley is permitted if a plat note provides for alley maintenance by the\nadjoining property owners or a property owners association.\n\n(1)\n\nExcept as provided in Paragraph (2), the minimum alley width is 30 feet, and the minimum\npavement width is 20 feet.\n\n(2)\n\nFor a residential alley, the minimum alley width is 20 feet, and the minimum pavement\nwidth is 15 feet.\n\nSource: City Code Section 25-4-132; County Code Section 82.202(p); Ord. 031211-11;\nOrd. 031211-42; Ord. 20131017-046.\n\nIf the single office determines that easements in areas adjoining a proposed subdivision\nare necessary to provide adequate drainage or utility service, the subdivider shall\nobtain the easements or make arrangements with the city or county, as appropriate,\nto obtain them.\n\nSource: City Code Section 25-4-133; County Code Section 82.202(i); Ord. 031211-11;\nOrd. 031211-42.\n\nStreets of a new subdivision shall be aligned with existing streets on adjoining property\nunless the platting board determines that topography, requirements of traffic circulation,\nthe comprehensive plan in a near-term annexation area, or other considerations make\nit desirable to vary the alignment.\n\nSource: City Code Section 25-4-151; County Code Section 82.202(b); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nA street may terminate in a cul-de-sac if the single office determines that the most\ndesirable plan requires laying out a dead-end street.\n\n(B)\n\nA platting board variance is required for a dead-end street more than 2,000 feet long.\n\n(C)\n\nThe platting official may approve a deviation from the cul-de-sac design described\nin the Transportation Criteria Manual if the platting official determines that topography,\ndensity, adequate traffic circulation, or unusual conditions necessitate a different\ndesign.\n\n(D)\n\nThis subsection applies to a dead-end street that terminates at the boundary of an\nundeveloped property with an established right of access across the property being\nsubdivided. The boundary line must form a chord in the cul-de-sac that is equal in\nlength to the right of way width.\n\nSource: City Code Section 25-4-152; County Code Section 82.202(j); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nA block may not exceed 1,200 feet in length, except as provided in this section.\n\n(B)\n\nA residential block that is parallel and adjacent to an arterial street may be up\nto 1,500 feet in length.\n\n(C)\n\nA commercial or industrial block may be up to 2,000 feet in length if the single office\ndetermines that there is adequate traffic circulation and utility service.\n\n(D)\n\nThe single office may approve a longer block length if the single office determines\nthat the proposed block length adequately meets the requirements of traffic circulation,\nutility service, topography, and the comprehensive plan in a near-term annexation\narea.\n\n(E)\n\nAn applicant may appeal a single office determination under Subsection (C) or (D)\nto the platting board.\n\nSource: City Code Section 25-4-153; County Code Section 82.202(l); Ord. 031211-11;\nOrd. 031211-42.\n\nA street or street intersection, whether public or private, shall be designed and\nconstructed in accordance with the Transportation Criteria Manual.\n\nSource: City Code Section 25-4-154; County Code Section 82.302(a); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nNew streets in subdivisions shall be named to provide continuity of name with existing\nstreets and to prevent conflict with identical or similarly spelled or pronounced\nnames in other parts of the planning jurisdiction.\n\n(B)\n\nAn applicant may suggest a street name. Approval of a street name by the city's 911\ncomputer mapping division is required before a final plat may be approved.\n\nSource: City Code Section 25-4-155; County Code Section 82.303(a); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nThe location of a street sign is determined by the most recent version of the Texas\nManual On Uniform Control Devices.\n\n(B)\n\nThe subdivider shall provide street name signs for street intersections with traffic\nsignals.\n\n(C)\n\nThe subdivider shall provide and install pole mounted street name signs at street\nintersections without traffic signals.\n\nSource: City Code Section 25-4-156; County Code Section 82.303; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nBefore a plat may be approved, a subdivider shall submit to the single office a traffic\ncontrol plan for the installation of traffic control signs and devices, pavement striping,\nand pavement markers. Approval of the traffic control plan by the single office is\nrequired.\n\n(B)\n\nA subdivider is responsible for installing a traffic control feature described in\nthe traffic control plan. The fabrication and installation of a traffic control feature\nmust be in accordance with the Texas Manual of Uniform Traffic Control Devices.\n\nSource: County Code Section 82.303; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nIn this section:\n\n(1)\n\nACCESS STREET means a street that provides access to a subdivision by connecting to\nan external street.\n\n(2)\n\nEXTERNAL STREET means a street that is outside the boundaries of a subdivision, and\nthat is:\n\n(a)\n\na publicly maintained street;\n\n(b)\n\na street that is offered for dedication and for which a construction performance bond\nis posted pending acceptance of the dedication; or\n\n(c)\n\na private street that complies with the requirements of this title and each applicable\ncriteria manual.\n\n(B)\n\nExcept as otherwise provided in this section:\n\n(1)\n\na new subdivision must have at least two access streets; and\n\n(2)\n\neach of the two access streets must connect to a different external street.\n\n(C)\n\nA new subdivision may have one access street if the single office determines that:\n\n(1)\n\nthe access street:\n\n(a)\n\ndoes not cross an area with a high wildland fire protection rating, as determined\nin accordance with the National Fire Protection Association Bulletin 299, \"Protection\nof Life and Property from Wildfire\", published in 1992;\n\n(b)\n\nis not inundated by more than nine inches of water by a 100-year flood, as determined\nin accordance with the Drainage Criteria Manual; and\n\n(c)\n\nhas a paved width of at least 36 feet from the intersection of the access street with\nthe external street for a distance of:\n\n(i)\n\n100 feet; or\n\n(ii)\n\n50 feet if the access street has curb and gutter; and\n\n(2)\n\nthe access street:\n\n(a)\n\nis not more than 2,000 feet in length, and provides access to not more than 30 single-family\nresidential dwellings; or\n\n(b)\n\nis an arterial or collector street, and its intersection with the external street\nwill function at a level of service of \"C\" or better during construction and after\nbuild-out of the subdivision, as determined by an intersection analysis that is:\n\n(i)\n\napproved by the platting official; and\n\n(ii)\n\nif the subdivision generates more than 1,000 vehicle trips a day, prepared by a registered\nprofessional engineer in accordance with the Transportation Criteria Manual or Transportation\nResearch Board Special Report 209, \"Highway Capacity Manual\", published in 1994.\n\n(D)\n\nA new subdivision may have one access street if the single office determines that\nproviding more than one access street is undesirable, unnecessary, or impractical\nafter considering:\n\n(1)\n\ntraffic circulation;\n\n(2)\n\ntraffic safety;\n\n(3)\n\nflood and fire safety;\n\n(4)\n\ntopography;\n\n(5)\n\nthe density of the subdivision and surrounding developed property;\n\n(6)\n\nwhether later development of adjacent property is anticipated to provide additional\naccess;\n\n(7)\n\nwhether traffic through the subdivision should be limited;\n\n(8)\n\nthe environmental effect of a cut or fill, waterway crossing, or other surface disturbance\nnecessary to provide more than one access street;\n\n(9)\n\nwhether the access street is a divided street;\n\n(10)\n\nwhether adverse effects, if any, from permitting one access street are mitigated,\nincluding whether secondary pedestrian access is provided; and\n\n(11)\n\nwhether the subdivider:\n\n(a)\n\nowns adjacent property through which access can be provided;\n\n(b)\n\nhas the right to provide a second access street across another person's property;\nor\n\n(c)\n\nis able to develop the subdivision if more than one access street is required.\n\nSource: City Code Section 25-4-157; County Code Section 82.202(c); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nThe platting board may approve a variance allowing a private street in a subdivision\nif the requirements of this section are met.\n\n(B)\n\nIn this section, the meaning of \"adjacent property\" is limited to a property that\nis adjacent to the proposed subdivision and that has an established right of access\nthrough a proposed private street.\n\n(C)\n\nWritten approval of the owner of adjacent property is required to establish a private\nstreet.\n\n(D)\n\nIf the only access to adjacent property is through a proposed private street:\n\n(1)\n\nthe owner of the proposed subdivision must prepare and file in the county's official\npublic records a joint access agreement that allows unrestricted access through the\nprivate street to the adjacent property; and\n\n(2)\n\nthe owner of the adjacent property must prepare and file in the county's official\npublic records a joint access agreement that requires private streets and street maintenance\nwhen the adjacent property is developed.\n\n(E)\n\nA property owners association must be responsible for maintenance of the private street.\n\n(F)\n\nThe subdivider must obtain the approval of the single office of the following documents\nrelating to the property owners association:\n\n(1)\n\ncovenants, conditions, and restrictions that provide for ownership, maintenance, fee\nassessment, and association dues; and\n\n(2)\n\nbylaws that provide for membership and voting rights.\n\n(G)\n\nA private street must have a direct connection to a dedicated public street or another\napproved private street.\n\n(H)\n\nA private street may not be the only connection between two public streets.\n\n(I)\n\nThe subdivider must identify a private street on the plat as a separate access, drainage,\nand public utility easement and as a separate lot.\n\n(J)\n\nThe subdivider must install standard street names at each intersection.\n\n(K)\n\nThe subdivider must post a sign indicating \"private street\" at each intersection of\na private street with a public street.\n\n(L)\n\nIf the subdivider proposes use of a security gate:\n\n(1)\n\nthe gate must be at least 40 feet from the right-of-way of the nearest intersecting\nstreet; and\n\n(2)\n\nthe subdivider must:\n\n(a)\n\nprovide the single office with plans showing the location of the gate; and\n\n(b)\n\nobtain approval of the gate design from the city, county, emergency service provider,\nand other governmental entity with jurisdiction, if any.\n\n(M)\n\nThe subdivider must place the following notes on the plat:\n\nAll private streets shown on this plat [list street names] and any security gates\nor devices controlling access to the streets will be owned and maintained by the property\nowners association of this subdivision.\n\nThe undersigned owner subdivides [number] acres of land out of the [number] acre tract\nin accordance with this plat, to be known as \"[subdivision name]\" subdivision, subject\nto the covenants and restrictions shown on this plat, and dedicates to the owners\nof the lots in the subdivision, public utilities serving the subdivision, emergency\nservices providers with jurisdiction, and public service agencies, the use of all\nthe private street and other easements shown on this plat, subject to any easements\nor restrictions previously granted and not released. The maintenance of and payment\nof real property taxes on the private streets are the responsibility of the owner\nof the subdivision or property owners association under that certain instrument of\nrecord under Document Number [number], of the Official Public Records of Travis County,\nTexas. An express easement is granted across the private streets and any common areas\nfor the use of all governmental functions, vehicular and nonvehicular, including fire\nand police protection, solid and other waste material pickup, and any other purpose\na governmental entity deems necessary. Owner agrees that all governmental entities\nand their agents and employees are not responsible or liable for any damage occurring\nto the surface of the private street or any common area as a result of use by governmental\nvehicles.\n\nSource: County Code Section 82.206; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nExcept as provided in Section 30-2-159 (Private Streets) and Subsection (B), each lot in a subdivision shall abut a dedicated public street.\n\n(B)\n\nThe platting board may approve a variance to the requirement of Subsection (A), including\napproval of a subdivision with private access easements, if development of the subdivision\nwith the variance places a minimal burden on the existing road infrastructure and\nall other requirements for a variance are met.\n\n(C)\n\nChapter 30-3, Article 3 (Access) governs access to a lot:\n\n(1)\n\non a roadway designated as a major arterial, freeway, parkway, expressway, or toll\nroad in the transportation plan; or\n\n(2)\n\non a hill country roadway.\n\nSource: City Code Section 25-4-171; County Code Section 82.202(d); Ord. 031211-11;\nOrd. 031211-42.\n\nA through lot in a single-family residential subdivision is permitted if access to\none of the abutting streets is prohibited. If one of the streets abutting a through\nlot is an arterial, access to the arterial is prohibited unless the single office\ndetermines that topography or property size justify access to the arterial.\n\nSource: City Code Section 25-4-172; County Code Section 82.202(m); Ord. 031211-11;\nOrd. 031211-42.\n\nThe side lines of lots must be approximately at right angles to straight street lines\nor radial to curved street lines. An arrangement placing adjacent lots at right angles\nto each other may be disallowed by the single office.\n\nSource: City Code Section 25-4-173; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nIn an area annexed by the city for limited purposes, the site development regulations\nfor the zoning district in which a lot is located determine minimum lot area and minimum\nlot width.\n\n(B)\n\nOutside a limited-purpose area, residential lot requirements are as follows:\n\n(1)\n\nminimum lot area is:\n\n(a)\n\nin a subdivision served by a public wastewater system or central wastewater disposal\nunit:\n\n(i)\n\n5,750 square feet; or\n\n(ii)\n\n6,900 square feet for a corner lot; or\n\n(b)\n\nin a subdivision with private on-site sewage facilities, as determined by the authorized\nagent in accordance with Texas Administrative Code Title 30, Chapter 285 (On-Site Sewage Facilities);\n\n(2)\n\nminimum lot width is:\n\n(a)\n\n50 feet for an interior lot;\n\n(b)\n\n60 feet for a corner lot; or\n\n(c)\n\n33 feet for a lot on a cul-de-sac or curved street; and\n\n(3)\n\nminimum lot frontage, including a flag lot, is:\n\n(a)\n\n15 feet; or\n\n(b)\n\nif a culvert is required for a driveway approach, 30 feet.\n\n(C)\n\nThe single office may reduce the minimum lot frontage prescribed by Subsection (B)\nif the single office determines that access to the lot is restricted to a joint use\ndriveway.\n\nSource: City Code Section 25-4-174; County Code Sections 82.202(o) and 82.302(d)(10);\nOrd. 031211-11; Ord. 031211-42.\n\n(A)\n\nA lot in a subdivision designed with streets without curb and gutter must be one-half\nacre or more in size and have 100 feet or more of street frontage.\n\n(B)\n\nLand designated in a preliminary plan as dedicated for open space or public right-of-way\nmay not be used to calculate a lot size for a lot described in Subsection (A).\n\nSource: City Code Section 25-6-204; County Code Section 82.302(d)(10); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nA flag lot may only be approved in accordance with the requirements of this subsection.\n\n(1)\n\nFlag lot designs may be used where no more than two dwelling units utilize a shared\ndriveway.\n\n(2)\n\nFor developments proposing more than two dwelling units, the single office may grant\na waiver to allow flag lots if:\n\n(a)\n\nthe single office finds that the subdivision:\n\n(i)\n\nhas provided accessibility for emergency responders and associated vehicular traffic;\n\n(ii)\n\nhas adequate room for required utilities;\n\n(iii)\n\nenhances environmental protection;\n\n(iv)\n\nis otherwise compatible with the surrounding neighborhood; and\n\n(b)\n\nthe applicant provides a copy of any existing private deed restrictions for informational\npurposes.\n\n(B)\n\nThe minimum width of a flag lot is:\n\n(1)\n\n20 feet; or\n\n(2)\n\n15 feet if:\n\n(a)\n\ntwo or more contiguous lots share a common driveway and sufficient area is available\noutside the drive on each lot for utility installation; or\n\n(b)\n\nthe applicant can demonstrate access through an alternative route.\n\n(C)\n\nFor a subdivision utilizing a flag lot design, any proposed driveways must be designed\nwith adequate space for all required utilities. A proposed driveway must also:\n\n(1)\n\ncomply with the Utilities Criteria Manual, if applicable; and\n\n(2)\n\ncomply with the Plumbing Code.\n\n(D)\n\nAll addresses utilizing a flag lot design must be displayed at their closest point\nof access to a public street for emergency responders.\n\nSource: Ord. No. 20230831-142, Pt. 34, 9-1-23.\n\n(A)\n\nA subdivision within 100 feet of a public water system must be connected to the public\nwater system. The director may waive this requirement.\n\n(B)\n\nIf a subdivision is to be served by a public water system:\n\n(1)\n\napproval of the water system plans by the director of the Water and Wastewater Utility\nis required;\n\n(2)\n\ninstallation of the water system must comply with the requirements of this title and\nthe Utilities Criteria Manual; and\n\n(3)\n\nwater lines to serve each lot must be installed before a lot may be occupied.\n\nSource: City Code Section 25-4-191; County Code Section 82.302(c)(12); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nA subdivision within 100 feet of a public wastewater system must be connected to the\npublic wastewater system. In the extraterritorial jurisdiction, the director may waive\nthis requirement. In the zoning jurisdiction, this requirement may be waived under\nCity Code Section 25-9-4 (Connection To Organized Wastewater System Required).\n\n(B)\n\nIf a subdivision is to be served by a public wastewater system or community disposal\nsystem, wastewater lines to serve each lot must be installed before a lot may be occupied.\n\nSource: City Code Section 25-4-192; County Code Section 82.203(b)(18); Ord. 031211-11;\nOrd. 031211-42.\n\nIf natural gas from a public utility is available within 2,000 feet of a subdivision,\nthe subdivider shall:\n\n(1)\n\nprepare plans for installation of natural gas lines to serve each lot and install\nthe portions of the lines that are under a street or alley; or\n\n(2)\n\nplace a note on the plat stating that natural gas lines have not been installed.\n\nSource: Section 25-4-193; County Code Section 82.204(e)(5); Ord. 031211-11; Ord. 031211-42.\n\nA subdivider shall arrange with the appropriate utility departments and utility companies\nfor the construction of water, wastewater, and gas utility lines unless the city manager\napproves the installation of utility lines by another entity.\n\nSource: City Code Section 25-4-194; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nTo have municipal water or wastewater service extended to land within the extraterritorial\njurisdiction, a landowner shall file with the director of the Water and Wastewater\nUtility a written request for:\n\n(1)\n\nextension of service; and\n\n(2)\n\nif the land is not covered by the utility's certificate of convenience and necessity,\nannexation by the City.\n\n(B)\n\nThe city may record an owner's request in the county deed records.\n\nSource: City Code Section 25-4-195; Ord. 031211-11; Ord. 031211-42; Ord. 20050929-077.\n\n(A)\n\nThis section applies to a subdivision that is to receive water or wastewater service\nfrom an entity other than the City's Water and Wastewater Utility.\n\n(B)\n\nA plat may not be approved unless the subdivider has complied with the requirements\nof this subsection.\n\n(1)\n\nThe subdivider shall provide the director with a copy of a contract between the subdivider\nand the utility service provider that provides for installing utility lines and furnishing\nadequate utility service.\n\n(2)\n\nWater or wastewater system plans must comply with the requirements of this title and\nthe Utilities Criteria Manual.\n\n(3)\n\nApproval of water or wastewater system plans by the director of the Water and Wastewater\nUtility and the Texas Commission on Environmental Quality is required.\n\n(C)\n\nApproval of the construction of water or wastewater facilities by the director of\nthe Water and Wastewater Utility is required. A city inspector may inspect the facilities\nduring construction. The director of the Water and Wastewater Utility may require\nthat the subdivider pay an inspection fee.\n\nSource: City Code Section 25-4-196; County Code Sections 82.203(b)(18) and 82.204(e)(3);\nOrd. 031211-11; Ord. 031211-42.\n\n(A)\n\nFor a subdivision that is not served by a water utility or sanitary sewer facility,\na plat may not be approved unless the subdivider has complied with the requirements\nof this section.\n\n(B)\n\nIf a subdivision is not to be served by a water utility, the subdivider shall provide\nthe platting official with evidence that a sufficient supply of water suitable for\nhuman consumption may be obtained from surface or subsurface sources in accordance\nwith this subsection.\n\n(1)\n\nIf surface water or a private water supply other than groundwater is proposed as a\nsource of water for the subdivision, the evidence must include the results of tests\nand statements from local and state health authorities, water engineers, and other\ncompetent authorities, and be in compliance with Texas Commission on Environmental\nQuality rules for public water supply.\n\n(2)\n\nIf groundwater is proposed as a source of water for the subdivision, the subdivider\nmust provide credible evidence that sufficient groundwater is available and will continue\nto be available to the subdivision, the subdivider must comply with the county's rules\nregarding the use of groundwater, and the evidence is subject to approval by the county's\nplatting official.\n\n(3)\n\nAny required plans and specification shall be prepared by a registered professional\nengineer and are subject to approval by the platting official.\n\n(C)\n\nIf a subdivision is not to be served by a sanitary sewer utility and the use of private\non-site sewage facilities has not been approved by the authorized agent in accordance\nwith Texas Administrative Code Title 30, Chapter 285 (On-Site Sewage Facilities), the subdivider shall construct a community sewage collection and treatment system\nthat serves each lot. The system must be designed and located in accordance with the\nregulations of the Texas Commission on Environmental Quality and the local health\nauthority. Approval by the platting official of the plans for the system is required.\n\nSource: City Code Section 25-4-197; County Code Section 82.204(c)(18) and (19); Ord.\n031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 35, 9-1-23.\n\nA subdivision that is to be served by private on-site sewage facilities must comply\nwith the requirements of the authorized agent adopted in accordance with Texas Administrative\nCode Title 30, Chapter 285 (On-Site Sewage Facilities). The authorized agent shall review a preliminary plan or plat and report its findings\nto the single office.\n\nSource: City Code Section 25-4-198; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nA plat may not be approved unless the subdivider has complied with the requirements\nof this section, if applicable.\n\n(B)\n\nThis section applies to the residential portion of a subdivision in the service area\nof the city's electric utility department if the subdivision is located:\n\n(1)\n\nat least partially inside the city limits; or\n\n(2)\n\noutside the city limits, and the subdivider has requested annexation.\n\n(C)\n\nA subdivider shall pay street lighting charges to the electric utility department.\nThe director may waive this requirement if the director determines that street lighting\nis not necessary, the requirement imposes an unreasonable hardship on the applicant,\nor obtaining payment for street lighting is impractical.\n\n(D)\n\nThe city shall use a payment collected under this section to install street lights\nin the residential areas of the subdivision for which it was collected.\n\n(E)\n\nThe city shall refund a payment collected under this section to the subdivider if\nthe city does not install street lights within two years after the date the subdivider\nmakes the payment.\n\n(F)\n\nThis section does not require the city to install street lights in a subdivision that\nhas not been annexed.\n\nSource: City Code Section 25-4-199; Ord. 031211-11; Ord. 031211-42.\n\nIn this division:\n\n(1)\n\nDIRECTOR, when used without a qualifier, means:\n\n(a)\n\nif the city is the park service provider, the director of the city's Parks and Recreation\nDepartment; or\n\n(b)\n\nif the county is the park service provider, the county executive.\n\n(2)\n\nPARK SERVICE PROVIDER means the city or the county, as determined by Section 30-2-212 (Park Service Provider Determination).\n\nSource: City/County subdivision agreement; County Code Section 82.208; Ord. 031211-11;\nOrd. 031211-42; Ord. 20120524-130.\n\n(A)\n\nA determination of whether the city or the county is the park service provider is\nbased on the earlier of:\n\n(1)\n\nthe date an application for preliminary plan approval is filed; or\n\n(2)\n\nthe date an application for final plat approval is filed.\n\n(B)\n\nThe governmental body that has a park nearest to the proposed subdivision is the park\nservice provider, unless the managing officials agree otherwise.\n\nSource: City/County subdivision agreement; County Code Section 82.208; Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nThe parkland dedication requirements of this division apply to all residential subdivisions,\nexcept as provided in Subsection (B).\n\n(B)\n\nThe following are exempt from the requirements of this part:\n\n(1)\n\na plat with not more than four single-family lots that may be approved without a preliminary\nplan;\n\n(2)\n\na resubdivision of land that does not increase the number of dwelling units;\n\n(3)\n\na subdivision for which a preliminary plan was approved after June 30, 1984 and before\nJuly 8, 1985; and\n\n(4)\n\nif the city is the park service provider, a subdivision of land within a municipal\nutility district that has a consent agreement and land use plan approved by the city\nthat provides for the dedication of parkland or recreational facilities or the payment\nof fees instead of dedication of the parkland or facilities.\n\nSource: City Code Section 25-4-211; County Code Section 82.208; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nA subdivider of a residential subdivision shall provide for the parkland needs of\nthe residents by the dedication of suitable land for park and recreational purposes\nunder this division.\n\n(B)\n\nThe area to be dedicated must be shown on the preliminary plan and the plat and included\nin the dedication statement. The subdivider shall dedicate to the park service provider\nall parkland required by this division when a plat is approved.\n\n(C)\n\nThe amount of parkland required to be dedicated by the subdivider to the park service\nprovider is five acres for every 1,000 residents, as determined by the following formula:\n\n![](https://mcclibrary.blob.core.usgovcloudapi.net/codecontent/15303/477741/30-2-214-C.png)\n\n(D)\n\nIn calculating the amount of parkland to be dedicated under this section, the number\nof residents in each dwelling unit is based on density as follows:\n\n| Dwelling Units Per Acre | Residents In Each Dwelling Unit |\n| --- | --- |\n| Not more than 6 | 2.8 |\n| Dwelling Units Per Acre | Residents In Each Dwelling Unit |\n| More than 6 and not more than 12 | 2.2 |\n| More than 12 | 1.7 |\n\n(E)\n\nIn calculating the amount of parkland to be dedicated under this section, density\nfor a multifamily subdivision is assumed to be the highest permitted in the zoning\ndistrict, or if the property is not zoned, 24 dwelling units per acre. The subdivider\nmay reduce the assumed density by restricting density in a restrictive covenant enforceable\nby the park service provider and approved by the park service provider's attorney.\n\nSource: City Code Section 25-4-212; County Code Section 82.208; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nLand to be dedicated as parkland must comply with the standards in the Administrative\nCriteria Manual and this section, and if the city is the park service provider, the\ncomprehensive plan and the Park And Recreation Action Plan.\n\n(B)\n\nThe director shall determine whether land offered for dedication complies with the\nstandards for dedication.\n\n(C)\n\nFifty percent of acreage in the 100-year floodplain that is dedicated as parkland\nmay be credited toward fulfilling the requirements of this part if the adjoining land\nwithin the 25-year floodplain, if any, is also dedicated as parkland. The land within\nthe 25-year floodplain may not be credited toward fulfilling the requirements of this\npart.\n\n(D)\n\nLand identified on the Critical Areas Map maintained by the Watershed Protection and\nDevelopment Review Department that does not otherwise comply with the standards for\nparkland dedication may be accepted as dedicated parkland if the director determines\nthat the land will provide recreational or educational opportunities for the surrounding\ncommunity. In this event, 50 percent of the acreage may be credited toward fulfilling\nthe requirements of this part.\n\nSource: City Code Section 25-4-213; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe director may allow up to a 50 percent credit toward fulfilling the requirements\nof this part for privately owned and maintained park and recreational facilities that\nare for use by the residents of a subdivision.\n\n(B)\n\nIf the city is the park service provider, the director may allow up to a 100 percent\ncredit toward fulfilling the requirements of this part for private parkland in a subdivision\nlocated outside the city limits, if the subdivider agrees to dedicate the private\nparkland to the city when the city annexes the subdivision for all purposes.\n\n(C)\n\nPrivate parkland excludes yards, setback areas, and open spaces required by this title.\n\nSource: City Code Section 25-4-214; County Code Section 82.208; Ord. 031211-11; Ord.\n031211-42.\n\n(A)\n\nThe director may require a subdivider to deposit with the park service provider a\ncash payment or fiscal security instead of the dedication of parkland if:\n\n(1)\n\nless than six acres is required to be dedicated; or\n\n(2)\n\nthe land available for dedication does not comply with the standards for dedication.\n\n(B)\n\nA deposit is calculated by multiplying the number of acres of parkland required to\nbe dedicated by the average value of an acre of land in the subdivision. The average\nvalue of an acre of land in the subdivision is calculated by dividing the fair market\nvalue of the land in the subdivision by the number of acres in the subdivision. To\nmake this calculation, the subdivider may select one of the following fair market\nvalue determinations:\n\n(1)\n\nthe current fair market value of the land as shown on the records of the tax appraisal\ndistrict;\n\n(2)\n\nthe current fair market value of the land as determined by a qualified real estate\nappraiser at the subdivider's expense, if the director approves the appraiser and\ncertifies that the appraisal fairly reflects the land value; or\n\n(3)\n\nthe current fair market value of the land as determined by a qualified real estate\nappraiser employed by the park service provider.\n\n(C)\n\nA deposit must be placed in the park service provider's park improvement fund. The\ndeposit must be used for the acquisition or improvement of parks that will benefit\nthe residents of the subdivision and that are located in the service area defined\nby the park service provider.\n\n(D)\n\nThe park service provider shall expend a deposit within five years from the date it\nis received. This period is extended by five years if, at the expiration of the initial\nfive year period, less than 50 percent of the residential units in the subdivision\nhave been constructed.\n\n(E)\n\nIf the park service provider does not expend a deposit by the deadline described in\nSubsection (D), and the actual number of residential units constructed is less than\nthe number assumed at the time the deposit was calculated, the owner may request a\nrefund. The request must be in writing and filed with the director not later than\n180 days after the expiration of the time period described in Subsection (D). A refund\nis calculated by multiplying the percentage of the reduction in the number of residential\nunits times the amount of the deposit. A refund may not exceed the unexpended amount\nof a deposit.\n\nSource: City Code Section 25-4-215; County Code Section 82.208; Ord. 031211-11; Ord.\n031211-42.\n\nThe single office may request that the subdivider provide information relating to\nproposed parkland to determine whether the proposed parkland complies with this division.\n\nSource: City Code Section 25-4-216; County Code Section 82.208; Ord. 031211-11; Ord.\n031211-42; Ord. No. 20230831-142, Pt. 36, 9-1-23.\n\n(A)\n\nThis section applies to a subdivision with townhouse lots.\n\n(B)\n\nCommon areas must be identified on the plat. An applicant shall provide for maintenance\nof and payment of taxes on common areas.\n\n(C)\n\nBefore an application proposing townhouse lots can be approved, an applicant shall\nsubmit to the single office a legal opinion that describes the rights and duties of\nthe owners, the legal status of common areas and facilities, and the provisions for\ntaxation and maintenance of the common areas.\n\n(D)\n\nAn applicant shall submit to the single office a site plan showing the locations and\ndimensions of buildings, accessory uses, and other improvements.\n\nSource: City Code Section 25-4-231; Ord. 031211-11; Ord. 031211-42; Ord. No. 20230831-142, Pt. 37, 9-1-23.\n\n(A)\n\nThis section applies to a subdivision with small lots.\n\n(B)\n\nA small lot subdivision may not be approved unless service is available to each lot\nin the subdivision from public water and centralized sewer systems.\n\n(C)\n\nA small lot subdivision must comply with the following requirements:\n\n(1)\n\nMinimum lot area is:\n\n(a)\n\n3,600 square feet, except for a corner lot; and\n\n(b)\n\n4,500 square feet for a corner lot.\n\n(2)\n\nMinimum lot width is:\n\n(a)\n\n40 feet for an interior lot;\n\n(b)\n\n50 feet for a corner lot; and\n\n(c)\n\n40 feet for a lot on a cul-de-sac or curved street, except it may be 33 feet at the\nfront lot line.\n\n(3)\n\nMinimum front yard setback is 20 feet.\n\n(4)\n\nMinimum street side yard setback is ten feet.\n\n(5)\n\nA lot may have one zero lot line.\n\n(6)\n\nThe combined side yard setbacks of a lot may be not less than ten feet.\n\n(7)\n\nExcept for a patio or patio cover, the minimum distance between structures on adjoining\nlots is ten feet. The minimum distance between a patio or patio cover and the roof\nline of a structure on an adjoining lot is six feet.\n\n(8)\n\nThe wall of a structure built adjacent to a zero lot line or within five feet of a\ncommon side lot line must be solid and opaque and may not contain an opening.\n\n(9)\n\nMinimum rear yard setback is five feet, excluding drainage easements.\n\n(10)\n\nMinimum setback is ten feet between a rear access easement and a building or fence.\n\n(11)\n\nMaximum building coverage is 45 percent.\n\n(12)\n\nMaximum impervious cover is 55 percent.\n\n(13)\n\nMaximum building height is 35 feet.\n\n(14)\n\nA lot may have not more than one dwelling unit.\n\n(15)\n\nTwo off-street parking spaces, are required for each dwelling unit.\n\n(16)\n\nA maintenance easement is required in the dominant side yard of a lot.\n\n(17)\n\nA use easement is required in the subordinate side yard of a lot.\n\n(18)\n\nA lot that is less than 50 feet wide and that fronts on a collector street must have\na private access easement along the rear property line.\n\n(19)\n\nMinimum pavement width of a private access easement is 25 feet. In the extraterritorial\njurisdiction, the minimum pavement width is 25 feet or the width required by the county,\nwhichever is greater.\n\n(20)\n\nA lot may not front on an arterial street.\n\n(21)\n\nUnderground utility service to all lots is required.\n\n(22)\n\nMaintenance of a common area or access easement is the responsibility of the adjoining\nproperty owner or the homeowners' association, in accordance with the required declaration\nof covenants, easements, and restrictions.\n\n(D)\n\nThe single office may not record a plat of a small lot subdivision unless a declaration\nof covenants, easements, and restrictions or similar document has been approved by\nthe city attorney, recorded, and referenced on the plat. The document must contain\nthe following:\n\n(1)\n\na statement that the subdivision is developed under this section and incorporating\nthe requirements of this section by reference;\n\n(2)\n\na description of the requirements of Subsections (C)(1) through (14) and an imposition\nof those requirements as a restriction running with the land; and\n\n(3)\n\na restriction of the use of the property to:\n\n(a)\n\none-family dwellings except mobile homes;\n\n(b)\n\naccessory uses permitted in an SF-3 district;\n\n(c)\n\nparks, playgrounds, open space, and common areas providing recreational amenities\nto the subdivision; and\n\n(d)\n\ngrowing agricultural crops;\n\n(4)\n\nprovisions for the maintenance easements and use easements required by this section;\nand\n\n(5)\n\nprovisions obligating the adjoining property owner or the homeowners' association\nto maintain common areas and access easements.\n\nSource: City Code Section 25-4-232; County Code Section 82.202(o); Ord. 031211-11;\nOrd. 031211-42.\n\n(A)\n\nThis section applies to a subdivision with single-family attached residential lots.\n\n(B)\n\nA subdivision with single-family attached residential lots is permitted on:\n\n(1)\n\nunplatted land;\n\n(2)\n\na platted duplex lot that is vacant; or\n\n(3)\n\na platted lot developed with a duplex on or before March 1, 1987, if the duplex complies\nwith current regulations.\n\n(C)\n\nSingle-family attached residential lots may be created only in multiples of two lots\nper site, and each lot must be served by public water and sewage systems.\n\n(D)\n\nA lot may be subject to, or benefited by, private utility easements.\n\n(E)\n\nA lot must comply with the following requirements:\n\n(1)\n\nMinimum site area is 7,000 square feet.\n\n(2)\n\nMinimum lot area is 3,000 square feet.\n\n(3)\n\nMinimum lot width is:\n\n(a)\n\n25 feet, except for a lot on a cul-de-sac or curved street; and\n\n(b)\n\n20 feet on a cul-de-sac or curved street.\n\n(4)\n\nA lot may have not more than one dwelling unit.\n\n(5)\n\nMaximum height is 35 feet.\n\n(6)\n\nMinimum front yard setback is 25 feet.\n\n(7)\n\nMinimum street side yard setback is 15 feet.\n\n(8)\n\nMinimum interior side yard setback is five feet, except between attached units.\n\n(9)\n\nMinimum rear yard setback is 10 feet.\n\n(10)\n\nMaximum building coverage is 40 percent.\n\n(11)\n\nMaximum impervious coverage is 45 percent.\n\n(12)\n\nAt least two off-street parking spaces are required for a dwelling. The driveway may\ncount as one of the spaces.\n\n(F)\n\nA plat of a single family attached subdivision may not be recorded unless a declaration\nof covenants, easements, and restrictions or similar document has been approved by\nthe city attorney, recorded, and referenced on the plat. The document must:\n\n(1)\n\nrequire that development and use of the lots comply with this title;\n\n(2)\n\nrequire that construction of a dwelling unit comply with City Code Chapter 25-12, Article 1 (Uniform Building Code), Article 4 (Electrical Code), Article 5 (Uniform Mechanical Code), Article 6 (Uniform Plumbing Code), and Article 7 (Uniform Fire Code).\n\n(G)\n\nThis subsection applies to the sale of a single-family attached residential lot.\n\n(1)\n\nA seller shall deliver to the purchaser:\n\n(a)\n\na copy of the document described in Subsection (F); and\n\n(b)\n\na notice stating that the property will be conveyed under the terms of the document,\nand that the purchaser is advised to consult an attorney concerning the purchaser's\nrights and obligations under the document.\n\n(2)\n\nA purchaser may terminate the sale contract without penalty:\n\n(a)\n\nwithin five days of the purchaser's receipt of the document and notice under Subsection\n(G)(1); or\n\n(b)\n\nat any time before closing, if the seller does not deliver the document and notice.\n\nSource: City Code Section 25-4-233; Ord. 031211-11; Ord. 031211-42.\n",
  "start_line": 86443,
  "end_line": 89045,
  "subsections": []
}