{
  "id": "chapter-25-4",
  "title": "SUBDIVISION",
  "level": 1,
  "parent_id": null,
  "content": "## CHAPTER 25-4. - SUBDIVISION.\n\n(A)\n\nExcept as provided in Subsection (C), in the zoning jurisdiction, a subdivision must\ncomply with all requirements of this title.\n\n(B)\n\nExcept as provided in Subsection (C), in the extraterritorial jurisdiction, a subdivision\nmust comply with the requirements of:\n\n(1)\n\nChapter 25-1, (General Requirements and Procedures);\n\n(2)\n\nChapter 25-6, Article 2 (Reservation and Dedication of Right-of-Way), Article 4 (Street Design), and Article 5, Division 5 (Sidewalks);\n\n(3)\n\nChapter 25-7 (Drainage);\n\n(4)\n\nChapter 25-8, Subchapter A (Water Quality) and Subchapter B, Article 1 (Tree and Natural Area Protection);\n\n(5)\n\nChapter 25-9, Article 1 (Utility Service); and\n\n(6)\n\nthe portions of the Development Criteria Manuals that relate to the City Code provisions\ndescribed in this subsection.\n\n(C)\n\nIn the portion of the city's extraterritorial jurisdiction that is within Travis County,\na subdivision must comply with Title 30 (Austin/Travis County Subdivision Regulations).\n\nSource: Section 13-2-402; Ord. 990225-70; Ord. 031211-11; Ord. 031211-42.\n\n(A)\n\nThe director may except a parcel of land from the requirement to plat if the director\ndetermines that the parcel existed in its current configuration before becoming subject\nto the City's jurisdiction over subdivision of land.\n\n(B)\n\nThe director may except a parcel of land from the requirement to plat if the director\ndetermines that the parcel:\n\n(1)\n\ncontains a health or safety hazard associated with a private sewage facility or private\nwater well or other conditions that adversely affect public health, safety or welfare;\n\n(2)\n\nexisted in its current configuration on August 8, 1992;\n\n(3)\n\nwas served by a private sewage facility or private water well on August 8, 1992;\n\n(4)\n\nis located on an existing street; and\n\n(5)\n\ncomplies with the requirements of this title for roadway frontage.\n\n(C)\n\nThe director may except a parcel of land from the requirement to plat if the director\ndetermines that the parcel:\n\n(1)\n\nis five acres or less:\n\n(2)\n\nexisted in its current configuration on August 31, 1987;\n\n(3)\n\nwas receiving utility service that was authorized under the rules of the utility provider\non August 31, 1987;\n\n(4)\n\nis located on an existing street; and\n\n(5)\n\ncomplies with the requirements of this title for roadway frontage.\n\n(D)\n\nIn the full-purpose limits of the city, the director may except a parcel of land from\nthe requirement to plat if the director determines that the parcel:\n\n(1)\n\nis five acres or less;\n\n(2)\n\nexisted in its current configuration on January 1, 1995;\n\n(3)\n\nwas receiving utility service that was authorized under the rules of the utility provider\non January 1, 1995;\n\n(4)\n\nis located on an existing street; and\n\n(5)\n\neither complies with the requirements of this title for roadway frontage or was granted\na variance from the minimum lot width requirement of Section 25-2-492 (Site Development Regulations) by the Board of Adjustment.\n\n(E)\n\nAn applicant shall demonstrate to the director that a parcel is excepted under this\nsection from the requirement to plat. An applicant shall provide the director with\nthe current deed to the property, an adequate legal description, and proof of ownership.\n\n(F)\n\nIf the director excepts a parcel from the requirement to plat, the director shall\ncertify the parcel's exception.\n\n(G)\n\nAn approval to extend or change utility service to a parcel is not a certification\nunder this section or an approval of a plat.\n\nSource: Section 13-2-402.1; Ord. 990225-70; Ord. 031120-41; Ord. 031211-11; Ord. No.\n20200903-027, Pt. 1, 9-14-20.\n\n(A)\n\nThe director may temporarily exempt a parcel of land from the requirement to plat\nif the director determines that the sole use of the parcel is as a community garden.\nAn applicant shall provide the director with the information and documentation necessary\nto establish the exemption.\n\n(B)\n\nIf the sole use of an exempted parcel changes from a community garden, an exemption\nunder this section expires.\n\n(C)\n\nA parcel temporarily exempted under this section must be platted before it may be\nused for a purpose other than as a community garden.\n\nSource: Section 13-2-402.2; Ord. 990225-70; Ord. 031211-11; Ord. 20110210-018.\n\nThe municipal authority for review of a preliminary plan, plat, and subdivision construction\nplan is the director.\n\nSource: Ord. No. 20190822-117, Pt. 18, 9-1-19; Ord. No. 20230831-141, Pt. 17, 9-11-23.\n\nThe Planning Commission and the Zoning and Platting Commission may each adopt rules\nof procedure. Adopted rules are effective when filed with the City Clerk.\n\nSource: Section 13-2-403; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe requirements of this section are mandated by state law and supersede any contrary\nprovisions of the City Code.\n\n(B)\n\nThe director shall approve, approve with conditions, or disapprove with reasons an\napplication for preliminary plan or plat not later than the 30th day after the application\nis filed unless the director has approved a written request from the applicant to\nextend the initial review period pursuant to Section 25-1-89 (Extension of Review Period).\n\n(C)\n\nA condition for approval or reason for disapproval must be in writing and may not\nbe arbitrary. The condition or reason must:\n\n(1)\n\nbe directly related to requirements adopted under Texas Local Government Code Chapter\n212 Subchapter A (Regulation of Subdivisions); and\n\n(2)\n\ninclude a citation to the law, including a statute or municipal ordinance, that is\nthe basis for the condition for approval or reason for disapproval.\n\n(D)\n\nIf the director fails to comply with Subsection (B), the application for preliminary\nplan or plat is approved by operation of law, unless the deadline for action has been\nextended pursuant to Section 25-1-89 (Extension of Review Period).\n\nSource: Section 13-1-484(e); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No.\n20190822-117, Pt. 19, 9-1-19; Ord. No. 20230831-141, Pt. 18, 9-11-23.\n\nIf the director disapproves the preliminary plan or plat, the applicant can appeal\nthe director's decision to the Land Use Commission or city council.\n\nSource: Ord. No. 20230831-141, Pt. 19, 9-11-23.\n\n**Editor's note—**\nOrd. No. 20230831-141, Pt. 20, effective September 11, 2024, repealed the former § 25-4-33, and enacted\na new § 25-4-33 as set out herein. The former § 25-4-33 pertained to administrative\napproval of certain subdivision applications and derived from Ord. No. 20190822-117, Pt. 21, 9-1-19.\n\n(A)\n\nAn original tract is a tract that:\n\n(1)\n\nis a legal lot or tract; or\n\n(2)\n\nwas a legal lot or tract before being subdivided in violation of ordinance requirements.\n\n(B)\n\nAn applicant shall include all land in the original tract in an application for preliminary\nplan or plat approval.\n\n(C)\n\nThe director may waive the requirement of Subsection (B) if the director determines\nthat:\n\n(1)\n\nsubdividing only a portion of the original tract will not substantially impair the\norderly planning of roads, utilities, drainage, and other public facilities;\n\n(2)\n\nthe portion of the original tract contiguous to the area to be subdivided has direct\naccess to a public street, or the applicant has provided access to a public street\nby dedicating right-of-way at least 50 feet wide;\n\n(3)\n\na reasonable use of the balance of the original tract is possible; and\n\n(4)\n\nthe applicant has mailed, by certified mail, to all owners of land that is a portion\nof the original tract and contiguous to the land included in the application a request\nthat each owner provide written confirmation to the director that:\n\n(a)\n\nthe owner's land is not a legal lot or tract; and\n\n(b)\n\nthe owner must plat the land before the City may approve a development permit or a\nutility company may provide initial or additional service.\n\n(D)\n\nIn making a determination under Subsection (D)(3) that a reasonable use of the balance\nof the original tract is possible, the director may require that the applicant provide\na schematic land plan of the balance of the original tract. The director may not require\nthat the applicant provide detailed engineering information.\n\n(E)\n\nAn applicant who satisfies the requirement of Subsection (C)(2) by dedicating right-of-way\nto provide access to a public street is not required to construct improvements within\nthe right-of-way.\n\nSource: Sections 13-1-481(c) and 13-1-481.1; Ord. 990225-70; Ord. 000309-39; Ord.\n010607-8; Ord. 031211-11; Ord. No. 20190822-117, Pts. 20, 22, 9-1-19; Ord. No. 20230831-141, Pt. 20, 9-11-23.\n\n(A)\n\nThe director shall determine whether board or commission review of a request associated\nwith an application for preliminary plan or plat approval is required under this section.\nThe director shall schedule an associated request for board or commission review on\nthe earliest available date.\n\n(B)\n\nThe following board or commission must review an associated request before the director\nor Land Use Commission may consider the application or the associated request:\n\n(1)\n\nthe Urban Transportation Commission and the Environmental Commission shall review\na request for an amendment to the Transportation Plan;\n\n(2)\n\nthe Water and Wastewater Commission and, if requested by the city council, the Environmental\nCommission shall review a request for an amendment to the city's water or wastewater\nservice area boundary; and\n\n(3)\n\nthe Water and Wastewater Commission shall review a request for City cost participation\nin construction of water or wastewater facilities.\n\nSource: Section 13-1-484; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No.\n20190822-117, Pts. 20, 23, 9-1-19; Ord. No. 20230831-141, Pt. 21, 9-11-23.\n\n(A)\n\nIf an application for a preliminary plan, plat requires a variance from a subdivision\nrequirement, an applicant is required to obtain approval for the variance before associated\napplication for a preliminary plan, plat or subdivision construction plan can be approved\nby the director.\n\n(B)\n\nThe requirement of Section 25-1-214 (Public Hearing and Notice) that the Land Use Commission hold a public hearing not later than 45 days after\nthe date an application for a variance is filed does not apply to an application for\na variance from a subdivision requirement.\n\nSource: Sections 13-1-481(f) and 13-1-484(c); Ord. 990225-70; Ord. 010607-8; Ord.\n031211-11; Ord. No. 20190822-117, Pts. 20, 24, 9-1-19; Ord. No. 20230831-141, Pt. 22, 9-11-23.\n\n(A)\n\nThe Land Use Commission shall grant a variance from a requirement of Article 3 if\nthe Land Use Commission determines that enforcement of the requirement will make subdivision\nof a tract of land impractical and deny the owner all reasonable use of the land.\n\n(B)\n\nFor a mass housing project, a planned unit development, or similar neighborhood unit,\nthe Land Use Commission may grant a variance from a requirement of Article 3 (Platting Requirements) if the Land Use Commission determines that planned development will provide light\nand air, vehicular and pedestrian circulation, and recreational facilities that are\nat least equal to the requirements of this title. An applicant must provide the Land\nUse Commission with a written report documenting compliance with this subsection.\n\nSource: Section 13-2-407; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No.\n20190822-117, Pt. 20, 9-1-19.\n\n(A)\n\nBefore the director may approve a plat, the subdivider shall:\n\n(1)\n\nconstruct the streets, utilities, and drainage facilities in compliance with the requirements\nof this title; or\n\n(2)\n\nprovide fiscal security under Section 25-1-112 (Fiscal Security) for subdivision improvements that serve the public interest.\n\n(B)\n\nFiscal security provided under this section may be used by the City to construct the\nsubdivision improvements that serve the public interest.\n\nSource: Section 13-2-406; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No.\n20190822-117, Pt. 20, 9-1-19; Ord. No. 20230831-141, Pt. 23, 9-11-23.\n\n(A)\n\nApproval of a plat is not an acceptance by the City of an offered dedication. Disapproval\nor denial of a plat is a refusal by the City to accept an offered dedication shown\non a plat.\n\n(B)\n\nThe City may accept an offered dedication only by the action of an authorized official.\n\n(C)\n\nThe director and the director of the Public Works Department may accept for the City\nan offered dedication of a street by jointly issuing a certificate of acceptance.\n\n(D)\n\nA street may not be accepted unless it is surfaced, curbed, and guttered with the\nrequired utilities and drainage facilities installed. The City's entry, use, or improvement\nunder a fiscal security agreement is not an acceptance of an offered dedication.\n\n(E)\n\nExcept as provided in a fiscal security agreement, an officer or employee of the City\nmay not enter, use, or improve a street unless the street has been accepted by the\nCity.\n\nSource: Section 13-2-404; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. No.\n20190822-117, Pt. 20, 9-1-19.\n\n(A)\n\nThe requirements of this section are mandated by state law and supersede any contrary\nprovisions of the City Code.\n\n(B)\n\nIn this section, applicant response means the information provided by the applicant\nto the director to address the conditions of approval or reasons for disapproval of\nan application for preliminary plan or plat.\n\n(C)\n\nAn applicant response:\n\n(1)\n\nmust adequately address each condition of approval or reason for the disapproval;\n\n(2)\n\nmust include only changes only as necessary to address the condition of approval or\nreason for disapproval; and\n\n(3)\n\nmay not include substantial changes unrelated to the condition of approval or reason\nfor disapproval.\n\n(D)\n\nUpon receipt of an applicant response to a preliminary plan or plat application that\nrequires Land Use Commission consideration, the director shall:\n\n(1)\n\ndetermine if the applicant response meets the requirements in Subsection (C), and\n\n(2)\n\nschedule the application for consideration by the Land Use Commission not later than\nthe 15th day after the applicant response was submitted.\n\n(E)\n\nUpon receipt of an applicant response to a preliminary plan or plat the director shall:\n\n(1)\n\ndetermine if the applicant response meets the requirements in Subsection (C), and\n\n(2)\n\napprove, approve with conditions, or disapprove with reasons, the preliminary plan\nor plat not later than 15 days after the applicant response was submitted.\n\n(F)\n\nIf the applicant response as submitted complies with the provisions of Subsection\n(C), and the director fails to comply with the time limits for action in this section,\nthe application for preliminary plan or plat is approved by operation of law.\n\nSource: Ord. No. 20190822-117, Pt. 25, 9-1-19; Ord. No. 20230831-141, Pt. 24, 9-11-23.\n\n**Editor's note—**\nOrd. No. 20190822-117, Pt. 25, effective September 1, 2019, set out provisions intended for use as § 25-4-39.\nFor purposes of clarity, and at the editor's discretion, these provisions have been\nincluded as § 25-4-40.\n\n(A)\n\nA preliminary plan must be approved before a plat may be approved, except as provided\nin Subsection (B).\n\n(B)\n\nA plat may be approved without a preliminary plan if each lot abuts an existing dedicated\npublic street and the director determines that:\n\n(1)\n\na new street or an extension of a street is not necessary to provide adequate traffic\ncirculation;\n\n(2)\n\nthe applicant has dedicated additional right of way necessary to provide adequate\nstreet width for an existing street abutting a lot; and\n\n(3)\n\ndrainage facilities are not necessary to prevent flooding, or if necessary, the applicant\nhas arranged for the construction of drainage facilities.\n\nSource: Section 13-1-480; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf a preliminary plan is part of an applicant's plan for a larger development, the\napplicant shall file a master development plan with the director when the first application\nfor preliminary plan approval is filed.\n\n(B)\n\nA master development plan may be in schematic form, must include the applicant's entire\ndevelopment, and must provide for the safe, healthful, and orderly extension of roads,\nutilities, drainage, and other public facilities.\n\nSource: Section 13-1-481(d); Ord. 990225-70; Ord. 031211-11.\n\n**Editor's note—**\nOrd. No. 20190822-117, Pt. 26, effective September 1, 2019, repealed § 25-4-53, which pertained to concurrent\napplications and derived from Sections 13-1-481(h) and 13-1-486; Ord. 990225-70; Ord.\n031211-11.\n\n(A)\n\nApproval of a preliminary plan supersedes a previously approved preliminary plan for\nthe same land.\n\n(B)\n\nAn applicant may not include land from a previously approved preliminary plan in a\nsubsequent application for approval of a preliminary plan unless all the land, except\nland contained in an approved plat, is included in the application.\n\n(C)\n\nThe director may waive the requirement of Subsection (B) if the director determines\nthat including only a portion of the previously approved preliminary plan does not\nsubstantially impair the orderly planning of roads, utilities, drainage, or other\npublic facilities.\n\n(D)\n\nAn interested party may appeal the director's decision under Subsection (C) to the\nLand Use Commission.\n\nSource: Section 13-1-481(b); Ord. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\n(A)\n\nThe director shall give notice under Section 25-1-133(A) (Notice of Applications and Administrative Decisions) of the acceptance of an application for preliminary plan that requires a land use\ncommission variance.\n\n(B)\n\nThe director shall give additional notice if required by state law.\n\nSource: Section 13-1-482; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No.\n20190822-117, § 27, 9-1-19.\n\n(A)\n\nThe director shall promptly deliver a copy of an application for preliminary plan\napproval to each reviewing department or agency after the application has been filed.\n\n(B)\n\nA reviewing department or agency shall prepare and deliver to the director a written\nreport of comments and recommendations regarding an application for preliminary plan\napproval before the expiration of the staff review period described in this section.\n\n(C)\n\nStaff review period for an application for preliminary plan approval is established\nby the director by administrative rule under Section 25-1-83 (Preliminary Plan or Plat Application Requirements and Expiration).\n\n(D)\n\nAn applicant may file with the director an update to an application for preliminary\nplan approval before expiration of the application.\n\n(E)\n\nThe staff review period of an update to an application for preliminary plan approval\nis established by the director by administrative rule.\n\nSource: Section 13-1-483; Ord. 990225-70; Ord. 031211-11; Ord. No. 20160421-039, Pt. 6, 5-2-16; Ord. No. 20190822-117, § 28, 9-1-19; Ord. No. 20230831-141, Pt. 25, 9-11-23.\n\nThe director is authorized and shall approve an application for preliminary plan approval\nthat complies with the Comprehensive Plan and the requirements of this title.\n\nSource: Sections 13-1-484(d), 13-1-485, 13-1-486, and 13-1-487(a); Ord. 990225-70;\nOrd. 010607-8; Ord. 031211-11; Ord. No. 20190822-117, § 29, 9-1-19; Ord. No. 20230831-141, Pt. 26, 9-11-23.\n\n**Editor's note—**\nOrd. No. 20190822-117, § 30, effective September 1, 2019, repealed § 25-4-58, which pertained to council\naction on preliminary plan and derived from Sections 13-1-485, 13-1-486, and 13-1-487(a);\nOrd. 990225-70; Ord. 010607-8; Ord. 031211-11.\n\nApproval of a preliminary plan establishes a mutual commitment on behalf of the City\nand the applicant to:\n\n(1)\n\nthe subdivision layout for plat approval, including the location and width of proposed\nstreets, lots, blocks, and easements shown on the preliminary plan; and\n\n(2)\n\nthe availability of utilities to serve the subdivided land to the extent shown on\nthe preliminary plan.\n\nSource: Section 13-1-487(b); Ord. 990225-70; Ord. 031211-11.\n\n**Editor's note—**\nOrd. No. 20190822-117, § 31, effective September 1, 2019, repealed § 25-4-60, which pertained to denial\nof preliminary plan and derived from Section 13-1-483(d); Ord. 990225-70; Ord. 010607-8;\nOrd. 031211-11.\n\n(A)\n\nAn applicant can request a change to an approved preliminary plan if:\n\n(1)\n\nthe land affected by the change has not received final plat approval; and\n\n(2)\n\nall the owners of the land affected by the change are included in the request.\n\n(B)\n\nThe director may approve a minor deviation from an approved preliminary plan if the\ndirector determines that the minor deviation complies with the requirements of this\nsubsection. An applicant shall identify the proposed minor deviation on a copy of\nthe preliminary plan submitted to the director. A formal application is not required.\n\n(1)\n\nA minor deviation may not:\n\n(a)\n\nremove a property restriction or subdivision note;\n\n(b)\n\nmodify a waiver or variance;\n\n(c)\n\nchange an easement, except with the director's approval;\n\n(d)\n\nincrease impervious cover;\n\n(e)\n\nmodify a conservation easement, common area, green space, or other open space shown\non the preliminary plan;\n\n(f)\n\naffect property outside the proposed plat;\n\n(g)\n\nincrease the number of lots;\n\n(h)\n\nchange the use of a lot; or\n\n(i)\n\nchange the basic street layout.\n\n(2)\n\nA minor deviation may:\n\n(a)\n\nchange lot size or configuration;\n\n(b)\n\nchange street width or alignment; or\n\n(c)\n\nchange a utility or access easement.\n\n(C)\n\nIf the requested change does not qualify as a minor deviation, the applicant may submit\na separate application to the director requesting the change. The director may approve\nthe change if the director determines that the requested change complies with the\nrequirements of this title.\n\nSource: Section 13-1-488; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No. 20230831-141, Pt. 27, 9-11-23; Ord. No. 20240718-102, Pt. 2, 7-29-24.\n\nAn approved preliminary plan expires five years after the date the application for\napproval of the preliminary plan is submitted.\n\nSource: Section 13-1-489; Ord. 990225-70; Ord. 990805-46; Ord. 031211-11; Ord. No. 20140612-084, Pt. 7, 6-23-14.\n\nAn application for approval of a plat may include all or a portion of the land included\nin an approved preliminary plan.\n\nSource: Section 13-1-481(e); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe director shall promptly deliver a copy of an application for plat approval to\neach reviewing department or agency after the application has been filed.\n\n(B)\n\nAfter the application is filed, a reviewing department or agency shall prepare and\ndeliver to the director a written report of comments and recommendations regarding\nan application for plat approval not later than the deadline established by the director\nunder Section 25-1-83 (Preliminary Plan and Plat Application Requirements and Expiration).\n\n(C)\n\nAfter the application is filed, the director shall determine whether an application\nfor plat approval complies with the criteria for approval.\n\n(D)\n\nAn applicant may file with the director an update to an application for plat approval\nbefore the application expires under the expiration period established under Section 25-1-83(B) (Preliminary Plan and Plat Application Requirements and Expiration).\n\n(E)\n\nAfter an update is filed, the director shall determine whether an update to an application\nfor plat approval complies with the criteria for approval.\n\nSource: Section 13-1-490; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No. 20160421-039, Pt. 7, 5-2-16; Ord. No. 20190822-117, Pt. 32, 9-1-19; Ord. No. 20230831-141, Pt. 28, 9-11-23.\n\nThe applicant must include the following note on the proposed plat: The owner of this\nsubdivision and the owner's successors and assigns are responsible for construction\nof subdivision improvements that comply with City of Austin regulations. The owner\nunderstands that plat vacation or replatting may be required, at the owner's expense,\nif plans to construct this subdivision do not comply with the regulations. Approval\nof this subdivision does not guarantee future approval of variances to the City of\nAustin regulations that may be required at later stages of development.\n\nSource: Section 13-1-491; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No.\n20190822-117, Pt. 33, 9-1-19; Ord. No. 20230831-141, Pt. 29, 9-11-23.\n\n(A)\n\nThe director is authorized to approve a plat.\n\n(B)\n\nThe director shall approve a plat that complies with the Comprehensive Plan and the\nrequirements of this title.\n\n(C)\n\nApproval of a plat is conditioned on the applicant's posting the fiscal security required\nby this title in the amount determined by the director. After the director certifies\non the plat that the applicant has posted the fiscal security:\n\n(1)\n\nthe presiding officer of the Land Use Commission shall endorse the plat to certify\nthe Land Use Commission's approval;\n\n(2)\n\nthe Mayor shall endorse the plat to certify the council's approval; or\n\n(3)\n\nthe director shall endorse the plat to certify the director's approval.\n\n(D)\n\nApproval of a plat expires on the 90th day after the approval date if the director\nhas not certified that the applicant has posted fiscal security.\n\nSource: Sections 13-1-491(a) and 13-1-492; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11;\nOrd. No. 20230831-141, Pt. 30, 9-11-23.\n\n(A)\n\nThe director shall record an approved plat in each county where land included in the\nplat is located.\n\n(B)\n\nThe director may not record a plat located in the extraterritorial jurisdiction unless\nthe appropriate county has approved the plat.\n\n(C)\n\nAn applicant must provide all of the items and fees required to record the plat with\nthe County Clerk within 80 business days from the date of plat approval.\n\n(D)\n\nAn application for plat approval expires on the 81\nst\nbusiness day after such approval unless Subsection (C) of this section is satisfied.\n\nSource: Section 13-1-493; Ord. 990225-70; Ord. 031211-11; Ord. No. 20160421-039, Pt. 8, 5-2-16.\n\nWhen an approved preliminary plan expires, a pending application for plat approval\nexpires.\n\nSource: Ord. 990805-46; Ord. 031211-11.\n\nAn application to vacate a plat expires after one year.\n\nSource: Ord. No. 20160421-039, Pt. 9, 5-2-16.\n\n(A)\n\nThe director shall give notice under Section 25-1-133 (A) (Notice of Applications and Administrative Decisions) of the acceptance of an application for a plat that requires a Land Use Commission\napproved variance.\n\n(B)\n\nThe director shall give notice under Section 25-1-132(B) (Notice of Public Hearing) of a public hearing at the Land Use Commission on an application for the replat\nof a subdivision that requires a Land Use Commission approved variance.\n\n(C)\n\nThe director shall give notice after a replat has been approved administratively by\nproviding written notice by mail not later than the 15\nth\nday following the approval of the replat to each owner of a lot in the original subdivision\nthat is within 200 feet of the lots replatted according to the most recent municipal\nor county tax roll. Notice under this subsection must include:\n\n(1)\n\nthe zoning designation of the property after the replat; and\n\n(2)\n\na telephone number and e-mail address an owner of a lot may use to contact the municipality\nabout the replat.\n\n(D)\n\nThe director shall give additional notice if required by state law.\n\nSource: Ord. No. 20190822-117, Pt. 34, 9-1-19.\n\nThe director shall approve a subdivision construction plan that complies with the\nComprehensive Plan and the requirements of this title.\n\nSource: Ord. No. 20230831-141, Pt. 32, 9-11-23.\n\nAn applicant may file an update to a subdivision construction plan application until\nthe underlying application has expired under Section 25-1-84 (Subdivision Construction Plan Application Requirements and Expiration).\n\nSource: Ord. No. 20160421-039, Pt. 10, 5-2-16; Ord. No. 20190822-117, Pt. 35, 9-1-19; Ord. No. 20230831-141, Pts. 31, 33, 9-11-23.\n\n(A)\n\nThe director may release a subdivision construction plan if:\n\n(1)\n\nthe director approves the subdivision construction plan; and\n\n(2)\n\nthe applicant posts the required fiscal security with the director.\n\n(B)\n\nThe director's release of a subdivision construction plan authorizes the applicant\nto begin development in accordance with the plan.\n\nSource: Section 13-1-494; Ord. 990225-70; Ord. 031211-11; Ord. No. 20230831-141, Pts. 31, 34, 9-11-23.\n\n(A)\n\nA subdivision construction plan expires three years after the date of its approval\nunless:\n\n(1)\n\nthe Land Use Commission sets a later expiration date when it approves the plat;\n\n(2)\n\nbefore the plan expires, site work is commenced and diligently pursued to completion;\nor\n\n(3)\n\nthe director extends the expiration date under Subsection (B).\n\n(B)\n\nAn applicant may request that the director extend the expiration date of a subdivision\nconstruction plan by filing a written request and justification with the director\nbefore the expiration date.\n\n(1)\n\nThe director may extend the expiration date of the plan once for a period of one year\nif the director determines:\n\n(a)\n\nthere is good cause for the extension;\n\n(b)\n\nthere has not been a significant change in development conditions affecting the plan;\nand\n\n(c)\n\nthe plan continues to comply with the criteria for its approval and release.\n\n(2)\n\nAn interested party may appeal the director's decision under this subsection to the\nLand Use Commission.\n\n(3)\n\nThe director shall give notice under Section 25-1-132(A) (Notice of Public Hearing) of the Land Use Commission's consideration of an appeal.\n\n(4)\n\nThe Land Use Commission shall conduct a public hearing on an appeal before taking\naction.\n\n(5)\n\nAn interested party may appeal the Land Use Commission's decision under this subsection\nto the council.\n\nSource: Section 13-1-495; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No. 20230831-141, Pt. 31, 9-11-23.\n\n(A)\n\nConstruction management for a subdivision is governed by Chapter 25-1, Article 8 (Construction Management).\n\n(B)\n\nIssuance of a certificate of compliance for a subdivision is governed by Chapter 25-1, Article 9 (Certificates of Compliance and Occupancy).\n\nSource: Chapter 13-1, Article XI.; Ord. 990225-70; Ord. 031211-11; Ord. No. 20230831-141, Pt. 31, 9-11-23.\n\nA surveyor shall mark each boundary corner, intermediate property corner, curve point,\nand angle point of a subdivision with a permanent marker identified in the most recent\nedition of the Manual of Practice for Land Surveying in Texas, published by the Texas\nSociety of Professional Surveyors. One boundary corner shall be marked with a concrete\nmonument, unless a concrete monument exists on an adjacent platted subdivision within\n1,300 feet of the proposed plat. Permanent markers along boundary lines may be spaced\nnot more than 1,300 feet apart.\n\nSource: Section 13-2-420; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nEasements for public utilities and drainage ways shall be retained in all subdivisions\nin the widths and locations determined necessary by the director. All easements shall\nbe dedicated to public use for the named purpose and shall be aligned to minimize\nconstruction and future maintenance costs.\n\n(B)\n\nOff-street loading and unloading facilities shall be provided on all commercial and\nindustrial lots, except in the area described in Subsection (C). The subdivider shall\nnote this requirement on a preliminary plan and a plat.\n\n(C)\n\nAn alley at least 20 feet wide is required to serve a commercial or industrial lot\nin the area bounded by Town Lake, IH-35, Martin Luther King, Jr. Boulevard, and Lamar\nBoulevard. If the director of Transportation and Public Works Department determines\nthat the proposed alley adequately meets the requirements of traffic circulation,\nutility service, topography, and the Comprehensive plan, the director may waive this\nrequirement.\n\nSource: Section 13-2-421; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 20131017-046;\nOrd. No. 20230831-141, Pt. 35, 9-11-23.\n\nIf the director determines that easements in areas adjoining a proposed subdivision\nare necessary to provide adequate drainage or utility service, the subdivider shall\nobtain the easements or make arrangements with the City to obtain them.\n\nSource: Section 13-2-422; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this section:\n\n(1)\n\nHAZARDOUS PIPELINE means a pipeline designed for the transmission of a \"hazardous\nliquid\", as defined by Title 49, Code of Federal Regulations, Section 195.2, that\nhas an inside diameter of eight inches or more.\n\n(2)\n\nRESTRICTED PIPELINE AREA includes an area within 25 feet of a hazardous pipeline and\nan area within a hazardous pipeline easement.\n\n(B)\n\nA subdivider shall determine whether a hazardous pipeline crosses a proposed subdivision.\n\n(C)\n\nA subdivider shall depict on the plat a restricted pipeline area, if any.\n\n(D)\n\nA residential lot that is less than one acre in size may not include a restricted\npipeline area.\n\n(E)\n\nIn calculating minimum lot area under this chapter, a restricted pipeline area is\nexcluded.\n\n(F)\n\nA person may not place a structure or excavate within a restricted pipeline area.\n\n(1)\n\nThis prohibition does not apply to:\n\n(a)\n\nthe pipeline or an appurtenance;\n\n(b)\n\na facility that produces, consumes, processes, or stores the product transported by\nthe pipeline, including a power generation facility;\n\n(c)\n\na utility line that crosses the restricted pipeline area, including an appurtenance\nto the line;\n\n(d)\n\na utility service connection;\n\n(e)\n\na road;\n\n(f)\n\nsurface parking lot; or\n\n(g)\n\na structure or excavation that the director determines does not disturb the pipeline\nor impede its operation.\n\n(2)\n\nBefore a person may place a road, surface parking lot, or utility line in a restricted\npipeline area, the person must deliver to the director a certification by a registered\nengineer stating that the proposed construction activity and structure are designed\nto prevent disturbing the pipeline or impeding its operation.\n\n(G)\n\nA person who seeks to convey a lot containing a restricted pipeline area shall, before\ntitle is transferred, deliver to the proposed grantee a document describing the restricted\npipeline area, the limitations on its development, and the name and address of the\npipeline owner or operator.\n\n(H)\n\nFor a plat that includes a restricted pipeline area, a plat note restating Subsection\n(G) is required.\n\nSource: Ord. 030410-12; Ord. 031211-11.\n\nStreets of a new subdivision shall be aligned with and connect to existing streets\non adjoining property unless the director of the Transportation and Public Works Department\ndetermines that the Comprehensive Plan, topography, requirements of traffic circulation,\nor other considerations make it desirable to depart from the alignment or connection.\n\nSource: Section 13-2-423; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 20080214-095;\nOrd. No. 20230831-141, Pt. 36, 9-11-23.\n\n(A)\n\nA street may terminate in a cul-de-sac if the director of the Transportation and Public\nWorks Department determines that the most desirable plan requires laying out a dead-end\nstreet.\n\n(B)\n\nThe director of the Transportation and Public Works Department may approve a dead-end\nstreet more than 2,000 feet long.\n\n(C)\n\nThe director of the Transportation and Public Works Department may approve a deviation\nfrom the cul-de-sac design described in the Transportation Criteria Manual if the\ndirector determines that topography, density, adequate traffic circulation, or unusual\nconditions necessitate a different design.\n\nSource: Section 13-2-429; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. No. 20230831-141, Pt. 37, 9-11-23.\n\n(A)\n\nA block may not exceed 1,200 feet in length, except as provided in this section.\n\n(B)\n\nA residential block that is parallel and adjacent to an arterial street may be up\nto 1,500 feet in length.\n\n(C)\n\nA residential block that is more than 900 feet in length must be transected by a pedestrian\npath that is located not less than 300 feet from each block end. The pedestrian path\nmust be not less than five feet wide, comply with City standards for a sidewalk or\ntrail, and be located within an easement or right-of-way, as determined by the director,\nthat is not less than 15 feet wide. The director may waive or modify this requirement\nif the director determines that the pedestrian path cannot comply with the Americans\nwith Disabilities Act.\n\n(D)\n\nA commercial or industrial block may be up to 2,000 feet in length if the director\ndetermines that there is adequate traffic circulation and utility service.\n\n(E)\n\nThe director may waive a block length restriction if the director determines that\nthe proposed block length adequately meets the requirements of traffic circulation,\nutility service, topography, and the Comprehensive Plan.\n\n(F)\n\nAn applicant may appeal the director's denial of a waiver under this section to the\nLand Use Commission.\n\nSource: Section 13-2-430; Ord. 990225-70; Ord. 010607-8; Ord. 031211-11; Ord. 20080214-095.\n\nA street or street intersection, whether public or private, shall be designed and\nconstructed in accordance with the Transportation Criteria Manual.\n\nSource: Sections 13-2-428, 13-2-488(a), and 13-2-488(b); Ord. 990225-70; Ord. 031211-11.\n\nNew streets in subdivisions shall be named to provide continuity of name with existing\nstreets and to prevent conflict with identical or similarly spelled or pronounced\nnames in other parts of the planning jurisdiction.\n\nSource: Section 13-2-427; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe location of a street sign is determined by the most recent version of the Texas\nManual On Uniform Control Devices.\n\n(B)\n\nThe subdivider shall provide the City with street name signs for street intersections\nwith traffic signals.\n\n(C)\n\nThe subdivider shall provide and install pole mounted street name signs at street\nintersections without traffic signals.\n\nSource: Section 13-2-488(c); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn this section:\n\n(1)\n\nACCESS STREET means a street that provides access to a subdivision by connecting to\nan external street.\n\n(2)\n\nADDITIONAL PEDESTRIAN ACCESS means a pedestrian path that meets City standards for\na sidewalk or trail, is established to connect a new street in a subdivision to an\nexisting street on adjoining property, and is at least 300 feet from an access street.\n\n(3)\n\nEXTERNAL STREET means a street that is outside the boundaries of a subdivision, and\nthat is:\n\n(a)\n\na publicly maintained street;\n\n(b)\n\na street that is offered for dedication and for which a construction performance bond\nis posted pending acceptance of the dedication; or\n\n(c)\n\na private street that complies with the requirements of this Code and each applicable\ncriteria manual.\n\n(B)\n\nExcept as otherwise provided in this section:\n\n(1)\n\na new subdivision must have at least two access streets; and\n\n(2)\n\neach of the two access streets must connect to a different external street.\n\n(C)\n\nA new subdivision may have only one access street if the director determines that:\n\n(1)\n\nexcept as provided in Subsection (E), the subdivision has an additional pedestrian\naccess;\n\n(2)\n\nthe access street:\n\n(a)\n\ndoes not cross nor is adjacent to an area identified as high risk Wildland Urban Interface\narea, as determined by the Austin Fire Department in accordance with the Austin Fire\nDepartment Wildfire Risk Map;\n\n(b)\n\nis not inundated by more than nine inches of water by a 100-year flood, as determined\nin accordance with the Drainage Criteria Manual; and\n\n(c)\n\nhas a paved width of at least 36 feet from the intersection of the access street with\nthe external street for a distance of:\n\n(i)\n\n100 feet; or\n\n(ii)\n\n50 feet if the access street has curb and gutter; and\n\n(3)\n\nthe access street:\n\n(a)\n\nis not more than 2,000 feet in length, and provides access to not more than 30 single-family\nresidential dwellings; or\n\n(b)\n\nis an arterial or collector street, and its intersection with the external street\nwill function at a level of service of \"C\" or better during construction and after\nbuild-out of the subdivision, as determined by an intersection analysis that is:\n\n(i)\n\napproved by the director; and\n\n(ii)\n\nif the subdivision generates more than 1,000 vehicle trips a day, prepared by a registered\nprofessional engineer in accordance with the Transportation Criteria Manual, or Transportation\nResearch Board Special Report 209, \"Highway Capacity Manual\", published in 1994.\n\n(D)\n\nA new subdivision may have only one access street if the director determines that:\n\n(1)\n\nexcept as provided in Subsection (E), the subdivision has an additional pedestrian\naccess; and\n\n(2)\n\nproviding more than one access street is undesirable, unnecessary, or impractical\nafter considering:\n\n(a)\n\ntraffic circulation;\n\n(b)\n\ntraffic safety;\n\n(c)\n\nflood and fire safety;\n\n(d)\n\ntopography;\n\n(e)\n\nthe density of the subdivision and surrounding developed property;\n\n(f)\n\nwhether later development of adjacent property is anticipated to provide additional\naccess;\n\n(g)\n\nwhether traffic through the subdivision should be limited;\n\n(h)\n\nthe environmental effect of a cut or fill, waterway crossing, or other surface disturbance\nnecessary to provide more than one access street;\n\n(i)\n\nwhether the access street is a divided street;\n\n(k)\n\nwhether adverse effects, if any from permitting one access street are mitigated, including\nwhether secondary pedestrian access is provided; and\n\n(l)\n\nwhether the subdivider:\n\n(i)\n\nowns adjacent property through which access can be provided;\n\n(ii)\n\nhas the right to provide a second access street across another person's property;\nor\n\n(iii)\n\nis able to develop the subdivision if more than one access street is required.\n\n(E)\n\nThe director may waive or modify the requirement of Subsection (C) or (D) for additional\npedestrian access if the director determines that providing additional pedestrian\naccess is impractical because of existing development or topography.\n\nSource: Ord. 030306-48A; Ord. 031211-11; Ord. 20080214-095; Ord. No. 20230413-057, Pt. 3, 4-24-23.\n\n(A)\n\nEach lot in a subdivision shall abut a dedicated public street.\n\n(B)\n\nChapter 25-6, Article 6 (Access to Major Roadways And In Certain Watersheds) governs access to a lot:\n\n(1)\n\non a roadway designated as a major arterial, freeway, parkway, or expressway in the\ntransportation plan or in a roadway plan approved by the appropriate county; or\n\n(2)\n\non a Hill Country Roadway.\n\nSource: Section 13-2-424; Ord. 990225-70; Ord. 030306-48A; Ord. 031211-11.\n\nA through lot in a single-family residential subdivision is permitted if access to\none of the abutting streets is prohibited. If one of the streets abutting a through\nlot is an arterial, access to the arterial is prohibited unless the director determines\nthat topography or property size justify access to the arterial.\n\nSource: Section 13-2-431; Ord. 990225-70; Ord. 031211-11.\n\nThe side lines of lots must be approximately at right angles to straight street lines\nor radial to curved street lines. An arrangement placing adjacent lots at right angles\nto each other may be disallowed by the director.\n\nSource: Section 13-2-432; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIn the zoning jurisdiction, the site development regulations for the zoning district\nin which a lot is located determine minimum lot area and minimum lot width.\n\n(B)\n\nIn the extraterritorial jurisdiction, residential lot requirements are as follows:\n\n(1)\n\nminimum lot area is:\n\n(a)\n\nin a subdivision served by a public wastewater system or central wastewater disposal\nunit:\n\n(i)\n\n5,750 square feet; or\n\n(ii)\n\n6,900 square feet for a corner lot; or\n\n(b)\n\nin a subdivision with private on-site sewage facilities, as determined by Texas Administrative\nCode Title 30, Chapter 285 (On-Site Sewage Facilities);\n\n(2)\n\nminimum lot width is:\n\n(a)\n\n50 feet for an interior lot;\n\n(b)\n\n60 feet for a corner lot; or\n\n(c)\n\n33 feet for a lot on a cul-de-sac or curved street; and\n\n(3)\n\nminimum lot frontage, including a flag lot, is:\n\n(a)\n\n20 feet; or\n\n(b)\n\nif a culvert is required for a driveway approach, 30 feet.\n\n(C)\n\nThe director may reduce the minimum lot frontage prescribed by Subsection (B) if the\ndirector determines that access to the lot is restricted to a joint use driveway.\n\nSource: Section 13-2-433; Ord. 990225-70; Ord. 030306-48A; Ord. 031211-11.\n\nThe applicant shall demonstrate that all proposed duplex or single-family lots have\nusable lot area that can reasonably accommodate the assumed square footage of impervious\ncover established by Section 25-8-64 (Impervious Cover Assumptions). The usable lot area must account for all applicable waterway setbacks, floodplains,\nsteep slopes, grade limitations, critical environmental features, protected trees,\non-site sewage facilities, and other relevant code provisions.\n\nSource: Ord. No. 20230831-141, Pt. 39, 9-11-23.\n\n(A)\n\nIn this section, SINGLE-FAMILY RESIDENTIAL means:\n\n(1)\n\nsingle-family attached residential use;\n\n(2)\n\nsingle-family residential use; and\n\n(3)\n\nsmall lot single-family residential use.\n\n(B)\n\nA flag lot may only be approved in accordance with the requirements of this subsection.\n\n(1)\n\nExcept as provided in Subdivision (2), flag lot designs are permitted if the director\ndetermines that the subdivision conforms to the Fire Code, utility design criteria,\nPlumbing Code and requirements for access.\n\n(2)\n\nIn single-family, duplex, two-unit, or three-unit residential subdivisions on previously\nunplatted land,\n\n(a)\n\nresidential flag lot designs may be used where no more than two dwelling units utilize\na shared driveway; and\n\n(b)\n\nresidential flag lot designs with more than two units sharing a driveway may be used\nif the lots conform to the Fire Code, utility design criteria, Plumbing Code, and\nrequirements for access.\n\n(C)\n\nMinimum Width of a Flag Lot.\n\n(1)\n\nExcept as provided in Subdivision (2), the minimum width of a flag lot is:\n\n(a)\n\n20 feet; or\n\n(b)\n\n15 feet if:\n\n(i)\n\ntwo or more contiguous lots share a common driveway and sufficient area is available\noutside the drive on each lot for utility installation;\n\n(ii)\n\nthe applicant can demonstrate access through an alternative route; or\n\n(iii)\n\na driveway is not proposed.\n\n(2)\n\nThe minimum width of a flag lot with at least one but no more than three dwelling\nunits is:\n\n(a)\n\n10 feet when:\n\n(i)\n\nsufficient area is available for utility installation;\n\n(ii)\n\na driveway is not proposed; or\n\n(b)\n\nfive feet when:\n\n(i)\n\ntwo or more contiguous lots share a common driveway or walkway and sufficient area\nis available for utility installation; or\n\n(ii)\n\nthe applicant can demonstrate access through an alternative route.\n\n(D)\n\nFor residential subdivisions utilizing a flag lot design, all driveways within the\nsubdivision must be located and designed in a manner that:\n\n(1)\n\nprovides adequate space for required utilities;\n\n(2)\n\ncomplies with the Utilities Criteria Manual;\n\n(3)\n\ncomplies with the Drainage Criteria Manual;\n\n(4)\n\ncomplies with the Fire Code;\n\n(5)\n\ncomplies with the Plumbing Code; and\n\n(6)\n\ncomplies with applicable tree preservation requirements detailed in the Environmental\nCriteria Manual.\n\n(E)\n\nAll addresses for residential lots utilizing a flag lot design must be displayed at\ntheir closest point of access to a public street for emergency responders.\n\nSource: 20120524-139; Ord. No. 20190822-117, Pt. 36, 9-1-19; Ord. No. 20230831-141, Pt. 38, 9-11-23; Ord. No. 20240516-006, Pt. 8, 5-27-24.\n\n(A)\n\nA subdivision within 100 feet of a public water system must be connected to the public\nwater system. The director may waive this requirement.\n\n(B)\n\nIf a subdivision is to be served by a public water system:\n\n(1)\n\napproval of the water system plans by the director of the Water and Wastewater Utility\nis required;\n\n(2)\n\ninstallation of the water system must comply with the requirements of this title and\nthe Utilities Criteria Manual; and\n\n(3)\n\nwater lines to serve each lot must be installed before a lot may be occupied.\n\nSource: Section 13-2-476; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA subdivision within 100 feet of a public wastewater system must be connected to the\npublic wastewater system. In the extraterritorial jurisdiction, the director may waive\nthis requirement. In the zoning jurisdiction, this requirement may be waived under\nSection 25-9-4 (Connection to Organized Wastewater System Required).\n\n(B)\n\nIf a subdivision is to be served by a public wastewater system or community disposal\nsystem, wastewater lines to serve each lot must be installed before a lot may be occupied.\n\nSource: Section 13-2-475; Ord. 990225-70; Ord. 031211-11.\n\nIf natural gas from a public utility is available within 2,000 feet of a subdivision,\nthe subdivider shall:\n\n(1)\n\nprepare plans for installation of natural gas lines to serve each lot and install\nthe portions of the lines that are under a street or alley; or\n\n(2)\n\nplace a note on the plat stating that natural gas lines have not been installed.\n\nSource: Section 13-2-477; Ord. 990225-70; Ord. 031211-11.\n\nA subdivider shall arrange with the appropriate utility departments and utility companies\nfor the construction of water, wastewater, and gas utility lines unless the city manager\napproves the installation of utility lines by another entity.\n\nSource: Section 13-2-478; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nTo have municipal water or wastewater service extended to land within the extraterritorial\njurisdiction, a landowner shall file with the director of the Water and Wastewater\nUtility a written request for:\n\n(1)\n\nextension of service; and\n\n(2)\n\nif the land is not covered by the utility's certificate of convenience and necessity,\nannexation by the City.\n\n(B)\n\nThe City may record an owner's request in the county deed records.\n\nSource: Section 13-2-485; Ord. 990225-70; Ord. 031211-11; Ord. 20050929-077.\n\n(A)\n\nThis section applies to a subdivision that is to receive retail water or wastewater\nservice from an entity other than the City's Water and Wastewater Utility.\n\n(B)\n\nA plat may not be approved unless the subdivider has complied with the requirements\nof this subsection.\n\n(1)\n\nThe subdivider shall provide the director with a copy of a contract between the subdivider\nand the utility service provider that provides for installing utility lines and furnishing\nadequate utility service.\n\n(2)\n\nWater or wastewater system plans must comply with the requirements of this title and\nthe Utilities Criteria Manual.\n\n(3)\n\nApproval of water or wastewater system plans by the director of the Water and Wastewater\nUtility and the Texas Natural Resource Commission is required.\n\n(C)\n\nApproval of the construction of water or wastewater facilities by the director of\nthe Water and Wastewater Utility is required. A City inspector may inspect the facilities\nduring construction. The director of the Water and Wastewater Utility may require\nthat the subdivider pay an inspection fee.\n\nSource: Section 13-2-480; Ord. 990225-70; Ord. 030731-54; Ord. 031211-11.\n\n(A)\n\nA plat may not be approved unless the subdivider has complied with the requirements\nof this section, if applicable.\n\n(B)\n\nIf a subdivision is not to be served by a water utility, the subdivider shall provide\nthe director with evidence that water suitable for human consumption may be obtained\nfrom surface or subsurface sources on the land. The evidence may include the results\nof tests and borings, and statements from local and state health authorities, water\nengineers, and other competent authorities. If the subdivider proposes a private water\nsupply for the subdivision, the plans and specification shall be prepared by a registered\nprofessional engineer and approved by the director of the Water and Wastewater Utility\nand the Texas Natural Resource Conservation Commission.\n\n(C)\n\nIf a subdivision is not to be served by a sanitary sewer utility and the use of private\non-site sewage facilities has not been approved by the local health authority, the\nsubdivider shall construct a community sewage collection and treatment system that\nserves each lot. The system must be designed and located in accordance with the regulations\nof the Texas Natural Resource Conservation Commission and the local health authority.\nApproval by the director of the Water and Wastewater Utility of the plans for the\nsystem is required.\n\nSource: Section 13-2-481; Ord. 990225-70; Ord. 031211-11.\n\nA subdivision that is to be served by private on-site sewage facilities must comply\nwith Chapter 15-5 (Private Sewage Facilities) of the City Code. The local health authority shall review a preliminary plan or\nplat and report its findings to the Watershed Protection and Development Review Department.\n\nSource: Section 13-2-482; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11.\n\n(A)\n\nA plat may not be approved unless the subdivider has complied with the requirements\nof this section, if applicable.\n\n(B)\n\nThis section applies to the residential portion of a subdivision in the service area\nof the City's Electric Utility Department if the subdivision is located:\n\n(1)\n\nat least partially inside the City limits; or\n\n(2)\n\noutside the City limits, and the subdivider has requested annexation.\n\n(C)\n\nA subdivider shall pay street lighting charges to the Electric Utility Department.\nThe director may waive this requirement if the director determines that street lighting\nis not necessary, the requirement imposes an unreasonable hardship on the applicant,\nor obtaining payment for street lighting is impractical.\n\n(D)\n\nThe City shall use a payment collected under this section to install street lights\nin the residential areas of the subdivision for which it was collected.\n\n(E)\n\nThe City shall refund a payment collected under this section to the subdivider if\nthe City does not install street lights within two years after the date the subdivider\nmakes the payment.\n\n(F)\n\nThis section does not require the City to install street lights in a subdivision that\nhas not been annexed.\n\nSource: Section 13-2-479; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf a subdivision requires connection to Austin Energy's electric system:\n\n(1)\n\nthe applicant must obtain approval of the electric system plans from Austin Energy;\nand\n\n(2)\n\nthe applicant must demonstrate that the installation of the electric system will comply\nwith the requirements of this title and all electric system design, safety, and reliability\nrequirements found in:\n\n(a)\n\nChapter 15-9 (Utility Service Regulations) of the City Code;\n\n(b)\n\nAustin Energy's Design Criteria Manual adopted as part of the Utilities Criteria Manual;\n\n(c)\n\nThe National Electrical Safety Code (NESC); and\n\n(d)\n\nThe National Electrical Code (NEC).\n\n(B)\n\nIf any part of a subdivision is within 200 feet of an existing component of Austin\nEnergy's electric system, the applicant must comply with the following requirements:\n\n(1)\n\nthe applicant must obtain approval from Austin Energy; and\n\n(2)\n\nthe applicant must demonstrate that the subdivision will comply with the electrical\nsystem design, safety and reliability requirements found in Austin Energy's Design\nCriteria Manual adopted as part of the Utilities Criteria Manual.\n\nSource: Ord. No. 20190822-117, Pt. 37, 9-1-19.\n\nThe platting requirement for parkland dedication is governed by Chapter 25-1, Article 14 (Parkland Dedication).\n\nSource: Section 13-2-455 and Section 13-2-450(a); Ord. 990225-70; Ord. 031211-11;\nOrd. 20070621-027.\n\n(A)\n\nIn approving a subdivision or site plan that is required to dedicate parkland under\nSection 25-1-602 (Parkland Dedication Required), the director may require a notation on the plat or site plan indicating that land\nhas been dedicated or a fee in-lieu paid as required by this article.\n\n(B)\n\nIf an application for a preliminary plan or final plat is submitted for a non-residential\ndevelopment that is exempt from this article under Section 25-1-601 (Applicability), the director may require a plat notation stating that any subsequent residential\ndevelopment within the subdivision is required to dedicate parkland or make payment\nin-lieu of dedication as required by Chapter 25-1, Article 14 (Parkland Dedication) or other applicable ordinance.\n\n(C)\n\nIf a plat note prohibiting residential uses was required by the City of Austin in\norder to document an exemption from parkland dedication for a non-residential subdivision\non or after July 25, 1985, the applicant may amend the plat in order to conform the\nnotation with the plat note authorized under Subsection (A) or (B) of this section.\n\nSource: Ord. No. 20140807-169, Pt. 4, 8-18-14.\n\n(A)\n\nThis section applies to a subdivision with townhouse lots.\n\n(B)\n\nCommon areas must be identified on the plat. An applicant shall provide for maintenance\nof and payment of taxes on common areas.\n\n(C)\n\nAn applicant shall submit to the director a legal opinion that describes the rights\nand duties of the owners, the legal status of common areas and facilities, and the\nprovisions for taxation and maintenance of the common areas.\n\n(D)\n\nIn the extraterritorial jurisdiction, an applicant shall submit to the director a\nsite plan showing the locations and dimensions of buildings, accessory uses, and other\nimprovements.\n\nSource: Section 13-2-434; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThis section applies to a subdivision with small lots that are zoned single family\nresidence small lot (SF-4A) district or less restrictive.\n\n(B)\n\nA small lot subdivision may not be approved unless service is available to each lot\nin the subdivision from public water and centralized sewer systems.\n\n(C)\n\nA small lot subdivision must comply with the following requirements:\n\n(1)\n\nMinimum lot area is:\n\n(a)\n\n3,600 square feet, except for a corner lot; and\n\n(b)\n\n4,500 square feet for a corner lot.\n\n(2)\n\nMinimum lot width is:\n\n(a)\n\n40 feet for an interior lot, or 35 feet if access to the lot is provided by a joint\naccess driveway at the front of the lot or by a paved alley or paved private access\neasement at the rear of the lot;\n\n(b)\n\n50 feet for a corner lot, or 45 feet if access to the lot is provided by a joint access\ndriveway at the front of the lot or by a paved alley or paved private access easement\nat the rear of the lot; and\n\n(c)\n\n40 feet for a lot on a cul-de-sac or curved street, except it may be 33 feet at the\nfront lot line.\n\n(3)\n\nMinimum front yard setback is 15 feet.\n\n(4)\n\nMinimum street side yard setback is ten feet.\n\n(5)\n\nA lot may have one zero lot line.\n\n(6)\n\nThe combined side yard setbacks of a lot may be not less than seven feet.\n\n(7)\n\nExcept for a patio or patio cover, the minimum distance between structures on adjoining\nlots is seven feet. The minimum distance between a patio or patio cover and the roof\nline of a structure on an adjoining lot is six feet.\n\n(8)\n\nThe wall of a structure built adjacent to a zero lot line or within three feet of\na common side lot line must be solid and opaque and may not contain an opening.\n\n(9)\n\nMinimum rear yard setback is five feet, excluding drainage easements.\n\n(10)\n\nMinimum setback is ten feet between a rear access easement and a building or fence.\n\n(11)\n\nMaximum building coverage is 55 percent.\n\n(12)\n\nMaximum impervious cover is 65 percent.\n\n(13)\n\nMaximum building height is 35 feet.\n\n(14)\n\nA lot may have not more than one dwelling unit.\n\n(15)\n\nA maintenance easement is required in the dominant side yard of a lot.\n\n(16)\n\nA use easement is required in the subordinate side yard of a lot.\n\n(17)\n\nA lot that is less than 50 feet wide and that fronts on a collector street must have\na paved alley or paved private access easement along the rear property line.\n\n(18)\n\nMinimum pavement width of a private access easement is 25 feet. In the extraterritorial\njurisdiction, the minimum pavement width is 25 feet or the width required by the county,\nwhichever is greater.\n\n(19)\n\nA lot may not front on an arterial street.\n\n(20)\n\nUnderground utility service to all lots is required.\n\n(21)\n\nMaintenance of a common area or access easement is the responsibility of the adjoining\nproperty owner or the homeowners' association, in accordance with the required Declaration\nof Covenants, Easements, and Restrictions.\n\n(D)\n\nThe director may not record a plat of a small lot subdivision unless a Declaration\nof Covenants, Easements, and Restrictions or similar document has been approved by\nthe city attorney, recorded, and referenced on the plat. The document must contain\nthe following:\n\n(1)\n\na statement that the subdivision is developed under this section and incorporating\nthe requirements of this section by reference;\n\n(2)\n\na description of the requirements of Subsections (C)(1) through (14) and an imposition\nof those requirements as a restriction running with the land; and\n\n(3)\n\na restriction of the use of the property to:\n\n(a)\n\none-family dwellings except mobile homes;\n\n(b)\n\naccessory uses permitted in an SF-3 district;\n\n(c)\n\nparks, playgrounds, open space, and common areas providing recreational amenities\nto the subdivision; and\n\n(d)\n\ngrowing agricultural crops;\n\n(4)\n\nprovisions for the maintenance easements and use easements required by this section;\nand\n\n(5)\n\nprovisions obligating the adjoining property owner or the homeowners' association\nto maintain common areas and access easements.\n\nSource: Section 13-2-435; Ord. 990225-70; Ord. 000511-109; Ord. 030731-53; Ord. 031211-11;\nOrd. No. 20231102-028, Pt. 35, 11-13-23; Ord. No. 20240516-006, Pt. 9, 5-27-24.\n\n(A)\n\nThis section applies to a subdivision with single-family attached residential lots.\n\n(B)\n\nA subdivision with single-family attached residential lots is permitted on:\n\n(1)\n\nunplatted land;\n\n(2)\n\na platted duplex lot that is vacant; or\n\n(3)\n\na platted lot developed with a duplex on or before March 1, 1987, if the duplex complies\nwith current regulations.\n\n(C)\n\nSingle-family attached residential lots may be created only in multiples of two lots\nper site, and each lot must be served by public water and sewage systems.\n\n(D)\n\nA lot may be subject to, or benefitted by, private utility easements.\n\n(E)\n\nA lot must comply with the following requirements:\n\n(1)\n\nMinimum site area is 7,000 square feet.\n\n(2)\n\nMinimum lot area is 3,000 square feet.\n\n(3)\n\nMinimum lot width is:\n\n(a)\n\n25 feet, except for a lot on a cul-de-sac or curved street; and\n\n(b)\n\n20 feet on a cul-de-sac or curved street.\n\n(4)\n\nA lot may have not more than one dwelling unit.\n\n(5)\n\nMaximum height is 35 feet.\n\n(6)\n\nMinimum front yard setback is 25 feet.\n\n(7)\n\nMinimum street side yard setback is 15 feet.\n\n(8)\n\nMinimum interior side yard setback is five feet, except between attached units.\n\n(9)\n\nMinimum rear yard setback is 10 feet.\n\n(10)\n\nMaximum building coverage is 40 percent.\n\n(11)\n\nMaximum impervious coverage is 45 percent.\n\n(F)\n\nA plat of a single family attached subdivision may not be recorded unless a Declaration\nof Covenants, Easements, and Restrictions or similar document has been approved by\nthe city attorney, recorded, and referenced on the plat. The document must:\n\n(1)\n\nrequire that development and use of the lots comply with this title;\n\n(2)\n\nrequire that construction of a dwelling unit comply with Chapter 25-12, Article 1 (Uniform Building Code), Article 4 (Electrical Code), Article 5 (Uniform Mechanical Code), Article 6 (Uniform Plumbing Code), and Article 7 (Uniform Fire Code).\n\n(G)\n\nThis subsection applies to the sale of a single-family attached residential lot.\n\n(1)\n\nA seller shall deliver to the purchaser:\n\n(a)\n\na copy of the document described in Subsection (F); and\n\n(b)\n\na notice stating that the property will be conveyed under the terms of the document,\nand that the purchaser is advised to consult an attorney concerning the purchaser's\nrights and obligations under the document.\n\n(2)\n\nA purchaser may terminate the sale contract without penalty:\n\n(a)\n\nwithin five days of the purchaser's receipt of the document and notice under Subsection\n(G)(1); or\n\n(b)\n\nat any time before closing, if the seller does not deliver the document and notice.\n\nSource: Section 13-2-436; Ord. 990225-70; Ord. 031211-11; Ord. No. 20231102-028, Pt. 36, 11-13-23.\n",
  "start_line": 42946,
  "end_line": 45167,
  "subsections": []
}