{
  "id": "chapter-25-11",
  "title": "BUILDING, DEMOLITION, AND RELOCATION PERMITS; SPECIAL REQUIREMENTS FOR HISTORIC STRUCTURES",
  "level": 1,
  "parent_id": null,
  "content": "## CHAPTER 25-11. - BUILDING, DEMOLITION, AND RELOCATION PERMITS; SPECIAL REQUIREMENTS FOR HISTORIC STRUCTURES.\n\n(A)\n\nThis chapter applies to property in the city's zoning jurisdiction.\n\n(B)\n\nThe provisions of this chapter relating to plumbing, electric, and mechanical permits\napply to structures connected to the City's electric and water and wastewater utilities.\n\nSource: Section 13-1-731; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe building official may not issue a building, demolition, or relocation permit unless\nthe requirements of Article 4 (Special Requirements For Historic Structures) have\nbeen satisfied, if applicable.\n\n(B)\n\nA person may not change, restore, remove, or demolish an exterior architectural feature\nof a designated historic landmark, a structure for which a designation is pending\nunder Section 25-11-214, or a contributing structure in a local historic district unless the requirements\nof Article 4 (Special Requirements For Historic Structures) have been satisfied.\n\nSource: Sections 13-1-602, 13-1-733 and 13-1-741(d); Ord. 990225-70; Ord. 031211-11;\n20090806-068.\n\n(A)\n\nUnless a technical code exempts an activity from its permitting requirements, a person\nmay not perform the following activities unless the person first obtains the appropriate\npermit from the building official:\n\n(1)\n\nan activity regulated by Chapter 25-12, Article 1 (Uniform Building Code), Article 4 (Electrical Code), Article 5 (Uniform\nMechanical Code), or Article 6 (Uniform Plumbing Code);\n\n(2)\n\nconstructing or structurally altering a pier or other structure in or along the shores\nof:\n\n(a)\n\nLake Austin below an elevation of 504.9 feet above mean sea level;\n\n(b)\n\nTown Lake below an elevation of 435.0 feet above mean sea level; or\n\n(c)\n\nLake Walter E. Long;\n\n(3)\n\naltering the shoreline or bed of Lake Austin, Town Lake, or Lake Walter E. Long by\nfilling or dredging;\n\n(4)\n\nconstructing, altering, or repairing a sidewalk, curb, gutter, or driveway approach\non property under a person's control or in public right-of-way adjoining property\nunder a person's control;\n\n(5)\n\nerecting, moving, or structurally altering or repairing an outdoor sign; or\n\n(6)\n\ncausing or permitting the activities described in this section to occur.\n\n(B)\n\nA building permit does not authorize the demolition or removal of any part of a structure.\n\nSource: Section 13-1-735; Ord. 990225-70; Ord. 000309-39; Ord. 031211-11; Ord. 20060216-043;\nOrd. 20060309-058; Ord. 20060622-022; Ord. 20060928-022.\n\n(A)\n\nExcept as provided in Subsection (B), a person shall comply with technical code requirements\nfor new facilities when making an addition, alteration, or repair to a building or\nstructure or to building service equipment.\n\n(B)\n\nThe building official may allow a person to:\n\n(1)\n\nmake a minor addition, alteration, or repair to existing building service equipment\nin accordance with the technical codes in effect at the time the equipment was originally\ninstalled;\n\n(2)\n\nuse, maintain, or repair building service equipment that was lawfully in existence\nat the time of the adoption of the technical codes in accordance with the original\ndesign if the building service equipment does not create a hazard to life, health,\nor property; and\n\n(3)\n\nexcept as provided in Subsection (C), use the type of materials used in the original\nconstruction of an existing building or structure to make a nonstructural alteration\nor repair if the alteration or repair does not adversely affect a structural member\nor the required fire resistance of a part of the building or structure.\n\n(C)\n\nA person must comply with requirements for new installations when installing or replacing\nglass.\n\n(D)\n\nA person who makes an addition, alteration, or repair to a building or structure or\nto building service equipment is not required to conform the portions of the existing\nbuilding not affected by the addition, alteration, or repair to requirements for new\nfacilities.\n\n(E)\n\nA person may not create a condition in an existing building or structure or in existing\nbuilding service equipment that violates the technical codes as a result of an addition\nor alteration.\n\n(F)\n\nA person may not create an unsafe condition in an existing building or structure or\nin existing building service equipment as a result of an addition or repair. An unsafe\ncondition exists if an addition or alteration:\n\n(1)\n\ncauses the existing building or structure to become structurally unsafe;\n\n(2)\n\noverloads or exceeds the capacity of building service equipment;\n\n(3)\n\nresults in inadequate egress or obstructs existing exits;\n\n(4)\n\ncreates a fire hazard;\n\n(5)\n\nreduces fire resistance; or\n\n(6)\n\ncreates a health hazard or a condition dangerous to human life.\n\nSource: Section 13-1-732(a) through (e); Ord. 990225-70; Ord. 031211-11.\n\nAn activity that is exempt from the permitting requirements of this article must comply\nwith City regulations and Code requirements.\n\nSource: Section 13-1-736; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe building official may issue a temporary building permit to authorize construction\nof a portion of a building, structure, or building service equipment before the plans\nand specifications for the entire project have been submitted or approved if the applicant\nfiles information and detailed statements describing the activity to be performed\nand the building official determines that the activity complies with this title.\n\n(B)\n\nThe permittee under a temporary building permit proceeds with construction at the\npermittee's risk. A temporary building permit does not guarantee that a permit for\nthe entire building or structure will be approved. A permittee does not acquire vested\nrights under a permit issued under this section.\n\n(C)\n\nThe building official shall provide a permittee with written documentation stating\nthat the permittee does not acquire vested rights under a temporary building permit.\n\nSource: Section 13-1-741(c); Ord. 990225-70; Ord. 031211-11.\n\nUnless state law or the technical codes exempt an activity from the permitting requirements,\nthe following activity must be performed by a licensed contractor:\n\n(1)\n\nactivity for which a plumbing, electrical, solar, or mechanical permit is required;\nand\n\n(2)\n\nactivity for which a sidewalk, curb, gutter, or driveway approach permit is required.\n\nSource: Section 13-1-737; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), a person may not demolish all or part of a structure\nunless the person first obtains a demolition permit from the building official.\n\n(B)\n\nA demolition permit is not required to demolish all or part of an interior wall, floor,\nor ceiling.\n\n(C)\n\nExcept as provided in Article 4 (Special Requirements For Historic Landmarks), the\nbuilding official may issue a permit to demolish all or part of a structure.\n\n(D)\n\nAn applicant for a demolition permit must provide notice of the demolition to adjacent\none-family structures, two-family structures, and any multi-family component of other\nadjacent structures. The building official shall adopt rules regarding the requirements\nof the notice. At a minimum, the required notification must be:\n\n(1)\n\non a form approved by the director and specify the date or range of dates on which\nthe demolition may occur, which must be between five and ten days after notice is\nprovided;\n\n(2)\n\nmailed or placed on properties adjacent to the property where the demolition is to\noccur; and\n\n(3)\n\nposted on the property where the demolition is to occur, in a manner visible from\nthe primary street frontage.\n\nSource: Section 13-1-741(d); Ord. 990225-70; Ord. 031211-11; Ord. 20060216-043; Ord.\n20060309-058; Ord. 20060622-022; Ord. 20060928-022; Ord. No. 20201001-040, Pt. 1, 10-12-20.\n\n(A)\n\nIn this section, \"asbestos survey\" means an inspection, by an individual licensed\nby the state to perform the inspection, of a building or facility to determine the\nlocation, quantity, and condition of asbestos containing material in the building\nby taking samples for analysis and by visual inspection.\n\n(B)\n\nThe building official may not issue a permit to a person for the demolition or renovation\nof a building unless an asbestos survey has been conducted of the areas of the building\naffected by the proposed renovation or demolition. A person seeking a permit must\nprovide evidence of the survey to the building official.\n\n(C)\n\nThis section does not apply to:\n\n(1)\n\na building owned by the state or federal government;\n\n(2)\n\nan industrial facility to which access is limited principally to employees of the\nfacility because of processes or functions that are hazardous to human safety or health;\n\n(3)\n\na manufacturing facility or building that is limited to workers and invited guests\nunder controlled conditions;\n\n(4)\n\na building, or any portion of a building that a professional engineer, a registered\narchitect, or a city, county, or state government official determines to be structurally\nunsound and in danger of imminent collapse; or\n\n(5)\n\na single family dwelling, or a residential use with four or fewer units.\n\n(D)\n\nA person who obtains a survey of a building in its entirety is not required to obtain\nadditional surveys for subsequent renovations or demolitions of the building.\n\n(E)\n\nInstead of a criminal prosecution under this section, the building official may impose\na civil penalty not to exceed $2,000 for each instance of a violation of this section.\nThe building official may impose a separate penalty for each day that a violation\ncontinues. The city attorney may initiate a civil action to recover a penalty owed\nunder this section.\n\n(F)\n\nA person commits an offense if the person begins, conducts, or continues demolition\nor renovation operations without an asbestos survey required by this section. A culpable\nmental state is not required, and need not be proved, for an offense under this section.\nEach instance of a violation under this section is a separate offense. Each day that\na violation continues is a separate offense. An offense is punishable by a fine not\nto exceed $2,000.\n\nSource: Ord. 010329-49; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (D), each person that applies for a building permit\nor demolition permit for activities described in Subsection (C) must acknowledge the\nperson's need to comply with this Section and Chapter 15-6, Article 9 (Construction and Demolition Materials Diversion Program) before a building or demolition permit is issued.\n\n(B)\n\nThis section is applicable in the City's zoning jurisdiction.\n\n(C)\n\nExcept as provided in Subsection (D), construction and demolition materials diversion\nis required for\n\n(1)\n\nconstruction projects that exceed 5,000 square feet of new, added, or remodeled floor\narea; and\n\n(2)\n\nbeginning October 1, 2019, commercial and multifamily projects that require a demolition\npermit.\n\n(D)\n\nConstruction and demolition materials diversion is not required for the following\nactivities:\n\n(1)\n\nprojects for which only mechanical, electrical, or plumbing permits are required;\nor\n\n(2)\n\nwork for which a building or demolition permit is not required.\n\nSource: Ord. No. 20151119-098, Pt. 4, 10-1-16.\n\n**Note—**\nOrdinance No. 20151119-098 takes effect on October 1, 2016.\n\nAn applicant for a building permit must submit an application on a form prescribed\nby the building official. The application must include the information required in\nChapter 25-12, Article 1 (Uniform Building Code) and Building Criteria Manual.\n\nSource: Section 13-1-735; Ord. 990225-70; Ord. 031211-11.\n\nThe building official shall submit each application for a building permit to appropriate\ncity departments for review. Each department shall determine whether an application\ncomplies with regulations enforced by the department and shall provide its determination\nto the building official.\n\nSource: Section 13-1-741(a); Ord. 990225-70; Ord. 031211-11.\n\nThe building official shall approve or disapprove an application for the following\npermits by the deadlines established by the director under Section 25-1-82 (Application Requirements and Expiration).\n\nType of Permit:\n\n(1)\n\nCommercial buildings, new construction;\n\n(2)\n\nCommercial buildings, remodeling and finishouts;\n\n(3)\n\nResidential, new construction;\n\n(4)\n\nResidential, remodeling of a complying structure;\n\n(5)\n\nResidential, remodeling of or additions to a noncomplying structure;\n\n(6)\n\nSign, other than a nonconforming off-premise sign;\n\n(7)\n\nReplacement of nonconforming off-premise sign;\n\n(8)\n\nRepair of nonconforming off-premise sign;\n\n(9)\n\nDemolition; and\n\n(10)\n\nRelocation.\n\nSource: Section 13-1-740; Ord. 990225-70; Ord. 020207-35; Ord. 031211-11; Ord. 20100624-149;\nOrd. No. 20160421-039, Pt. 14, 5-2-16.\n\n(A)\n\nThe building official shall coordinate review of applications under this article with\nthe City's electric utility and Austin Water if the property is served or will be\nserved by public utilities.\n\n(B)\n\nWhen an applicant files an application for a building permit, the applicant must submit\na written verification that utilities for the proposed development are suitable and\nsufficient for the proposed project.\n\n(C)\n\nAfter a demolition application has been approved but before demolition can occur,\nthe applicant must satisfy the following requirements:\n\n(1)\n\nThe applicant shall terminate all utilities unless the applicant submits a request\nfor continued services and receives approval from the appropriate utility service.\n\n(2)\n\nThe applicant shall abandon public water and wastewater service lines in accordance\nwith the Utilities Criteria Manual.\n\n(i)\n\nIf the existing public water and wastewater service lines or appurtenances are to\nbe reused in the future, the corresponding private yard lines must be capped within\nprivate property in accordance with Chapter 25-12, Article 6 (Plumbing Code).\n\n(ii)\n\nIf the existing public water and wastewater service lines or appurtenances will be\ndiscontinued, the applicant shall submit additional plans to Austin Water for review.\n\n(3)\n\nFor properties served by private on-site sewage facilities and located within the\nfull purpose boundaries of the City or in areas annexed in the limited purpose boundaries\nof the City where the City's health and safety ordinances apply, the applicant shall\nabandon the on-site sewage facilities in accordance in Chapter 15-5 (Private Sewage Facilities). For all other properties, the applicant shall abandon the on-site sewage facilities\nin accordance with the requirements of the applicable permitting authority.\n\n(4)\n\nIf the property is served by the City's electric utility, the applicant shall contact\nthe electric utility to arrange to have the electric meter and service drop removed\nfrom the structure by the electric utility. Demolition may not proceed until the electric\nmeter and service drop has been removed by the electric utility. The building official\nmay issue an electric permit for temporary power if the applicant requests temporary\nconstruction power to a site.\n\nSource: Section 13-1-739.; Ord. 990225-70; Ord. 031211-11; Ord. No. 20200917-067, Pt. 1, 9-28-20.\n\n(A)\n\nThe building official may require that an applicant test materials or construction\nmethods to demonstrate compliance with technical codes if:\n\n(1)\n\nthe building official has reason to believe that materials or construction methods\nwere not tested; or\n\n(2)\n\nthe applicant proposes an alternate method of compliance.\n\n(B)\n\nThe applicant shall use a test method:\n\n(1)\n\nprescribed in a technical code;\n\n(2)\n\nrecognized in the industry; or\n\n(3)\n\ndetermined by the building official.\n\n(C)\n\nA test shall be performed by an agency approved by the building official.\n\n(D)\n\nThe building official shall retain a test report for a reasonable time.\n\n(E)\n\nThe applicant is responsible for the cost of a test.\n\nSource: Section 1-31-734; Ord. 990225-70; Ord. 031211-11.\n\nIf the building official discovers an error in the plans, specifications, or other\ndata submitted in support of a permit application, the building official may:\n\n(1)\n\nrequire an applicant to correct the error; and\n\n(2)\n\nstop building operations at the site if the error results in a violation of City regulations.\n\nSource: Section 13-1-742; Ord. 990225-70; Ord. 031211-11.\n\nThe building official shall issue a permit if the building official determines that\nthe activity described in an application, plans, specifications, and other support\ndata comply with applicable law and that the required fees have been paid.\n\nSource: Section 13-1-741(a); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe building official shall endorse or stamp \"APPROVED\" on plans and specifications\napproved in conjunction with permit issuance.\n\n(B)\n\nA person may not alter approved plans or specifications without authorization from\nthe building official.\n\n(C)\n\nActivity conducted under a permit issued under this article must be done in accordance\nwith the approved plans and specifications.\n\nSource: Section 13-1-741(b); Ord. 990225-70; Ord. 031211-11.\n\nAn interested party may appeal a decision of the building official to grant or deny\na permit under this division to the Building and Fire Code Board of Appeal.\n\nSource: Section 13-1-744; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA building permit expires if work authorized by the permit does not begin before the\n181st day after the permit is issued. The building official may grant a single 180\nextension of the building permit if the permittee requests the extension before the\npermit expires and demonstrates good cause for the extension.\n\n(B)\n\nA building permit expires if work authorized by the permit begins before the 181st\nday after the permit is issued but is abandoned or suspended for more than 180 days.\nThe building official may grant a single 180 extension of the building permit if the\npermittee requests the extension before the permit expires and demonstrates good cause\nfor the extension.\n\n(C)\n\nAfter a building permit expires, a person may not perform work for which the permit\nis required.\n\nSource: Section 13-1-743; Ord. 990225-70; Ord. 031211-11; Ord. 20130411-036.\n\n(A)\n\nExcept as provided in Subsection (C) of this section, a demolition permit expires\nif:\n\n(1)\n\nwork authorized by the permit does not begin within two years from the date the permit\nis issued, except as provided in Subsection (C); or\n\n(2)\n\nthe demolition is not complete within six months from the date work begins.\n\n(B)\n\nThe building official may grant a single one-year extension of a demolition permit\nif the permittee requests the extension before the permit expires. An extension must\nbe requested in writing, but does not require an application.\n\n(C)\n\nIf a demolition permit expires after work has begun, a subsequent demolition permit\nissued for the same structure expires if the work is not complete within six months\nor a lesser time if required by the building official based on public health and safety.\n\n(D)\n\nAn active demolition permit does not prevent expiration of a site plan under Chapter 25-5, Article 1, Division 5 (Expiration).\n\nSource: Ord. 20130411-036.\n\n(A)\n\nThe owner or the owner's general contractor must obtain each building permit inspection\ndescribed in this section, if applicable.\n\n(B)\n\nElectrical, plumbing, and mechanical inspections may be requested only by the contractor\nauthorized by the permit to perform the work.\n\n(C)\n\nThe building official may require the following inspections before issuing a certificate\nof occupancy:\n\n(1)\n\nstructural inspections, including layout, foundation, framing, and wallboard inspections;\n\n(2)\n\nconcrete inspections, including sidewalk pre-pour and driveway pre-pour inspections;\n\n(3)\n\nelectrical inspections, including slab and rough inspections;\n\n(4)\n\nmechanical inspections, including rough and vent inspections;\n\n(5)\n\nplumbing inspections, including rough, copper, top out, gas, wastewater, and fire\nline inspections;\n\n(6)\n\nfire inspections, including access and water supply and system rough-in inspections;\n\n(7)\n\nenergy inspections, including insulation and infiltration inspections; and\n\n(8)\n\nfinal inspections, including electric, plumbing, mechanical, energy, concrete, building,\nfire, health,landscape, and drainage/engineering inspections.\n\n(D)\n\nThe building official may require additional inspections if the building official\ndetermines that a hazardous condition exists. An inspection under this subsection\nmust be performed by an inspector approved by the building official.\n\nSource: Section 13-1-902; Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe owner of a building or structure is responsible for the maintenance of the building,\nstructure, and building service equipment. The owner shall:\n\n(1)\n\nmaintain the building, structure, and building service equipment in a safe and sanitary\ncondition; and\n\n(2)\n\nmaintain a device or safeguard required by a technical code in the manner required\nby the technical code under which the device or safeguard was installed.\n\n(B)\n\nThe building official may inspect a building or structure to determine compliance\nwith this section.\n\nSource: Section 13-1-732(g); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), a person must obtain a relocation permit to\nmove a building regulated by this title from one site to another or along public right-of-way.\n\n(B)\n\nA relocation permit is not required to move a building that:\n\n(1)\n\nis specifically designed and constructed to be portable;\n\n(2)\n\nhas a loaded height of not more than 14 feet and a loaded width of not more than 14\nfeet.\n\nSource: Section 13-1-745(a)(2) and (g); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA person must submit an application for a relocation permit to the building official\non a form prescribed by the building official. The application must include:\n\n(1)\n\nthe name, address, and telephone number of the owner of the building to be moved;\n\n(2)\n\nthe current address of the building, legal description of the current location of\nthe building, and current use of the building;\n\n(3)\n\nthe proposed address of the building, legal description of the proposed location of\nthe building, and proposed use of the building.\n\n(B)\n\nIn addition to the application, an applicant must submit:\n\n(1)\n\na tax certificate indicating that delinquent taxes are not due on the property from\nwhich the building is removed or the property to which the building is to be moved;\n\n(2)\n\na floor plan of the building to be moved; and\n\n(3)\n\nif the building is to be relocated within the city's zoning jurisdiction, a plot plan\nof the proposed location showing all required setbacks and measurements.\n\n(C)\n\nAn applicant for a relocation permit must pay the application fee and deposit established\nby separate ordinance.\n\nSource: Sections 13-1-745(h)(1) and (2) and 13-1-745(i)(1) and (2); Ord. 990225-70;\nOrd. 031211-11.\n\n(A)\n\nThe building official shall submit each application for a relocation permit to affected\ncity departments for review. The departments shall provide the building official with\na recommendation on issuance of the permit.\n\n(B)\n\nThe applicant may amend the application if it is disapproved.\n\nSource: Section 13-1-745(k); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe building official shall inspect the building to be moved and the proposed location\nof the building to determine whether the move complies with applicable city ordinances.\n\n(B)\n\nThe building official may not issue a permit if the building official determines that:\n\n(1)\n\nthe structure cannot safely be moved; or\n\n(2)\n\nthe structure cannot be made to comply with city ordinances in its proposed location.\n\nSource: Section 13-1-745(l); Ord. 990225-70; Ord. 031211-11.\n\nThe building official may deny a permit application submitted by a mover who knowingly\nand repeatedly violates the provisions of this title.\n\nSource: Section 13-1-745(m); Ord. 990225-70; Ord. 031211-11.\n\nThe building official shall issue a relocation permit if the building official determines\nthat:\n\n(1)\n\nthe proposed relocation complies with applicable regulations;\n\n(2)\n\nthe applicant has paid required fees and deposits; and\n\n(3)\n\nthe applicant has obtained all required building permits.\n\nSource: Sections 13-1-741 and 13-1-745(i)(1); Ord. 990225-70; Ord. 031211-11.\n\nAn interested party may appeal the decision of the building official to approve or\ndeny a relocation permit to the Building and Fire Code Board of Appeal.\n\nSource: Section 13-1-744; Ord. 990225-70; Ord. 031211-11.\n\nA permittee may not transfer or attempt to transfer a permit or right granted under\nthis division.\n\nSource: Section 13-1-745(n); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), a building may be moved only by a moving contractor\nwho is bonded and insured in accordance with City rules.\n\n(B)\n\nA person other than a moving contractor may move a building described in Section 25-11-141(B) (Relocation Permit Requirement). A person who moves a building under this subsection\nmust comply with applicable provisions of this division.\n\nSource: Section 13-1-745(a)(1) and (j); Ord. 990225-70; Ord. 031211-11.\n\nThe name, address, and telephone number of the person or firm performing the move\nmust be permanently and prominently displayed:\n\n(1)\n\non the vehicles, dollies, beams, and trailers used in the move; and\n\n(2)\n\nduring the move, on the rear of the structure being moved.\n\nSource: Section 13-1-745(a)(3); Ord. 990225-70; Ord. 031211-11.\n\nThe permittee shall post one copy of the permit on a building before the building\nis moved. The permit must remain on the building throughout the move.\n\nSource: Section 13-1-745(o); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), a person may move a building or portion of a\nbuilding on a street within the City only between the hours of 12:00 midnight and\n6:30 a.m.\n\n(B)\n\nThe building official may provide written authorization for a person to move a building\nduring hours other than between 12:00 midnight and 6:30 a.m. if the building official\ndetermines that the building may be quickly and safely moved without public inconvenience\nbecause of the size of the building, the loading method used, and the route to be\nused.\n\nSource: Section 13-1-745(b)(1) and (2); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nExcept as provided in Subsection (B), a permittee moving a building along a public\nright-of-way in the City shall be accompanied by a uniformed police escort.\n\n(B)\n\nA permittee may move a building without a police escort if the permittee obtains written\nauthorization from the building official and the chief of police.\n\n(C)\n\nA permittee shall comply with an order or direction given by a police officer escorting\nthe move.\n\n(D)\n\nAfter the move has been completed, the escorting police officer shall file a written\nreport of the move with the building official.\n\n(E)\n\nUnless waived in writing by the director of the Electric Utility Department, a person\nmoving a building that exceeds 17 feet 6 inches in height when loaded shall be escorted\nby personnel from that department.\n\n(F)\n\nThe building official shall charge the deposit paid by the permittee for each officer\nor city employee escorting the move. The charge is based on the current hourly wage\nof each officer or employee. The building official shall retain the unused balance\nof the deposit in an escrow account. The permittee shall promptly remit to the building\nofficial the balance due if the deposit does not cover the escort service charges.\n\nSource: Section 13-1-745(c) and (i)(1); Ord. 990225-70; Ord. 031211-11.\n\nA permittee may move a building outside of the City if an in-city move becomes unfeasible.\n\nSource: Section 13-1-745(h)(3); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nA building or structure or building service equipment that is moved into or through\nthe City's zoning jurisdiction must comply with the Building Code requirements for\nrelocated buildings.\n\n(B)\n\nA person may not move a substandard or dangerous building into or through the City's\nzoning jurisdiction.\n\nSource: Section 13-1-745(f) and (p); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe permittee shall maintain the building to be moved and the site to which the building\nis moved in a clean and safe condition during repair and remodeling.\n\n(B)\n\nExcept as provided in Subsection (C), the permittee shall remove from the lot from\nwhich a building is removed, all above-grade protrusions, including tree stumps, placed\nor prefabricated concrete, and piers and beams from the foundation.\n\n(C)\n\nThe permittee may file a written request with the building official to retain concrete\non a site from which a building is removed. The request must be filed not later than\nthe 15th day after a building is removed and must include a justification for the\nrequest. The building official shall provide a written determination to the permittee\nnot later than the 14th day after receipt of a request.\n\n(D)\n\nThe permittee shall restore the lot from which a building is moved to a clean and\nraked condition not later than the 15th day after removal of a building.\n\nSource: Section 13-1-745(d); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nThe permittee is responsible for damage to public or private property caused by the\nmoving of a building under this division.\n\n(B)\n\nThe permittee shall restore damaged property to the condition that the property was\nin before the damage occurred.\n\n(C)\n\nIf the permittee does not restore the damaged property as required by this section\non or before the 10th day after receiving notice of the damage from the building official,\nthe building official may make the necessary repairs. The permittee is responsible\nfor costs incurred by the City.\n\nSource: Section 13-1-745(e); Ord. 990225-70; Ord. 031211-11.\n\nA permittee may not cut or trim a tree or shrub located on or over:\n\n(1)\n\na public right-of-way or public land without written permission from the Parks and\nRecreation Department; or\n\n(2)\n\nprivate property without written permission of the owner or person in control of the\nproperty.\n\nSource: Section 13-1-745(e); Ord. 990225-70; Ord. 031211-11.\n\nIn this article:\n\n(1)\n\nALTERATION means any exterior change, demolition, or modification to a historic landmark\nor to a contributing property located within a historic area (HD)combining district,\nincluding, but not limited to:\n\n(a)\n\nexterior changes to or modifications of structures, architectural details, or visual\ncharacteristics;\n\n(b)\n\nconstruction of new structures;\n\n(c)\n\ndisturbance of archeological sites or areas; or\n\n(d)\n\nplacement or removal of exterior objects that affect the exterior qualities of the\nproperty.\n\n(2)\n\nARCHITECTURAL FEATURE means an architectural element, which alone or as part of a\npattern, embodies the style, design, or general arrangement of the exterior of a building\nor structure, including but not limited to the kind, color, and texture of building\nmaterials, and style and type of windows, doors, lights, porches, and signs.\n\n(3)\n\nCERTIFICATE means a certificate of appropriateness issued by the City approving work\non, relocation of, or demolition of a historic structure, historic or archeological\nsite, or a contributing structure within a historic area (HD) combining district.\n\n(4)\n\nCOMMISSION means the Historic Landmark Commission.\n\n(5)\n\nCONTRIBUTING STRUCTURE means a building, structure, site, feature, or object within\na designated historic area (HD) combining district which has been designated as a\ncontributing structure by the ordinance creating the district, or within a National\nRegister District.\n\n(6)\n\nDEMOLITION BY NEGLECT means lack of maintenance of any building or structure designated\nas a historic landmark (H) or any building or structure designated by ordinance as\ncontributing to a historic area (HD) combining district that results in deterioration\nand threatens the preservation of the structure.\n\n(7)\n\nHISTORIC AREA COMBINING DISTRICT means a district approved by the Council through\nan ordinance which contains a geographically definable area, possessing particular\narchitectural, cultural, or historic importance or significance. A historic area (HD)\ncombining district must consist, at a minimum, of one block-face.\n\n(8)\n\nORDINARY REPAIR OR MAINTENANCE means any work that does not constitute an exterior\nchange in design, material, or outward appearance, and includes in-kind replacement\nor repair with the same original material.\n\n(9)\n\nOWNER OR PROPERTY OWNER means the record owner of a property within an existing or\nproposed historic landmark (H) or historic area (HD) combining district or an agent\nof the property owner.\n\nSource: Chapter 13-2 Division 4, Part B; Ord. 990225-70; Ord. 031211-11; Ord. 041202-16;\n20090806-068.\n\n(A)\n\nUntil a person obtains a certificate of appropriateness from the Commission or the\nbuilding official, the person may not:\n\n(1)\n\nchange, restore, rehabilitate, alter, remove, or demolish an exterior architectural\nor site feature of a designated historic landmark or a contributing structure, whether\nor not a building or demolition permit is required, and including but not limited\nto the replacement of windows, doors, exterior siding materials, installation of shutters\nor exterior lighting, or the replacement of roof materials;\n\n(2)\n\nchange, restore, remove or demolish an exterior architectural or site feature of a\nstructure for which a designation is pending under Section 25-11-214 (Pendency Of Designation); or\n\n(3)\n\nconstruct a new, standalone, ground-up structure on a historic landmark (H) property\nor within a historic area (HD) combining district.\n\n(B)\n\nExcept for a change to the exterior color of a historic landmark, the prohibition\nof Subsection (A) does not apply if the historic preservation officer determines that\na change or restoration:\n\n(1)\n\nis ordinary repair or maintenance that does not involve changes in architectural and\nhistorical value, style, or general design;\n\n(2)\n\nis an accurate restoration or reconstruction of a documented missing historic architectural\nelement of the structure or site, unless a variance or waiver is requested; or\n\n(3)\n\ndoes not visually affect the historic character of the structure or site from an adjacent\npublic street, and is limited to the construction of:\n\n(a)\n\na ground-floor, one-story addition or outbuilding with less than 600 square feet of\ngross floor area;\n\n(b)\n\na second-story rear addition to a two-story building, so long as the addition is not\nvisible from an adjacent public street; or\n\n(c)\n\na pool, deck, fence, back porch enclosure, or other minor feature.\n\n(C)\n\nA criminal penalty for a violation of this section applies only to a person who has\nactual or constructive notice that:\n\n(1)\n\nthe structure is a designated historic landmark or contributing structure; or\n\n(2)\n\na designation is pending under Section 25-11-213 (Pendency Of Designation).\n\nSource: Sections 13-2-760(a), 13-2-760(d), 13-2-761(a), 13-2-762(b), and 13-2-762(d);\nOrd. 990225-70; Ord. 031211-11; Ord. 041202-16; 20090806-068; Ord. No. 20221115-049, Pt. 7, 11-28-22.\n\n(A)\n\nIn this section \"National Register Historic District\" means an area designated in\nthe Federal Register under the National Preservation Act of 1966, as amended, for\nwhich maps depicting the area are available for inspection by the public at the Neighborhood\nPlanning and Zoning Department.\n\n(B)\n\nExcept as provided in Subsection (C), this section applies to a building, structure,\nor site:\n\n(1)\n\nlocated in a National Register Historic District;\n\n(2)\n\nlisted in a professionally prepared survey of historic structures approved by the\nhistoric preservation officer;\n\n(3)\n\nindividually listed in the National Register of Historic Places;\n\n(4)\n\ndesignated as a Recorded Texas Historic Landmark, a State Archeological Landmark,\nor a National Historic Landmark;\n\n(5)\n\ndesignated as a historic landmark (H)combining district;\n\n(6)\n\nlocated within a historic area (HD) combining district; or\n\n(7)\n\ndetermined by the historic preservation officer to have potential for designation\nas a historic landmark.\n\n(C)\n\nThis section does not apply to a structure if the historic preservation officer determines\nthat the structure:\n\n(1)\n\nis less than 50 years old;\n\n(2)\n\ndoes not meet at least two of the criteria for designation as a historic landmark\n(H) combining district prescribed by Section 25-2-352(A)(3)(b) (Historic Designation Criteria); and\n\n(3)\n\nis not a contributing structure in a historic area (HD) combining district.\n\n(D)\n\nWhen the building official receives an application requesting a building permit, relocation\npermit, or demolition permit for a structure to which this section applies, the building\nofficial shall immediately:\n\n(1)\n\nnotify the historic preservation officer; and\n\n(2)\n\nupon receipt of notification by the historic preservation officer that the application\nwill be placed upon the Commission's agenda, the building official shall post a sign\non the site and notify property owners, residents, and registered neighborhood associations\nin accordance with Section 25-1-133(A).\n\n(E)\n\nThe historic preservation officer shall complete the review of an application for\na demolition, relocation, or building permit within five business days of receipt\nof a complete application, and determine whether to place the application on the Commission\nagenda.\n\n(F)\n\nThe Commission shall hold a public hearing on an application described in Subsection\n(D) within 60 days of receipt of a complete application.\n\n(G)\n\nThe building official shall not issue a building permit, relocation permit, or demolition\npermit for a structure to which this section applies until the earlier of:\n\n(1)\n\nthe date the Commission makes a decision not to initiate a historic zoning designation\ncase regarding the structure;\n\n(2)\n\nthe date on which the Commission approves an application for a certificate of appropriateness,\nor makes recommendations on an application for a building permit;\n\n(3)\n\nexcept as provided in Subsection (G)(4), the expiration of 75 days after the date\nof the first Commission meeting at which the application is posted on the agenda;\nor\n\n(4)\n\nthe expiration of 180 days after receipt of a complete application for a contributing\nstructure within a National Register Historic District or a pending historic area\n(HD) combining district.\n\n(H)\n\nIf the Commission makes a decision to initiate a historic zoning designation case,\na designation becomes pending on the structure under Section 25-11-214.\n\n(I)\n\nThe historic preservation officer may approve applications for each of the following:\n\n(1)\n\nBuilding permits for properties located within a National Register Historic District\nwhich are considered minor projects, such as:\n\n(a)\n\nconstruction of a one-story ground-floor addition or outbuilding with no more than\n600 square feet of gross floor area;\n\n(b)\n\nconstruction of a second-story rear addition to a two-story building or structure\nif the addition is not visible from an adjacent public street; or\n\n(c)\n\nconstruction of a pool, deck, fence, back porch enclosure, or other minor feature.\n\n(2)\n\nDemolition permits for minor outbuildings within a National Register Historic District\nsuch as carports, detached garages, sheds, greenhouses, and other outbuildings determined\nby the historic preservation officer not to possess historical or architectural significance\neither as a stand-alone building or structure, or as part of a complex of buildings\nor structures on the site.\n\n(3)\n\nDemolition or relocation permits for properties deemed non-contributing to the historic\ncharacter of a National Register Historic District.\n\n(J)\n\nThe building official may not release a demolition or relocation permit for a building\nor structure deemed contributing to a National Register Historic District or a historic\narea (HD) combining district until the Commission has reviewed and made recommendations\non the application for a building permit for the site, unless the building official\ndetermines that demolition or relocation is necessary for reasons related to public\nsafety.\n\n(K)\n\nFor properties subject to Section 25-11-212 (Certificate Required), the historic preservation officer and the commission shall consider the United\nStates Secretary of the Interior's Standards for Rehabilitation, 36 Code of Federal\nRegulations Section 67.7(b), and:\n\n(1)\n\nexcept as provided in Subsection (K)(2), the historic design standards and the supplemental\nstandards, if any; or\n\n(2)\n\nfor a property located within an area designated as an historic area (HD) combining\ndistrict prior to the effective date of this ordinance, the design standards applicable\nto that district.\n\n(L)\n\nOwners of properties located within a National Register Historic District are not\nrequired to comply with the historic design standards for new construction or alterations\nto existing contributing buildings; however, projects within such districts subject\nto the requirements of this section are subject to advisory review by the historic\npreservation officer and the commission, which shall consider the historic design\nstandards in making their recommendations.\n\nSource: Section 13-2-763; Ord. 990225-70; Ord. 010329-18; Ord. 031211-11; Ord. 041202-16;\n20090806-068; Ord. 20111215-091; Ord. 20130829-106; Ord. No. 20221115-049, Pt. 8, 11-28-22.\n\n(A)\n\nA building, structure, or site is subject to this article if a designation as a historic\nlandmark is pending. A permit issued for abuilding, structure, or site while a designation\nas a historic landmark is pending is void.\n\n(B)\n\nA designation is pending under Subsection (A) on the occurrence of the earliest of\nthe following:\n\n(1)\n\ntwo members of the Commission direct the historic preservation officer in writing\nto place the building, structure, or site on the Commission's agenda for consideration\nof whether the building, structure, or site should be designated as a historic landmark;\nor\n\n(2)\n\nCommission agenda is posted that includes Commission consideration of whether the\nbuilding, structure, or site should be designated as a historic landmark.\n\n(3)\n\na Commission agenda is posted that includes Commission consideration of an application\nfor a demolition, relocation, or building permit concerning the building, structure,\nor site.\n\n(C)\n\nA written order issued by a member of the Commission under Section (B)(1) must address:\n\n(1)\n\nwhether the structure should be considered for historic zoning;\n\n(2)\n\nwhether the status quo of the structure should be maintained pending historic zoning\nproceedings; and\n\n(3)\n\nwhether, if the status quo is not maintained pending historic zoning proceedings,\nthe zoning of the structure as historic may become moot.\n\n(D)\n\nA designation is no longer pending if:\n\n(1)\n\nthe Commission issues a final certificate of appropriateness, or a demolition, relocation,\nor building permit, as applicable;\n\n(2)\n\nthe Commission does not make a final decision on whether to recommend designation\nof the structure as a historic landmark by the 75th day after the date of the first\nCommission meeting at which an item is posted on the agenda for action on an application\nfor demolition, relocation, or historic zoning;\n\n(3)\n\nthe Commission makes a final decision to recommend that the structure not be designated\na historic landmark; or\n\n(4)\n\nthe council makes a final decision not to designate the structure as a historic landmark.\n\n(E)\n\nThe historic preservation officer shall provide the building official with a copy\nof each written order, agenda, or preservation plan described in Subsection (B), as\npromptly as practicable. The failure to do so does not validate a building permit,\nrelocation permit, or demolition permit issued without notice of the written order\nor agenda.\n\n(F)\n\nIf a permit from the City is not required for the change to the structure, the historic\npreservation officer must provide notice to the owner of the structure of a written\norder, or agenda that applies to the change.\n\n(1)\n\nNotice under this subsection may be oral or written.\n\n(2)\n\nNotice under this subsection is effective:\n\n(a)\n\nwhen actually given; or\n\n(b)\n\nwhen sent by registered or certified mail, return receipt requested, addressed to\nthe owner.\n\n(G)\n\nAn applicant or owner entitled to notice under this section may appeal the Commission\naction under this section to the council consistent with the requirements of Chapter 25-1, Article 7, Division 1 (Appeals).\n\nSource: Section 13-2-762; Ord. 990225-70; Ord. 031211-11; 20090806-068.\n\n(A)\n\nThe building official must notify the historic preservation officer before the building\nofficial may issue a permit to demolish or relocate a structure.\n\n(B)\n\nThe director of the Watershed Protection and Development Review Department must notify\nthe historic preservation officer of the filing of a site plan that indicates the\ndemolition or removal of a structure.\n\nSource: Ord. 041202-16.\n\n(A)\n\nThe owner, or other person having legal custody and control of a designated historic\nlandmark or contributing structure in a local historic district or National Register\nHistoric District, shall preserve the historic landmark or contributing structure\nagainst decay and deterioration and shall keep it free from any of the following defects:\n\n(1)\n\nParts which are improperly or inadequately attached so that they may fall and injure\npersons or property;\n\n(2)\n\nDeteriorated or inadequate foundation;\n\n(3)\n\nDefective or deteriorated floor supports or floor supports that are insufficient to\ncarry the loads imposed;\n\n(4)\n\nWalls, partitions, or other vertical supports that split, lean, list, or buckle due\nto defect or deterioration or are insufficient to carry the loads imposed;\n\n(5)\n\nCeilings, roofs, ceiling or roof supports, or other horizontal members which sag,\nsplit, or buckle due to defect or deterioration or are insufficient to support the\nloads imposed;\n\n(6)\n\nFireplaces and chimneys which list, bulge, or settle due to defect or deterioration\nor are of insufficient size or strength to carry the loads imposed;\n\n(7)\n\nDeteriorated, crumbling, or loose exterior stucco or mortar, rock, brick, or siding;\n\n(8)\n\nBroken, missing, or rotted roofing materials or roof components, window glass, sashes,\nor frames, or exterior doors or door frames; or\n\n(9)\n\nAny fault, defect, or condition in the structure which renders it structurally unsafe\nor not properly watertight.\n\n(B)\n\nThe owner or other person having legal custody and control of a designated historic\nlandmark or contributing structure in a local historic district or National Register\nHistoric District shall, in keeping with the city's minimum housing standards, repair\nthe landmark or structure if it is found to have any of the defects listed in Subsection\n(A) of this section.\n\n(C)\n\nThe owner or other person having legal custody and control of a designated historic\nlandmark, or a building, object, site, or structure located in a historic district,\nor a contributing structure in a local historic district or National Register Historic\nDistrict, shall keep the property clear of all vermin, weeds, fallen trees or limbs,\ndebris, abandoned vehicles, and all other refuse as specified under the City Code\nChapter 9-1 (Abandoned Property and Vehicles), and Chapter 10-5 (Miscellaneous Public\nHealth Regulations), Articles 2, 3, and 4.\n\n(D)\n\nThe owner of a residence with a homestead exemption as defined under state law may\napply to the city council for an exemption from the requirements of this section.\nThe city council may grant an exemption on a showing of financial inability to comply\nwith the requirements of this section. An exception under this subsection may be limited\nin time and may be subject to terms and conditions deemed necessary by the city council.\n\nSource: Ord. 20090806-068.\n\n(A)\n\nThe historic preservation officer and the Commission are authorized to work with a\nproperty owner to encourage maintenance and stabilization of the structure and identify\nresources available before taking enforcement action under this section.\n\n(B)\n\nExcept as provided in Subsection (C), the following procedures apply to enforcement\nof this chapter.\n\n(1)\n\nThe Commission or the historic preservation officer may initiate an investigation\nof whether a property is being demolished by neglect.\n\n(2)\n\nUpon initiation of an investigation, the historic preservation officer shall:\n\n(a)\n\nattempt to meet with the property owner to inspect the structure and discuss the resources\navailable for financing any necessary repairs; and\n\n(b)\n\nprepare a report for the Commission on the condition of the structure, the repairs\nneeded to maintain and stabilize the structure, and the amount of time needed to complete\nthe repairs.\n\n(3)\n\nThe Commission shall review the historic preservation officer's report and may vote\nto certify the property as a demolition by neglect case.\n\n(4)\n\nIf the Commission certifies the property as a demolition by neglect case, the historic\npreservation officer shall take the following actions.\n\n(a)\n\nSend notice to the property owner or the property owner's agent, by certified mail,\ndescribing the required repairs and specifying:\n\n(i)\n\nthat repairs must be started within 60 days; and\n\n(ii)\n\na date by which repairs must be completed, as determined by the historic preservation\nofficer.\n\n(b)\n\nMeet with the property owner within 90 days after the notice is sent, if the historic\npreservation officer determines that it would be useful to discuss progress in making\nrepairs and consider any issues that may delay completion of repairs.\n\n(5)\n\nThe historic preservation officer may refer a demolition by neglect case to the Building\nand Standards Commission, the City Attorney, or the appropriate city department for\nenforcement action to prevent demolition by neglect if the property owner fails to:\n\n(a)\n\nstart repairs by the deadline set in the notice;\n\n(b)\n\nmake continuous progress toward completion; or\n\n(c)\n\ncomplete repairs by the deadline set in the notice.\n\n(6)\n\nThe historic preservation officer shall provide notice of a referral under Subsection\n(B)(5) of this section to the property owner. The owner may appeal the historic preservation\nofficer's referral to the city council.\n\n(C)\n\nIf immediate enforcement is necessary to prevent imminent destruction or harm to a\ndesignated historic landmark or contributing structure, the historic preservation\nofficer may refer the structure or landmark to the appropriate city department to\nenforce this chapter and to seek correction of any condition prohibited under Subsection\n25-11-216 (Duty to Preserve and Repair).\n\nSource: Ord. 20090806-068.\n\n(A)\n\nA person may not violate a requirement of this article. Pursuant to Section 214.0015\n(Additional Authority Regarding Substandard Buildings) of the Texas Local Government\nCode, a person who violates a requirement of this article commits a civil offense,\nand is civilly liable to the City in an amount not to exceed $1,000 per day for each\nviolation or an amount not to exceed $10 per day for each violation if the property\nis the owner's lawful homestead.\n\n(B)\n\nA person who violates this article commits an offense. An offense under this article\nis a Class C misdemeanor punishable as provided in Section 1-1-99 (Offenses; General\nPenalty).\n\n(C)\n\nAn action to enforce the requirements of this article may include injunctive relief\nand may be joined with enforcement of applicable City technical codes under Chapter 25-12 (Technical Codes).\n\n(D)\n\nIf a building, object, site or structure covered by this section is required to be\ndemolished as a public safety hazard and the owner has received two (2) or more notices\nof violation under Subsection 25-11-217(B), no application for a permit for a project on the property may be considered for\na period of three years from the date of demolition of the structure.\n\nSource: Ord. 20090806-068.\n\n(A)\n\nThis section applies to an application under Section 25-11-212 (Certificate Required).\n\n(B)\n\nIf the commission determines that the proposed work will not adversely affect a significant\narchitectural or historical feature of the designated historic landmark or historic\narea combining district:\n\n(1)\n\nthe commission shall issue a certificate of appropriateness; and\n\n(2)\n\nthe commission shall provide the certificate to the building official not later than\nthe 30th day after the date of the public hearing.\n\n(3)\n\nthe building official shall provide the certificate to the applicant not later than\nthe fifth day after the day the building official receives the certificate from the\ncommission.\n\n(C)\n\nIf the commission determines that the proposed work will adversely affect or destroy\na significant architectural or historical feature of the designated historic landmark\nor historic area combining district:\n\n(1)\n\nthe commission shall notify the building official that the application has been disapproved;\nand\n\n(2)\n\nthe commission shall, not later than the 30th day after the date of the public hearing\nnotify the applicant of:\n\n(a)\n\nthe disapproval; and\n\n(b)\n\nthe changes in the application that are necessary for the commission's approval.\n\n(D)\n\nFor properties subject to Section 25-11-212 (Certificate Required), the historic preservation officer and the commission shall consider the United\nStates Secretary of the Interior's Standards for Rehabilitation, 36 Code of Federal\nRegulations Section 67.7(b), and:\n\n(1)\n\nexcept as provided in Subsection (D)(2), the historic design standards and the supplemental\nstandards, if any; or\n\n(2)\n\nfor a property located within an area designated as historic area (HD) combining district\nprior to the effective date of this ordinance, the design standards applicable to\nthat district.\n\n(E)\n\nOwners of properties located within a National Register Historic District are not\nrequired to comply with the historic design standards for new construction or alteration\nto existing contributing buildings; however, projects within such districts subject\nto the requirements of Section 25-11-213 (Building, Demolition, and Relocation Permits and Certificates of Appropriateness Relating\nto Certain Buildings, Structures or Sites) are subject to advisory review by the historic preservation officer and the commission,\nwhich shall consider the historic design standards in making their recommendations.\n\nSource: Section 13-2-760(b)(2) and (3), and (c)(4); Ord. 990225-70; Ord. 000629-103;\nOrd. 031211-11; Ord. No. 20221115-049, Pt. 9, 11-28-22.\n\n(A)\n\nThis section applies to an application under Section 25-11-241(C) (Application For Certificate).\n\n(B)\n\nThe commission shall consider:\n\n(1)\n\nthe state of repair of the building;\n\n(2)\n\nthe reasonableness of the cost of restoration or repair;\n\n(3)\n\nthe existing or potential usefulness, including economic usefulness, of the building;\n\n(4)\n\nthe purpose of preserving the structure as a historic landmark;\n\n(5)\n\nthe character of the neighborhood; and\n\n(6)\n\nother factors the commission determines to be appropriate.\n\n(C)\n\nThe commission shall issue a certificate to the building official if the commission\ndetermines that:\n\n(1)\n\nthe interest of historic preservation will not be adversely affected by the demolition\nor removal; or\n\n(2)\n\nthe interest of historic preservation can be best served by the removal of the structure\nto another identified location,\n\n(D)\n\nThe building official shall notify the applicant not later than the fifth day after\nthe certificate is issued.\n\nSource: Section 13-2-761(a); Ord. 990225-70; Ord. 031211-11.\n\nIf the commission fails to act as provided by Section 25-11-243 (Action on Certificate of Appropriateness) or Section 25-11-244 (Action on a Certificate of Demolition or Removal) by the 60th day after the receipt of the application by the commission, the building\nofficial shall issue the necessary certificate to the applicant.\n\nSource: Section 13-2-760(b)(4), (c)(5), and 13-2-761(b); Ord. 990225-70; Ord. 031211-11.\n\n(A)\n\nIf an application for a certificate of appropriateness is denied by the commission,\nan application for a certificate of appropriateness on the same historic landmark\nmay not be filed before the first anniversary of the date that the certificate of\nappropriateness was denied, unless the applicant states in writing that:\n\n(1)\n\nconditions have changed; or\n\n(2)\n\neach change in the application required by the commission under Section 25-11-243(C)(2)(b) (Action on a Certificate of Appropriateness) has been made.\n\n(B)\n\nIf an application for a certificate of demolition or a certificate of removal is denied\nby the commission, an application for a certificate of demolition or a certificate\nof removal on the same historic landmark may not be filed before the first anniversary\nof the date that the certificate of demolition or certificate of removal was denied.\n\nSource: Section 13-2-760(b)(6), and (c)(7), and 13-2-761(c); Ord. 990225-70; Ord.\n031211-11.\n\n(A)\n\nAn interested party may appeal an action of the commission under Section 25-11-243 (Action on a Certificate of Appropriateness) or Section 25-11-244 (Action on a Certificate of Demolition or Removal), or an action of the building official under Section 25-11-245 (Issuance of Certificate by Building Official) to the land use commission.\n\n(B)\n\nA decision by the land use commission on an appeal may be appealed to the council.\n\n(C)\n\nExcept as provided by Subsection (D), an appeal must be made in accordance with the\nappeal procedures in Chapter 25-1, Article 7, Division 1 (Appeals).\n\n(D)\n\nThis subsection applies only to an appeal of the issuance of a certificate of demolition\nor a certificate of removal.\n\n(1)\n\nAn interested party may file an appeal not later than the 60th day after the date\nof the decision.\n\n(2)\n\nWhile an appeal is pending under this subsection, the building official may not issue\na permit for the demolition or removal of the landmark.\n\nSource: Section 13-2-760(e), 13-2-761(d); Ord. 990225-70; Ord. 031211-11; Ord. 20060622-128.\n\n(A)\n\nA change may not be made in the application for a permit or the approved building\nplans or materials after Commission review of a National Register District permit\nor after a certificate of appropriateness has been issued, unless the change is approved\nby the Commission and the applicant receives a certificate of appropriateness for\nthe change.\n\n(B)\n\nThe procedure for obtaining a certificate of appropriateness for a change is the same\nas for obtaining the initial certificate of appropriateness.\n\nSource: Section 13-2-760(b)(5), and (c)(6); Ord. 990225-70; Ord. 031211-11; 20090806-068.\n\nFor purposes of the time limits for action in Sections 25-11-213, 25-11-214, and 25-11-245, a postponement requested or agreed to by the owner or his agent tolls the running\nof the time limit from the date of the request until the meeting to which the case\nhas been postponed.\n\nSource: Ord. 20090806-068.\n",
  "start_line": 64889,
  "end_line": 66753,
  "subsections": []
}